{"title":"Our Mother's House (Jack Clayton-Dirk Bogard-Mark Lester-UK-196","uid":4958607,"size":734464000,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0013f2c44407a9cc7c1c8e1f6364c214ebe8df60&amp;dn=Our+Mother%5C%27s+House+%28Jack+Clayton-Dirk+Bogard-Mark+Lester-UK-196&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ppptest","files":1,"time":1245214072,"description":"Among the filmography of the great Jack Clayton, OUR MOTHER'S HOUSE ranks with ROOM AT THE TOP, THE INNOCENTS and THE PUMPKIN EATER. He has a master's hand to deal with the smallest details. His work with children is unsurpassed. Here we have the splendid Pamela Franklin (The Prime of Miss Jean Brodie) and Mark Lester(Oliver in Carol Reed's Oliver) plus a sterling performance by Dirk Bogarde. The film is, clearly, an ancestor of THE CEMENT GARDEN but it creates a world impossible to emulate. In my list of films that changed my life, it goes hand in hand with ROSEMARY'S BABY, APARTMENT ZERO, THE CONFORMIST and BLOW UP.\n\nAuthor: marcosaguado from Los Angeles, USA \n\n&quot;Todas las noches a las 9&quot; (1tÃƒÂ­tulo en espaÃƒÂ±ol):\nAl ver esos muchachos en esa casa, como que algo te estremece y un vacÃƒÂ­o inunda tu cuerpo. Es que verlos con esa entereza para asumir responsabilidades de adultos realmente impacta. Una hermosa mÃƒÂºsica para acompaÃƒÂ±ar esta magnifica pelÃƒÂ­cula donde las dificultades por las que pasamos en la niÃƒÂ±ez y la adolescencia se ven plasmadas y ese amor inmenso por nuestra madre que sobrepasa a veces los limites de la cordura. Impactantes y conmovedoras actuaciones de todos los chicos y una direcciÃƒÂ³n de gran altura muy bien lograda.\nExtraÃƒÂ±a estremecedora y brillante obra del cine","torrent":{"xt":"urn:btih:0013f2c44407a9cc7c1c8e1f6364c214ebe8df60","amp;dn":"Our+Mother%5C%27s+House+%28Jack+Clayton-Dirk+Bogard-Mark+Lester-UK-196","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0013f2c44407a9cc7c1c8e1f6364c214ebe8df60","infoHashBuffer":{"type":"Buffer","data":[0,19,242,196,68,7,169,204,124,28,142,31,99,100,194,20,235,232,223,96]},"announce":[],"urlList":[]}}