{"title":"MKV Converter Studio v2.0.1 Incl;Serial Tested - DeGun SCTV83","uid":5862798,"size":24025961,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:005ca331892a2831cf51727c70b9206398170dbe&amp;dn=MKV+Converter+Studio+v2.0.1+Incl%3BSerial+Tested+-+DeGun+SCTV83&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DeGun","files":-1,"time":1286026725,"description":"Compatible : Windows 7 32/64 bits, Vista 32/64 bits, XP, 98\n\nENG,DUTCH,FRANCAIS,ITALIANO\n\n\nMKV Converter is the best software to convert MKV files with subtitles. This MKV Converter can convert MKV to any video or audio formats like AVI, MP4, Divx, DVD Video, MPEG, and WMV. MKV Converter also supports converting videos to iPod, iPhone, Zune, PSP, MP4 player and other digital devices.\n\nKey Features\n\nPowerful MKV Converter\n\nBest way to convert MKV files; support MKV to AVI, MKV to MP4, MKV to WMV, MKV to Divx. Also support other MKV to other video formats like (H.264/AVC, WMV, DivX, MP4, XviD and MOV, etc). Also help you convert MKA to audio formats like MP3, WMA, AAC, OGG, M4A etc.\n\nSupport MKV Subtitles Editing\n\nYou can load external subtitle file or embedded subtitle for the MKV video when converting, support formats like .srt . sub .ssa .ass .smi .psb .tex .idx etc.\n\nAudio track conversion settings;\nYou can choose an audio language track that is inside the MKV video.\n\nConvert MKV and Compatible with any mobile devices\n\nThe final video you convert from MKV file will be completely compatible with any digital player like iPod, iPhone, MP4 player, Zune, PSP etc.\n\nMerging MKV file into video with batch mode\n\nYou can convert several MKV file into one video file with Merging, and support converting several MKV files at a time, you can call this batch conversion process.\n\nCrop, Trim and Convert MKV video\n\nYou can capture images from the MKV video to your computer as JPEG or bmp, cropping and trimming mkv file before converting to other video formats.\n\nConvert MKV with excellent quality and super fast speed.\n\nOffers your best videoand fast conversion speed, this extremely useful for this who want to Convert MKV files:\n\nConvert MKV to AVI video, Convert MKV to DVD Video, Convert MKV to Divx Video, Convert MKV to WMV Video.\n\n\n###################### F R E N C H ###################\n\nMKV Converter est le meilleur logiciel pour convertir des fichiers MKV avec sous-titres. Ce convertisseur peut convertir MKV MKV ÃƒÂ  toute vidÃƒÂ©o ou des formats audio tels que AVI, MP4, DivX, DVD vidÃƒÂ©o, MPEG et WMV. MKV Converter prend ÃƒÂ©galement en charge la conversion des vidÃƒÂ©os pour iPod, iPhone, Zune, PSP, MP4 et autres dispositifs numÃƒÂ©riques.\n\nPrincipales caractÃƒÂ©ristiques\n\nMKV Converter Puissant\n\nLa meilleure faÃƒÂ§on de convertir des fichiers MKV, MKV soutien aux formats AVI, MKV en MP4, MKV en WMV, MKV en DivX. Aussi le soutien d'autres MKV d'autres formats vidÃƒÂ©o tels que (H.264/AVC, WMV, DivX, MP4, MOV et XviD, etc.) En outre vous aider ÃƒÂ  convertir MKA ÃƒÂ  des formats audio comme MP3, WMA, AAC, OGG, M4A, etc\n\nSous-titres MKV Support d'ÃƒÂ©dition\n\nsrt Vous pouvez charger le fichier sous-titres externes ou intÃƒÂ©grÃƒÂ©s sous-titres pour la vidÃƒÂ©o MKV lors de la conversion des formats de support comme.. sous. ssa. ass. smi. psb. tex. idx etc\n\nParamÃƒÂ¨tres audio de conversion de la voie;\nVous pouvez choisir une piste audio langue qui est au coeur de la vidÃƒÂ©o MKV.\n\nConvertir MKV et compatible avec tout les appareils mobiles\n\nLa vidÃƒÂ©o finale de la conversion de fichiers MKV sera entiÃƒÂ¨rement compatible avec n'importe quel lecteur numÃƒÂ©rique comme l'iPod, iPhone, lecteur MP4, Zune, PSP etc\n\nLa fusion de fichiers MKV en vidÃƒÂ©o avec mode batch\n\nVous pouvez convertir plusieurs fichiers MKV en un seul fichier vidÃƒÂ©o avec la fusion, et le soutien de convertir plusieurs fichiers MKV ÃƒÂ  un moment, vous pouvez appeler ce processus de conversion par lots.\n\nCultures, d'assiette et de convertir MKV vidÃƒÂ©o\n\nVous pouvez capturer des images de la vidÃƒÂ©o MKV sur votre ordinateur au format JPEG ou BMP, de culture et de dÃƒÂ©coupage de fichiers mkv avant de convertir d'autres formats vidÃƒÂ©o.\n\nConvertir MKV avec une excellente qualitÃƒÂ© et la vitesse super rapide.\n\nOffres votre meilleure qualitÃƒÂ© vidÃƒÂ©o et la vitesse de conversion rapide, ce trÃƒÂ¨s utile pour ce qui veulent convertir les fichiers MKV:\n\nConvertir MKV en AVI, convertit MKV en DVD vidÃƒÂ©o, convertit MKV en DivX, le converti MKV au WMV Video.","torrent":{"xt":"urn:btih:005ca331892a2831cf51727c70b9206398170dbe","amp;dn":"MKV+Converter+Studio+v2.0.1+Incl%3BSerial+Tested+-+DeGun+SCTV83","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"005ca331892a2831cf51727c70b9206398170dbe","infoHashBuffer":{"type":"Buffer","data":[0,92,163,49,137,42,40,49,207,81,114,124,112,185,32,99,152,23,13,190]},"announce":[],"urlList":[]}}