{"title":"Mobile First Bootstrap - Packt (2013) PDF - GOLU","uid":10200463,"size":2148424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:00760b4e99f8285c6cdfad37752bc8656997dfc6&amp;dn=Mobile+First+Bootstrap+-+Packt+%282013%29+PDF+-+GOLU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GOLU","files":-1,"time":1400767757,"description":"Title: Mobile First Bootstrap\nAuthor: Alexandre Magno\nEdition: 1\nLanguage: English\nPublisher: Packt Publishing\nPublication Date: 2013-12-18\nISBN-10: 1783285796\nISBN-13: 9781783285792\nFormat: PDF\n\nDescription:\nBootstrap changes the way we develop websites in the frontend, and mobile web development has grown incredibly over the past few years. There are over 1.2 billion mobile web users in the world, and 25% of those mobile web users are exclusively mobile. Now, Bootstrap has also gone mobile-first. The mobile-first version of Bootstrap lets you first think about the mobile site and then think about how it expands to larger screens. To build websites for mobile devices that improve the overall experience of your customers, you need to be skilled at using the mobile-first feature of Bootstrap.\nMobile-first Bootstrap covers the new features in Bootstrap 3 and focuses on how they affect development from a mobile-first perspective. It will show you how to use Bootstrap 3 for developing websites for mobile and how to use that knowledge for your own development projects.\nThe book starts by highlighting the new changes that have been made to Bootstrap 3. After learning about these new features, you will discover how to easily build websites for mobile. You will learn how to run Bootstrap 3 Docs to customize Bootstrap for your needs. You will then be introduced to the new mobile grid system, the responsive utilities, and how to use mobile-first for navigation. Then, using JavaScript, you will explore the power of data attributes and progressive enhancement before starting to develop a web project from scratch. The last section of the book will discuss the main issues that affect the performance of Bootstrap as well as the issues that arise while dealing with responsive images.","torrent":{"xt":"urn:btih:00760b4e99f8285c6cdfad37752bc8656997dfc6","amp;dn":"Mobile+First+Bootstrap+-+Packt+%282013%29+PDF+-+GOLU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"00760b4e99f8285c6cdfad37752bc8656997dfc6","infoHashBuffer":{"type":"Buffer","data":[0,118,11,78,153,248,40,92,108,223,173,55,117,43,200,101,105,151,223,198]},"announce":[],"urlList":[]}}