{"title":"VSO ConvertXtoDVD 5.3.0.0 Beta + Patch (menin)","uid":11846559,"size":36347791,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:008837f0c78b9c790bc230c470015cd5429e18f0&amp;dn=VSO+ConvertXtoDVD+5.3.0.0+Beta+%2B+Patch+%28menin%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"menin1","files":1,"time":1429961742,"description":"Description:\n\nAn easy-to-use piece of software that can help you convert and watch any Divx or a AVI video files on your regular home DVD Player\n\nConvertXtoDVD - ConvertXtoDVD will help you convert and watch a Divx or a AVI on a regular home DVD Player Creating DVDs is quite a common undertaking nowadays and perhaps this is why there are loads of applications designed to help users in this respect. One of the more popular utilities of this kind is ConvertXtoDVD and, as its name suggests, it can convert videos to DVD format.\n[/color]\n\nThe software comes with an easy to use interface that makes all the functions available with one or two clicks and it is not cluttered by may buttons, tabs or menus. A great thing about this tool is that it supports not only DVDs abut also Blu-ray discs for both input and output.\n\nWith ConvertXtoDVD you can edit the audio streams, subtitles and disc chapters as well. If you want to check out the modifications of the work in progress, you can use the preview window on the right side of the main window.\n\nThere are many menu templates you can choose from and make the DVD look more modern or more classic just as easy. More detailed settings allow you to configure the root menu parameters, including background audio, video or image, the chapter menu and many more.\n\nWhen it comes to the supported filetypes and sources, ConvertXtoDVD offers a variety of options. It can handle AVI, DivX, XviD, MPEG4, MOV, DV, WMV and WMV HD while the input can come from digital video cameras, capture cards, TV or satellite.\n\nIn case you don't want to burn the data to disc, there's always the possibility to save the DVD structure to a folder on your hard drive or make an ISO image. ConvertXtoDVD can create discs in both PAL and NTSC region formats, so the compatibility is ensured for all DVD players out there.\n\nAll in all, the application is indeed one that deserves at least a try. Thanks to a solid feature pack, easy to use and quick in processing, ConvertXtoDVD remains one of the best choices in its category.\n\nConvertXtoDVD (formerly DivxToDVD) is a software to convert and burn your videos to DVD. With ConvertXtoDVD and in a few clicks you can backup your movies to DVD playable on any home DVD player.\n\nConvertXtoDVD supports most popular format such Xvid, MOV, VOB, Mpeg, Mpeg4, MP4, AVI, WMV, DV and stream formats. ConvertXtoDVD converts your files into a compliant DVD Video set of files and burns it on a DVD media.\n\nThe aspect ratio can be automatically selected or forced to a specific format. The program works for NTSC and PAL video formats and creates chapters automatically. Multiple audio tracks are supported. Version 2 uses a completely rewritten interface with subtitles support and a lot of new settings.\n\n\nKey Features:\n\n*Supported video formats: DivX, Xvid, MPEG4, MOV, AVI, WMV, WMV HD, DV\n*Supported sources: existing files from digital camcorders, TV/Sat, capture cards\n*Can merge up to 4 hours of material from several movies or episodes\n*Supported audio formats: AC3, DTS, PCM, OGG, MP3\n*Handles subtitles files (.SRT .SUB/IDX) with color and font selection, and supports tags (italic, bold)\n*Video format choice: NTSC, PAL, or automatic and PULL-DOWN\n*Picture output: Widescreen, Fullscreen, or automatic\n*Create Automatic chapters or edit your owns\n*Fast preview mode to check if the source is loaded correctly\n*Save the DVD structure on hard drive or burn it to a blank DVD\n*Reliable burn engine integrated (supports all DVD formats)\n*Fast and quality encoder (typically less than 1 hour for converting 1 movie)\n*Variable options and settings for advanced users\n*Control of the conversion speed vs quality\n*DVD Menu control (auto-start, loop etc)\n*DVD Menu edition (background, fond, color)\n*Customizable interface (themes, dockable windows)\n*Multilingual support.\n\nChanges in version 5.3.0.0 Beta:\n\n- 0009778: [Bug] Low Audio quality on output When Converting from an mp3 Audio track (Cedric) - resolved. \n- 0009700: [Bug] Refresh / or text overlap problem in burning window (Cedric) - resolved. \n- 0009777: [Bug ] Language identifier for Audio and SUBTITLE tracks never USED for output (always Show &quot;Undefined&quot;) (Cedric) - resolved. \n- 0009744: [Bug] color and positioning of subtitles is not correct converting specific ASS file to DVD subtitles (felicia) - resolved. \n- 0007780: [Feature Request] Add H265 / HEVC decoding support (Wesson) - resolved. \n- 0008857: [Bug] burning engine - a couple users with message &quot;Wrong disk. Use one of these: double Layer DVD + R, ...... &quot;(Wesson) - resolved. \n- 0009704: [Bug] Missing PG streams When loading DVD (felicia) - resolved. \n- 0009646: [Bug] black mirror with video does not by default play audio in root menu like previous versions (Cedric) - resolved. \n- 0009695: [Bug] pulldown not working (cedric) - resolved.\n\nInstructions:\n\n1.Unpack and Install\n2.Run patch into install location\n3.Done","torrent":{"xt":"urn:btih:008837f0c78b9c790bc230c470015cd5429e18f0","amp;dn":"VSO+ConvertXtoDVD+5.3.0.0+Beta+%2B+Patch+%28menin%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"008837f0c78b9c790bc230c470015cd5429e18f0","infoHashBuffer":{"type":"Buffer","data":[0,136,55,240,199,139,156,121,11,194,48,196,112,1,92,213,66,158,24,240]},"announce":[],"urlList":[]}}