{"title":"Nobody Knows  [Japan 2004]","uid":3320213,"size":1470080559,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:010192a1287a027a6e47c18ae9893d19895abdfa&amp;dn=Nobody+Knows++%5BJapan+2004%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"watwegsw","files":6,"time":1114189054,"description":"&lt;img src=&quot;http://www.graffitiforum.se/generator/covers/1.jpg&quot;&gt;\n\n&lt;b&gt;Nobody Knows (Dare mo Shiranai) | Japan 2004 | Drama | Eng Subs | 8.2/10 (736 votes) &lt;/b&gt;\n\nFour siblings, ranging in age from four to 12, live happily with their mother in a small Tokyo apartment. Their circumstance is far from normal, however: the children have never been to school and all have different fathers. The existence of the three youngest has been hidden from the landlord; they are smuggled into the apartment in suitcases and ordered not to make excessive noise, or even step outside. One day the mother vanishes, leaving behind some money and a note for the eldest child, Akira, asking him to look after the others. With the responsibility of caring for the family resting on him, Akira shoulders the burden with a heavy heart as the children are forced to engage in the world outside their cocooned universe.\n\nWinner of the Best Actor award at Cannes, 14-year-old Yagira Yuga is simply extraordinary as the caretaker head of the abandoned clan. Based on a true story, Nobody Knows is an emotional, enriching experience.\n\n&lt;img src=&quot;http://www.graffitiforum.se/generator/screencaps/94353_3.jpg&quot;&gt;\n&lt;img src=&quot;http://www.graffitiforum.se/generator/screencaps/99475_2.jpg&quot;&gt;\n&lt;img src=&quot;http://www.graffitiforum.se/generator/screencaps/30187_4.jpg&quot;&gt;\n\n&lt;b&gt;Comments:&lt;/b&gt;\n&lt;i&gt;\nToday I went to the pre-screening of &quot;Nobody Knows,&quot; a stunningly brilliant film by director Hirokazu Koreeda who also directed the philosophical &quot;After Life.&quot;\n\nWhat if I were a 12 years old boy and left alone to take care of two younger sisters and one younger brother in a big city like Tokyo, and I have to hide them in the apartment so nobody knows about them? That's what I have been thinking when I was watching this film and how the film gets my sympathy for these children. It allows me to experience the ordeal through these children's eyes and the transcending performance by Yuya Yagira, who is the youngest actor ever won the best actor award in the history of Cannes Film Festival.\n\nDirector Koreeda allows the camera to take the time to shoot and he never rushes from one scene to the next. He let me observe, let me feel, let me be as close to these children as I possibly can, until I can no longer take it and until I am drowned by the frustration and sadness. I become as helpless as those children, because I simply can not resist the urge to help them. That makes me cry. Through out the film, Koreeda masterfully positioned his lenses to ordinary objects around these children, such as simply a finger, a hand, a stain, a foot, or four empty glasses. But through these zoomed in images, I have no trouble to &quot;see&quot; and &quot;feel&quot; what's going on in the whole picture. And it tells the story in a more profound fashion and more personal way, a story you will never forget, along with those images, sometimes, even the music.\n\nThe 12 years old boy is played by Yuya Yagira, who has a haircut like the Japanese animation character. Yagira's outstanding performance is original and remarkable, and simply unforgettable. Through him, you see a premature 12 years old boy who is acting as an adult to take care the other kids, meanwhile, he is still a 12 years old kid, who will just like other kids around his age. That's make this movie can be so hard to watch sometimes, because no matter how hard your heart is, it will be softened by watching his struggle to survive. It's hard to leave this movie with dry eyes.\n\nThere is no doubt in my mind that this is the best film I have seen this year.\n\n------------------------------------------------------------------------------------------------\n\nIt has been a while since I saw a film with this much humanity. That is, until I saw acclaimed Japanese director Hirokazu Koreeda's latest, Nobody Knows, about a quartet of siblings left to fend for themselves.\n\nIt's heartbreaking, just thinking about some of these random moments subtly displayed on screen. The look on an adolescent girl's face when her mom paints her nails. A little boy making silly faces in the mirror. A little girl's scribbling of stick people on a gas bill that has been months overdue... I can go on.\n\nI wish I can put into words, or convey in some sort of way, the flowing of rampant emotions experienced when I saw these images: about how much it hit so close to home, how much it reminded me of my own family. But I can't. I guess it simply cannot be articulated in such a concise, simplified manner.\n\nYou'll just have to see it for yourself.&lt;/i&gt;\n------------------------------------------------------------------------------------------------\n\n&lt;b&gt; This movie recently launched in a few theatres in the states - and was and is an incredible success among the viewers!&lt;/b&gt;\n\n&lt;img src=&quot;http://upl.silentwhisper.net/uplfolders/upload9/123213213.jpg&quot;&gt;\n\n\n************************************************************\n\n\nAndra torrents/filmer jag lagt upp:\n\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3295025&amp;hit=1&quot;&gt;Dead Friend [Korea 2004]&lt;/a&gt;\n&lt;a href=&quot;http://www.thepiratebay.se/torrents-details.php?id=3298369&amp;hit=1&quot;&gt;Cutie Honey [Japan 2004]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3293234&amp;hit=1&quot;&gt;The Blue Light [Japan 2003]&lt;/a&gt;\n\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3304088&amp;hit=1&quot;&gt; Conduct Zero [Korea 2002]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3294535&amp;hit=1&quot;&gt; Barking Dogs Never Bite [Korea 2000]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3307076&amp;hit=1&quot;&gt;Swing Girls [Japan 2004]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3309553&amp;hit=1&quot;&gt;Kids Return [Takeshi Kitano 1996]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3310096&amp;hit=1&quot;&gt;A  Scene at the Sea [Takeshi Kitano 1991]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3310493&amp;hit=1&quot;&gt;JDorama - [1998] Great Teacher Onizuka [JTV]&lt;/a&gt;\n&lt;a href=&quot;http://tracker.piratbyran.org/torrents-details.php?id=3293442&amp;hit=1&quot;&gt;JDorama - [2003] Waterboys + The Movie&lt;/a&gt;\n\n\n\n************************************************************\n\nAsiantorrents","torrent":{"xt":"urn:btih:010192a1287a027a6e47c18ae9893d19895abdfa","amp;dn":"Nobody+Knows++%5BJapan+2004%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"010192a1287a027a6e47c18ae9893d19895abdfa","infoHashBuffer":{"type":"Buffer","data":[1,1,146,161,40,122,2,122,110,71,193,138,233,137,61,25,137,90,189,250]},"announce":[],"urlList":[]}}