{"title":"Eclipse IDE_ Pocket Guide.epub","uid":9857186,"size":412015,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0104486a12584d197555f8763893f32ab3d6cbc9&amp;dn=Eclipse+IDE_+Pocket+Guide.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xerokull","files":1,"time":1396229895,"description":"Eclipse is the world's most popular IDE for Java development. And although there are plenty of large tomes that cover all the nooks and crannies of Eclipse, what you really need is a quick, handy guide to the features that are used over and over again in Java programming. You need answers to basic questions such as: Where was that menu? What does that command do again? And how can I set my classpath on a per-project basis?\n\nThis practical pocket guide gets you up to speed quickly with Eclipse. It covers basic concepts, including Views and editors, as well as features that are not commonly understood, such as Perspectives and Launch Configurations. You'll learn how to write and debug your Java code--and how to integrate that code with tools such as Ant and JUnit. You'll also get a toolbox full of tips and tricks to handle common--and sometimes unexpected--tasks that you'll run across in your Java development cycle.\n\nAdditionally, the Eclipse IDE Pocket Guide has a thorough appendix detailing all of Eclipse's important views, menus, and commands.\n\nThe Eclipse IDE Pocket Guide is just the resource you need for using Eclipse, whether it's on a daily, weekly, or monthly basis. Put it in your back pocket, or just throw it in your backpack. With this guide in hand, you're ready to tackle the Eclipse programming environment.\n\nAbout the AuthorEd Burnette is editor of the articles section at eclipse.org, and author of the web site's &quot;The Rich Client Platform (RCP) Tutorial&quot; series. Ed also co-authored Eclipse in Action (Manning) and runs the eclipsepowered.org site, where he can often be found hanging out in the Eclipse community forums. He's written everything from multi-user servers to compilers to commercial video games since earning a Bachelor of Science degree in computer science from North Carolina State University. He is a Principal Systems Developer at SAS, and lives near Research Triangle Park, NC.","torrent":{"xt":"urn:btih:0104486a12584d197555f8763893f32ab3d6cbc9","amp;dn":"Eclipse+IDE_+Pocket+Guide.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0104486a12584d197555f8763893f32ab3d6cbc9","infoHashBuffer":{"type":"Buffer","data":[1,4,72,106,18,88,77,25,117,85,248,118,56,147,243,42,179,214,203,201]},"announce":[],"urlList":[]}}