{"title":"A MERCY - Toni Morrison 2008 {FerraBit}","uid":4722573,"size":189316308,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:011911e036f2dbdf17e52d289a8aae6aac46bf25&amp;dn=A+MERCY+-+Toni+Morrison+2008+%7BFerraBit%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FerraBit","files":-1,"time":1234596508,"description":"A MERCY by Toni Morrison (2008)\n\nNarrated by Toni Morrison\n5 CDs - Ripped with iTunes 8\nBitrate: 64kbps (mono), VBR (high), 32,000 kHz. (avg ~80kbps)\nTracks every 3 minutes\n\nPublisher: Random House Audio. Unabridged (2008)\nISBN-10: 0739332546 ISBN-13: 978-0739332542 ASIN: B001L1KBUQ\n\nCheers, FerraBit\nFenruary 2009\n\nLinks: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/A_Mercy_(novel)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/A_Mercy_(novel)&lt;/a&gt;\n____________________\n\n   Toni Morrison's 9th novel A Mercy reveals what lies beneath the surface of slavery. At its heart, like Beloved, it is the story of a mother who casts off her daughter in order to save her and a daughter who may never exorcise that abandonment. It made the New York Times Book Review list of &quot;10 Best Books of 2008&quot; as chosen by the papers editors.\n\n   In the 1680s the slave trade was still in its infancy. In the Americas, virulent religious and class divisions, prejudice and oppression were rife, providing the fertile soil in which slavery and race hatred were planted and took root. Jacob is an Anglo-Dutch trader and adventurer, with a small holding in the harsh north. Despite his distaste for dealing in \u001aflesh,\u001a he takes a small slave girl in part payment for a bad debt from a plantation owner in Catholic Maryland. This is Florens, \u001awith the hands of a slave and the feet of a Portuguese lady.\u001a Florens looks for love, first from Lina, an older servant woman at her new master\u001as house, but later from a handsome blacksmith, an African, never enslaved. There are other voices: Lina, whose tribe was decimated by smallpox; their mistress, Rebekka, herself a victim of religious intolerance back in England; Sorrow, a strange girl who\u001as spent her early years at sea; and finally the devastating voice of Florens\u001a mother. A Mercy reveals what lies beneath the surface of slavery. But at its heart it is the ambivalent, disturbing story of a mother who casts off her daughter in order to save her, and of a daughter who may never exorcise that abandonment. Acts of mercy may have unforeseen consequences.\n\n   From Publishers Weekly\n  Starred Review. Nobel laureate Morrison returns more explicitly to the net of pain cast by slavery, a theme she detailed so memorably in Beloved. Set at the close of the 17th century, the book details America's untoward foundation: dominion over Native Americans, indentured workers, women and slaves. A slave at a plantation in Maryland offers up her daughter, Florens, to a relatively humane Northern farmer, Jacob, as debt payment from their owner. The ripples of this choice spread to the inhabitants of Jacob's farm, populated by women with intersecting and conflicting desires. Jacob's wife, Rebekka, struggles with her faith as she loses one child after another to the harsh New World. A Native servant, Lina, survivor of a smallpox outbreak, craves Florens's love to replace the family taken from her, and distrusts the other servant, a peculiar girl named Sorrow. When Jacob falls ill, all these women are threatened. Morrison's lyricism infuses the shifting voices of her characters as they describe a brutal society being forged in the wilderness. Morrison's unflinching narrative is all the more powerful for its relative brevity; it takes hold of the reader and doesn't let go until the wrenching final-page crescendo.\n\n","torrent":{"xt":"urn:btih:011911e036f2dbdf17e52d289a8aae6aac46bf25","amp;dn":"A+MERCY+-+Toni+Morrison+2008+%7BFerraBit%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"011911e036f2dbdf17e52d289a8aae6aac46bf25","infoHashBuffer":{"type":"Buffer","data":[1,25,17,224,54,242,219,223,23,229,45,40,154,138,174,106,172,70,191,37]},"announce":[],"urlList":[]}}