{"title":"Sonny Criss - The Complete Imperial Sessions CD 1 of 2 (1956) [J","uid":5702495,"size":153519635,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:014277952570aa12a87438f23819a138bdb14e0a&amp;dn=Sonny+Criss+-+The+Complete+Imperial+Sessions+CD+1+of+2+%281956%29+%5BJ&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":23,"time":1279558862,"description":"Sonny Criss - The Complete Imperial Sessions CD 1 of 2 \nOriginal Release Date: June 27, 2000 \nCD-R: June 27, 2000 \nFormat: Original recording remastered \nLabel: Blue Note Records \nQuality: mp3 cbr 320 kbps\n\nIn 1956 he signed to Imperial Records, based in New York, and recorded a series of &quot;underground&quot; classics namely, Jazz in U.S.A , Go Man and Sonny Criss Plays Cole Porter featuring pianist Sonny Clark. Capitol, the masters' owners, reissued them as a 2CD set on their Blue Note imprint in October, 2000. ~ Wikipedia.org\n\nEditorial Reviews - Amazon.com\nAll things considered, the late alto player Sonny Criss didn't record as much as his talent warranted, especially in the early part of his career, and much of what he did record stayed out of print for too long. This double disc rectifies that situation, collecting all three 1956 albums originally made for the R&amp;B label Imperial. Criss's forte was his ability to combine technical facility with emotional force, and his rather robust yet sharp tone remains distinct. His style seemed to balance elements of bebop and R&amp;B adeptly. The first album here, Jazz U.S.A., features guitarist Barney Kessel on four songs (including a nifty &quot;Alabamy Bound&quot; and the original &quot;Criss Cross&quot;) and pianist Kenny Drew. Go Man! boasts a stellar rhythm section of Sonny Clark, Leroy Vinnegar, and Lawrence Marable. Clark and Marable return with vibist Larry Bunker for the final all-Cole Porter album. Like, say, guitarist Grant Green, Criss was able to build a wonderful reputation without straying from the basic blues-bop-and-ballads template. Yet, in a way, that was also his best quality, always seeming to play exactly what you want to hear--and playing it with fluency and feeling. ~ Marc Greilsamer \n\nUnderrecorded, undervalued, and underappreciated. Sonny Criss was a West Coast alto man that never garnered the recognition and acclaim that was his due. His life ended sadly in 1977. \n\nHe was not considered an innovator in Bebop and was a study of Charlie Parker. In my humble opinion, Criss was just as nimble as Bird. Sonny played with Bird during his extended stay in Los Angeles. Contrary to the popular urban legend that no one showed up when Diz, Bird, and Bebop Invaded the West, Sonny Criss tells a different story, &quot;I don't recall it that way because the club(Billy Berg's) was packed every night.&quot; Sonny's tone was as unique as it was bright, sharp, crisp, brilliant, and downright perfect. Can Bebop sound romantic? To hear these recordings the answer is a resounding, &quot;YES.&quot; Man, this cat could SWING! And his Blue Jazz balladry was also quite STUNNING! \n\nWhen I pull this out of my collection and play these remarkable Imperial sides, I always say to myself, &quot;this man is one of the reasons why I love jazz.&quot; \n\nSurely, this is one of my Desert Island Selections. \n\nNo jazz collection is complete without this Double CD. One of the GREATEST archival recordings BLUE NOTE has to offer. A MUST OWN! \n\nSONNY CRISS LIVES!   Enjoy. ~ Unlucky Frank\n\nOriginally issued as:\n(A) Jazz U.S.A (Imperial LP9006)\nPersonnel:\nSonny Criss (alto saxophone)\nBarney Kessel (guitar)\nKenny Drew (piano)\nBill Woodson (bass)\nChuck Thompson (drums)\n\n(B) Go Man! (Imperial LP 9020)\nPersonnel:\nSonny Criss (alto saxophone)\nSonny Clark (piano)\nLeroy Vinnegar (bass)\nLawrence Marable (drums)\n\n(C) Plays Cole Porter (Imperial LP 9024)\nPersonnel:\nSonny Criss (alto saxophone)\nLarry Bunker (vibes)\nSonny Clark (piano)\nBuddy Clark (bass)\nLawrence Marable (drums)\n\nSonny Criss - The Complete Imperial Sessions CD 1 of 2 \n01  Willow Weep for Me (A)\n02  These Foolish Things (A)\n03  Blue Friday (A)\n04  Sunday (A)\n05  More Than You Know (A)\n06  Easy Living (A)\n07  Alabamy Bound (A)\n08  Something's Gotta Give (A)\n09  West Coast Blues (A)\n10  Criss-Cross (A)\n11  Ham's Blues (A)\n12  Sweet Georgia Brown (A)\n13  Summertime (B)\n14  Memories of You (B)\n15  Wailin' With Joe (B)\n16  How Deep Is the Ocean? (B)\n17  The Blues for Rose (B)\n18  The Man I Love (B)\n\nSonny Criss - The Complete Imperial Sessions CD 2 of 2 \n01  Until the Real Thing Comes Along (B)\n02  Blue Prelude (B)\n03  After You've Gone (B)\n04  Come Rain or Come Shine (B)\n05  How High the Moon (B)\n06  If I Had You (B)\n07  I Love You (C)\n08  Anything Goes (C)\n09  Easy to Love (C)\n10  It's All Right With Me (C)\n11  In the Still of the Night (C)\n12  Love for Sale (C)\n13  Night and Day (C)\n14  Just One of Those Things (C)\n15  What Is This Thing Called Love? (C)\n16  I Get a Kick Out of You (C)","torrent":{"xt":"urn:btih:014277952570aa12a87438f23819a138bdb14e0a","amp;dn":"Sonny+Criss+-+The+Complete+Imperial+Sessions+CD+1+of+2+%281956%29+%5BJ","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"014277952570aa12a87438f23819a138bdb14e0a","infoHashBuffer":{"type":"Buffer","data":[1,66,119,149,37,112,170,18,168,116,56,242,56,25,161,56,189,177,78,10]},"announce":[],"urlList":[]}}