{"title":"On Writing Romance: How to Craft a Novel That Sells-Leigh Michae","uid":8906085,"size":1598883,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0174ec0bcd249905847de4c5bb53504e28295eb1&amp;dn=On+Writing+Romance%3A+How+to+Craft+a+Novel+That+Sells-Leigh+Michae&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1378908560,"description":"Sweep Readers Off Their Feet With a Romance They'll Never Forget\n\nIn On Writing Romance, award-winning romance novelist Leigh Michaels talks you through each stage of the writing and publishing process. From the origins and evolution of the romance novel to establishing a vital story framework to writing that last line to seeking out appropriate publishers, everything you ever wanted to know about writing a romance novel is here.\n\nIn addition to a comprehensive breakdown of more than thirty romance subgenres, including such categories as historical, inspirational, Regency, and sweet traditional, you'll discover how to:\n\nSteer clear of cliches and stereotypes by studying the genre\nCraft engaging and realistic heroes and heroines readers will adore\nConvincingly develop the central couple's blossoming relationship\nAdd conflict by utilizing essential secondary characters like the &quot;other woman&quot;\nUse tension and timing to make your love scenes sizzle with sensuality\nGet your characters to happily-ever-after with an ending readers will always remember\n\nPlus, read a sample query letter, cover letter, and synopsis, and learn how to properly prepare you romance novel for submission to agents and editors. On Writing Romance has everything you need to leave readers swooning!","torrent":{"xt":"urn:btih:0174ec0bcd249905847de4c5bb53504e28295eb1","amp;dn":"On+Writing+Romance%3A+How+to+Craft+a+Novel+That+Sells-Leigh+Michae","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0174ec0bcd249905847de4c5bb53504e28295eb1","infoHashBuffer":{"type":"Buffer","data":[1,116,236,11,205,36,153,5,132,125,228,197,187,83,80,78,40,41,94,177]},"announce":[],"urlList":[]}}