{"title":"The Science of Ice Cream","uid":4675470,"size":17116374,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:01d1b03e2fa6cafca1a68d0b1f6cfd981c2a0497&amp;dn=The+Science+of+Ice+Cream&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"iornix","files":-1,"time":1232888534,"description":"Ice cream as we recognize it today has been in existence for at least 300 years, though its origins probably go much further back in time. Though no one knows who invented ice cream, the first improvement in its manufacture was made by Nancy Johnson, of Philadelphia, who invented the first ice cream making machine in the 1840s. The Science of Ice Cream begins with an introductory chapter on the history of ice cream. Subsequent chapters outline the physical chemistry underlying its manufacture, describe the ingredients and industrial production of ice cream and ice cream products respectively, detail the wide range of different physical and sensory techniques used to measure and assess ice cream, describe its microstructure (i.e. ice crystals, air bubbles, fat droplets and sugar solution), and how this relates to the physical properties and ultimately the texture that you experience when you eat it. Finally, some suggestions are provided for experiments relating to ice cream and ways to make ice cream at home or in a school laboratory.\n\nThe Science of Ice Cream is ideal for undergraduate food science students as well as for people working in the ice cream industry. It is also accessible to the general reader who has studied science to A level and provides teachers with ideas for using ice cream to illustrate scientific principles.\n\nThe Science of Ice Cream\nBy Chris Clarke\nEdition: illustrated\nPublished by Royal Society of Chemistry, 2004\nISBN 0854046291, 9780854046294\n187 pages\n\nPreview at http://books.google.com/books?id=bKZ1oICZWywC&amp;dq","torrent":{"xt":"urn:btih:01d1b03e2fa6cafca1a68d0b1f6cfd981c2a0497","amp;dn":"The+Science+of+Ice+Cream","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d1b03e2fa6cafca1a68d0b1f6cfd981c2a0497","infoHashBuffer":{"type":"Buffer","data":[1,209,176,62,47,166,202,252,161,166,141,11,31,108,253,152,28,42,4,151]},"announce":[],"urlList":[]}}