{"title":"Armin Van Buuren - Mirage The Remixes (Bonus Edition) (2011)","uid":6476689,"size":418269004,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:01d8eb1637d6d7147af24f69fd7e983a8e8287e8&amp;dn=Armin+Van+Buuren+-+Mirage+The+Remixes+%28Bonus+Edition%29+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"IndexTrance","files":-1,"time":1308334322,"description":"ARMIN VAN BUUREN - MIRAGE THE REMIXES (BONUS EDITION) (2011)\n\nAlways Seperated And Splitted.\n\nTracks:\n\n01. (00:07:52) Armin Van Buuren feat. Laura - Drowning (Avicii Remix)\n02. (00:06:11) Armin Van Buuren feat. Nadia Ali - Feels So Good (Tristan Garner Remix)\n03. (00:06:09) Armin Van Buuren feat. Adam Young - Youtopia (Blake Jarrell Remix)\n04. (00:06:50) Armin Van Buuren vs. Ferry Corsten - Minack (Orjan Nilsen Remix)\n05. (00:07:07) Armin Van Buuren vs. Sophie Ellis-Bextor - Not Giving Up On Love (Dash Berlin 4AM Mix)\n06. (00:07:26) Armin Van Buuren feat. Winter Kills - Take A Moment (Shogun Remix)\n07. (00:07:54) Armin Van Buuren - Orbion (Max Graham vs. Protoculture Remix)\n08. (00:09:28) Armin Van Buuren feat. BT - These Silent Hearts (Ralphie B Remix)\n09. (00:07:04) Armin Van Buuren - Full Focus (Ummet Ozcan Remix)\n10. (00:09:19) Armin Van Buuren feat. Sophie - Virtual Friend (BT Remix)\n11. (00:04:02) Armin Van Buuren feat. Christian Burns - This Light Between Us (Orchestral Version)\n12. (00:08:18) Armin Van Buuren feat. Sophie - Virtual Friend (16 Bit Lolitas Remix)\n13. (00:07:34) Armin Van Buuren feat. Ana Criado - Down To Love (Kyau &amp; Albert Remix)\n14. (00:07:24) Armin Van Buuren - Mirage (Alexander Popov Remix)\n15. (00:07:22) Armin Van Buuren feat. Christian Burns - This Light Between Us (Armin Van Buuren's Great Strings Mix)\n16. (00:08:53) Armin Van Buuren - I Don't Own You (Andy Moor Remix)\n17. (00:07:34) Armin Van Buuren feat. Winter Kills - Take A Moment (Alex M.O.R.P.H. Remix)\n18. (00:07:49) Armin Van Buuren feat. Cathy Burton - I Surrender (Sebastian Brandt Remix)\n19. (00:07:48) Armin Van Buuren feat. Vanvelzen - Take Me Where I Wanna Go (Giuseppe Ottaviani Remix)\n20. (00:08:36) Armin Van Buuren - Coming Home (Arctic Moon Remix)\n21. (00:08:22) Armin Van Buuren feat. Christian Burns &amp; Bagga Bownz - Neon Hero\n22. (00:07:29) Armin Van Buuren - Orbion (Eco Remix)\n23. (00:06:19) Armin Van Buuren feat. Adam Young - Youtopia (Tocadisco Remix)\n24. (00:08:19) Armin Van Buuren feat. Adam Young - Youtopia (ReLocate Remix\n25. (00:07:03) Armin Van Buuren feat. Christian Burns - This Light Between Us (Dabruck &amp; Klein Remix)\n26. (00:07:01) Armin Van Buuren feat. Vanvelzen - Take Me Where I Wanna Go (Chris Schweizer Mix)\n27. (00:06:44) Armin Van Buuren - I Don't Own You (The Thrillseekers Remix)\n28. (00:06:32) Armin Van Buuren feat. BT - These Silent Hearts (W&amp;W Remix)\n29. (00:07:17) Armin Van Buuren feat. Jessie Morgan - Love Too Hard (Roger Shah's Pumpin' Island Remix)\n30. (00:07:07) Armin Van Buuren vs. Ferry Corsten - Minack (Mark Sixma Remix)\n\nPlaying Time: 03:42:53\nQuality: Extreme, (avg. bitrate: 250kbps)\nSource: N/A\n\nEnjoy, Segel","torrent":{"xt":"urn:btih:01d8eb1637d6d7147af24f69fd7e983a8e8287e8","amp;dn":"Armin+Van+Buuren+-+Mirage+The+Remixes+%28Bonus+Edition%29+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01d8eb1637d6d7147af24f69fd7e983a8e8287e8","infoHashBuffer":{"type":"Buffer","data":[1,216,235,22,55,214,215,20,122,242,79,105,253,126,152,58,142,130,135,232]},"announce":[],"urlList":[]}}