{"title":"Dillinja.Various.Singles.Drum'N'Bass","uid":4579940,"size":94865285,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:01e7387778e737c90edb8d14320ec95fba40c90c&amp;dn=Dillinja.Various.Singles.Drum%5C%27N%5C%27Bass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tzanev","files":17,"time":1229381872,"description":"Arguably the most prolific producer within the drum and bass scene (with over 500 releases produced since 1991), Francis subsequently set up Valve Recordings in partnership with long-term collaborator Lemon D (Kevin King), with whom he also designed and built the Valve Sound System. Purported to be the most bass-heavy system in the world (contrary to rumour it is not the loudest), it is the only sound system to have been purpose-built for drum and bass.\n\nAs well as the record label and sound system, Francis and King have also opened a specialist mastering and vinyl cutting studio, Ear2ground.\n\nAlbums include My Sound (1993-2004), Cybotron, as well as Big Bad Bass and The Killa-Hertz with Lemon D.\n\nThe spelling of Dillinja has changed since he started releasing vinyl (found on some older vinyl as Dillinger). The origin of his name is unknown but it is likely that it came from one of reggae's earliest MCs, who called himself Dillinger (real name Lester Bullocks) after the famous American gangster John Dillinger. One of Dillinja's other aliases, Capone, is also linked to one of Bullocks contemporaries, Dennis 'Alcapone' (born Dennis Smith), who produced reggae and ran a sound system in Jamaica.\n\nDillinja originates from Clapham, London.","torrent":{"xt":"urn:btih:01e7387778e737c90edb8d14320ec95fba40c90c","amp;dn":"Dillinja.Various.Singles.Drum%5C%27N%5C%27Bass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"01e7387778e737c90edb8d14320ec95fba40c90c","infoHashBuffer":{"type":"Buffer","data":[1,231,56,119,120,231,55,201,14,219,141,20,50,14,201,95,186,64,201,12]},"announce":[],"urlList":[]}}