{"title":"Hot Funk with a hint of jazz n soul","uid":4283240,"size":295832249,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0238553e3e0988e90488606450a943da3a2e9b7c&amp;dn=Hot+Funk+with+a+hint+of+jazz+n+soul&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"imunionjack","files":74,"time":1215541644,"description":"Hot Funk with a touch of Jazz and a hint of Soul\nThis is the complete last set I did at the Wag Club London WC1\n\nFunk is an American musical style that originated in the mid- to late-1960s when African American musicians blended soul music, soul jazz and R&amp;B into a rhythmic, danceable new form of music. Funk de-emphasizes melody and harmony, and brings a strong rhythmic groove of electric bass and drums to the foreground. Unlike R&amp;B and soul songs, which had many chord changes, funk songs are often based on an extended vamp on a single chord.\nLike much of African inspired music, funk typically consists of a complex groove with rhythm instruments such as electric guitar, electric bass, Hammond organ, and drums playing interlocking rhythms. Funk bands also usually have a horn section of several saxophones, trumpets, and in some cases, a trombone, which plays rhythmic \\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;hits\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&quot;.\nInfluential African American funk performers include James Brown, Sly and the Family Stone, George Clinton and Parliament-Funkadelic, Curtis Mayfield, The Meters, The Funk Brothers, Bootsy Collins, and Prince. Notable 1970s funk bands included Earth, Wind &amp; Fire, Tower of Power, Average White Band, The Ohio Players, The Commodores, and Kool &amp; the Gang though many of these most famous bands in the genre also played disco and soul extensively. Funk music was a major influence on the development of 1970s disco music and funk samples are used in most styles of house music and hip hop music, and it\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s also the main influence of Go-Go. Funk even left its mark on New Wave, and its pulse was evident in post punk as well.\nThis was a set I did 2 weeks ago and was asked to do a torrent of it ~ it got everyone dancing for 4 + hours so it might be worth playing. Its not got that many rarities amongst them but I dare ya to stay in your seat for long without your foot tapping. I might do a rare groove one ~ we will see. But as 70\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Funk is so popular down here at the moment I dont see why I should ~ might just do another Funk one but jazz it up. All I can add is to enjoy! \nunionjack 2008","torrent":{"xt":"urn:btih:0238553e3e0988e90488606450a943da3a2e9b7c","amp;dn":"Hot+Funk+with+a+hint+of+jazz+n+soul","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0238553e3e0988e90488606450a943da3a2e9b7c","infoHashBuffer":{"type":"Buffer","data":[2,56,85,62,62,9,136,233,4,136,96,100,80,169,67,218,58,46,155,124]},"announce":[],"urlList":[]}}