{"title":"Cortex_Command-FANiSO","uid":7683230,"size":65258274,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0240fdc9c1fb221949a514c2217b34951cf94191&amp;dn=Cortex_Command-FANiSO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Gh0stNet","files":3,"time":1348876760,"description":" A project over eleven years in the making, Cortex Command has rich 2D\n  pixel graphics coupled with an extremely detailed physics engine, which\n  allows for highly replayable and emergent real-time action. There is also\n  a turn-based strategic campaign mode which ties the tactical fights\n  together, featuring persistent terrains that will accumulate the battle\n  scars, debris, and bunker ruins through your entire campaign.\n \n \n  Choose from several unique technology factions, each featuring their own\n  sets of expendable soldier bodies, mechas, weapons, tools, and landing\n  craft. Protect your brain, mine the gold, and destroy the enemy cortex in\n  his bunker complex!\n \n \n \n   Features:\n   ~~~~~~~~~\n   * Fully destructible environments - The gold you need to excavate is\n     sprinkled throughout the terrain of each scene. Use special digging\n     tools to blast your way into the dirt and debris. All the pieces of\n     bodies and ships from your struggles will fall to the ground and\n     permanently add to the battlefield. Get more powerful (and expensive)\n     diggers and you can even tunnel into your enemies' bunkers from below!\n   * In-game buying menu - At any time and place during the game, bring up\n     a powerful menu to order new bodies and equipment, all delivered at\n     the location and by the transport ship of your choosing. Rockets are\n     cheaper but unreliable and harder to land. Drop ships are far more\n     expensive but can quickly deploy entire groups of puppets onto\n     difficult terrain. Ships and equipment returned to the TradeStar are\n     refunded to your account.\n   * Build your own bunker - At the start of most missions, you are able to\n     take your time and build your own command bunker from scratch. Easily\n     design twisting tunnels and place doors, traps, and turrets to thwart\n     your enemies' intrusions! Pre-deploy and equip bodies in and around\n     your installation to prepare yourself for your objectives. Don't spend\n     too much though, or you won't have enough funds left when the mission\n     starts!\n   * Four-player cooperative and/or versus multiplayer - Gather your\n     friends and plug in those game controllers! Play skirmish or campaign\n     missions with or against up to three of your buddies. 2 vs 2, 1 vs. 3,\n     4 vs. the CPU - it's up to you! (rhyme intended). Flexible control\n     settings allow you to use the keyboard, keyboard + mouse, or any\n     generic game controller you can find and plug in.\n   * Built-in editors and modding - Several in-game editors allow you to\n     easily create your own stuff. The game's engine is built to make it\n     very simple to modify and add your own content. Design your own\n     missions, guys, ships, weapons, tools, bombs, and shields - and easily\n     share them with your friends. Join and download some fantastic mods\n     from the community at the Data Realms Fan Forums.\n \n \n \n   Install\n   ~~~~~~~\n   1.) Unpack\n   2.) Burn or mount\n   3.) Play the game\n ","torrent":{"xt":"urn:btih:0240fdc9c1fb221949a514c2217b34951cf94191","amp;dn":"Cortex_Command-FANiSO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0240fdc9c1fb221949a514c2217b34951cf94191","infoHashBuffer":{"type":"Buffer","data":[2,64,253,201,193,251,34,25,73,165,20,194,33,123,52,149,28,249,65,145]},"announce":[],"urlList":[]}}