{"title":"[HorribleSubs] [Cardfight!! Vanguard] [01-60] [720p]","uid":7067263,"size":18442985508,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:024886995822ada21495d60c4127cce64b6e5322&amp;dn=%5BHorribleSubs%5D+%5BCardfight%21%21+Vanguard%5D+%5B01-60%5D+%5B720p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Presk","files":61,"time":1330557204,"description":"As i couldn't find all the episodes in 1 big file in torrent sites, so i decided to create my own so others wont have to go thru all the trouble i had to download each episode 1 at a time, so here you are, episodes 1 to 60,all in 720p, enjoy!\n\nPlot\n\nThe protagonist of this story, Aichi Sendo, is a timid boy in his third year of middle school. He had been living his life looking backward rather than forward, trying not to stand out. However, he had one thing that kept him going - the &quot;Blaster Blade&quot;, a card from a card game that was given to him when he was little. That card is the reason why he begins to engage in Card Fights, something that changes his life drastically. The name of the card game is &quot;Vanguard&quot;. The game takes place in a different planet called &quot;Cray&quot;, and due to a never-before-seen play system, it becomes popular throughout the world.\n\nAichi, immediately attracted by Vanguard, meets friends such as Misaki Tokura and Kamui Katsuragi, along with other rivals. Through friendly rivalry with them, Aichi begins to enjoy a fulfilling life. Aichi, however, has a goal: to once again battle with a Vanguard Fighter by the name of Kai Toshiki, who is an aloof and cold-hearted high schooler who has outstanding abilities in the world of Vanguard. He is also the reason why Aichi started playing the game. For him, Kai is the person who saved him from his boring life and introduced him to Vanguard. In order to get better at Vanguard, Aichi puts his soul into it every day. He wishes that someday, he'll be able to battle Kai and have him recognize his worth.","torrent":{"xt":"urn:btih:024886995822ada21495d60c4127cce64b6e5322","amp;dn":"%5BHorribleSubs%5D+%5BCardfight%21%21+Vanguard%5D+%5B01-60%5D+%5B720p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"024886995822ada21495d60c4127cce64b6e5322","infoHashBuffer":{"type":"Buffer","data":[2,72,134,153,88,34,173,162,20,149,214,12,65,39,204,230,75,110,83,34]},"announce":[],"urlList":[]}}