{"title":"Dee Henderson-True Valor","uid":10161555,"size":306118149,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:02a220fc9e06a4059876edd44f3501fa1f1b144c&amp;dn=Dee+Henderson-True+Valor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"twocows","files":46,"time":1400301458,"description":"During a rescue in Ecuador gone bad, Air Force Major Bruce &quot;Striker&quot; Stanton, a Pararescue Jumper (PJ for short), realizes he only has three regrets in life: &quot;Not having a dog. A house. A wife.&quot; As soon as he gets stateside he immediately rectifies the first two things on the list. The third is going to take a little longer, but he has a candidate in mind: Navy pilot Lieutenant Grace Yates.\n\nAs much as Grace likes Bruce, she's not sure she's ready. She's still in mourning for the boyfriend she lost a few years earlier, and she doesn't want to date someone who's job involves a lot of risk-taking. Not to mention that they are stationed in different cities when they're stateside, as well as spending a lot of time overseas. Grace is worried the obstacles are too great, but Bruce persuades her to give them a chance. They start with exchanging letters while on deployment in the Middle East. Soon friendship is budding into something more, and when they get home they start exploring options for a more permanent relationship. Unfortunately, tensions are rising in ........................................ ","torrent":{"xt":"urn:btih:02a220fc9e06a4059876edd44f3501fa1f1b144c","amp;dn":"Dee+Henderson-True+Valor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02a220fc9e06a4059876edd44f3501fa1f1b144c","infoHashBuffer":{"type":"Buffer","data":[2,162,32,252,158,6,164,5,152,118,237,212,79,53,1,250,31,27,20,76]},"announce":[],"urlList":[]}}