{"title":"Shogun's Sadism aka Oxen Split Torturing or Joy of Torture 2","uid":5617006,"size":706015228,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:02e1b28daeb17644c8784ca07d9023116be1d8f9&amp;dn=Shogun%5C%27s+Sadism+aka+Oxen+Split+Torturing+or+Joy+of+Torture+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"SuperMexican","files":-1,"time":1276103870,"description":"   Here is another hard to find film that I will be seeding for a week. Here is a mini-review from The Horrorist of Horrowatch.com...\n\n&quot;Two short stories, the first being a doomed love story between a samarai and a young woman at a time when the local Shogun really enjoys torturing those sneaky Christians - which she happens to be one of. The second tale is equally gloomy, with a shiftless brothel-janitor tries to help one of the prostitutes escape the brutality of her profession. While both those stories sound harmless, maybe even a little boring, the truth is this movie is pretty much wall-to-wall torture and executions with gallons of gruesome.\n\nFilmed in what we'd now call docu-drama style, Shogun's Sadism is actually a surprising little flick. The first story was actually pretty moving. Don't get me wrong, it's really just another excuse for a bunch of filmmakers to show off their gore skills and how creatively sadistic they could be, but the story does actually make it through the castrations, immolations, crucifixions and other cheery stuff. \n\nThis is some seriously unpleasant viewing, though. Unlike films where it's all a little tongue-in-cheek like Bloodsucking Freaks or some women-in-prison flick where scantily clad gals whip each other menacingly, this one's much more grim. \n\nAlso the torture and execution scenes abound, I lost track and can't even remember them all. People are boiled, burned and fried, branded, crushed, castrated, torn apart, blinded, beaten... and it actually gets much worse and the list goes on and on.\n\nOne would think that the most disturbing scenes would be either the long and grisly castration or the oxen-torture scene where a woman's legs are tied to two oxen and they split her up the middle, but it really wasn't. I won't tell you what was, though. \n\nAn interesting insight into the film that I've read is that the characters in the second story are reincarnated from the first story, but with roles reversed so that the evil Shogun and his henchmen are now the prostitutes in the brothel, being driven and abused by the pimp who was originally the good samarai and is now acting out his celestial vengeance, thus showing that Karma is indeed a bitch. I dunno, I personally think that's reading a bit too much into a story that's really just meant to be sleazy and shocking. \n\nAlso, if you think Hostel is tame, you shuld check this out. You probably can't, though, it's pretty hard to find.&quot;\n\n   I've added the English subtitles so you can follow some of the story. I will be seeding this for about one week. I am not the original uploader and I simply want to share this rare flick with the Piratebay community. So if you like it, please seed and enjoy! Comments are welcome because I am sort of new to uploading files here.\n \n\n\n\n","torrent":{"xt":"urn:btih:02e1b28daeb17644c8784ca07d9023116be1d8f9","amp;dn":"Shogun%5C%27s+Sadism+aka+Oxen+Split+Torturing+or+Joy+of+Torture+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02e1b28daeb17644c8784ca07d9023116be1d8f9","infoHashBuffer":{"type":"Buffer","data":[2,225,178,141,174,177,118,68,200,120,76,160,125,144,35,17,107,225,216,249]},"announce":[],"urlList":[]}}