{"title":"Animals as Disguised Symbols in Renaissance Art (Art Ebook).pdf","uid":9702289,"size":10981092,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03336b6b758e006ca210ca0619a57b180edd807c&amp;dn=Animals+as+Disguised+Symbols+in+Renaissance+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1394024725,"description":"Animals as Disguised Symbols in Renaissance Art By Simona Cohen\nPublisher: Brill Academic Publishers 2008 | 316 Pages | ISBN: 9004171010 | PDF | 11 MB\n\nThe relationship between medieval animal symbolism and the iconography of animals in the Renaissance has scarcely been studied. Filling a gap in this significant field of Renaissance culture, in general, and its art, in particular, this book demonstrates the continuity and tenacity of medieval animal interpretations and symbolism, disguised under the veil of genre, religious or mythological narrative and scientific naturalism. An extensive introduction, dealing with relevant medieval and early Renaissance sources, is followed by a series of case studies that illustrate ways in which Renaissance artists revived conventional animal imagery in unprecedented contexts, investing them with new meanings, on a social, political, ethical, religious or psychological level, often by applying exegetical methodology in creating multiple semantic and iconographic levels. \n\nAuthor:\nSimona Cohen, Phd. in Art History (1982), Tel-Aviv University, is Senior Lecturer there. She has published extensively on problems of Renaissance iconography, Venetian art and animal symbolism. Indian Art History is her second academic field of research and teaching.","torrent":{"xt":"urn:btih:03336b6b758e006ca210ca0619a57b180edd807c","amp;dn":"Animals+as+Disguised+Symbols+in+Renaissance+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03336b6b758e006ca210ca0619a57b180edd807c","infoHashBuffer":{"type":"Buffer","data":[3,51,107,107,117,142,0,108,162,16,202,6,25,165,123,24,14,221,128,124]},"announce":[],"urlList":[]}}