{"title":"Satiric Advice on Women and Marriage: From Plautus to Chaucer ","uid":9408664,"size":1238212,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:035090e00bd66f49a9cf56d9b3999464f4396557&amp;dn=Satiric+Advice+on+Women+and+Marriage%3A+From+Plautus+to+Chaucer+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1388226288,"description":"Advice on sex and marriage in the literature of antiquity and the middle ages typically stressed the negative: from stereotypes of nagging wives and cheating husbands to nightmarish visions of women empowered through marriage. Satiric Advice on Women and Marriage brings together the leading scholars of this fascinating body of literature. Their essays examine a variety of ancient and early medieval writers' cautionary and often eccentric marital satire beginning with Plautus in the third century B.C.E. through Chaucer (the only non-Latin author studied). The volume demonstrates the continuity in the Latin tradition which taps into the fear of marriage and intimacy shared by ancient ascetics (Lucretius), satirists (Juvenal), comic novelists (Apuleius), and by subsequent Christian writers starting with Tertullian and Jerome, who freely used these ancient sources for their own purposes, including propaganda for recruiting a celibate clergy and the promotion of detachment and asceticism as Christian ideals.\n\nWarren S. Smith is Professor of Classical Languages at the University of New Mexico.\n","torrent":{"xt":"urn:btih:035090e00bd66f49a9cf56d9b3999464f4396557","amp;dn":"Satiric+Advice+on+Women+and+Marriage%3A+From+Plautus+to+Chaucer+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035090e00bd66f49a9cf56d9b3999464f4396557","infoHashBuffer":{"type":"Buffer","data":[3,80,144,224,11,214,111,73,169,207,86,217,179,153,148,100,244,57,101,87]},"announce":[],"urlList":[]}}