{"title":"John Coltrane - The Best of John Coltrane (2004) [FLAC] -politux","uid":5550711,"size":456780094,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0485e42b91c5cd13bdb0f7206bb00237205779f5&amp;dn=John+Coltrane+-+The+Best+of+John+Coltrane+%282004%29+%5BFLAC%5D+-politux&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1273531689,"description":"A look at the dates and the label easily give the story away, for on this single disc, you are going to hear the formative Coltrane when he was still working for Miles Davis and Thelonious Monk, not the spiritual visionary of the 1960s. Nevertheless, there are plenty of indications of what was to come in these sessions, as distilled from the massive 16-CD Prestige Recordings box. To cite just one of many examples where Coltrane seems to be leaving his sidemen and the era behind, on &quot;Come Rain or Come Shine,&quot; Coltrane's sheets of sound are already blazing, while the rest of the expert rhythm section and trumpeter Donald Byrd seem stuck in the 1950s. Trane also rips up-tempo into as unlikely a vehicle as Irving Berlin's &quot;Russian Lullaby,&quot; and the alternating Latin and straight-ahead grooves of the rhythm section in &quot;Bahia&quot; play as foils to the increasingly outside flurries of the restless leader. The gentle side of Coltrane took shape in the 1950s as well; that wonderfully majestic yet compassionate tone can be felt in the ballad &quot;Theme for Ernie.&quot; Coltrane is also heard as a sideman on albums by Mal Waldron (&quot;The Way You Look Tonight&quot;), Tadd Dameron in a rare quartet setting (&quot;On a Misty Night&quot;); Trane sounds more clearly his own man in the latter than the former, though the recording date is earlier. There's no work with Miles  here; you can find some of that on the Best of Miles Davis volume in this series. And there is no attempt at putting things in chronological order, in the service of better pacing. For those unable, or unwilling, to invest in the big box, this single disc will do fine as a stopgap. \n\nFormat: CD\nReleased: 2004\nLabel: Prestige Records\nGenre: Jazz\nStyle: Hard Bop\nQuality: FLAC\nAllmusic rating: 4 / 5 stars\n\n\nTracks:\n\n 1 Russian Lullaby\n 2 The Way You Look Tonight\n 3 On a Misty Night\n 4 Come Rain or Come Shine\n 5 Dakar\n 6 I'll Get By (As Long As I Have You)\n 7 Theme for Ernie\n 8 Bahia\n 9 Lover Come Back to Me\n 10 I Hear a Rhaposdy\n 11 Trane's Slo Blues (aka Slowtrane)\n\n\nUploaded by politux. More at:\nhttp://thepiratebay.se/user/politux/","torrent":{"xt":"urn:btih:0485e42b91c5cd13bdb0f7206bb00237205779f5","amp;dn":"John+Coltrane+-+The+Best+of+John+Coltrane+%282004%29+%5BFLAC%5D+-politux","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0485e42b91c5cd13bdb0f7206bb00237205779f5","infoHashBuffer":{"type":"Buffer","data":[4,133,228,43,145,197,205,19,189,176,247,32,107,176,2,55,32,87,121,245]},"announce":[],"urlList":[]}}