{"title":"Fuck: Word Taboo and Protecting our First Amendment Liberties","uid":10320241,"size":8711701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0550486f5408ee12bafa64c819ebf8c977aab3d2&amp;dn=Fuck%3A+Word+Taboo+and+Protecting+our+First+Amendment+Liberties&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1402299082,"description":"\nby Christopher M. Fairman\n\nFUCK. Our most taboo word and how the law keeps it forbidden.\nThis entertaining read is about the word &quot;fuck&quot;, the law, and the taboo. Whether you shout it out in the street or whisper it in the bedroom, deliberately plan a protest, or spontaneously blurt it out, if you say &quot;fuck,&quot; someone wants to silence you, either with a dirty look across the room or by making a rule that you cannot say the word. \n\nWhen it's the government trying to cleanse your language, though, you should worry. Words are ideas. If the government controls the words we use, it can control what we think. To protect this liberty, we must first understand why the law's treatment of &quot;fuck&quot; puts that freedom at risk. This book examines the law surrounding the word and reveals both inconsistencies in its treatment and tension with other identifiable legal rights that the law simply doesn't answer. \n\nThe power of taboo provides the framework to understand these uncertainties. It also explains why attempts to curtail the use of &quot;fuck&quot; through law are doomed to fail. Fundamentally, it persists because it is taboo; not in spite of it.\n\nFrom Publishers Weekly\n\nIn a spirited expansion on his law review article, &quot;Fuck,&quot; Ohio State Univ. law professor Fairman explores the origin and the affect of perhaps the most notorious word in the English language. \n\nFairman begins with a catalog and limited history of the word, including usages sexual and non-sexual. In tracking down the word's origins-largely unknown-and the abundance of court cases involving it, Fairman highlights the long struggle of conservative forces to expel that word, and other forms of speech, from American society, in direct opposition to the first amendment. \n\nFairman also addresses the downfalls inherent to the amendment, including the exception for speech used to incite violence, and the myriad of punishments used, at state and national levels, to deal with those exceptions. Drawing from a vast selection of historical documentation, Fairman also explores the nature of taboo and related trivia, such as the word's usage across gender lines. \n\nAustere and informative, Fairman's social history is uncompromising in its vigilant defense of first amendment rights, both in spite of his subject's potential for offense, and because of it.\n\nGenre: Non Fiction | General","torrent":{"xt":"urn:btih:0550486f5408ee12bafa64c819ebf8c977aab3d2","amp;dn":"Fuck%3A+Word+Taboo+and+Protecting+our+First+Amendment+Liberties","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0550486f5408ee12bafa64c819ebf8c977aab3d2","infoHashBuffer":{"type":"Buffer","data":[5,80,72,111,84,8,238,18,186,250,100,200,25,235,248,201,119,170,179,210]},"announce":[],"urlList":[]}}