{"title":"Learn HackingPenetration Testing using Android From Scratch","uid":15592332,"size":1859631878,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:05692971ac840adeb88714dfcc85bd7678ff18f1&amp;dn=Learn+HackingPenetration+Testing+using+Android+From+Scratch&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Bonnytu","files":1,"time":1471524465,"description":"Learn HackingPenetration Testing using Android From Scratch\r\n\r\nMP4 | Video: AVC 1280x720 | Audio: AAC 44KHz 2ch | Duration: 4.5 Hours | Lec: 47 | 1.73 GB\r\nGenre: eLearning | Language: English\r\n\r\n45+ Videos to learn how to use Android as an ethical hacking tool to test the security of networks and computer systems.\r\n\r\nWelcome to my comprehensive course on using Android as a penetration testing tool, you will start as a beginner with no previous knowledge about penetration testing. The course will start with you from scratch, from preparing your Android device and computer, installing the needed apps and will finish up with examples of real life scenarios that will give you full control over various computer systems.\r\n\r\nThis course focuses on the practical side penetration testing without neglecting the theory behind each attack, for each attack you will learn how that attack works and then you will learn how to practically launch that attack, this will give you full understanding of the conditions which allow this attack to be successfully executed, this knowledge will help you to detect and sometimes prevent this attack from happening. The the attacks explained in this course are launched against real devices in my lab.\r\n\r\nThe Course is Divided into four main sections:\r\n\r\nPreparing: this section will take you through the steps of of preparing your computer and installing NetHunter (an Android penetration testing platform) on your Android device. You will also learn how to use the main menus of NetHunter, and as a bonus I added three lectures to teach you how to install Kali Linux (a penetration testing OS) on your computer.\r\nInformation Gathering:in this section we still don't know much about penetration testing , all we have is an Android device with NetHunter installed on it, you will learn how to start gathering information about WiFi networks around you, not only that but you will also learn how to map your current networking, displaying the connected devices and information about them such as their IP address, Mac Address, OS, open ports and running services/programs. You will also learn how to connect an external wireless card to your Android device and prepare it to be used to crack WiFi keys.\r\nSpying: In this section you will learn what is meant by MITM (Man In The Middle) and how to use your Android device to achieve it using three methods. Being the MITM will allow you to gain access to any account accessed by devices in your network, or accounts accessed by the device which your Android device is connected to via USB. You will also learn how to create a fake access point and spy on all the data sent on it. \r\nExploitation: In this section we will have a look on a number of exploitation methods that can be used to to gain full control over your target computer weather it runs Windows/Linux/OSX only by connecting your Android device to the target computer. You will also learn why you should never leave your computer locked on a login screen as you will see login screens can be bypassed on both OSX and Windows (ie: you'll be able to login without a password to Windows and OSX machines). Finally you will learn how to make an undetectable backdoor and deliver it to the target computer by replacing files that the target machine downloads or backdooring the downloaded files on the fly.\r\nDetection &amp; Protection: In this section you will learn three methods to detect ARP Poisoning Attacks, you will also learn how to use Wireshark to detect other suspicious activities in your network. We will also discuss how to protect against these MITM attacks and prevent them from happening. Finally you will learn how to detect backdoors that can bypass antivirus programs and check file integrity to ensure that they have not been backdoored.\r\nNOTE: This course is created for educational purposes only and all the attacks are launched in my own lab or against devices that I have permission to test.\r\n\r\nNOTE: This course is totally a product of Zaid Sabih and No other organization is associated for certification exam for the same. Although, you will receive Course Completion Certification from Udemy, apart from that No OTHER ORGANIZATION IS INVOLVED","torrent":{"xt":"urn:btih:05692971ac840adeb88714dfcc85bd7678ff18f1","amp;dn":"Learn+HackingPenetration+Testing+using+Android+From+Scratch","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05692971ac840adeb88714dfcc85bd7678ff18f1","infoHashBuffer":{"type":"Buffer","data":[5,105,41,113,172,132,10,222,184,135,20,223,204,133,189,118,120,255,24,241]},"announce":[],"urlList":[]}}