{"title":"Ray Charles 24 Bit Vinyl Pack","uid":8602504,"size":3025908793,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:059ff7b69a6fba6ff40f294edc804b4e27e2f45c&amp;dn=Ray+Charles+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1371921461,"description":"\n  BTC \n\n  1P3bCN55pmnKLvuqHJcsGWyAiu8eSZW3aZ\n\n\n  Ray Charles 24 Bit Vinyl Pack\n\n  * Genres: R&amp;B, Pop/Rock, Blues, Jazz\n  * Styles: Early R&amp;B, Soul, Piano Blues, Jazz Blues\n  * Source: Vinyl\n  * Codec: FLAC\n  * Bit Rates: ~ 2,800 - 3,200 kbps\n  * Bit Depth: 24\n  * Sampling Rate: 96,000 Hz\n\n  Albums\n\n  * Ray Charles\n  * What'd I Say\n  * The Genius Sings the Blues\n  * The Genius Hits the Road\n  * Selected Songs\n\n  Artist Bio\n\n  * Ray Charles was the musician most responsible for developing soul music. Singers like Sam Cooke and Jackie Wilson also did a great deal to pioneer the form, but Charles did even more to devise a new form of black pop by merging '50s R&amp;B with gospel-powered vocals, adding plenty of flavor from contemporary jazz, blues, and (in the '60s) country. Then there was his singing; his style was among the most emotional and easily identifiable of any 20th century performer, up there with the likes of Elvis and Billie Holiday. He was also a superb keyboard player, arranger, and bandleader. The brilliance of his 1950s and '60s work, however, can't obscure the fact that he made few classic tracks after the mid-'60s, though he recorded often and performed until the year before his death.\n\n  * Blind since the age of six (from glaucoma), Charles studied composition and learned many instruments at the St. Augustine School for the Deaf and the Blind. His parents had died by his early teens, and he worked as a musician in Florida for a while before using his savings to move to Seattle in 1947. By the late '40s, he was recording in a smooth pop/R&amp;B style derivative of Nat &quot;King&quot; Cole and Charles Brown. He got his first Top Ten R&amp;B hit with &quot;Baby, Let Me Hold Your Hand&quot; in 1951. Charles' first recordings came in for their fair share of criticism, as they were much milder and less original than the classics that would follow, although they're actually fairly enjoyable, showing strong hints of the skills that were to flower in a few years.\n\n  * In the early '50s, Charles' sound started to toughen as he toured with Lowell Fulson, went to New Orleans to work with Guitar Slim (playing piano on and arranging Slim's huge R&amp;B hit, &quot;The Things That I Used to Do&quot;), and got a band together for R&amp;B star Ruth Brown. It was at Atlantic Records that Ray Charles truly found his voice, consolidating the gains of recent years and then some with &quot;I Got a Woman,&quot; a number-two R&amp;B hit in 1955. This is the song most frequently singled out as his pivotal performance, on which Charles first truly let go with his unmistakable gospel-ish moan, backed by a tight, bouncy horn-driven arrangement.\n\n  * Throughout the '50s, Charles ran off a series of R&amp;B hits that, although they weren't called &quot;soul&quot; at the time, did a lot to pave the way for soul by presenting a form of R&amp;B that was sophisticated without sacrificing any emotional grit. &quot;This Little Girl of Mine,&quot; &quot;Drown in My Own Tears,&quot; &quot;Hallelujah I Love Her So,&quot; &quot;Lonely Avenue,&quot; and &quot;The Right Time&quot; were all big hits. But Charles didn't really capture the pop audience until &quot;What'd I Say,&quot; which caught the fervor of the church with its pleading vocals, as well as the spirit of rock &amp; roll with its classic electric piano line. It was his first Top Ten pop hit, and one of his final Atlantic singles, as he left the label at the end of the '50s for ABC.\n\n  * One of the chief attractions of the ABC deal for Charles was a much greater degree of artistic control of his recordings. He put it to good use on early-'60s hits like &quot;Unchain My Heart&quot; and &quot;Hit the Road Jack,&quot; which solidified his pop stardom with only a modicum of polish attached to the R&amp;B he had perfected at Atlantic. In 1962, he surprised the pop world by turning his attention to country &amp; western music, topping the charts with the &quot;I Can't Stop Loving You&quot; single, and making a hugely popular album (in an era in which R&amp;B/soul LPs rarely scored high on the charts) with Modern Sounds in Country and Western Music. Perhaps it shouldn't have been so surprising; Charles had always been eclectic, recording quite a bit of straight jazz at Atlantic, with noted jazz musicians like David &quot;Fathead&quot; Newman and Milt Jackson.","torrent":{"xt":"urn:btih:059ff7b69a6fba6ff40f294edc804b4e27e2f45c","amp;dn":"Ray+Charles+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"059ff7b69a6fba6ff40f294edc804b4e27e2f45c","infoHashBuffer":{"type":"Buffer","data":[5,159,247,182,154,111,186,111,244,15,41,78,220,128,75,78,39,226,244,92]},"announce":[],"urlList":[]}}