{"title":"Robert Hilburn, Johnny Cash, The Life 2013 epub mobi dovah","uid":9147539,"size":5140839,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:05c964c2ded62b30ab1c3d187b5761b371ff46bd&amp;dn=Robert+Hilburn%2C+Johnny+Cash%2C+The+Life+2013+epub+mobi+dovah&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dovah12","files":-1,"time":1383615422,"description":"Johnny Cash: The Life\n\n\n\nAuthor : Robert Hilburn\n\n\nisbn: 031624869X\nisbn13: 9780316248693\nformat: ebook\nPublished October 29th 2013 by Little, Brown and Company\n\n\n\n\nThe definitive biography of an American legend In Johnny Cash: The Life, Robert Hilburn conveys the unvarnished truth about a musical icon whose colorful career stretched from his days at Sun Records with Elvis Presley and Jerry Lee Lewis to the remarkable creative last hurrah, at age sixty-nine, that resulted in the brave, moving &quot;Hurt&quot; video. As music critic for the Los Angeles Times, Hilburn knew Cash well throughout his life: he was the only music journalist at the legendary Folsom Prison concert in 1968, and he interviewed Cash and his wife June Carter for the final time just months before their deaths in 2003. Hilburn's rich reporting shows the remarkable highs and deep lows that followed and haunted Cash in equal measure. A man of great faith and humbling addiction, Cash aimed for more than another hit on the jukebox; he wanted to use his music to lift people's spirits and help promote what he felt was the best of the American spirit.\n\nDrawing upon his personal experience with Cash and a trove of never-before-seen material from the singer's inner circle, Hilburn creates an utterly compelling, deeply human portrait of one of the most iconic figures in modern popular culture - not only a towering figure in country music, but also a seminal influence in rock, whose personal life was far more troubled, and whose musical and lyrical artistry much more profound, than even his most devoted fans ever realized.\n\n================\n\nDovah","torrent":{"xt":"urn:btih:05c964c2ded62b30ab1c3d187b5761b371ff46bd","amp;dn":"Robert+Hilburn%2C+Johnny+Cash%2C+The+Life+2013+epub+mobi+dovah","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"05c964c2ded62b30ab1c3d187b5761b371ff46bd","infoHashBuffer":{"type":"Buffer","data":[5,201,100,194,222,214,43,48,171,28,61,24,123,87,97,179,113,255,70,189]},"announce":[],"urlList":[]}}