{"title":"License to Pawn: Deals, Steals, and My Life at the Gold &amp; Si","uid":8601471,"size":1127852,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06656425c4839df8fa6896f5af74d00c85a46200&amp;dn=License+to+Pawn%3A+Deals%2C+Steals%2C+and+My+Life+at+the+Gold+%26amp%3B+Si&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"candymancan","files":1,"time":1371898471,"description":"\nIn Las Vegas, there's a family-owned business called the Gold &amp; Silver Pawn Shop, run by three generations of the Harrison family: Rick; his son, Big Hoss; and Rick's dad, the Old Man. Now License to Pawn takes readers behind the scenes of the hit History show Pawn Stars and shares the fascinating life story of its star, Rick Harrison, and the equally intriguing story behind the shop, the customers, and the items for sale.\n\nRick hasn't had it easy. He was a math whiz at an early age, but developed a similarly uncanny ability to find ever-deepening trouble that nearly ruined his life. With the birth of his son, he sobered up, reconnected with his dad, and they started their booming business together.\n\nLicense to Pawn also offers an entertaining walk through the pawn shop's history. It's a captivating look into how the Gold &amp; Silver works, with incredible stories about the crazy customers and the one-of-a-kind items that the shop sells. Rick isn't only a businessman; he's also a historian and keen observer of human nature. For instance, did you know that pimps wear lots of jewelry for a reason? It's because if they're arrested, jewelry doesn't get confiscated like cash does, and ready money will be available for bail. Or that WWII bomber jackets and Zippo lighters can sell for a freakishly high price in Japan? Have you ever heard that the makers of Ormolu clocks, which Rick sells for as much as $15,000 apiece, frequently died before forty thanks to the mercury in the paint?\n\nRick also reveals the items he loves so much he'll never sell. The shop has three Olympic bronze medals, a Patriots Super Bowl ring, a Samurai sword from 1490, and an original Iwo Jima battle plan. Each object has an incredible story behind it, of course. Rick shares them all, and so much more--there's an irresistible treasure trove of history behind both the Gold &amp; Silver Pawn Shop and the life of Rick Harrison.\n","torrent":{"xt":"urn:btih:06656425c4839df8fa6896f5af74d00c85a46200","amp;dn":"License+to+Pawn%3A+Deals%2C+Steals%2C+and+My+Life+at+the+Gold+%26amp%3B+Si","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06656425c4839df8fa6896f5af74d00c85a46200","infoHashBuffer":{"type":"Buffer","data":[6,101,100,37,196,131,157,248,250,104,150,245,175,116,208,12,133,164,98,0]},"announce":[],"urlList":[]}}