{"title":"Ain't It Time We Said Goodbye The Rolling Stones on the Road to ","uid":11644555,"size":1851609,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:06cb243366590f5e0512da29072e1acdc760667b&amp;dn=Ain%27t+It+Time+We+Said+Goodbye+The+Rolling+Stones+on+the+Road+to+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1417806926,"description":"Although they did not know it then, when the Rolling Stones embarked on their farewell tour of Great Britain in March 1971 after having announced they were about to go into tax exile in the south of France, it was the end of an era. For the Stones, nothing would ever be the same again. For ten days on that tour, the Rolling Stones traveled by train and bus to play two shows a night in many of the same small town halls and theaters where they had begun their career. Performing brand new songs like &quot;Bitch,&quot; &quot;Brown Sugar,&quot; &quot;Wild Horses,&quot; and &quot;Can't You Hear Me Knockin'&quot; from their as-yet-unreleased album Sticky Fingers live on stage for the very first time, they also played classics like &quot;Midnight Rambler,&quot; &quot;Honky Tonk Women,&quot; &quot;Satisfaction,&quot; &quot;Street Fighting Man,&quot; and Chuck Berry's &quot;Little Queenie&quot; and &quot;Let It Rock.&quot; Because only one journalist--Robert Greenfield--was allowed to accompany the Stones on this tour, there has never before been a full-length account of the landmark event that marked the end of the first chapter of the Rolling Stones' extraordinary career. In a larger sense, Ain't It Time We Said Goodbye is the story of two artists on the precipice. For Mick Jagger and Ketih Richards, as well as those who traveled with them, the Rolling Stones' farewell tour of England was the end of the innocence. No laminates. No backstage passes. No security. No sound checks and no rehearsals. Just the Rolling Stones on the road playing rock 'n' roll the way it was truly meant to be seen and heard. Based on Greenfield's first-hand account as well as new interviews with many of the key players, Ain't It Time We Said Goodbye is a vibrant and thrilling look at the way it once was and would never be again in the world according to the Rolling Stones.\n\nProduct Description\n\nReview\nKirkus Reviews, 4/15/14 &quot;A book about one of the most interesting eras in the band's history.&quot; Folkrocks blog, 4/7/2014 &quot;If you want some he-was-there insights into the band's quirky and changing dynamic, you'll get those.&quot; Macomb Daily, 4/13/14 &quot;The all-access travelogue takes us inside Stonesworld at a time of shifting inner-band dynamics and in the midst of what was arguably the Stones' creative high point.&quot; UnderTheRadarMag.com, 5/19/14 &quot;Insightful and informative...Anecdotes around.&quot; NoHoArtsDistrict.com (North Hollywood), 5/21/14 &quot;[An] engaging book...Charming anecdotes of the comparatively ordinary life led by the Stones on what was announced at the time as well as their farewell tour of Great Britain.&quot; Milwaukee Shepherd Express, 6/3/14 &quot;A breezy, enjoyable look back at a brief tour of smaller British venues by the Stones in early 1971, in between Sticky Fingers and Exile on Main Street.&quot; Curled Up with a Good Book, 6/5/14 &quot;Provides a rare glimpse behind the curtain where all the magic and madness always happens on the road...[A] wonderful rock and roll travelogue...What we have is virtually an unobstructed view of the Rolling Stones in all their glorious decadence...An honest and eye-opening journal of life on the road with the world's greatest rock band.&quot; Curled Up with a Good Book, 6/5/14 &quot;If anyone has the experience to write this book, it's him. Greenfield combines his observations at the time of the ten-day tour while also adding insights from 40 years of looking back on the events and the behind-the-scenes with the unique cast of characters...It's a fine, short snapshot of the Rolling Stones.&quot; Library Journal, 6/12/14 &quot;Greenfield's narrative has a breathless, immediate tone that places readers in the middle of the action...This is a visceral and well-crafted portrait of the Stones at a crucial time in their career...An enjoyable look at the group that's likely to appeal to both Rolling Stones followers as well as fans of music journalism in general.&quot; Roanoke Times, 6/15/14 &quot;Greenfield's engaging style pulls the reader into this Britain of the past. He writes in present tense, which makes the reader feel as if she is hanging out backstage with Mick and Keith, and not merely reading tales of the long ago youth of these now aging rock stars...Although all of the sex, drugs, and rock 'n' roll one would expect in a Stones bio is here, Greenfield also highlights the band members' humanity.&quot; Hudson Valley News, 7/2/14 &quot;If you loved the Stones, and want a trip down memory lane, pick up this book and remember.&quot; Portland Book Review, 7/9/14 &quot;Easy to read.&quot; Houston Press, 7/1/14 &quot;[Greenfield] has a keen literary take on super-strong personalities. And Ain't It Time We Said Goodbye...brings those personalities to life.&quot; Waterbury Sunday Republican, 6/29/14 &quot;This book has it appeals, particularly in the portraits Greenfield provides of peripheral players in the Stones' orbit...The book also captures an England and Scotland that would be hard to find now...Some surprises await even those Stones fans who think they've heard it all.&quot; InfoDad.com,7/3/14 &quot;The chronicle of the end of an era as well as the beginning of a new one...Those of Greenfield's fellow aging baby boomers who were once deeply devoted to the Rolling Stones, and perhaps still are, will enjoy this foray into a dim past age by someone who...was certainly present while some portions of it were made.&quot; Campus Circle,7/31/14 &quot;An incredibly intimate, behind-the-scenes look at the Rolling Stones. Robert Greenfield followed the band at the tender age of 25 with stunning results.&quot; Manhattan Mercury,7/20/14 &quot;If you want to know more about secrets, truths and lies, pick up a copy...[An] excellent new read...[Greenfield] is one out of hundreds of Stones' biographers who captures the moods and climates of the group...You'll feel as if you are standing where he stands.&quot; The Weeklings,8/25/14 &quot;Offers page after page of awesome backstage revelations.&quot; Bookviews,September 2014 &quot;Greenfield chronicles the group during the ten days before their leave England in tax exile. The story is punctuated by Greenfield's analysis of the seething tensions between Mick and Keith on the cusp of their heyday.&quot; MusicTomes.com, 9/5/14 &quot;I've been collecting Stones books since that first one in 1964 and, much as I love the huge coffee table jobs, you can't beat up close and personal eye witness accounts from back in the day. Plus he's cleverly added his 2014 insights and clarifications.&quot;---NOT SURE, ANOTHER PERSON MENTIONED HIM IN THEIR INTERVIEW Midwest Book Review, September 2014 &quot;Offers an insider's survey of life backstage and the different personalities and encounters of each Stones member...An outstanding recommendation for any rock music history collection!&quot; PopMatters.com, 10/1/14 &quot;Entertaining enough, not surprising given its characters--for whom 'colorful' hardly covers it--and its evocation of a time when rock still had some countercultural edge and 'the greatest rock 'n roll band in the world' hadn't yet become a multimillion dollar corporation...Greenfield serves up some new stuff, including tasty gossip, to keep longtime Stones fans (like this reviewer) interested.&quot; Glide, 10/8/14 &quot;Sitting down with this book makes for a perfect way to spend a lazy weekend.&quot;\n\nAbout the Author\nRobert Greenfield, a former Associate Editor of the London bureau of Rolling Stone magazine, is the author of many classic rock books, including STP: A Journey Through America with the Rolling Stones and Exile on Main St.: A Season in Hell with the Rolling Stones, as well as the definitive biographies of Timothy Leary and Ahmet Ertegun. He is the coauthor, with Bill Graham, of Bill Graham Presents: My Life Inside Rock and Out, which won the ASCAP-Deems Taylor Award. An award-winning playwright and novelist, his short fiction has appeared in Esquire, GQ, and Playboy magazines. He lives in California.\n\nPublisher: Da Capo Press Inc (22 May 2014)\nLanguage: English\nISBN-10: 0306823128\nISBN-13: 978-0306823121\n\nMost Helpful Customer Reviews\n\nLoved this! A great read. 12 July 2014\nBy Brian Swanson -\nLoved this! A truly great read. In a world now dominated by Twitter feeds and fluff pieces that take no longer to read than your last visit to the loo, Greenfield puts it all down with old school detail and he has the street cred to back it up. This guy was there and though there is but one photo of Greenfield in the entire book, it's clear from that photo alone that he fit right in, allowing for him to be a true fly on the wall during what is arguably the most pivotal point in the career of the most enduring rock bands in history. Relying on what must have been an overwhelming abundance of notes scribbled in bathroom stalls and hall closets, Greenfield clearly isn't making any of this up or looking upward while uttering &quot;I remember when....&quot; Not just for Stones fans / not just for fans of rock and roll, this is about what makes any great story worth reading. It's about relationships, one of a kind characters, and yes, sex and drugs and rock and roll.\n\nBobby G Writes Another Brilliant, Sexy Exploration into Rolling Stones at Their Peak! 15 July 2014\nBy tony pazzaglia -\nRobert Greenfield writes another captivating, page turner that provides personal insights into the band during its farewell European tour. Complete with Mick and Keith relationship tension, sex, drugs and rock and roll, Ain't it Time We Said Goodbye tells an insider's story with the voice of an intelligent, cool and keen observer into the tribe that call themselves the Rolling Stones. An essential read for any Stones, music, counterculture or 1970's hipster fan!\n\nSmall book but enjoyable 6 May 2014\nBy J. Kelleher -\nI first read Greenfield's &quot;STP&quot; book in 1974 when I was 16 years old, and still covet my original hardcover. I was not impressed with his &quot;Exile&quot; book from a few years ago and gave it away as soon as I was done reading it. This new one is enjoyable enough, with a lot of re-hashing from old articles in Rolling Stones. The first error I caught is on p. 32, and says the Stones played in Boston Garden in 1967. The Stones did not tour the USA in 1967. This is a well-known fact,, and I'm surprised Greenfield's proofreaders didn't catch it. Overall, an enjoyable, short read","torrent":{"xt":"urn:btih:06cb243366590f5e0512da29072e1acdc760667b","amp;dn":"Ain%27t+It+Time+We+Said+Goodbye+The+Rolling+Stones+on+the+Road+to+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06cb243366590f5e0512da29072e1acdc760667b","infoHashBuffer":{"type":"Buffer","data":[6,203,36,51,102,89,15,94,5,18,218,41,7,46,26,205,199,96,102,123]},"announce":[],"urlList":[]}}