{"title":"Black Prairie - Fortune [2014][EAC/FLAC]","uid":10194036,"size":329694440,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:06d48bcb4fe7ecf0b12f8fb3a27acf67ab286328&amp;dn=Black+Prairie+-+Fortune+%5B2014%5D%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":18,"time":1400633963,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Sugar Hill #9141042\nCountry: USA\nYear: April 22, 2014\nGenre: Americana\nFormat: CD,Album\n\n\n1. The 84\n2. Kiss of Fate\n3. Let It Out\n4. Let Me Know Your Heart\n5. Fortune*\n6. Trask\n7. If I Knew You Then\n8. Songs To Be Sung\n9. Cold Day\n10. Animal Inside\n11. The White Tundra\n12. Be Good\n13. Count to Ten\n\n\nBegun as a side project of the Decemberists, Black Prairie started out as a sort of kinetically diverse Gypsy string band, falling maybe to the edgier, progressive side of bluegrass, and all instrumental, but with the emergence of violinist Annalisa Tornfelt as a singer on 2012's A Tear in the Eye Is a Wound in the Heart, the group's sophomore album, things on this third album have taken a whole other turn. By now their own creative entity and well past just being an adjunct to the Decemberists, Black Prairie have delivered an album of band originals, all with vocals, and with hardly a trace of any bluegrass leanings. It's folk-rock of a sort, an energetic and amped-up blend of Fairport Convention, say, with early Jefferson Airplane, maybe, all done with a sort of junkyard garage band mentality that clearly indicates that this band of precisely talented musicians isn't about to stand still and be labeled. Things open with the wonderful and easy-flowing country-folk shuffle &quot;The 84,&quot; moving over to loose-limbed Americana-tinged rock riffs for songs like title tune &quot;Fortune&quot; and arena guitars for stomping rocker &quot;The White Tundra,&quot; and maybe hitting a feistier Cowboy Junkies meets It's a Beautiful Day feel on &quot;Cold Day.&quot; There's an open-minded exploratory edge to everything here, as if Black Prairie were delighted to discover that genres are really just in the mind of the beholder. There's a tremendous creative freedom in that, and this band has poised itself to go anywhere it wants from here.","torrent":{"xt":"urn:btih:06d48bcb4fe7ecf0b12f8fb3a27acf67ab286328","amp;dn":"Black+Prairie+-+Fortune+%5B2014%5D%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06d48bcb4fe7ecf0b12f8fb3a27acf67ab286328","infoHashBuffer":{"type":"Buffer","data":[6,212,139,203,79,231,236,240,177,47,143,179,162,122,207,103,171,40,99,40]},"announce":[],"urlList":[]}}