{"title":"Incontrovertible - New 9/11 Documentary by Tony Rooke","uid":14650977,"size":444242496,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07088ec95548fa7e749e05266038cf7579882f6c&amp;dn=Incontrovertible+-+New+9%2F11+Documentary+by+Tony+Rooke&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Truthout","files":1,"time":1463626783,"description":"Incontrovertible - New 9/11 Documentary by Tony Rooke \nhttp://www.incontrovertible911evidence.co.uk/\r\n\r\nINCONTROVERTIBLE is the first and only feature length documentary we have which portrays the frank and candid views of Police Officers, Firefighters and Soldiers as they express their grave concerns about the official explanation for the events of 9/11. The film is intended to act as a practical aid in combating the mainstream media's propaganda and outright lies concerning the attacks on September 11th 2001.\r\nThis film is intended to be viewed by Police Officers, Firefighters and all those serving in the Armed Forces as they are the among the best placed members of our society to have the ability to change things for the better. If you have friends or family who are serving then please pass this film onto them.\r\nTony Rooke and Brian Maxwell interviewed on INFOWARS\r\nTony and Brian were interviewed on Infowars Nightly News about the film INCONTROVERTIBLE and Brian's resignation.\r\nINFOWARS interview on Youtube at\nINCONTROVERTIBLE bite size released\r\nTony Rooke has produced and published a bite size edition of his film INCONTROVERTIBLE.\r\nThis edition is especially intended for Fire Fighters in the UK and abroad.\r\nINCONTROVERTIBLE bite size is available on Youtube at\nUK Government Petition Launched\r\nA new government petition has been started to try to get a proper investigation into the collapse of World Trade Centre building 7.\r\nClick here to add your name to the petition\r\nOfficial Wise Monkeys goes live\r\nTwo of the participants of the film INCONTROVERTIBLE have launched a new website intended to report on attempts to lobby those people in a position to do something about the problems with the official story.\r\nOfficial Wise Monkeys - officialwisemonkeys.org.uk\r\nBrian Maxwell resigns from Fire Service after appearing in INCONTROVERTIBLE\r\nAfter appearing in the film Scottish Firefighter Brian Maxwell faced disciplinary action from the Scottish Fire Service. It seems his employer did not like him raising concerns for the safety of his colleagues following the first and only collapse in history of a steel framed high rise building from fire alone.\r\nFurther information is available on our page Brian Maxwell Resigns\r\nMatt Cambell attempting to get the inquest into his brother's death re-opened\r\nOne of the participants in the film INCONTROVERTIBLE is attempting to get the inquest into his brother's death re-opened. Geoff Cambell was murdered when the North tower of the World Trade Center was demolished on September 11th 2001. Geoff's brother Matt is planning to submit an application to the Attorney General later this year under Section 13 1(b) of the Coroner's Act 1988.\r\nFor further information please visit","torrent":{"xt":"urn:btih:07088ec95548fa7e749e05266038cf7579882f6c","amp;dn":"Incontrovertible+-+New+9%2F11+Documentary+by+Tony+Rooke","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07088ec95548fa7e749e05266038cf7579882f6c","infoHashBuffer":{"type":"Buffer","data":[7,8,142,201,85,72,250,126,116,158,5,38,96,56,207,117,121,136,47,108]},"announce":[],"urlList":[]}}