{"title":"Usher - Looking 4 Myself (Deluxe Edition) (128kbps &amp; 320kbps","uid":7711582,"size":244448155,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:075ed0bdf88e074ffc3676e498bbd094a4c888ad&amp;dn=Usher+-+Looking+4+Myself+%28Deluxe+Edition%29+%28128kbps+%26amp%3B+320kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"maxx101","files":38,"time":1349818265,"description":"Tracklist:\n01. Can't Stop Won't Stop 03:51\n02. Scream 03:55\n03. Climax 03:53\n04. I Care For U 04:08\n05. Show Me 03:43\n06. Lemme See 04:13\n07. Twisted 03:44\n08. Dive 03:47\n09. What Happened To U 04:22\n10. Looking 4 Myself 04:12\n11. Numb 03:46\n12. Lessons For The Lover 05:07\n13. Sins Of My Father 03:57\n14. Euphoria 04:20\n15. I.F.U. 04:02\n16. Say The Words 04:01\n17. 2nd Round 03:22\n18. Hot Thing 03:27\n\nBiography\nAfter Usher Raymond was spotted by a LaFace record executive at a talent show in his hometown of Atlanta, it took no time for his career to take off. The 14-year-old auditioned for LaFace co-founder L.A. Reid, who signed the gospel choir boy to a recording contract. Raymond was introduced to the world simply as &quot;Usher,&quot; and released his debut album of the same name in 1994, which featured co-executive producer Sean &quot;Puffy&quot; Combs. The first single, &quot;Think of You,&quot; gained Usher wide recognition and reached gold status. From that initial exposure, Usher was approached to do other projects. In 1995, he recorded a national holiday jingle for Coca-Cola. He also joined several top male R&amp;B vocalists to form Black Men United for the single &quot;You Will Know,&quot; featured on the Jason's Lyric soundtrack. He also teamed with teen singing sensation Monica for a duet remake of Latimore's &quot;Let's Straighten It Out.&quot;\n\nAfter graduating from high school, Usher released his sophomore album, My Way, in 1997. In an attempt to display his maturity and songwriting abilities, he co-wrote six of the nine songs and enlisted the help of producers Jermaine Dupri, Babyface, and, again, Combs. The album's first single, &quot;You Make Me Wanna,&quot; reestablished Usher as one of R&amp;B's hottest artists, and also made him a crossover sensation; it topped the R&amp;B charts for 11 weeks, hit number two pop, and eventually went double platinum. Both of the follow-up singles, &quot;Nice &amp; Slow&quot; and &quot;My Way,&quot; also went platinum; the former stayed at number one on the R&amp;B charts for eight weeks and became his first number one pop single. In the meantime, Usher launched an acting career, appearing in the 1998 horror spoof The Faculty and the 1999 urban high-school drama Light It Up.\n\nTo tide fans over, he issued a concert recording titled simply Live in 1999. Usher returned with his third proper album, All About U, toward the end of 2000. His third album, 8701 (2001), moved him from a teen pop star to a sultry R&amp;B singer. In early 2004, Arista released the single &quot;Yeah!&quot; Produced by Lil Jon and guesting Ludacris, the addictive, lightly crunk cut fast became a club and radio favorite. By the time the Usher full-length Confessions dropped later that March, &quot;Yeah!&quot; had hit the top of the Billboard charts. The album itself was Usher's most mature work to date and won the Grammy for Best Contemporary R&amp;B Album in 2004, while &quot;Yeah!&quot; took home the best rapped/sung collaboration award. He starred in the 2005 flop In the Mix and went back to music with 2008's Here I Stand, an album that was ultimately declared a flop, even though it topped the Billboard 200 and Hot R&amp;B/Hip-Hop Albums charts. Raymond v Raymond, inspired in part by the end of his marriage, was released in 2010 as three of its songs were climbing the charts. Its buzz single, &quot;Papers,&quot; had already topped the Hot R&amp;B/Hip-Hop Singles chart. An EP titled Versus followed later in the year. Led by Hot R&amp;B/Hip Hop chart-topper &quot;Climax&quot; (co-produced by Diplo), Looking for Myself was issued in 2012. ~ Lynda Lane &amp; Andy Kellman, Rovi\n\nPlease Seed!!!!!!!!!! ","torrent":{"xt":"urn:btih:075ed0bdf88e074ffc3676e498bbd094a4c888ad","amp;dn":"Usher+-+Looking+4+Myself+%28Deluxe+Edition%29+%28128kbps+%26amp%3B+320kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"075ed0bdf88e074ffc3676e498bbd094a4c888ad","infoHashBuffer":{"type":"Buffer","data":[7,94,208,189,248,142,7,79,252,54,118,228,152,187,208,148,164,200,136,173]},"announce":[],"urlList":[]}}