{"title":"Japanese in Mangaland","uid":7898225,"size":171439148,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:076853d28b1ebb269e7e16772cf1df013fc52338&amp;dn=Japanese+in+Mangaland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1354895948,"description":"1.Japanese in Mangaland: Learning The Basics\n  by Marc Bernabe\n\nDescription:\n This book is designed to help one master the basics of the Japanese language using the popular &quot;manga&quot; (Japanese comics) as a didactic tool. Its clear explanations and vivid examples help one naturally to get the &quot;feel&quot; for the basic patterns of Japanese grammar and at the same time to remember vocabulary associated with concrete situations. Besides that, learning with manga is more fun than simply reading page after page of dry prose. The 30 lessons that make up the book include drills, and a small glossary of 160 basic &quot;kanji&quot; is appended as an added bonus.\n\n2.Japanese in MangaLand 2: Basic to Intermediate Level\n  by Marc Bernabe\n\nDescription:\n A truly innovative and enjoyable way to learn Japanese-based on manga.\n\n Like the original Japanese in MangaLand, the second volume in the series combines the phenomenal popularity of manga with language instruction to make learning Japanese easier and a lot more fun than with traditional approaches. Japanese in MangaLand Vol. 2 helps even beginning students master the basics of conversational Japanese with fifteen lessons including drills, the patterns of Japanese grammar and more than 360 kanji characters to assist in the learning process. Eleven of these lessons cover such grammar topics as intransitive/transitive verbs, particles, honorific expressions, and even dialects and proverbs.\n\n The four conversational lessons will prove invaluable to readers traveling to Japan by teaching them phrases and expressions to use at airports, hotels, shops and restaurants. Another new feature in this second volume is the culture notes section, which provides insight into life in Japan today.\n\n3.Japanese in MangaLand 3: Intermediate Level\n  by Marc Bernabe\n\nDescription:\n Manga is well on its way to becoming the most popular comic form in the United States. According to USA Today, sales in 2004 reached $120 million, a 20% increase over 2003. At the same time, interest in learning Japanese is booming among secondary school students-and recent studies indicate that the reason students want to learn Japanese is to be able to understand their favorite anime and manga in its original language.\n\n Like the first two volumes in the Japanese in MangaLand series, this third volume combines the phenomenal popularity of manga with language instruction to make learning Japanese easier and a lot more fun than with traditional approaches. Japanese in MangaLand 3 picks up where volume 2 left off, with 15 lessons designed to help students consolidate and further expand their Japanese skills at the intermediate level. The book offers an intensive study of grammar and conversation combined with examples from manga that introduce &quot;real life&quot; spoken Japanese - not typical &quot;textbook&quot; language. The conversational lessons will help students communicate in various everyday situations in Japan, from ordering in a restaurant to speaking the Osaka dialect, from using the honorific language (keigo) to the casual, colloquial, idiomatic and vulgar expressions found in manga.\n\nJapanese in MangaLand 3 covers all the requirements of grammar, vocabulary and kanji of Level 3 (Intermediate) of the Japanese Language Proficiency Test, as well as offering many exercises, grammar and vocabulary reference appendixes (especially designed for Proficiency Test candidates) and many other features. And, in the fall of 2007, when high schools around the country begin offering Advance Placement courses in Japanese, these entertaining and user-friendly instructional materials will surely find an even wider audience.","torrent":{"xt":"urn:btih:076853d28b1ebb269e7e16772cf1df013fc52338","amp;dn":"Japanese+in+Mangaland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"076853d28b1ebb269e7e16772cf1df013fc52338","infoHashBuffer":{"type":"Buffer","data":[7,104,83,210,139,30,187,38,158,126,22,119,44,241,223,1,63,197,35,56]},"announce":[],"urlList":[]}}