{"title":"Juicy Lucy - Juicy Lucy 1969 / Lie Back And Enjoy It 1970","uid":3401080,"size":137876868,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0793d8394a585d8915ff2acc3ec96983fba8438c&amp;dn=Juicy+Lucy+-+Juicy+Lucy+1969+%2F+Lie+Back+And+Enjoy+It+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"buzzard","files":22,"time":1130233089,"description":"Juicy Lucy - Juicy Lucy 1969 / Lie Back And Enjoy It 1970\n\n[IMG]http://img456.imageshack.us/img456/2605/zeldaplum6ml.jpg[/IMG]\n\nsize:              131 mb\nbitrate:          256\n\nSaucy blues-rockers Juicy Lucy formed in 1969 from the ashes of cult-favorite garage band the Misunderstood, reuniting vocalist Ray Owen, steel guitarist Glenn &quot;Ross&quot; Campbell and keyboardist Chris Mercer; with the additions of guitarist Neil Hubbard, bassist Keith Ellis and drummer Pete Dobson, the group immediately notched a UK Top 20 hit with their reading of the Bo Diddley perennial &quot;Who Do You Love,&quot; with their self-titled debut LP falling just shy of the Top 40. Ex-Zoot Money singer Paul Williams, guitarist Mick Moody and drummer Rod Coombes replaced Owen (who exited for a solo career), Hubbard and Dobson for 1970's Lie Back and Enjoy It, with bassist Jim Leverton assuming Ellis' duties for the follow-up, 1971's Get a Whiff a This. The constant turnover clearly took its toll on the group both creatively and commercially, with co-founders Campbell and Mercer both exiting prior to the fourth Juicy Lucy album, 1972's Pieces, which was recorded by a makeshift lineup of Williams, Moody, keyboardist Jean Roussel and the former Blodwyn Pig rhythm section of bassist Andy Pyle and drummer Ron Berg. Juicy Lucy finally disbanded shortly thereafter. ~ Jason Ankeny, All Music Guide \n\nBeat Goes On combined Juicy Lucy's first two albums -- Juicy Lucy and Lie Back &amp; Enjoy It -- on one CD in 1995. Since the band didn't have much sustained momentum in their career, this is essentially a best-of collection. All their best moments arrive on the debut, particularly their heavy cover of Bo Diddley's &quot;Who Do You Love.&quot; The horribly named Lie Back &amp; Enjoy It follows the same pattern as the debut, as the group churns out heavy blooze-boogie, but without as much conviction. For hardcore fans, this doesn't really matter -- it's just nice to get these two albums on one disc -- but for anyone who's not a devotee of late '60s/early '70s hard rock and heavy blues, this isn't going to change their mind. ~ Stephen Thomas Erlewine, All Music Guide\n\n[IMG]http://img456.imageshack.us/img456/7047/juicylucy1wu.jpg[/IMG]    [IMG]http://img456.imageshack.us/img456/1663/juicylucy22em.jpg[/IMG]\n\nTrack Title  \n1. Mississippi Woman   \n2. Who Do You Love   \n3. She's Mine She's Yours   \n4. Just On Time   \n5. Chicago North Western   \n6. Train   \n7. Nadine   \n8. Are You Satisfied?   \n9. Thinking Of My Life   \n10. Built For Comfort   \n11. Pretty Woman   \n12. Whisky In My Jar   \n13. Hello L.A. Bye Bye Birmingham   \n14. Changed My Mind   \n15. That Woman's Got Something   \n16. Willie The Pimp   \n17. Lie Back And Enjoy It \n\n\nJuicy Lucy I\n[Autumn 1969 - 1970]\n \n Personnel   \n \nGlen &quot;Ross&quot; Campbell: steel gtr\nRay Owen: voc\nChris Mercer: sax\nNeil Hubbard: gtr\nKeith Ellis: bass\nPete Dobson: drums\n \nGlenn 'Ross' Campbell gathered this gang soon after the end of Misunderstood. Their debut single Who Do You Love (also recorded by Misunderstood IV earlier) earned them a top 20 hit. Their self titled album of rock, blues &amp; boogie blend climbed to no. 41 in the UK charts. Glenn left Juicy Lucy (III) in 1971 before the 4th. and last album. \n\nKeith Ellis: Keith Ian Ellis stayed on in Juicy Lucy II in 1970 (for one more album, Lie Back And Enjoy It), then played sessions with Bobby Whitlock, Paul Williams (ex Juicy Lucy II), joined Spooky Tooth in '74 and Boxer in '75. He died while on tour with Iron Butterfly in Germany in 1978.","torrent":{"xt":"urn:btih:0793d8394a585d8915ff2acc3ec96983fba8438c","amp;dn":"Juicy+Lucy+-+Juicy+Lucy+1969+%2F+Lie+Back+And+Enjoy+It+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0793d8394a585d8915ff2acc3ec96983fba8438c","infoHashBuffer":{"type":"Buffer","data":[7,147,216,57,74,88,93,137,21,255,42,204,62,201,105,131,251,168,67,140]},"announce":[],"urlList":[]}}