{"title":"The Princess Diaries 2001","uid":8002178,"size":941279161,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07e9ff66b39466994713da6d5d510ecc94a86010&amp;dn=The+Princess+Diaries+2001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ericthered2012","files":5,"time":1357799351,"description":"This teen comedy from Disney is based on a popular novel by Meg Cabot and directed by Garry Marshall. Mia Thermopolis (Anne Hathaway) is a teenage klutz who's openly mocked by the popular Lana Thomas (pop singer Mandy Moore). In fact, Mia's only friend at her exclusive prep school is the socially outcast Lilly (Heather Matarazzo). Mia's life takes a dramatic turn, however, when her mom announces that her late biological father was in actuality the crown prince of a small European nation, Genovia. Now Mia is the sole heir to the throne, and her grandmother, Queen Clarisse Renaldi (Julie Andrews) wants to tutor the awkward teen in royal behavior. It's a daunting task given Mia's lax table manners, poise, and hair care, but the girl perseveres with some makeover help from her grandmother's security chief Hector Elizondo) and a style expert (Larry Miller). In the meantime, Mia's romantic affections are torn between the handsome, popular Josh (Erik Von Detten) and the more appropriate Michael (Robert Schwartzman), who also happens to be Lilly's brother. ","torrent":{"xt":"urn:btih:07e9ff66b39466994713da6d5d510ecc94a86010","amp;dn":"The+Princess+Diaries+2001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07e9ff66b39466994713da6d5d510ecc94a86010","infoHashBuffer":{"type":"Buffer","data":[7,233,255,102,179,148,102,153,71,19,218,109,93,81,14,204,148,168,96,16]},"announce":[],"urlList":[]}}