{"title":"finch - Say Hello To Sunshine","uid":4195961,"size":81099847,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:08498e89bd19e44b5ae6272c924bd15859eca08f&amp;dn=finch+-+Say+Hello+To+Sunshine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"billy_stretcher","files":18,"time":1211221694,"description":"Finch\nSay Hello To Sunshine\nAlt.Metal/Post-Hardcore\n2005\n192Kbps\n\n1.Insomniatic Meat \n2.Revelation Song \n3.Brother Bleed Brother \n4.A Piece Of Mind \n5.Ink \n6.Fireflies \n7.Hopeless Host \n8.Reduced To Teeth \n9.A Man Alone \n10.Miro \n11.Ravenous \n12.Bitemarks And Bloodstains \n13.The Casket Of Roderic Usher \n14.Dreams Of Psilocybin \n15.Gak 2 (UK Bonus Track) \n\nFront, Back And CD Covers Included.\n\nSay Hello To Sunshine is the second full-length album from the Drive Thru label favourites, Finch, who saw some big success with their debut effort What It Is to Burn, which helped bridge the gap between hard rock and punk-pop. Includes the unapologetically twisted anthem Bitemarks And Bloodstains&amp;#039;\n\nSAY HELLO TO SUNSHINE, the follow up to Finch&amp;#039;s hugely successful debut album, features &quot;Piece of Mind&quot; and &quot;Hopeless Host.&quot; contains one bonus cut--&quot;Gak 2.&quot;\n\nNaysayers of hard rock and metal describe the genre as bordering on one-directional, when the truth is that great hard music is so much more than that. An amalgamation of jazz rhythms, emotive metal-influenced vocals and strong instrumentation happens when the genre hits it just right. Finch contained all of those elements on their much-heralded full-length, What It Is To Burn, and the result created a nearly religious fan base; expectations have been high during the three year wait for their new disc Say Hello To Sunshine. The strongest tracks on this release are ultimately are the most jagged, from the opening guttural growl of &quot;Insomniatic Meat&quot; to tracks like &quot;Fireflies&quot; and &quot;Miro&quot; which shows the group&amp;#039;s emo-core colors brightly. Their whisper-to-a-scream tendencies are all over the disc, as the group moves from mixed tempos with deep howls to straight-up belted-out choruses. There is an obvious System Of A Down-meets-Linkin Park reference that also can&amp;#039;t be ignored. The lead single, &quot;Bitemarks and Bloodstains,&quot; is deceptive--the disc is consistently harder than this song. In fact, the whole is much stronger than the single.\n\nEnjoy! :)","torrent":{"xt":"urn:btih:08498e89bd19e44b5ae6272c924bd15859eca08f","amp;dn":"finch+-+Say+Hello+To+Sunshine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08498e89bd19e44b5ae6272c924bd15859eca08f","infoHashBuffer":{"type":"Buffer","data":[8,73,142,137,189,25,228,75,90,230,39,44,146,75,209,88,89,236,160,143]},"announce":[],"urlList":[]}}