{"title":"Hitler.The.Last.Ten.Days.1973","uid":6844795,"size":735134635,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:087b3b1135f5fe90a10716430afb0843d1e5851d&amp;dn=Hitler.The.Last.Ten.Days.1973&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"lordvladg","files":2,"time":1322312742,"description":"Hitler.The.Last.Ten.Days.1973. http://www.imdb.com/title/tt0070184/\n\n\\&quot;Hitler: the Last Ten Days\\&quot; is beyond doubt the best movie ever made about Adolf Hitler\\'s final days. The sets, uniforms and script are exceedingly accurate. I could find only two flaws regarding uniforms. Even the actors bore a remarkable resemblance to the characters they portrayed. I was somewhat disappointed with the casting of Doris Kunstmann as Eva Braun. Doris is far too beautiful. Britt Ekland would have been a much better choice. The exterior scenes, being shot in black and white accentuated the graphic realism outside the bunker as opposed to the color shots of the madness within. Most of the script is based on the writings of Rittmeister Gerhard Boldt (portrayed by Simon Ward as Hauptmann Hoffman). Boldt left the bunker just shortly before Hitler\\'s suicide. The research done for the construction of the sets must have been awesome. Even an old cement mixer viewed in wartime photos is present. The bare concrete walls and luxurious furnishings cast a stark reality of the bunker interior. Regarding performances, Alec Guinness is of course commanding as Hitler. He clearly shows he is concerned about nothing except his place in history and how many followers he can convince to follow his lead of suicide as opposed to surrender. All the other roles, except Eva Braun\\'s are minor as they should be. Goebbels comes across as the eternal lackey, who would rather his children die, than live in a world without Hitler. Bormann\\'s sole concern is consolidating power in the Reich that is soon to be no more. The Generals follow orders as they have for years, and quarrel amongst themselves about who should break the latest bad news to the Fuehrer. All in all the film is quite entertaining and will definitely hold the attention of any history buff","torrent":{"xt":"urn:btih:087b3b1135f5fe90a10716430afb0843d1e5851d","amp;dn":"Hitler.The.Last.Ten.Days.1973","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"087b3b1135f5fe90a10716430afb0843d1e5851d","infoHashBuffer":{"type":"Buffer","data":[8,123,59,17,53,245,254,144,161,7,22,67,10,251,8,67,209,229,133,29]},"announce":[],"urlList":[]}}