{"title":"Dividing The Spoils - Robin Waterfield.epub","uid":9565799,"size":1295756,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0928f8564fe314aa869134a50644617ae631e519&amp;dn=Dividing+The+Spoils+-+Robin+Waterfield.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1391509484,"description":"Alexander the Great conquered an enormous empire--stretching from Greece to the Indian subcontinent--and his death triggered forty bloody years of world-changing warfare. These were years filled with high adventure, intrigue, passion, assassinations, dynastic marriages, treachery, shifting alliances, and mass slaughter on battlefield after battlefield. And while the men fought on the field, the women, such as Alexander's mother Olympias, schemed from their palaces and pavilions. The story of one of the great forgotten wars of history, Dividing the Spoils serves up a fast-paced narrative that captures this turbulent time as it revives the memory of the Successors of Alexander and their great war over his empire. The Successors, Robin Waterfield shows, were no mere plunderers. Indeed, Alexander left things in great disarray at the time of his death, with no guaranteed succession, no administration in place suitable for such a large realm, and huge untamed areas both bordering and within his empire. It was the Successors--battle-tested companions of Alexander such as Ptolemy, Perdiccas, Seleucus, and Antigonus the One-Eyed--who consolidated Alexander's gains. Their competing ambitions, however, eventually led to the break-up of the empire. To tell their story in full, Waterfield draws upon a wide range of historical materials, providing the first account that makes complete sense of this highly complex period. Astonishingly, this period of brutal, cynical warfare was also characterized by brilliant cultural achievements, especially in the fields of philosophy, literature, and art. A new world emerged from the dust and haze of battle, and, in addition to chronicling political and military events, Waterfield provides ample discussion of the amazing cultural flowering of the early Hellenistic Age.","torrent":{"xt":"urn:btih:0928f8564fe314aa869134a50644617ae631e519","amp;dn":"Dividing+The+Spoils+-+Robin+Waterfield.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0928f8564fe314aa869134a50644617ae631e519","infoHashBuffer":{"type":"Buffer","data":[9,40,248,86,79,227,20,170,134,145,52,165,6,68,97,122,230,49,229,25]},"announce":[],"urlList":[]}}