{"title":"China Mieville - Kraken (2010)","uid":5656433,"size":4183598,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:09baff5a073440bdc6697156192ae2bee6875277&amp;dn=China+Mieville+-+Kraken+%282010%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kash79","files":8,"time":1277819553,"description":"China Mieville - Kraken (2010)\n\nBritish fantasist MieÃƒÅ’ÃƒÂ¼ville mashes up cop drama, cults, popular culture, magic, and gods in a Lovecraftian New Weird caper sure to delight fans of Perdido Street Station and The City &amp; the City. When a nine-meter-long dead squid is stolen, tank and all, from a London museum, curator Billy Harrow finds himself swept up in a world he didn't know existed: one of worshippers of the giant squid, animated golems, talking tattoos, and animal familiars on strike. Forced on the lam with a renegade kraken cultist and stalked by cops and crazies, Billy finds his quest to recover the squid sidelined by questions as to what force may now be unleashed on an unsuspecting world. Even MieÃƒÅ’ÃƒÂ¼ville's eloquent prose can't conceal the meandering, bewildering plot, but his fans will happily swap linearity for this dizzying whirl of outrageous details and fantastic characters.\n\nFrom Booklist\nMieville (The City &amp; the City, 2009) returns to the world of Perdido Street Station, a fantasy London where anything is possible and where something threatens to end the world and burn the city out of existence. Billy Harrow is a dedicated scientist who never imagined being caught up in intrigue, but after he successfully preserves a giant squid, he comes to the attention of the Krakenists, an obscure cult that worships squids. When the giant squid mysteriously disappears from the museum in the middle of the day, Billy is drawn into the world of cults, magic, and Armageddon. He is arrested by the Fundamentalist and Sect-Related Crime unit (with a young witch as their tough-talking cop) and then escapes with Dane, a warrior in the Kraken church. Mievilles fantasy is a rich literary work, full of wordplay and imagery that will appeal to literary-fiction fans as much as to fantasy readers. It is a very dense read, however, and lacks the thrills of City &amp; the City, but Mievilles dedicated readership will be willing to persevere to the end\n\n\n\nformats - html , epub, mobi ,lit, pdf\n\n\nthanks to  OP","torrent":{"xt":"urn:btih:09baff5a073440bdc6697156192ae2bee6875277","amp;dn":"China+Mieville+-+Kraken+%282010%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09baff5a073440bdc6697156192ae2bee6875277","infoHashBuffer":{"type":"Buffer","data":[9,186,255,90,7,52,64,189,198,105,113,86,25,42,226,190,230,135,82,119]},"announce":[],"urlList":[]}}