{"title":"Rainbow - 'Live Cologne Sporthalle 1976' [320k MP3]","uid":4622969,"size":240138396,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0a0745b1d2c9a2336bc3da642c926299f218e487&amp;dn=Rainbow+-+%5C%27Live+Cologne+Sporthalle+1976%5C%27+%5B320k+MP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"smbdownload","files":-1,"time":1231104580,"description":"This is the first of three releases from the 1976 Rainbow tour of Germany, each featuring a complete, unedited show. \n\nNaturally, these shows have been circulating amongst fans almost since the daythey took place. But that is wrong. You should have waited 30 years for this instead. So, was it worth the wait? Um, yes and no. \n\nOn the down side, the &quot;Rising&quot; tour always seemed to have an odd set list, with only &quot;Stargazer&quot; and the lamentable &quot;Do You Close Your Eyes&quot; making it into the set. And with &quot;Mistreated&quot; and &quot;Still I'm Sad&quot; occupying a large part of the set, there was a surprising lack of classic Rainbow tracks I know they were new at the time but no &quot;Tarot Woman&quot;, &quot;Starstruck&quot; or &quot;Light In The Black&quot;? Madness! And Cozy Powells drum sound hasn't benefited much from an official release. It still sounds like he's slowly slipping into a swamp. \n\nOn the upside, Blackmore was on fire on this tour. Some of his playing is otherworldly. His unpredictability was still a boon in those days, with no 2 nights alike.. As you will discover if you stick withthe series. Dio is also in fine form, recognising that after 20 years of slog, his time was now. Listen to &quot;Catch The Rainbow&quot; and be amazed. \n\nAs someone who recognises Blackmore as the greatest guitarist ever (and don't bother arguing - you're wrong *2nd best in smb's opinion), this is a nice addition to a ludicrously large collection. It's aimed squarely at fans, and they will like the music, if not the Rainbow by numbers liner notes. \n\nDisc: 1 \n\n1. Intro \n2. Kill The King  \n3. Mistreated  \n4. Sixteenth Century Greensleeves  \n5. Catch The Rainbow\n6. Man On The Silver Mountain  \n  \nDisc: 2 \n \n\n1. Stargazer  \n2. Still I'm Sad  \n3. Do You Close Your Eyes  \n\n\n----------------------------------------------------------------------------------\n\nRichard Hugh &quot;Ritchie&quot; Blackmore (born April 14, 1945 in Weston-super-Mare, England) is an English guitarist, who was a founding member of hard rock bands Deep Purple and Rainbow. He left Deep Purple in 1973 due to a growing rift between Blackmore and other members in spite of renewed commercial success. His current band is the Renaissance influenced Blackmore's Night. He was ranked 55 on Rolling Stone's 100 Greatest Guitarists of All Time in 2003.\n\n","torrent":{"xt":"urn:btih:0a0745b1d2c9a2336bc3da642c926299f218e487","amp;dn":"Rainbow+-+%5C%27Live+Cologne+Sporthalle+1976%5C%27+%5B320k+MP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a0745b1d2c9a2336bc3da642c926299f218e487","infoHashBuffer":{"type":"Buffer","data":[10,7,69,177,210,201,162,51,107,195,218,100,44,146,98,153,242,24,228,135]},"announce":[],"urlList":[]}}