{"title":"FemaleAgent - Alexis Crystal, Izzy (Lickin designers pussy)","uid":12748932,"size":574406181,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:0a5e72953fca4749ee9643c6a7298361d2159654&amp;dn=FemaleAgent+-+Alexis+Crystal%2C+Izzy+%28Lickin+designers+pussy%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"feeldabyte","files":1,"time":1447350545,"description":"\nScreens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n  \nhttp://imgkiss.com/image/fQNej \nhttp://imgkiss.com/image/fQqXo\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\n  I was bored of the office decor now and I wanted to redesign the entire thing, so I made an appointment for an interior designer to come and visit me. When she walked in she made my pussy moisten instantly. She was young, blonde and beautiful which is everything I like in a woman. I explained that I wanted to change the color scheme and the furniture in the office. I didn't let her investigate the couch too closely, there's a few stains ingrained on that bad boy she didn't need to see. She was very helpful and informative and once we had agreed on what I wanted she added the total cost up for me. When she told me the price my jaw hit the floor. There was no way my boss would let me spend that amount on redesigning the office. I had to get a discount on the price and I think I knew exactly how to do it. I had noticed we had been flirting as we talked and I was sure she was into women. I went over and sat on her lap and told her I could give her something if she could arrange a discount in return. \r\n\r\n  She understood me completely and we were soon locked in a tight kiss as both of our tongues explored each other mouths. I took her over to the couch and undressed her completely so I could see her naked body in full. The next few minutes passed in a wave of ecstasy. She was a very accomplished lover and she sucked and finger fucked my pussy with such skill that I had one of the best orgasms of my life. I knew if I wanted the discount, I would have to return the favor and to be honest it was a real pleasure to suck on her pussy lips and taste her juices. I gave it my all until her whole body was arching and jerking on the couch as my talented tongue and digits gave her one of the best orgasms of her life.\r\n\r\n\r\nSail to another one :\r\n  \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:0a5e72953fca4749ee9643c6a7298361d2159654","amp;dn":"FemaleAgent+-+Alexis+Crystal%2C+Izzy+%28Lickin+designers+pussy%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a5e72953fca4749ee9643c6a7298361d2159654","infoHashBuffer":{"type":"Buffer","data":[10,94,114,149,63,202,71,73,238,150,67,198,167,41,131,97,210,21,150,84]},"announce":[],"urlList":[]}}