{"title":"Witch and Wizard Trilogy - James Patterson  (epub/mobi)","uid":6744723,"size":7038588,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0a9c6c6406e85e54e1edd4790bb788229f9d61be&amp;dn=Witch+and+Wizard+Trilogy+-+James+Patterson++%28epub%2Fmobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"neil1966hardy","files":13,"time":1318638267,"description":"Witch &amp; Wizard (Witch &amp; Wizard, #1) (epub,lit,mobi):-\nEVERYTHING. CHANGES. NOW.\n\nImagine you wake up and the world around you-life as you know it-has changed in an instant. That's what has happened to Whit Allgood and his sister, Whisty. They went to sleep as normal teenagers, and woke up as wanted criminals. Accused of holding incredible powers they'd never dreamed possible. And now, just how different they are-special, even-if just beginning to be revealed in a strange new world.\n\nFor more information about the series, visit www.WitchandWizard.com.\n\nIt begins...now.\n\n--------------------------------------------------------------------------------------------------------------------\n\n\n\nThe Gift (Witch &amp; Wizard, #2) (epub,lit,mobi):-\nWhen Whit &amp; Wisty were imprisoned by the wicked forces of the totalitarian regime known as the New Order, they were barely able to escape with their lives. Now part of a hidden community of teens like themselves, Whit and Wisty have established themselves as leaders of the Resistance, willing to sacrifice anything to save kids kidnapped and brutally imprisoned by the New Order. But the One has other plans in store for them: He needs Wisty, for she is &quot;The One Who Has the Gift.&quot; While trying to figure out what that means, Whit and Wisty's suspenseful adventures through Overworld and Shadowland lead to a jaw-dropping climax and conclusion: the highly-anticipated fulfillment of the heart-pounding opening prologue of book one...The Execution of the Allgoods.\n\n--------------------------------------------------------------------------------------------------------------------\n\n\n\nThe Fire (Witch &amp; Wizard, #3) (epub,pdf,mobi):-\nWhit and Wisty Allgood have sacrificed everything to lead the resistance against the merciless totalitarian regime that governs their world. Its supreme leader, The One Who Is The One, has banned everything they hold dear: books, music, art, and imagination. But the growing strength of the siblings' magic hasn't been enough to stop the One's evil rampage, and now he's executed the only family they had left.\n\nWisty knows that the time has finally come for her to face The One. But her fight and her fire only channel more power to this already invincible being. How can she and Whit possibly prepare for their imminent showdown with the ruthless villain that devastated their world-before he can truly become all-powerful?\n\nIn this stunning climax of the epic Witch &amp; Wizard series, the stakes have never been higher-and the consequences will change everything.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:0a9c6c6406e85e54e1edd4790bb788229f9d61be","amp;dn":"Witch+and+Wizard+Trilogy+-+James+Patterson++%28epub%2Fmobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a9c6c6406e85e54e1edd4790bb788229f9d61be","infoHashBuffer":{"type":"Buffer","data":[10,156,108,100,6,232,94,84,225,237,212,121,11,183,136,34,159,157,97,190]},"announce":[],"urlList":[]}}