{"title":"Ulysses S. Grant - Personal Memoirs of U.S. Grant","uid":7595628,"size":680407852,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:0ab214c444eecfb99dca6ff3eaee13c3a6ebc3b1&amp;dn=Ulysses+S.+Grant+-+Personal+Memoirs+of+U.S.+Grant&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sulla_felix","files":143,"time":1346685157,"description":"Destitute and wracked by throat cancer, Ulysses S. Grant finished writing his Personal Memoirs shortly before his death in 1885. Today their clear prose stands as a model of autobiography. Civil War soldiers are often celebrated for the high literary quality of the letters they sent home from the front lines; Grant's own book is probably the best piece of writing produced by a participant in the War Between the States. Apart from Lincoln, no man deserves more credit for securing the Northern victory than Grant, and this chronicle of campaigns and battles tells how he did it. (The book also made a bundle of money for his family, which had been reeling from the failure of Grant's brokerage firm.) This is not an overview of the entire Civil War; as the North was beating the South on the third day of Gettysburg, for example, Grant was in Mississippi capturing Vicksburg. But it is a great piece of writing, one that can be appreciated even by readers with little interest in military history.\n\n-------------------------------------------------------------------------------------\n\nPirates, sharing is caring! Please do your part to show combat copyright everywhere! Seed the torrents you download, and upload your own!\n\nAnd remember... &quot;If Sulla did it, why can't I?&quot;\t","torrent":{"xt":"urn:btih:0ab214c444eecfb99dca6ff3eaee13c3a6ebc3b1","amp;dn":"Ulysses+S.+Grant+-+Personal+Memoirs+of+U.S.+Grant","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ab214c444eecfb99dca6ff3eaee13c3a6ebc3b1","infoHashBuffer":{"type":"Buffer","data":[10,178,20,196,68,238,207,185,157,202,111,243,234,238,19,195,166,235,195,177]},"announce":[],"urlList":[]}}