{"title":"POtHS - Classic Bible Movies - 05 - Moses","uid":8635259,"size":5963729974,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b3585b4832e3397c0d6c42f57f1942bef73f1c5&amp;dn=POtHS+-+Classic+Bible+Movies+-+05+-+Moses&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"POtHS11","files":-1,"time":1372727069,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\n\nClassic Bible Movies\nMoses\n\n\n\n\nPOtHS - Classic Bible Movies - 05 - Moses\n\n\n\n\nPOtHS says: Israel Starts Here.\nDescription:\n\nMoses\nThe Five Books of Moses\nXtras\n\n\n&quot;The best Exodus film to date...\nBy\nJerry Parks &quot;USAToday All-American Teacher; N... (Lexington, KY USA) - See all my reviews\n\nThis review is from: Moses  \n\nBen Kingsley has to be one of the finest Hollywood--as well as biblical, character actors in the world today. His Moses spans the life of the hero from youth to the old man most people think of when the name of Moses is mentioned.\n\nThis film is the best version of the Exodus story to date. It is far superior to 'Ten Commandments', which stressed the spectacular at the expense of the accurate. This TNT version--while not quite as good as 'Joseph', is extremely accurate in its depiction of ancient Egyptian history. It stresses the Egyptian background of Moses' life, and doesn't just portray him as simply Hebrew alone.\n\nHow nice to see Moses pictured as a highly trained soldier (which he surely was) in growing up in the Pharaoh's court! Especially novel is the portrayal of Moses' lisp, which could be a very accurate interpretation of the Biblical narrative's 'slow of speech'. While a bit more emphasis could've been placed on the fact that the plagues were specific judgments upon Egyptian gods, the film does a fine job in nearly every other respect.\n\nThe next to last meeting between Moses and the Pharaoh (&quot;MY name resounds in all the earth--and I let YOU live&quot;!) is exceptionally well written, and the final meeting is wonderful. Moses speaks volumes in his silence! The parting of the Red Sea is pretty darn good (though the crossing is mysteriously speedy--even for an epic!), and the fact that the Hebrews crossed it 'on dry ground' is an excellent addition which most miss in the Bible, not to mention the film! Great job, here!\n\nThe 'pillars of fire' which hold back the Egyptians are depicted as lightning, and this part is a real highlight! The film assumes Ramases and Mernepta are the major Pharaohs of the period. This might cause a little confusion to more conservative believers who place the Exodus earlier (1445 BC), and the Pharaoh as Thutmoses III. It will be especially confusing to 'Prince of Egypt' admirers, since Ramases there is Moses' friend, instead of the Pharaoh-father.\n\nAll in all, this is a film well worth watching. Unlike 'Joseph' however, which never had a dull moment, 'Moses' is considerably less interesting after the crossing of the Red Sea. But it does fair justice to the Bible, and the acting is superb. One could hardly ask too much more from Hollywood!\n\n\n--------------------------------------------------------------\nThis is in memory of my Mom who passed at 11:44 pm PST ON 1-25-2011. Now she knows.\n\nThese Torrents are currently on a Free Leech --  High Speed Server\n\n[size=18]JESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\n\nEphesians 5:11\n11 And have no fellowship with the unfruitful works of darkness, but rather reprove (expose) them.\n\n\n                                           \n\n      :thankyou:    :thankyou:     Thank You JESUS  \n \n","torrent":{"xt":"urn:btih:0b3585b4832e3397c0d6c42f57f1942bef73f1c5","amp;dn":"POtHS+-+Classic+Bible+Movies+-+05+-+Moses","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b3585b4832e3397c0d6c42f57f1942bef73f1c5","infoHashBuffer":{"type":"Buffer","data":[11,53,133,180,131,46,51,151,192,214,196,47,87,241,148,43,239,115,241,197]},"announce":[],"urlList":[]}}