{"title":"The Ultimate Man's Survival Guide","uid":8851617,"size":1832143,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0b573de68187eda0f9cf3cc27776a35af15b289c&amp;dn=The+Ultimate+Man%27s+Survival+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1377541447,"description":"\nThe Ultimate Man's Survival Guide By Frank Miniter\n2009 | 400 Pages | ISBN: 1596985704 | EPUB \n\n\nThis is the ultimate handbook for real men, explaining everything from surviving an avalanche and identifying poisonous snakes to picking a great cigar. The metrosexual man may be good at cocktail chat, but a real man knows how to fight off alligators, create a tourniquet out of a t-shirt, and rescue a drowning person. Frank Miniter's &quot;The Ultimate Man's Survival Guide&quot; is the ultimate handbook that shows men how to do all of these and more, including: how to fight off a bear; how to treat a snake bite and identify poisonous snakes; how to make a compass; how to set a dislocated joint; and, how to pick the perfect cigar and bottle of wine.Broken into seven sections - survivor, provider, athlete, hero, romantic, cultured man, and philosopher - Miniter teaches guys the skills, attitudes, and philosophies they need to be the ultimate man. Concisely written and packed with real-life anecdotes from Miniter and other men, &quot;The Ultimate Man's Survival Guide&quot; teaches guys that the ultimate man isn't an unattainable archetype; any guy can be the ultimate man whether he is rescuing a lost hiker, plucking a child from a swift stream, or standing up against injustice. Whether you're a father, husband, brother, or boyfriend, this book shows you how to be the ultimate man - a man even James Bond would envy.\n","torrent":{"xt":"urn:btih:0b573de68187eda0f9cf3cc27776a35af15b289c","amp;dn":"The+Ultimate+Man%27s+Survival+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b573de68187eda0f9cf3cc27776a35af15b289c","infoHashBuffer":{"type":"Buffer","data":[11,87,61,230,129,135,237,160,249,207,60,194,119,118,163,90,241,91,40,156]},"announce":[],"urlList":[]}}