{"title":"Killzone_3_EUR_PS3-MIRSUPER","uid":6171507,"size":44449827740,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0b87f72683387dc1a0fcfdd3144173164dd9f7cf&amp;dn=Killzone_3_EUR_PS3-MIRSUPER&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"Mbb15","files":-1,"time":1297558139,"description":"Whatever can I say? no nfo ofcourse, well here\\'s the article and I will find some info myself.\n &lt;a href=&quot;\nhttp://www.ps3news.com/forums/ps3-online-news/killzone-3-ps3-leaks-torrent-sites-two-weeks-before-release-117855.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ps3news.com/forums/ps3-online-news/killzone-3-ps3-leaks-torrent-sites-two-weeks-before-release-117855.html&lt;/a&gt;\n\nLanguages:\n\nChinese\nDanish\nDutch\nEnglish (American)\nEnglish (British)\nFinnish\nFrench\nGerman\nItalian\nJapanese\nKorean\nNorwegian\nPolish\nPortuguese (Brazil)\nPortuguese (Portugal)\nRussian\nSpanish (Latin America)\nSpanish (Spain)\nSwedish\nTurkish\n\nTitle: Killzone.3\nPlatform: PS3\nRetail Date: 25 Feb 2011\nRelease Date: 13 Feb 2011\nSource: EUR\nUsage: Copy to GAMEZ folder on JB PS3 HDD...Play\nLink: http://www.tothegame.com/ps3-10398-killzone-3-for-sony-playstation-3.html\nNotes: P2P Wins Again\nShoutz: _bubba (source) MIRSUPER (supply)\n\n\nPlayers will be tasked with utilizing a host of new weapons and vehicles in the battle for human survival. Helghast variety is now greater than ever, with players facing jetpack troopers as well as enemies wielding weapons of mass destruction. Killzone 3 thoroughly explores the planet Helghan, showcasing a wide breadth of destructible environments and stunningly detailed scenery. Additionally, players will be tasked with utilizing a host of new weapons and vehicles in the war to stop the Helghast. Featuring an extensive single-player campaign and thrilling multi-player mode, Killzone 3 delivers a host of new gameplay elements and an intense storyline that will once again drive gamers to join the ranks of the ISA and fight the Helghast.\n\nContinuing from Killzone 2, players find Emperor Visari, the viscious dictator of the Helghast, dead at the feet of Sev and Rico. However this war is far from won. In the wake of Visari\\'s death, Helghan has devolved into a world of political scheming, rapid infighting, and murder. Now, the two most powerful men on Helghan are fighting for complete and utter dominance while Visari\\'s vision of Helghan is in jeopardy. With limited supplies and no re-enforcements, the ISA must now fight not to win a war, but to survive a lost one.\n\n\\&quot;Hollywood-style\\&quot; production value with action-focused narrative that mirrors the \\&quot;David vs. Goliath\\&quot; theme\nMuch bigger environments throughout the game, including nuclear wastelands, alien jungles, and arctic vistas. Levels are up to 10 times the size of those in Killzone 2\nFully enhanced game engine, with new optimized data streaming systems that will load texture and music content seamlessly\nNew brutal melee system with a number of varied attacks\nControl an arsenal of advanced weaponry, such as the Wasp missile launcher, in addition to trusty classics like the M82-G assault rifle\nFace off against new breeds of fearsome Helghast enemies that wield a variety of new weapons and abilities\nVehicle gameplay is greatly increased, with players able to do battle from Intruders, using jet packs, and accessing a number of land-based vehicle options\nKillzone 3 will support full stereoscopic 3D gameplay compatibility\nOverall improved accessibility including better controls as well as much more varied Artificial Intelligence (A.I.)\nRaising the bar graphically by incorporating texture and mesh streaming throughout the game\nKillzone 3 utilizes the HDR audio system, allowing the game to dynamically focus the audio depth of field. Players will hear effects in context, making the action much more up close and personal and well as immersive. \n","torrent":{"xt":"urn:btih:0b87f72683387dc1a0fcfdd3144173164dd9f7cf","amp;dn":"Killzone_3_EUR_PS3-MIRSUPER","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b87f72683387dc1a0fcfdd3144173164dd9f7cf","infoHashBuffer":{"type":"Buffer","data":[11,135,247,38,131,56,125,193,160,252,253,211,20,65,115,22,77,217,247,207]},"announce":[],"urlList":[]}}