{"title":"VA - Best of the Nordics-greatest Eurovision hits - 3CD-BOX 2010","uid":6635880,"size":1700588087,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0bc3ba11e2dbc2490c69462cddc33ca2cb0a775b&amp;dn=VA+-+Best+of+the+Nordics-greatest+Eurovision+hits+-+3CD-BOX+2010&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"barber9","files":-1,"time":1314555112,"description":"Giving Europe the gift of music.\nThe Nordic countries and the Eurovision Song Contest: a love story from the word go!\n\nNordic countries have carried off the Eurovision crown 10 times. Sweden has had the most success with four victories, followed by Norway with three, Denmark with two and Finland with one. Iceland is still waiting  for its moment of Eurovision glory, but can proudly look back on two second placings.\n\nThis record of ten victories for the Nordic cultural block is astounding giving the population figures of the individual countries. Only the English speaking nations of the UK and Ireland can boast more winning songs.\n\nLike all countries that wanted to take part in the Eurovision Song Contest, in the beginning the Nordic nations had only a vague idea of what was most likely to lead to success. Denmark joined the Eurovision family in 1957 and landed an immediate success with a second place for Birthe Wilke &amp; Gustav Wincklers Skibet skal sejle I nat (The ship sails tonight). This may well have been down to the charming performance of the two Danish stars, but it was not a blueprint that would guarantee a top placing for the years to come. Sweden and Norway went for a jazzy sound for their early entries. Artists such as Alice Babs, Siw Malmkvist and Brita Borg revealed their backgrounds in the fields of swing and jazz. Generally this fell flat with the juries, and the light swinging, jazzy tones, with their obvious Anglo-American influences, seemed to have little acceptance inside the predominately Francophile world of the early Eurovision Song Contest.\n\nIn 1963 Denmark landed the coup, even if the victory of Grethe &amp; JÃƒÂ¶rgen Ingmann was accompanied by the first voting controversy of the contest. The Norwegian spokesman failed to follow the agreed procedure in announcing his points and the hostess had to return to him after all the other points had been cast. The Norwegian points had mysteriously changed, taking victory away from Switzerland, represented by Israeli born Esther Ofarim, and giving it to the Ingmanns, There is, however, good reason to believe that the first Norwegian points were indeed wrong. There is also little proof of neighbourly voting, as Sweden, Finland and Norway all scored no points for the first time.\n\nDespite some set-backs, the early years of Eurovision can be seen as a success for the Nordic countries. Artists such as Siw Malmkvist, Lill-Babs, Wenche Myhre or Gitte Haenning benefitted from international exposure. Moreover, the contest was a hit with the public - viewing figures were the highest of anywhere in Europe. The Eurovision Song Contest brought the whole family together in front of their TV sets in the spirit of a united Europe.\n\nIn the late sixties Denmark withdrew from the contest, citing the reason that the format was too plebeian to fulfil televisions mandate to bring culture to the nation. The decision only served to deny Danish artists to the best springboard there ever was for international success. A Swedish band saw this chance and grabbed it with both hands in 1973. However, ABBA failed to convince the juries in Melodifestivalen that Ring Ring was right for Europe. Undeterred, they returned in 1974 and nothing was going to stop them.\n\nEven if the victory of Waterloo in Brighton was not the landslide that the legend would have us believe (the gap to the second placed Gigliola Cinquetti from Italy was actually fairly narrow), nevertheless it was a landmark in the history of the contest. Pop had arrived at Eurovision and ABBA sent out a message to the world from Brighton that they were ready to give the world some of the best pop music ever created. Indeed ABBA went on to becoming the most successful act to emerge from Eurovision.\n\nABBA also put their stamp on the sound of future Nordic entries, be they Swedish, Norwegian, Danish, Finnish or, later, Icelandic - a bright, modern, poppy sound was what the acts should deliver to be in with a chance of success. Most of them were rewarded with respectable placings for the recipe, some of them with a win. Contest veterans Elisabeth Andreasson and Hanne Krogh united as Bobbysocks and gave Norway their first victory with a fifties revival number in Gothenburg in 1985. A year earlier the Herreys had come in for a lot of criticism on the home front in Sweden for their blatantly poppy Diggi-loo Diggi-ley, but managed to convince Europe that they had the best song. Carola snatched the crown for Sweden again in 1991, as did Charlotte Nilsson in 1999. The exception to the upbeat success story was Norways 1995 winner, Nocturne. Composer Rolf LÃƒÂ¶vland created an ethereal, swirling sound that fitted in well with the new age music trends popular at the time, and romped to victory with a piece of music containing only 14 words.\n\nDenmark on the other hand put their faith in a duo again, and the mature Olsen Brothers landed a victory in 2000 with Fly On The Wings Of Love, a European hit which quickly gained evergreen status. In the meantime, the technical restrictions which had kept Iceland out of the contest had been overcome by 1986, and the island also scored their best placings with songs of a happy-go-lucky character.\n\nFor Finland, however, success was more elusive. Their best result remained the sixth position by Marion Rung with Tom Tom Tom in 1973 until the sensation of 2006. The heavy metal band Lordi managed to bowl over Europe with their anthem Hard Rock Hallelujah and walked to victory in Athens. The countrys president, Tarja Hallonen, called for a grand reception for the group upon their return to Helsinki, and thousands of happy, cheering Finns turned out to greet the band that are only ever seen in monster costumes. Finland had finally hit the right chord with the viewers of Europe.\n\nThe history of the Nordic countries in the Eurovision Song Contest is, on the whole, a glorious one, but at the same time the largest number of last places has also been collected by Nordic nations, mostly by Finland and Norway. These were the years when the songs were at a complete tangent to the mainstream European taste. A good example was John Teigen with Mil efter mil in 1978, but his zero points were such a shock that his crash-landing made him a celebrity, and his song still ranks as one of the biggest cult hits ever to hit the airwaves between Oslo and Hammerfest.\n\nThis collection contains a representative cross section of hits, favourites and classics that have had the honour of taking part in the most popular musical event in Europe. And nowhere is the Eurovision Song Contest more popular than in Sweden, Danmark, Norway, Finland and Iceland. All acts who have participated have, regardless of their results, never failed to use it to open doors and advance their careers. This compilation presents the priceless crown jewels of Nordic pop - we wish you listening pleasure, again and again.\n\nJan Feddersen &amp; Ivor Lyttle\n\n- - -\n\nVA - Best of the Nordics - the greatest Eurovision hits -\nEurovision Song Contest - an official album 1963-2010\n(3CD KÃƒÂ¶benhavn CMC Entertainment 2010)\n\nCD 1 - Hits\n\n 1. Chane &amp; N'evergreen - In a Moment Like This \n 2. Alexander Rybak - Fairytale \n 3. Yohanna - Is It True? \n 4. Maria Haukaas Storeng - Hold On Be Strong\n 5. LORDI - Hard Rock Hallelujah \n 6. Jostein Hasselgaard - Im Not Afraid To Move On \n 7. Rollo &amp; King - Never Ever Let You Go \n 8. Friends - Listen To Your Heartbeat \n 9. Brdr. Olsen - Fly On The Wings Of Love \n10. Charlotte Nilsson - Take Me To Your Heaven \n11. Selma - All Out Of Luck \n12. Elisabeth Andreassen - I Evighet \n13. Secret Garden - Nocturne (To Nie Ja) \n14. Jan Johansen - Se Paa Mig \n15. Carola - Faangad Av En Stormvind \n16. Birthe Kjaer - Vi Maler Byen Roed \n17. Kirsten &amp; Soeren - Ka Du Se Hva Jeg Sa \n18. Bobbysocks - La Det Swinge \n19. Kikki Danielsson - Bra Vibrationer \n20. Herreys - Diggi-Loo Diggi-Ley \n21. Tommy Seebach - Disco Tango \n22. Abba - Waterloo \n23. Marion Rung - Tom Tom Tom \n24. Aase Kleveland - Intet Er Nytt Under Solen \n25. Grethe &amp; Joergen Ingmann - Dansevise \n\nCD 2 - Favorites\n\n 1. Hera Bjoerk - Je Ne Sais Quoi \n 2. Euroband - This Is My Life \n 3. Carola - Invincible \n 4. Christine Guldbrandsen - Alvedansen \n 5. Jakob Sveistrup - Talking To You \n 6. Wig Wam - In My Dreams \n 7. Lena Philipsson - It Hurts \n 8. Birgitta - Open Your Heart \n 9. Einer Agust Vidisson &amp; Telma Augustdottir - Tell Me \n10. Michael Teschl &amp; Trine Jepsen - This Time I Mean It \n11. One More Time - Den Vilda \n12. Jill Johnson - Kaerleken Aer \n13. Aud Wilken - Fra Mols Til Skagen \n14. Elisabeth Andreasson &amp; Jan Werner Danielsen - Duett \n15. Sigga - Naetur \n16. Kenny &amp; Lotte - Alt Det Som Ingen Ser \n17. Stjornin - Eitt Lag Enn \n18. Anneli Saaristo - La Dolce Vita \n19. Lasse Holm &amp; Monica Toernell - E De Det Haer Du Kallar Kaerlek \n20. Kirsten &amp; Soeren - Det Lige Det \n21. Ami Aspelund - Fantasiaa \n22. Anita Skorgan - Oliver \n23. Monica Aspelund - Lapponia \n24. Fredi &amp; Friends - Pump Pump \n25. Claes-Gran Hederstroem - Det Boerjar Verka Kaerlek Banne Mej \n\nCD 3 - Classics\n\n 1. Waldos People - Lose Control \n 2. Malena Ernman - La Voix \n 3. The Ark - The Worrying Kind \n 4. Eirikur Hauksson - Valentine Lost \n 5. Hanna - Leave Me Alone \n 6. Silvia Night - Congratulations \n 7. Selma - If I Had Your Love \n 8. Laura - Addicted To You \n 9. Two Tricky - Angel \n10. Charmed - My Heart Goes Boom \n11. Cat Cat - Bye Bye Baby \n12. Tommy Seebach - Under Stjernerne Paa Himlen \n13. Just 4 Fun - Mrs. Thompson \n14. Ketil Stokkan - Romeo \n15. Kirsten &amp; Soeren (Hot Eyes) - Sku Du Spoer Fra Noen \n16. Dollie de Luxe - Lenge Leve Livet \n17. Kojo - Nuku Pommiin \n18. Jahn Teigen &amp; Anita Skorgan - Adieu \n19. Riki Sorsa - Reggae O.K. \n20. Sverre Kjelsberg &amp; Mattis Haetta - Samiid Aednan \n21. Ted Gaerdestad - Satellit \n22. Jahn Teigen - Mil Etter Mil \n23. Boejrn Skifs - Det Blir Alltid Vaerre Framaat Hatten \n24. Anne Karine Stroem - Mata Hari \n25. Kirsti Sparboe - Oj, Oj, Oj, Saa Glad Jeg Skal Bli \n","torrent":{"xt":"urn:btih:0bc3ba11e2dbc2490c69462cddc33ca2cb0a775b","amp;dn":"VA+-+Best+of+the+Nordics-greatest+Eurovision+hits+-+3CD-BOX+2010","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0bc3ba11e2dbc2490c69462cddc33ca2cb0a775b","infoHashBuffer":{"type":"Buffer","data":[11,195,186,17,226,219,194,73,12,105,70,44,221,195,60,162,203,10,119,91]},"announce":[],"urlList":[]}}