{"title":"Massive Attack - Mezzanine","uid":8107654,"size":1303352627,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:0c8b6aaae3b073275eff4c2ac32cad62579dc8cf&amp;dn=Massive+Attack+-+Mezzanine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"24.96","files":-1,"time":1360111659,"description":"Increasingly ignored amidst the exploding trip-hop scene, Massive Attack finally returned in 1998 with Mezzanine, a record immediately announcing not only that the group was back, but that they'd recorded a set of songs just as singular and revelatory as on their debut, almost a decade back. It all begins with a stunning one-two-three-four punch: &quot;Angel,&quot; &quot;Risingson,&quot; &quot;Teardrop,&quot; and &quot;Inertia Creeps.&quot; Augmenting their samples and keyboards with a studio band, Massive Attack open with &quot;Angel,&quot; a stark production featuring pointed beats and a distorted bassline that frames the vocal (by group regular Horace Andy) and a two-minute flame-out with raging guitars. &quot;Risingson&quot; is a dense, dark feature for Massive Attack themselves (on production as well as vocals), with a kitchen sink's worth of dubby effects and reverb. &quot;Teardrop&quot; introduces another genius collaboration -- with Elizabeth Fraser from Cocteau Twins -- from a production unit with a knack for recruiting gifted performers. The blend of earthy with ethereal shouldn't work at all, but Massive Attack pull it off in fine fashion. &quot;Inertia Creeps&quot; could well be the highlight, another feature for just the core threesome. With eerie atmospherics, fuzz-tone guitars, and a wealth of effects, the song could well be the best production from the best team of producers the electronic world had ever seen. Obviously, the rest of the album can't compete, but there's certainly no sign of the side-two slump heard on Protection, as both Andy and Fraser return for excellent, mid-tempo tracks (&quot;Man Next Door&quot; and &quot;Black Milk,&quot; respectively).","torrent":{"xt":"urn:btih:0c8b6aaae3b073275eff4c2ac32cad62579dc8cf","amp;dn":"Massive+Attack+-+Mezzanine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c8b6aaae3b073275eff4c2ac32cad62579dc8cf","infoHashBuffer":{"type":"Buffer","data":[12,139,106,170,227,176,115,39,94,255,76,42,195,44,173,98,87,157,200,207]},"announce":[],"urlList":[]}}