{"title":"InTheCrack E384 Madison Parker Full HD 1080p","uid":12283533,"size":2398822488,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:0d36df0dd18d801e7f542a2bb19b66fa88450ad3&amp;dn=InTheCrack+E384+Madison+Parker+Full+HD+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"pornboy89","files":6,"time":1440447346,"description":"..:::ScreenShots:::..\n &lt;a href=&quot;\nhttp://imgnemo.com/?g=224361&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?g=224361&lt;/a&gt;\n &lt;a href=&quot;\nhttp://imgnemo.com/?v=805417&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imgnemo.com/?v=805417&lt;/a&gt;\n\nSpot Remover.8:28\n\nThough there is nothing particularly outstanding about this strip tease it does show some very nice up skirt views with Madison's quite voluptuous ass hanging out the bottom of her polka dot dress. After the dress comes off there's some more equally nice ass views with her black thong in the crack of her ass. There's a brief bit of full nudity at the end of the clip as you see her posing nude in full body view.\n\n\n\n\n\nMadison's Rear Partings.8:35\n\nThis clip consists entirely of all spread ass views in several positions including standing, bending over doggy style and lying on her side and front. She sometimes spanks her ass and on the odd occasion she also lightly rubs her pussy though the main focus remains on spread ass views. She may at times appear to be &quot;going through the motions&quot; although the final squirming ass view while she lies on her front is especially nice.\n\n\n\n\n\nPlaying in the Orange Bowl.2:54\n\nMadison's fingers get a little more busy now with some light pussy rubbing action although it is really just a warm up for the main action to follow in the next clip.\n\n\n\n\n\nDrive a Bentley up Madison's Avenue.5:18\n\nThis is certainly the best action segment of this video as Madison uses an unusual crooked dildo to pump her pussy. Her position is especially nice lying on her back with her ass hanging right off the edge of the couch and all her prettiest places fully exposed in mid air for maximum ogling access.\n\n\n\n\n\nA Box of Nails.5:35\n\nNow lying back with her knees up Madison uses her fingers to pry her vagina wide open and we get some great extreme close up inside views. She has quite a talent for gaping her vagina like this as you can almost see all the way up to her cervix with excellent lighting. You can see really quite deep up her vagina although the depth of field is too shallow to see the deepest areas fully in focus. The puffy rippling walls of her vagina are quite a unique and amazing sight.\n\n\n\n\n\nShe's very Deep End able. ITC Favorite8:19\n\nMadison's speculum scene shows some very nicely lit cervix views with the full depth of her vagina visible even in the full body views. The close up inside views are exceptionally clear and well lit showing traces of pussy goo caked around the outside of her cervix. In the second half she poses bending over on her knees with her butt squirming in the air. You can see all the way up her vagina while her ass squirms in the air and with her head simultaneously in the background of the shot. You can sometimes see her cervix moving around inside as she flexes her muscles. She turns back onto her back to remove the speculum and we get another great inside close up view as the speculum comes out with the vagina walls closing behind the speculum. This clip has some of the best speculum footage we have shot to date","torrent":{"xt":"urn:btih:0d36df0dd18d801e7f542a2bb19b66fa88450ad3","amp;dn":"InTheCrack+E384+Madison+Parker+Full+HD+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d36df0dd18d801e7f542a2bb19b66fa88450ad3","infoHashBuffer":{"type":"Buffer","data":[13,54,223,13,209,141,128,30,127,84,42,43,177,155,102,250,136,69,10,211]},"announce":[],"urlList":[]}}