{"title":"#007 - Discography (Elliott Smith)","uid":4304290,"size":1467424187,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0d3b1ebbed391ed6d286f59868661f5b7c384a89&amp;dn=%23007+-+Discography+%28Elliott+Smith%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"West-Independent","files":340,"time":1216427004,"description":"West Independent is proud to release the entire Elliott Smith discography (#007), this includes the six studio albums that he released through 1994-03, to the even more obscure releases, from demos, to singles, this is all of Elliott Smith&amp;#039;s music. Including some rare live promos discs.\n\n  (27 discs) total (all remastered/tagged): \nDisc 1-2 (Early Works):\n   Disc 1 (Roman Candle)\n   Disc 2 (Shytown)\nDisc 3-13 (Kill Rock Stars Era):\n   Disc 3 (Elliott Smith)\n   Disc 4 (Either-Or)\n   Disc 5 (Either-Or Demos)\n   Disc 6 (New Moon)\n   Disc 9 (Needle in the Hay (EP)\n   Disc 8 (Ballad Of Big Nothing (EP)\n   Disc 9 (Speed Trials + 2 (EP)\n   Disc 10 (Division Day-No Name #6 (EP)\n   Disc 11 (Jackpot! Demos)\nDisc 11-18 (Dreamworks Era):\n   Disc 12 (XO)\n   Disc 13 (Waltz #2 (XO)(EP)\n   Disc 14 (Figure 8)\n   Disc 15 (Place Pigalle Demos)\n   Disc 16 (Happiness (EP)\n   Disc 17 (Son Of Sam (EP)\n   Disc 18 (3 Titres Inedits (EP)\nDisc 19-21 (Basement Era):\n   Disc 19 (From a Basement on the Hill)\n   Disc 20 (Pretty (Ugly Before) (EP)\n   Disc 21 (Basement Era Demos)\nDisc 22-25 (Live &amp; Radio):\n   Disc 22 (End Sessions; Seattle, WA)\n   Disc 23 (Live At Largo)\n   Disc 24 (Morning Becomes Eclectic, KCRW-FM Studios)\n   Disc 25 (Live at Crystal Ballroom)\nDisc 26-27 (Bonus Material):\n   Disc 26 (Grand Mal)\n   Disc 27 (Video)\n\nBiography\tby Jason Ankeny\n\nFolk-punk singer/songwriter Elliott Smith rose from indie obscurity to mainstream success in 1997 on the strength of &quot;Miss Misery,&quot; his Academy Award-nominated song from the film Good Will Hunting. A native of Portland, OR, Smith began writing and recording his first songs at age 14, later becoming a fixture of the city&amp;#039;s thriving music scene; as a member of the band Heatmiser, he debuted in 1993 with the LP Dead Air, issuing his first solo effort Roman Candle on the tiny Cavity Search label a year later. For his 1995 self-titled album, Smith signed with the noted Kill Rock Stars label; Either/Or followed in 1997, around the same time that filmmaker and longtime fan Gus Van Sant requested permission to use the singer&amp;#039;s music in his upcoming Good Will Hunting. Smith also composed a handful of new songs for the soundtrack, among them &quot;Miss Misery,&quot; and when the Academy of Motion Picture Arts and Sciences announced its Oscar nominations the following February, the track was a surprise entry in the Best Original Song category. Although he did not win, Smith performed the song live at the televised Oscar broadcast, appearing on-stage alongside superstars Trisha Yearwood and eventual award-winner Celine Dion in one of the most notably surreal musical moments in recent memory. Smith&amp;#039;s DreamWorks label debut, XO, followed later in 1998. Two years later he delivered Figure 8, which indulged in lush arrangements and orchestrations more so than any of his previous solo efforts. For the next two years, Smith labored over what was to be his next album, From a Basement on a Hill. He would not live to see its completion, however -- to the shock of friends and fans alike, Smith&amp;#039;s body was found on October 21, 2003. To date, the coroner has been unable to determine the cause of death, and the Los Angeles Police Department&amp;#039;s investigation remains open. From a Basement on a Hill was released two days shy of the first anniversary of his death to critical acclaim. In 2007, Kill Rock Stars issued a two-disc set of some of the late singer&amp;#039;s unreleased work, all of which had been recorded between 1994 and 1997. Entitled New Moon, the 24-track collection contained three songs that had been previously released on hard-to-find compilations or soundtracks, an early version of &quot;Miss Misery,&quot; and a live favorite of his, a cover of Big Star&amp;#039;s &quot;Thirteen.&quot; \n\n\n{IMPORTANT: Due to filesize we ask that you help share this discography with others by seeding after you&amp;#039;re completion.}","torrent":{"xt":"urn:btih:0d3b1ebbed391ed6d286f59868661f5b7c384a89","amp;dn":"%23007+-+Discography+%28Elliott+Smith%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0d3b1ebbed391ed6d286f59868661f5b7c384a89","infoHashBuffer":{"type":"Buffer","data":[13,59,30,187,237,57,30,214,210,134,245,152,104,102,31,91,124,56,74,137]},"announce":[],"urlList":[]}}