{"title":"Consciousness- An Introduction","uid":7809892,"size":28441099,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0dc2aaf03d2149bea6e876cc8cd5886bd63c07df&amp;dn=Consciousness-+An+Introduction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":".xtend.","files":-1,"time":1352497785,"description":"Consciousness: An Introduction\n2003 | 480 Pages | ISBN: 019515343X , 0195153421 | PDF | 27 MB\n\n\nIs there a theory that explains the essence of consciousness? Or is consciousness itself just an illusion? The &quot;last great mystery of science,&quot; consciousness was excluded from serious research for most of the last century but is now a rapidly expanding area of study for students of psychology, philosophy, and neuroscience. Recently the topic has also captured growing popular interest.\nThis groundbreaking book is the first volume to bring together all the major theories of consciousness studies--from those rooted in traditional Western philosophy to those coming out of neuroscience, quantum theory, and Eastern philosophy. Broadly interdisciplinary, Consciousness: An Introduction is divided into nine sections that examine such topics as how subjective experiences arise from objective brain processes, the basic neuroscience and neuropathology of consciousness, altered states of consciousness, mystical experiences and dreams, and the effects of drugs and meditation. It also discusses the nature of self, the possibility of artificial consciousness in robots, and the question of whether or not animals are conscious. Enhanced by numerous illustrations and profiles of important researchers, the book also includes self-assessment questions, further reading suggestions, and practical exercises that help bring the subject to life. ","torrent":{"xt":"urn:btih:0dc2aaf03d2149bea6e876cc8cd5886bd63c07df","amp;dn":"Consciousness-+An+Introduction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0dc2aaf03d2149bea6e876cc8cd5886bd63c07df","infoHashBuffer":{"type":"Buffer","data":[13,194,170,240,61,33,73,190,166,232,118,204,140,213,136,107,214,60,7,223]},"announce":[],"urlList":[]}}