{"title":"Michael Tsarion Collection (O&amp;O, Irish, and Architects)","uid":5739645,"size":15438335830,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:0e2cfe7ef852e3c7ec7b1c040676b081ef013075&amp;dn=Michael+Tsarion+Collection+%28O%26O%2C+Irish%2C+and+Architects%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"5iTH","files":-1,"time":1280954863,"description":" \n\n\n\nThe torrent contains the following:\n\nOrigins &amp; Oracles\nThe Irish Origins of Civilization\nArchitects of Control\n\n\n\n\n\n\nBelow is listed some of the subjects covered in O&amp;O, TIOoC and AoC respectively:\n\n\n\n\n\n\n[Origins &amp; Oracles]\n\nA series exploring ancient mysteries and forbidden knowledge.\n\nProduced and presented by alternative historian Michael Tsarion, the Origins &amp; Oracles series delves deeply into ancient mysteries and forbidden knowledge.\n\n==\n\n\n\n\nProgram 1 - Atlantis, Alien Visitation &amp; Genetic Manipulation:\n\n\n+ Who were the Atlanteans? Were they tutors or tyrants?\n\n+ How did the phenomena of evil come into our world and into the consciousness of \n  human beings?\n\n+ Who, or what, are the Fallen Angels?\n\n+ Is Homo Sapiens a hybrid created by beings from another solar system?\n\n+ Was the science of genetics known in ancient times?\n\n+ Are you Homo Sapiens or Homo Atlantis?\n\n+ What is the difference between Atlantis and Lemuria?\n\n+ Are we being told the truth about our origins and destiny?\n\n+ What do the Biblical terms Immaculate Conception, Forbidden Fruit, and Tree \n  of Life refer to?\n\n+ Why do some modern scientists believe that the so-called Ice-Age never \n  happened?\n\n+ Did Eve really cause the fall of man?\n\n+ Why have women and indigenous races been slaughtered and suppressed through the \n  centuries?\n\n+ Who built the great cyclopean megaliths, and why?\n\n+ Why has our technological expertise far outreached our psychological and \n  spiritual development?\n\n+ What do Atomic and Nuclear war really mean? Who, or what, are the \n  Reptilians? Do they really come from outer space?\n\n+ Is the New World Order really something new?\n\n+ What is the purpose of the many black budget projects, like HAARP?\n\n+ Who really governs from behind the thrones of government and religion?\n\n+ Why are so many US Presidents bloodline related to Europes elite royal \n  dynasties?\n\n+ Why is the US really involved in wars and Crusades in the Middle East?\n\n+ Is 2012 really the end of our world, as the Maya predicted?\n\n+ What can we do to actively rid ourselves and this planet of its evil?\n\n\nIn Program One, of the Origins &amp; Oracles series, Michael Tsarion takes us on a vivid journey back to the time of the lost continents of Atlantis and Lemuria.On this journey, timeless mysteries are unraveled and explained like never before. Masses of disinformation concerning pre-history and the origins of humanity, which have duped scholars and researchers for generations, are eradicated and we are finally able to connect the dots and comprehend how the innumerable idioms of our modern world came into being. In the tradition of Immanuel Velikovsky, Zechariah Sitchin, Jordan Maxwell, Graham Hancock and Michael Cremo, Michael Tsarion investigates the true origins of mankind and throws open doors which have been sealed for many an age.\n\nEnriched with a plenitude of rare source-material, Michaels scholarly work investigates the records of our ancient forbearers. Michael also reveals to us the secrets of his own Celtic ancestors who, behind the veil of folklore, had much to say about alien visitation, genetic manipulation, wars of the gods, the coming of evil, the Anti-Christ, and the degradation of spirit. It is doubtful whether you will watch and hear anything more lucid concerning the fascinating mysteries of occultism, genetics, Darwinism, ufology, the paranormal, the phenomena of evil, secret-society intrigue, the New World Order and the future the human race. This 15 hour-long magnum opus is compulsory viewing for those truth-hungry and educated seekers with a discriminating palate. This is revisionism at its best.\n\n==\n\n\n\n\nProgram 2 - 2012 - Where History Ends:\n\n\n+ 2012 and the Age of Revealing\n\n+ The Destruction of Atlantis \n\n+ The War of the Gods\n\n+ The Genetic Manipulation of Humankind\n\n+ The Fall of Man\n\n+ The True Origins of Evil\n\n+ The Armageddon Factor\n\n+ The Decline of Politics and Religion\n\n+ The Reasons for &amp; Significance of the Present World Crises\n\n+ The Occult History of America\n\n+ The Subversion of the Spiritual Destiny of America\n\n+ The Rise of the Anti-Christ (who is it?)\n\n+ Why Iraq, and the War on Terror?\n\n+ The Rising of the Nephilim\n\n+ The Final Days of the Age of Pisces\n\n+ What the Prophecies of Nostradamus Dont Tell Us\n\n+ The Photon Belt, the Earth Grid and the galactic alignments of the Next 10 \n  years\n\n\nIn Program Two, of the Origins &amp; Oracles series, Michael Tsarion explains exactly why the world is in the present state of decay, and who it is that really rules from the top of the power pyramid. We discover that earths crime-soaked history has been manipulated by powerful secret societies with bloodline connections to ancient alien visitors who crossed their own DNA with that of earths indigenous inhabitants. According to Michael Tsarions astonishing thesis, some of these original Fallen Angels are secretly interred beneath the ground in Iraq, Afghanistan, and in other locations around the globe. These undead vampiristic kings of old have been feeding off the death and mayhem, the pain and fear of human beings for millennia and their servants, upon the earths surface, have orchestrated wars, assassinations, and a climate of perversity and debauchery to feed their dark masters soon to arise again from their unholy repose. This arising is forced due to the approach of powerful constellational alignments and the coming of an Age of Revealing referred to in ancient Maya texts, and in the Book of Revelations. It is of paramount importance that each and every human being discovers what these alignments will mean, what the future holds, and what the worlds ancient scriptures are warning us about. This riveting investigation into the occult history of the world will open your eyes and allow you to make sense of the agendas of government and religion, the strange preoccupations of the media, and much of what will transpire in future years.\n\nAdditionally, Michael also reminds to us of the importance of cleansing the inner temple. He reminds us that a toxic mind creates a toxic society. It is schizoid people who inevitably create a schizogenic society, and who are responsible for raising-up the sadistic Orwellian regimes which prey over the good and the free. Michael delineates for us the age-old connections between mind and world, between microcosm and macrocosm, so that we are again empowered with proactive and sustainable solutions. Michael insists that we must re-learn how to put our own inner houses in order before our efforts at overcoming our inhuman adversaries can be successful. Other stratagems are merely akin to re-arranging the furniture on the Titanic, and have not been working. Therefore, it is time for humanity to show zero-tolerance for all the false paths and leads, and to have the truth about change. These are just a few of the topics covered in this monumental 13 hour presentation.\n\n==\n\n\n\n\nProgram 3 - Divination &amp; the Goddess Tradition:\n\n\n+ Who were the Gnostics, and what did they believe and teach?\n\n+ Who created Astrology and the high arts of Hermetic Divination?\n\n+ What is the Inner Zodiac?\n\n+ Do rocks floating in space really affect our character and fate?\n\n+ Why does the prohibition against making graven images of god come before that \n  against killing?\n\n+ Why is the female cycle connected to the heavens?\n\n+ Are women superior to men?\n\n+ Why do men fear and hate women?\n\n+ Why have women been marginalized and massacred down through time?\n\n+ What or who is Holy Mother Church?\n\n+ Do religions and governments have occult agendas?\n\n+ Why is prophecy legitimate?\n\n+ Why did human beings become sedentary and begin living in artificial city \n  environments?\n\n+ What is the real drive behind technology and the Technotronic Age?\n\n+ What are the solutions to the worlds crises and to the spiritual vacuity of \n  mankind?\n\n\nIn Program Three, of the Origins &amp; Oracles series, Michael Tsarion investigates the real history of religion and reveals its Egyptian origins. In the tradition of Joseph Campbell, Michael reveals the origins of the enigmatic Book of Genesis, and the actual hidden significance of religion, yoga, magick, ritual and science. This true meaning has been concealed so that humans remain disempowered and removed from their source. Prayers go unanswered, people remain lost, and humanity heads toward the precipice of oblivion, raping the planet and fighting endlessly. We might ask if it is God or Lucifer who presides over the world, and over the minds of men. Regardless of the miasma and debauchery, the truth of mans existence remains within the secret traditions. It is now time for ordinary people to have the facts which will make sense of their lives and beliefs. Michael specifies the forces (from within and without) which weigh us down and impede our natural rise, our advancement on all levels.\n\nIn this captivating and informative presentation, Michael also delves deeply into the gender divide and exposes why it is that the elites within the orthodox religions have debarred women from assuming positions of authority. He also investigates the real reasons for the criminality of mankind, as well as for the rise of technology and science. We learn what it is that really separates man from the primates, and why man is distinguished by his penchant for sadism, cruelty and violence upon members of his own species and upon others.\n\nAdditionally, we are introduced to the Western Magical Tradition, and to the meta-sciences employed by the Magi of old to engender psychic hygiene, moral rectitude, and spiritual empowerment. We discover the true hidden connections between the Tarot, the Zodiac, the Kabalistic Tree of Life and sacred Numerology.\n\n==\n\n\n\n\nProgram 4 - Weapons of Mass Deception - Behind the New World Order:\n\n\nIt is a no-brainer for veterans within the research-community to understand that the US Government was deeply complicit in the September Eleventh tragedy. However, it has taken quite a bit of book-writing, in-depth journalism and documentary-making to get this rather simple message across to the masses of people in America and the world.\n\nThose who have so labored are to be accoladed for their revisionism and bravery. However, veterans of alternative history know that such exposure is merely the tip of the ice-berg. They know that the masses of mankind need to dig a lot deeper to know the real extent of the treachery and guile of the worlds so-called Democratic politicians. The roots of todays atrocities lie in the ancient past, and in the agendas of powerful secret-societies who are moving ever nearer to their end-game. What lies ahead for mankind is not freedom, peace nor prosperity. Time is short, and if the human race is to end evil and survive it must first have the WHOLE TRUTH. Solution-Think, must replace Problem-Think.\n\nIn Program Four of the Origins &amp; Oracles series, Michael Tsarion conducts his own investigation into the history of the very real New World Order, detailing for us its founders and their real purpose. He reveals, in some depth, the magnitude of the occult agendas behind the furtherance of the draconian New Imperialism, and lets us see just how those arch-enemies of America have slowly and vampiristically hypnotized an entire continents historically-amnesiac inhabitants into selling off their sovereign power, prosperity and freedom. Using the September 11th attack as a back-drop, Michaels investigation into unseen and sinister stratagems involves warnings regarding the future. Michael insists that it is not by chance that we have conjured such evil in our midst. Overcoming our enemy involves re-learning better ways of being, not new ways to fight. As Michael warns, there can be no victory over an evil which strengthens itself due to our futile, anti-spiritual and self-defeating rivalry. As he reminds us: Evil does not take our power... we give it up ourselves.\n\nMichael opens the book of the worlds secret history and focuses on the ancient European dynastic powers - the all-powerful Black Venetians (Guelph, Saxe Coburg Gotha, House of Hanover Dynasties), whose agents operate throughout the US, in media, healthcare, big-business, law, and politics. He covers the English secret organizations, such as the Rhodes Round Table groups, the Club of the Isles, the Fabians and the Tavistock Institute. He also deals with their lieutenant orgs in the US, namely the Illuminati, the Scottish Rite Freemasons, the corrupt Council on Foreign Relations and the Trilateral Commission.\n\nImportantly, Michaels research indicates that these bastions, and their controllers, are motivated by more than simple physical domination of the earth. Although most under-informed researchers believe the machinations of political and religious elites to be motivated by simple greed and power-mania, Michael shows us that there are far more sinister reasons for the policies that lead our world toward the precipices of want and tragedy. We find out the real reasons why the vanguard of the West is back in the Middle East, and why our world has been engulfed in ages of crime and cruelty. Michael reminds us that the real Intelligence Community are those in America (and the world) who are not afraid to face the facts and intelligently and eloquently expose those who have no legal or moral right to dominate humanity. Although We the People are not respected, protected, served or free, there is something that can be done about it once we realize where the real power lies and how to use it.\n\nThis one of a kind presentation will inform and inspire veterans and beginners alike, giving each viewer a comprehensive, no-nonsense, yet sane and balanced expose into the real history of the world. As Michael says: The subject of history as taught in schools is surely boring, but the study of how history has been manipulated... is one of the most interesting of all.\n\n==\n\n\n\n\nProgram 5 - Astro-Theology &amp; Sidereal Mythology:\n\n\n+ What connection do the symbols of government, religion, royalty and the \n  corporate world have with the constellations and zodiac?\n\n+ Who was Jesus Christ? What he really the son of God and founder of Christianity?\n\n+ Is our culture Judeo-Christian, or Egytpo-Christian?\n\n+ Why did the orthodox Church suppress the Gnostics, and massacre women for \n  centuries?\n\n+ What did Jesus mean when he said the Temple of God is within, and that others \n  could do what he did?\n\n+ Why did Jesus refer to himself as the Morning Star, and ask his disciples to \n  be as wise as serpents.?\n\n+ Why was astrology and divination really prohibited?\n\n+ In the commandments, why does the edict against making graven images come \n  before the edict against killing?\n\n+ What do the symbols on flags, on heraldry, on money and on corporate logos, and \n  in ads, mean?\n\n+ Why are there so many cultural similarities when it comes to religion, race and \n  tradition?\n\n+ What are the solutions to the economic, political, social and psychological \n  challenges of the future?\n\n\nIn Program Five, of the Origins &amp; Oracles series, we learn about the real origins and meaning of the term - Holy Spirit, and we learn what humanity must do to secure its survival in the following years. We discover the actual roots of Christianity and find out what religious hierarchs have been hiding for over 2,000 years. Michael Tsarion investigates the suppression of women, the ecocidal tendency and the corruption in high places. Since, as Michael Tsarion says, the world elites have allegiances to hidden cults and secret societies, how can we expect them to honor their professed duties to humanity? In this all-revealing presentation we discover that the modern religions and political ideologies morphed out of seven great cults of power which ruled the world for millennia. The most powerful of these Cults was the Stellar Cult, dominant for over 10,000 years. Christ and the other Magi were initiates of this Cult, which gave mankind such sciences as astrology, astromancy, and the Tarot. Known as Serpents, they were the architects of the great temple structures such as the pyramids and the Sphinx. After the great Cults became corrupted they eventually gave rise to the modern exploitative religious and political hierarchies that prey off society today. We are still controlled by the elite bloodlines of these secret orders which continue to lead the world toward ruin and chaos. In this astounding presentation, Michael Tsarion demonstrates how religion and politics work to shape both the events around you, and the thoughts within you. Astro-Theology reveals the nature of the psychic and spiritual desecration which covertly operates upon us daily, and unlike the majority of other experts and researchers, Michael offers provocative solutions to our social and psychic predicaments.\n\n==\n\n\n\n\nProgram 6 - The Subversive Use of Sacred Symbolism in the Media:\n\n\n+ Why are the youth so delinquent, in these days of affluence and plenty?\n\n+ Why do over 70 percent of the products we buy have names that mean nothing in \n  English?\n\n+ What are the occult techniques used by corporations and governments to \n  manipulate thought and control behavior?\n\n+ In this so-called Age of Amnesia and Infotainment, are we owning our own \n  thoughts?\n\n+ If we are under psychic hypnosis would we know it?\n\n+ How to we get back to being a symbol literate culture, and offset the worst \n  effects of mind-control, addiction, delinquency and crime?\n\n+ What are the techniques that are used by the media to dumb-down, and influence \n  the youth?\n\n+ Why are television programs, called programs? What do words like Lexus, \n  Nissan, Coke, Visa, Nike, Fila, and Acura, etc., actually mean?\n\n+ Why do corporations such as Levi Strauss and MTV screen girls as young as 5 and \n  6 years of age?\n\n+ Why are banks and franchises designed to subliminally represent churches.\n\n+ Can a corporation be psychotic?\n\n\nHave you ever wondered whether the billion-dollar artifice of the media, and of the advertising conglomerates, has any lasting negative effect on your mind and behavior, or whether the young are particularly affected by the all-pervasive presence of ads? Is it rational to expect large ad-corporations to jeopardize their vast monopolies by becoming more responsible in the future? Can Madison Avenue agencies and other Hidden-Persuaders ever be held accountable, if it is discovered and proven that the glamorous creations of their industry do indeed have lasting negative effects on our minds and behavior? Is the new designer disease of our age Affluenza, and is the consumer the consumed, in these times of excess and chronic commercialism? Can there be positive psychological, spiritual or social advancement, in a symbol-illiterate culture, more and more dependent on image, brand-logos and chimeras of the perfect, happy life, based on chronic competitiveness, material affluence and technical proficiency? Is there a connection between the rising levels of crime, substance abuse, inner psychological dysfunction, emotional disassociation, and the subversive use of power images and words in our culture? In this the sixth of the Origins and Oracles series, Michael Tsarion reveals the occult meaning behind many of the brand-names and logos that infest our think- and mind-space. This thoroughly engrossing expose is compulsory viewing for members of the younger generation, who are under daily assault from a deadly arsenal of psychic weaponry designed to eradicate their moral sensibility and willpower. Michaels scathing expose leaves the vague warnings of most media-critics far behind, and delves into areas were few others care, or even dare, to venture.\n\n\n\n\n\n\n\n\n\n[The Irish Origins of Civilization]\n\nIn this companion DVD to The Irish Origins of Civilization book\n(Volumes 1 and 2), Michael Tsarion discusses the historical\nsignificance of ancient Ireland and takes us on a truly\nfascinating journey through time, from the Emerald Isle to Egypt\nand back again full circle. Along the way we are introduced to\nthe Druids and also to their destroyers, the Atonists. We\ndiscover the origins of the worlds most powerful secret\nsocieties and the New World Order they labor to create. We\ndiscover secret facts about the royal dynasties of Britain and\nEurope, the Empire of Rome, and about Masonic influence in\nAmerica. Featuring over 560 illustrations, and rare source\nmaterial, this DVD series dramatically revolutionizes our view of\nhistory and explains what can be done to combat the tyrannical\nforces that have long conspired to undermine truth, freedom and\njustice.\n\nSubjects Include:\n\nMessage to the Beginner\nMessage to the Insider\nFictions and Fallacies\nThe Pre-Diluvian World\nThe Age of Catastrophe\nThe World After the Flood\nAncient Ireland and the Druids\nThe West to East Movement of the Elements of Civilization\nColonization, Imperialism and Genocide\nWar on Consciousness\nThe Origins of Evil\nThe True Meaning of Aryan\nThe Term Celtic\nThe Moses-Akhenaton Problem\nThe Bible: Book of the Pharaohs\nMigrations of the Western Elders\nThe Sacred Trees of God\nAkhenaton and the Rise of the Atonists\nDruids, Amenists, and Atonists\nNefertiti and Scotia\nThe Shemsu Hor (Disciples of Horus)\nAncient Technology\nAntiquity of the Zodiac\nCaucasians in Africa and Egypt\nIdentity of the Israelites and Judites\nTruth About the Levites\nThe True Hebrews\nThe Secret Oral Tradition\nTruth About the Biblical Exodus\nThe Biblical Patriarchs: Who Where They?\nThe Ransacking of Egypt\nIdentity of the Hyksos Dynasty\nThe Scythian-Hyksos Connection\nMyths About Druidism\nGods and Beliefs of the Druids\nProhibition and Suppression\nThe Destruction of the Druids\nThe Milesians and the Conquest of Ireland\nArrival of the Romans\nArrival of the Normans\nThe Culdeans: Tutors of the Templars\nThe Luciferians\nThe Dark Side of the Sun\nOrigin of the Major Secret Societies\nThe Merovingian Dynasty\nKnights Templars and their Symbolism\nFreemasonry: The Irish and Egyptian Connections\nThe Davids: Commanders of Aton\nAtonism in America\nAnarchy of the Mind\nCivil Disobedience or Obedience\nSecret Societies: The Royal Connections\nThe Coronation of Queen Elizabeth II\n\n\n\n\n\n\n\n\n\n[Architects of Control]\n\nProduced by Michael Tsarion and Blue Fire Films, Architects of Control explores humankinds future and the post-human world. Will the perfect human be a dumbed down, regimented inhabitant of a cyber purgatory created by unseen elites? Will the children of tomorrow be smiling depressives of a technocratic dystopia?\n\nMichaels focus is on individual slave (and by extension slave owners) psyche and internal motives rather than the circus. Why slave needs the master and why master needs the slave. The pyramid is made of people that lean on each other. Mass and transpersonal psyche, which is substantially different from individual psyche and crucial for understanding mass control is not approached in program one, although it could be in further programs.\n\nSubjects Include:\n\nJim Keith\nMass Control\nMind Control and its History\nRadiotronic Weaponry\nPsychic Dictatorship\nMass Ritual Killings\nThe Men in White\nOperation Cointelpro\nOperation Chaos\nTeen Rage\nSchool Shootings\nMedia Manipulation\nSleeper Assassins\nProject Monarch and MK Ultra\nOperation Paperclip\nSorcery and Magic\nThe Cult of Dionysus\nPeoples Champions\nAstro-Theology\nThe Anatomy of Thought\nTragedy: Catalyst of Change\nGlobal Awakening\nThe Myth of Progress\nThe Global Village\nThe Inauthentic Life\nDrugged, Medicated, and Under Control\nThe Deconstruction Cycle\nThe Rise and Fall of Civilizations\nThe Death of Emotion\nThe Posthuman World Initiated\n2012: The Age of Revealing\nCivilization: Rise and Fall\nPsychic Hygiene\nThe Sane and the Unsane\n\n\n\n\n\n\n--\n\n\n\n\n\n\nIf you have cash to spare, please support them by buying their books or other works, or send them money directly.\n\nCopyrighted pieces of plastic sent by mail is an obsolete distribution model. Only junk food has to be paid for before consumption (otherwise you would not pay after eating it) - in good restaurants payment is after the meal, not before it.\n\n\n\n\n\n--\n\n\n\n\n\n[Some notes about the video files themselves]\n\nOrigins &amp; Oracles isnt very high res and its just XviD, BUT its the best encoding that is available! The Irish Origins of Civilization and Architects of Control are pretty high quality, being x264 and AAC. Irish and Architects were encoded by someone called kwixpix. Irish originally had some kind of subtitle file (a logo showing kwixpix or something like that) embedded into the .mp4 containers. This was removed, because (under certain circumstances) it caused problems when playing the file. The way it was removed was simply by re-muxing the video and audio with YAMB into a new .mp4 without the sub file. No re-encoding was involved.\n\n\n\n\n\n\n[A very useful tip]\n\nFor the best viewing experience, use MPC (MediaPlayerClassic) with ffdshow and the Haali renderer. In Haali set the Luma Range to 0-255, and in ffdshow under Levels set the Input to 16-235 and Output to 0-255. In the same section in ffdshow (Levels) check also Modify Only Luminance and Full Range. Remember to check Levels as well, so that its enabled.\n\n\n\n\n\n\n[A note about the order of watching this]\n\nI strongly suggest you watch Origins &amp; Oracles FIRST, before any of the others, as it was made first (completed 2006). Then Irish Origins, followed by AoC.\n\n\n\n\n\n\n[Regarding the viewing order of Origins &amp; Oracles]\n\nThe programs in Origins &amp; Oracles are NOT chronological, so you dont have to watch them in any specific order. The DVDs were made at different points in time and later compiled into a box set called Origins &amp; Oracles.\n\nNot sure why they numbered them the way they did. Doesnt make any particular sense.\n\nAnyway, you can watch them in whatever order you prefer, or even just some totally random order if you want.\n\nThe reason I mention this stuff is because I think the numbers the\nprograms were given may not be the optimal order to watch them in.\n\nBut that may depend on whos watching, I guess...\n\nI dont have any suggestion either; its just just that I remember watching them in a different order than the numbered one, and I think it flowed better that way. I dont remember exactly what order that was though.\n\n\n\n ","torrent":{"xt":"urn:btih:0e2cfe7ef852e3c7ec7b1c040676b081ef013075","amp;dn":"Michael+Tsarion+Collection+%28O%26O%2C+Irish%2C+and+Architects%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e2cfe7ef852e3c7ec7b1c040676b081ef013075","infoHashBuffer":{"type":"Buffer","data":[14,44,254,126,248,82,227,199,236,123,28,4,6,118,176,129,239,1,48,117]},"announce":[],"urlList":[]}}