{"title":"Walled In 2009 DVDRIP","uid":4762972,"size":1394107525,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0e415ff94ba672f584f42d06c0a3ef14270d94e7&amp;dn=Walled+In+2009+DVDRIP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"desifilmz","files":3,"time":1236766986,"description":"Storyline:Sam is young, smart and beautiful, but she's no ordinary woman, she's a demolition expert, usually considered as a man's job. This job should have been very easy: conduct a structural analysis on a building located in the remote Scottish swamps, a necessary step before demolition. The building was supposed to be empty upon her arriving. But strangely there are still a few lingering tenants, amongst them the caretaker and her 15 year old boy. The eight-story building has a grim past and Sam, forced to live in the cursed complex while conducting her study to demolish the building, has trouble sleeping. deep in the night, metal banging noises sifting through the walls, the same walls where fifteen years earlier, the building's architect had sadistically murdered some of the tenants by burying them alive within the walls of the building ... including the caretaker's husband. The police had never been able to arrest the killer. Now, deep within the maze-like corridors of the building, guided by the 15 year boy, Sam feels the lingering shadow of these past murders. Sam's paranoia builds up and comes to a conclusion when she comes face to face with her terrors and we find out who or what continues to haunt this mysterious place.\n\nFor Screens Visit Site...........","torrent":{"xt":"urn:btih:0e415ff94ba672f584f42d06c0a3ef14270d94e7","amp;dn":"Walled+In+2009+DVDRIP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e415ff94ba672f584f42d06c0a3ef14270d94e7","infoHashBuffer":{"type":"Buffer","data":[14,65,95,249,75,166,114,245,132,244,45,6,192,163,239,20,39,13,148,231]},"announce":[],"urlList":[]}}