{"title":"The Free by Willy Vlautin","uid":9643920,"size":760525,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0f4e5535d44a313a4af50af07d5a078ca3a246f1&amp;dn=The+Free+by+Willy+Vlautin&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":3,"time":1392963531,"description":"\nAward-winning author Willy Vlautin demonstrates his extraordinary talent for confronting issues facing modern America, illuminated through the lives of three memorable characters who are looking for a way out of their financial, familial, and existential crises, in his heartbreaking and hopeful fourth novel\nLeroy Kervin is a 31 year old Iraqi War veteran living with a traumatic brain injury. Unable to dress or feed himself, or cope with his emotions, he has spent the last seven years in a group home. \n\nThere he spends his days watching old sci-fi movies until he awakens one night with a clear mind and memories of his girlfriend. Realizing what his life has been he decides it would be better to die than to go on living this way. A failed suicide attempt leaves Leroy hospitalized where he retreats further into his mind in order to make sense of his existence.\n\nFreddie McCall is a middle aged father working two jobs. He's lost his wife and kids, and is close to losing his house. He's buried in debt, unable to pay the medical bills from his daughter's childhood illness. As Freddie's situation becomes more desperate he undertakes a risky endeavor he hopes will solve his problems but could possibly end in disaster. Just as Freddie is about to lose it all, he is faced with the possibility of getting his kids back.\n\nPauline Hawkins takes care of everyone else around her. She cares for her mentally ill father out of a deep sense of obligation. As a nurse at the local hospital, she treats her patients and their families with a familiar warmth and tenderness. When Pauline becomes attached to a young runaway, she learns the difficult lesson that you can't help someone who doesn't help themselves.\n\nThe lives of these three characters intersect as they look for meaning in desperate times. Willy Vlautin covers themes ranging from health care to the economic downturn and housing crisis, to the toll war takes on veterans and their families. The Free is an extraordinary portrait of contemporary America and a testament to the resiliency of the human heart.\n\nGenre: General Fiction","torrent":{"xt":"urn:btih:0f4e5535d44a313a4af50af07d5a078ca3a246f1","amp;dn":"The+Free+by+Willy+Vlautin","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f4e5535d44a313a4af50af07d5a078ca3a246f1","infoHashBuffer":{"type":"Buffer","data":[15,78,85,53,212,74,49,58,74,245,10,240,125,90,7,140,163,162,70,241]},"announce":[],"urlList":[]}}