{"title":"World of Tanks","uid":8550022,"size":9556423,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:0f8728e5bab437b5022a732909e0276f91f10a0f&amp;dn=World+of+Tanks+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gams-o9","files":-1,"time":1370623272,"description":"World of Tanks is a massively multiplayer online role playing game (MMORPG). Buy and collect and develop tanks, then take them into battles in European environments.\n\nThe basic game is a capture the flag battle, between two teams of tanks. World of Tanks has six classes of tank, from Light to Heavy and Destroyer tanks from the USSR, Germany and the USA. Taking part in battles earns you experience, which you can spend on research to improve your tanks and get new ones.\n\nWhen you enter a battle, there will be a range of tanks on the field. A World of Tanks game lasts 15 minutes, unless one side wins before that. Your game will last as long as you survive - there is no re-spawning in World of Tanks. If your tank is destroyed, you can leave the game and enter another with a different tank. You will still gain experience points. This helps to alleviate the frustration that new players will experience when being blown up by bigger, more experienced tanks!\n\nWorld of Tanks is a great idea, and for the most part it's done very well. However, the game is very dry and serious, and the interface is quite intimidating to begin with. Battles are fun, but playing against much stronger players can be annoying.\n","torrent":{"xt":"urn:btih:0f8728e5bab437b5022a732909e0276f91f10a0f","amp;dn":"World+of+Tanks+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f8728e5bab437b5022a732909e0276f91f10a0f","infoHashBuffer":{"type":"Buffer","data":[15,135,40,229,186,180,55,181,2,42,115,41,9,224,39,111,145,241,10,15]},"announce":[],"urlList":[]}}