{"title":"Mount Sinai Expert Guides- Hepatology [PDF] [StormRG]","uid":9741190,"size":6238172,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0fb20bbe3d91f9cfb83a2ef7ab07e8d500e69bb3&amp;dn=Mount+Sinai+Expert+Guides-+Hepatology+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":-1,"time":1394519742,"description":"Author: Jawad Ahmad, Scott L. Friedman, Henryk Dancygier\nSeries: Mount Sinai Expert Guides\nPaperback: 584 pages\nPublisher: Wiley-Blackwell; 1 edition (April 14, 2014)\nLanguage: English\nISBN-10: 1118517342\nISBN-13: 978-1118517345\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nMount Sinai Expert Guides: Hepatology will provide gastroenterology and hepatology trainees with an extremely clinical and accessible handbook covering the major liver diseases and symptoms, their diagnosis and clinical management. \n\nPerfect as a point-of-care resource on the hospital wards and also as a refresher for board exam preparation, the focus throughout is on providing rapid reference, essential information on each disease to allow for quick, easy browsing and assimilation of the must-know information. All chapters follow a consistent template including the following features:\n\n- An opening bottom-line/key points section.\n- Classification, pathogenesis and prevention of disease.\n- Evidence-based diagnosis, including relevant algorithms, laboratory and imaging tests, and potential pitfalls when diagnosing a patient.\n- Disease management including commonly used medications with dosages, when to perform surgery, management algorithms and how to prevent complications.\n- How to manage special populations, ie, in pregnancy, children and the eldery.\n- The very latest evidence-based results, major society guidelines (AASLD/EASL) and key external sources to consult.\n\nIn addition, the book comes with a companion website housing extra features such as case studies with related questions for self-assessment, key patient advice and ICD codes.\n\nIf you're specialising in hepatology and require a concise, practical guide to the clinical management of liver disease, bought to you by one of world's leading hospitals, then this is the perfect book for you.","torrent":{"xt":"urn:btih:0fb20bbe3d91f9cfb83a2ef7ab07e8d500e69bb3","amp;dn":"Mount+Sinai+Expert+Guides-+Hepatology+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fb20bbe3d91f9cfb83a2ef7ab07e8d500e69bb3","infoHashBuffer":{"type":"Buffer","data":[15,178,11,190,61,145,249,207,184,58,46,247,171,7,232,213,0,230,155,179]},"announce":[],"urlList":[]}}