{"title":"Better File Rename 5.6","uid":5251428,"size":1118202,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0fe378008f0e33a5310adbbec74f5e2aa11b521f&amp;dn=Better+File+Rename+5.6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Jester_EE","files":-1,"time":1262372488,"description":"Better File Rename is the most comprehensive file renamer on the market. You get an industrial strength utility that's fast, flexible, reliable and easy to use.\n\nThat's why since 1999, thousands of hobbyists, professionals and businesses depend on Better File Rename to organize and maintain their files.\nNew In Version 5\n\n    * Best-of-breed user experience\n    * Re-sizable instant preview\n    * Combine multiple steps into a single multi-step rename\n    * Regular expression substitution support for the true power-user\n\n\t\n\n    * Now operate as stand-alone application but is still available directly within the Windows Explorer\n    * Drag &amp; drop files into the preview table\n    * Unicode and Vista support\n    * dozens of tweaks and refinements\n\nComprehensive renaming options renaming actions\n\n    * add, remove, insert and replace characters and text\n    * add, format, change and insert sequence numbers, create sequence number lists..\n    * add file date and time to the beginning and the end, rename to date..\n    * replace file and folder extensions\n    * make uppercase, lowercase, title case or sentence case\n    * create space-saving alphabetical sequences\n    * truncate, remove vowels, reverse, transpose\n    * and much, much more...\n\nBetter File Rename Explorer menu\nWork the way that suits you best\n\nYou can use Better File Rename as a stand-alone application dragging &amp; dropping files onto its application icon or directly into the preview window.\n\nAlternatively you can use it straight from the Windows Explorer by right-clicking the files and selecting the &quot;Better File Rename...&quot; menu item.\nInstant preview eliminates guesswork and errors\ninstant preview of the renamed files\n\nSee the results of your renaming options while you are typing or changing the parameters.\n\nThe instant preview makes short work out of finding the right settings and avoids costly mistakes.\nBulk processing options\n\nbulk processing options\n\n    * Separate processing for file names and file extensions\n    * Process files, folders and subfolders (&quot;recursively&quot;)\n    * Choose to confirm each file name or batch process them automatically\n\nCombine multiple rename steps\nmultiple files renaming steps\n\nYou can combine several rename actions into a single multi-step rename. This allows you to perform even the most complex batch renaming jobs in a single pass.\n\nBetter File Rename allows you to create as many rename steps as you require and lets you edit and re-arrange them at will.\nDigital Photograpy EXIF digital camera picture\n\nBetter File Rename is the preferred renaming tool of many professional and ambitious amateur photographers and has over time grown an impressive array of features dedicated to manipulating sequence numbers (create sequence number lists, add and insert sequence numbers, pad them with 0s, etc..) and adding shooting dates &amp; times to picture names.\n\nIn these operations you can exploit the shooting date &amp; time extracted from the industry-standard EXIF digital camera meta-data stored in your JPEG pictures.\nPro Workflow Support\n\nSave recurring renaming options to self-contained &quot;droplet&quot; applications. Drag &amp; drop files and folders onto these droplets to apply the stored settings. This allows you to automate the renaming part of your workflow.\nFeatures for power users\n\npower logoFor those that need even more advanced features, we provide regular expression substitution support. This advanced string manipulation technique was popularized by UNIX and PERL professionals. Definitely not for the faint of heart, regular expressions are nonetheless an excellent tool for finding, replacing and swapping text fragments.\n\t\nWindows 7 and 64-bit compatible\n\nLatest Version\n\n20th October 2009\n\nVersion 5.6 adds Windows 7 compatibility and fixes a number of minor bugs.","torrent":{"xt":"urn:btih:0fe378008f0e33a5310adbbec74f5e2aa11b521f","amp;dn":"Better+File+Rename+5.6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe378008f0e33a5310adbbec74f5e2aa11b521f","infoHashBuffer":{"type":"Buffer","data":[15,227,120,0,143,14,51,165,49,10,219,190,199,79,94,42,161,27,82,31]},"announce":[],"urlList":[]}}