{"title":"Rachel Steele - MILF 1186 - I Got a D in Biology","uid":16034439,"size":681978417,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:10195f451517b02127575acb6137d5d4af647290&amp;dn=Rachel+Steele+-+MILF+1186+-+I+Got+a+D+in+Biology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"blu3collar","files":1,"time":1476462767,"description":"As promised, the long awaited for clip that has never been posted anywhere online. This is not the original standard clip from clips4sale but is a damn good HQ ripped track from VOD site. Starring Racahel Steele, Dallas Diamondz and Kenny Cox as the nerdy son who is trying to become a doctor but is failing in biology class. His aunt Dalls is a professor and helps teach Kenny the proper way to a woman's physiology. Rachel (the mother) is a dominating woman who holding back Kenny from all outisde contact with the world, inlcuding girls, the internet, etc. She gives in to Her sisters ways of teaching Kenny, hoping that perhaps it actually will help him become  doctor. I won't spoil the whole story line so download and find out for yourself what happens.\r\n\r\nFile INFO: HQ 852 x 480p. 1251 bit data rate. 128k Stereo audio which has been slighlty remastered to get rid of white noise. \r\n\r\nI don't post screen caps. Just trust me, this will be worth your trouble to grab while you. PLEASE help seed the file once you have completed your download. Don't just take and don't give back. Torrents don't stay healthy when people take and delete the torrent once they have a completed download. \r\n\r\nThanx.\r\n\r\n\r\nPS. Coming this month (or sooner) A lot of DID series. Many hard to get items.\r\nFor example.. The Taylor Moore collection. Stay tuned or send me a request. I'll see if I have it or can get it","torrent":{"xt":"urn:btih:10195f451517b02127575acb6137d5d4af647290","amp;dn":"Rachel+Steele+-+MILF+1186+-+I+Got+a+D+in+Biology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10195f451517b02127575acb6137d5d4af647290","infoHashBuffer":{"type":"Buffer","data":[16,25,95,69,21,23,176,33,39,87,90,203,97,55,213,212,175,100,114,144]},"announce":[],"urlList":[]}}