{"title":"Maybeshewill - Not For Want Of Trying [ragontheroad.]","uid":6990208,"size":47034727,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:10604dddce3bc6b351b416b654d6fd96a70b9156&amp;dn=Maybeshewill+-+Not+For+Want+Of+Trying+%5Bragontheroad.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tlmsnif","files":-1,"time":1327676448,"description":"Maybeshewill es una banda inglesa que le ha dado una vuelta de tuerca al saturado panorama del postrock aÃƒÂ±adiÃƒÂ©ndole sonidos electrÃƒÂ³nicos a sus temas. En absoluto son los precursores de esta idea, ya que anteriormente grupos como 65daysofstatic (y seguramente algun otro mÃƒÂ¡s, aunque no estoy tan puesto) ya habÃƒÂ­an hecho algo parecido, pero creo que el sonido que logra Maybeshewill es mucho mÃƒÂ¡s compacto y contundente que el de los tambiÃƒÂ©n ingleses 65daysofstatic.\nEste Not For Want of Trying es su primer trabajo, y la verdad es que sorprende que sea asÃƒÂ­, ya que este disco tiene una madurez y una claridad increÃƒÂ­ble. Como he dicho, se trata de un disco de postrock con ciertos arreglos electrÃƒÂ³nicos en el que tambiÃƒÂ©n hay cabida en ciertos momentos para sonidos mÃƒÂ¡s postmetaleros, que es la principal diferencia con 65daysofstatic. AdemÃƒÂ¡s, incoporan un piano con unas preciosas melodÃƒÂ­as que sin duda ameniza el disco y le termina de dar la forma al proyecto, consiguiendo ese cuerpo y empaque brutales. Algunos temas incluso tienen voz, coros o samplers de alguna pelicula, como es el caso del penÃƒÂºltimo tema, que lo tenÃƒÂ©is abajo para escuchar.\nQuizÃƒÂ¡s los mÃƒÂ¡s puristas del postrock renieguen de este disco por el hecho de contener electrÃƒÂ³nica, pero es justo por la electrÃƒÂ³nica por lo que este trabajo destaca, porque sino serÃƒÂ­a simplemente un disco mÃƒÂ¡s de postrock. SeguirÃƒÂ­a siendo bastante bueno, de eso no hay duda, pero no estarÃƒÂ­a al nivel que estÃƒÂ¡ ahora, al menos para mÃƒÂ­. A diferencia de lo que suele ser el postrock, suena alegre y colorido, y aunque no sea tan profundo o tan penetrante como otros discos del gÃƒÂ©nero, en ningÃƒÂºn momento suena aburrido ni repetitivo.","torrent":{"xt":"urn:btih:10604dddce3bc6b351b416b654d6fd96a70b9156","amp;dn":"Maybeshewill+-+Not+For+Want+Of+Trying+%5Bragontheroad.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"10604dddce3bc6b351b416b654d6fd96a70b9156","infoHashBuffer":{"type":"Buffer","data":[16,96,77,221,206,59,198,179,81,180,22,182,84,214,253,150,167,11,145,86]},"announce":[],"urlList":[]}}