{"title":"DmC-Devil May Cry 5-32play.iso","uid":11789730,"size":3737909248,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:11555761e0dadcaf3272bee5d6b6239ee756005e&amp;dn=DmC-Devil+May+Cry+5-32play.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"globeplus","files":1,"time":1427894266,"description":"Hi to all the Devil May Cry fans and enjoy the 5th installment of the games series with a nice installer and great compression work , fully game available in english ...\n\n\nGAMEPLAY\n\n\nPlayers take on the role of Dante as he uses his powers and weaponry to fight against enemies and navigate the treacherous Limbo. Like previous games in the series, Dante can perform combos by attacking with his sword, Rebellion, and shooting with his twin pistols, Ebony and Ivory. New to the series are modifiers to Dante's moveset, known as Angel Mode and Devil Mode, activated by holding down one of the trigger buttons. When in Angel mode, Dante's sword attacks change to the Osiris, a speedy scythe type weapon, whilst Devil mode uses the slower but more powerful Arbiter. These modes also alter Dante's mobility. Using Angel mode allows Dante to pull himself towards enemies and various points in each level, whilst Devil mode lets Dante pull enemies and objects towards him. Dante is also able to dash across large gaps in Angel mode. All of these moves can be used in conjunction with each other to perform massive combos, which are ranked based on the damage the player makes. When enough power has been gathered, Dante can activate Devil Trigger mode, which slows down time around him and levitates enemies into the air, allowing him to perform much stronger attacks. Like previous games, Dante can collect various types of souls which can be used to recover health, purchase items and upgrade Dante's moveset.\n\n\n\n* enjoy","torrent":{"xt":"urn:btih:11555761e0dadcaf3272bee5d6b6239ee756005e","amp;dn":"DmC-Devil+May+Cry+5-32play.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11555761e0dadcaf3272bee5d6b6239ee756005e","infoHashBuffer":{"type":"Buffer","data":[17,85,87,97,224,218,220,175,50,114,190,229,214,182,35,158,231,86,0,94]},"announce":[],"urlList":[]}}