{"title":"John Coltrane - Blue Train (1957) [Jazz][mp3 320][schon55]","uid":5781095,"size":145002424,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:1180465ff56120e0a3fa2ee06df10a4ca1732251&amp;dn=John+Coltrane+-+Blue+Train+%281957%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"schon55","files":11,"time":1282408508,"description":"John Coltrane - Blue Train \nAudio CD: October 25, 1990 \nLabel: Blue Note Records \nQuality: mp3 320 CBR\n\nMention the name &quot; Coltrane &quot; in Jazz circles and you're bound to receive a response whose admiration borders on an almost religious style worship. Other than Miles there's simply no one in this remarkable field of Music that has obtained such an incredibly strong, passionate and loyal following as that of John Coltrane. While long considered to be the intellectuals ( I dislike that word but.... ) 'favorite son' in a style of music that is chock-full of 'thinking' musicians Coltrane simply possess a unique position, where virtually he alone resides, all the while composing music that eventually would lead him on a quest where his soulful playing obtained an artistic level that was not only incredibly personal but certainly sought a deeply spiritual meaning as well. And while I won't pretend to understand the almost religious fervor that some friends have for this artist I will state that I do have a great deal of respect for John Coltrane....for the man and the musician as well. And listening to &quot; Blue Train &quot; might help explain why this tenor saxophonist is regarded in such high esteem. \nWhile long being regarded a 'searching' musician, Coltrane and bandmates recorded &quot; Blue Train &quot;, his only Blue Note release, on Sept. 15, 1957. Obviously being well-rehearsed, the title track, an eerie blues selection, is Lee Morgan's real chance to shine. After the intial melody Lee's trumpet makes an energetic statement, followed closely by Curtis Fuller on trombone, and everything here runs extremely 'Hot and Cool'. Plus after 10 odd minutes the listener may be already exhausted, to say nothing of in awe of this bands performance. Following up with &quot; Moment's Notice &quot;, my personal favorite, another fast-paced tune with solo's by Coltrane, Fuller, Morgan and even a bowed bass performance by Paul Chambers, and you'll be amazed at how 'happy' even Coltrane can sound when composing. The ballad &quot; I'm Old-Fashioned &quot;, the only selection not written by him, is a perenial favorite as well, played softly and gently it's a wonderful contrast to the energetic playing that fills up the rest of this remarkable cd. But than again.... I've always been preferential to Ballads anyway! Closing with &quot; Lazy Bird &quot; with a wonderful piano intro by Kenny Drew, and following with solos by Coltrane, Fuller and Paul Chambers ( again using the bow ) and with Lee Morgan ending this track while Coltrane and Curtis ride out the theme. Even I, with my 'tin ear' understood after my very first listen that what I was hearing was a disc filled with songs that were performed by musicians who were not only ultimately honest about their music but incredibly passionate as well. And while I wasn't ready to 'bow to the alter of Coltrane' just yet I was completely enthralled by my purchase. \n\nAll in all &quot; Blue Train &quot; is remarkable in the sense that while the music being performed here is extremely free in it's origins it never lose's that sense of control that many jazz cd's, at least for me, seem to be guilty of when letting musicians endlessly 'wander' when soloing. Everything here, individually and collectively, works simply due to the players musical maturity in relating with one another and in each participant understanding his part in these wonderful tracks. And while it's true that in later years Coltrane took his music to a level where I could not join him ( I'm still trying to get through 'A Love Supreme'! ) I do have this incredible disc, plus ' Ballads &quot; and &quot; Giant Steps &quot; to remember not only a quintessential musician but also a man who sought truth and guidance through his music. At hindsight, perhaps my friend's adoration of this inspired tenor saxophonist aren't so completely misguided after all. ~ Douglas Barton &quot;emotions in motion&quot;\n\nPersonnel:\nJohn Coltrane (tenor saxophone)\nLee Morgan (trumpet)\nCurtis Fuller (trombone)\nKenny Drew (piano)\nPaul Chambers (bass)\nPhilly Joe Jones (drums)\n\nJohn Coltrane - Blue Train Tracks:\n01  Blue Train\n02  Moment's Notice\n03  Locomotion\n04  I'm Old Fashioned\n05  Lazy Bird\n06  Blue Train (alternate take)\n07  Lazy Bird (alternate take)","torrent":{"xt":"urn:btih:1180465ff56120e0a3fa2ee06df10a4ca1732251","amp;dn":"John+Coltrane+-+Blue+Train+%281957%29+%5BJazz%5D%5Bmp3+320%5D%5Bschon55%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1180465ff56120e0a3fa2ee06df10a4ca1732251","infoHashBuffer":{"type":"Buffer","data":[17,128,70,95,245,97,32,224,163,250,46,224,109,241,10,76,161,115,34,81]},"announce":[],"urlList":[]}}