{"title":"Designing Democracy: What Constitutions Do prabhu_","uid":11727209,"size":3593046,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:119ba96eedcf1eba0253aa22e46438d6b9e93506&amp;dn=Designing+Democracy%3A+What+Constitutions+Do+prabhu_&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"prabhu_","files":2,"time":1425121826,"description":"Designing Democracy: What Constitutions Do\n\nby Cass R. Sunstein \n\nabout book :-\n\n\n\nSunstein takes the reader on a nuanced but spirited journey across a broad terrain of constitutional issues, from race discrimination to religious rights and presidential impeachment. Designing Democracy is a welcome change from the many books on constitutional law that sink under the weight of hermetic debates about interpretive methods. ...this approach brings a fresh perspective to many of the well-worn but still vital issues of American constitutional debate. (New York Times Book Review)\n\nOne of our finest constitutional thinkers, Cass Sunstein develops here a powerful new understanding of a constitution's purpose and resources. In this important book, Professor Sunstein discusses the way a democratic constitution can turn a nation's political differences, however sharp, into a constructive force. (William Jefferson Clinton, former president of the United States)\n\nA powerful, persuasive critique of the conditions that distort [democratic] deliberation. (Washington Post Bookworld)\n\n\nabout author :-\n\nCass Sunstein is Karl Llewellyn Distinguished Service Professor at the University of Chicago Law School and Department of Political Science. His many books include Republic.com, One Case at a Time: Judicial Minimalism on the Supreme Court, Free Markets and Social Justice, Democracy and the Problem of Free Speech, and The Partial Constitution. He has advised many nations on constitution-making and law reform initiatives, including Ukraine, South Africa, China, Bosnia, Israel, Russia, and Poland. A former law clerk to Justice Thurgood Marshall and a former Attorney-Advisor in the Department of Justice, he has testified before Congress on many issues, including free speech in the media, separation of powers, discriminations against gays in the military, and presidential impeachment. He served on the President's Advisory Committee on the Public Service Obligation of Television Broadcasters and is a frequent contributor to The New Republic and The New York Times Book Review.\n\n\n\n`~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`\n  SEED PLEASE , LET OTHERS GET IT TOO. \n `~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~`","torrent":{"xt":"urn:btih:119ba96eedcf1eba0253aa22e46438d6b9e93506","amp;dn":"Designing+Democracy%3A+What+Constitutions+Do+prabhu_","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"119ba96eedcf1eba0253aa22e46438d6b9e93506","infoHashBuffer":{"type":"Buffer","data":[17,155,169,110,237,207,30,186,2,83,170,34,228,100,56,214,185,233,53,6]},"announce":[],"urlList":[]}}