{"title":"Sir Walter Scott - 6 Novels","uid":9356693,"size":4368929,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:12229cf77c2732a92e0724055cde76ad85675dcf&amp;dn=Sir+Walter+Scott+-+6+Novels&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1387225793,"description":"Sir Walter Scott, 1st Baronet, FRSE was a Scottish historical novelist, playwright, and poet, popular throughout much of the world in the 19th century.\n\nIvanhoe\n&quot;Ivanhoe&quot; (1819) was the first of Scott's novels to adopt a purely English subject and was also his first attempt to combine history and romance, which later influenced Victorian medievalism. Set at the time of the Norman Conquest, &quot;Ivanhoe&quot; returns from the Crusades to claim his inheritance and the love of Rowena and becomes involved in the struggle between Richard Coeur de Lion and his Norman brother John. The gripping narrative is structured by a series of conflicts: Saxon versus Norman, Christian versus Jew, men versus women, played out against Scott's unflinching moral realism.\n\nRob Roy\nRob Roy is a historical novel by Walter Scott. It is narrated by Frank Osbaldistone, the son of an English merchant who travels first to the North of England, and subsequently to the Scottish Highlands, to collect a debt stolen from his father.\n\nLetters on Demonology and Witchcraft \nLetters on Demonology and Witchcraft by Sir Walter Scott [1885]. This book by the 19th Century novelist covers much of the same evidence as Murry (albeit in a more popular style). Scott draws few conclusions other than that our ancestors were extremely superstitious.\n\nThe Abbot\nThe Abbot (1820) is a historical novel by Sir Walter Scott. A sequel to The Monastery, it is one of Scott's Tales from Benedictine Sources and is set in the time of Mary, Queen of Scots. The story follows the fortunes of certain characters Scott introduced in The Monastery, but it also introduces new characters such as Roland Graeme.\n\nThe Pirate\nThe Pirate is a novel by Walter Scott, based roughly on the life of John Gow who features as Captain Cleveland. The setting is the southern tip of the main island of Shetland, around 1700.\n\nThe Bride of Lammermoor \nThe Bride of Lammermoor is a historical novel by Sir Walter Scott, published in 1819. The novel is set in the Lammermuir Hills of south-east Scotland, and tells of a tragic love affair between young Lucy Ashton and her family's enemy Edgar Ravenswood. Scott indicated the plot was based on an actual incident.","torrent":{"xt":"urn:btih:12229cf77c2732a92e0724055cde76ad85675dcf","amp;dn":"Sir+Walter+Scott+-+6+Novels","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12229cf77c2732a92e0724055cde76ad85675dcf","infoHashBuffer":{"type":"Buffer","data":[18,34,156,247,124,39,50,169,46,7,36,5,92,222,118,173,133,103,93,207]},"announce":[],"urlList":[]}}