{"title":"Highlander (00 - 12 + Extras) (2006 - 2008)","uid":10926237,"size":401579314,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:125af8d9cf3a72ec3950b6b9c16f2883045735c2&amp;dn=Highlander+%2800+-+12+%2B+Extras%29+%282006+-+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"nemesis43","files":19,"time":1409367504,"description":"Highlander (00 - 12 + Extras) (2006 - 2008) \n\nAlso includes the 4 issue mini-series Highlander - Way of the Sword and the two-part mini Highlander Origins - Kurgan.\n\n\nHighlander 00 - 12\n\nLimited series written by Brandon Jerwa and Michael Avon Oeming that focuses on the events that take place shortly after the first film, Highlander (1996), and continue the tales of the Immortal Highlander Connor MacLeod.\n\nNarrative (by Juan Sanchez Villa-Lobos Ramirez): &quot;From the dawn of time we came, moving silently down through the centuries. Living many secret lives, struggling to reach the time of the gathering, when the few who remain will battle to the last. No one has ever known we were among you.....until now.&quot;\n\n\nWay of the Sword 01 - 04\n\nHighlander: Way of the Sword is a four-part mini-series written by J.T. Krul with illustrations from Carlos Rafael spinning off the Highlander volume that was written by Brandon Jerwa and Michael Avon Oeming. All four issues feature connecting covers by Jean Diaz.\n\nThe story follows Connor MacLeod on his search for the lost sword of his mentor Ramirez that sends him through different time lines and lets him face his arch-enemy The Kurgan.\n\n\nHighlander Origins - Kurgan 01 - 02\n\nHighlander Origins: The Kurgan is a special two-issue mini-series focusing on The Kurgan's childhood and upbringing and how he became Connor MacLeod's most fearful enemy; written by Brandon Jerwa (Highlander).\n\n","torrent":{"xt":"urn:btih:125af8d9cf3a72ec3950b6b9c16f2883045735c2","amp;dn":"Highlander+%2800+-+12+%2B+Extras%29+%282006+-+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"125af8d9cf3a72ec3950b6b9c16f2883045735c2","infoHashBuffer":{"type":"Buffer","data":[18,90,248,217,207,58,114,236,57,80,182,185,193,111,40,131,4,87,53,194]},"announce":[],"urlList":[]}}