{"title":"The Hidden Game of Baseball - 3rd Edition (2015).pdf Gooner","uid":12787323,"size":80459313,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:13c8c88ebf9c0ca6e15c723d07f82ea74c947407&amp;dn=The+Hidden+Game+of+Baseball+-+3rd+Edition+%282015%29.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1447878600,"description":"The Hidden Game of Baseball - A Revolutionary Approach to Baseball and Its Statistics - 3rd Edition (2015).pdf Gooner\r\n\r\nPublisher: University Of Chicago Press; Third Edition, Enlarged edition (March 20, 2015)\r\nLanguage: English\r\nISBN-10: 022624248X\r\nISBN-13: 978-0226242484\r\n\r\nLong before Moneyball became a sensation or Nate Silver turned the knowledge he’d honed on baseball into electoral gold, John Thorn and Pete Palmer were using statistics to shake the foundations of the game. First published in 1984, The Hidden Game of Baseball ushered in the sabermetric revolution by demonstrating that we were thinking about baseball stats—and thus the game itself—all wrong. Instead of praising sluggers for gaudy RBI totals or pitchers for wins, Thorn and Palmer argued in favor of more subtle measurements that correlated much more closely to the ultimate goal: winning baseball games.\r\n            The new gospel promulgated by Thorn and Palmer opened the door for a flood of new questions, such as how a ballpark’s layout helps or hinders offense or whether a strikeout really is worse than another kind of out. Taking questions like these seriously—and backing up the answers with data—launched a new era, showing fans, journalists, scouts, executives, and even players themselves a new, better way to look at the game.\r\n            This brand-new edition retains the body of the original, with its rich, accessible analysis rooted in a deep love of baseball, while adding a new introduction by the authors tracing the book’s influence over the years. A foreword by ESPN’s lead baseball analyst, Keith Law, details The Hidden Game’s central role in the transformation of baseball coverage and team management and shows how teams continue to reap the benefits of Thorn and Palmer’s insights today. Thirty years after its original publication, The Hidden Game is still bringing the high heat—a true classic of baseball literature","torrent":{"xt":"urn:btih:13c8c88ebf9c0ca6e15c723d07f82ea74c947407","amp;dn":"The+Hidden+Game+of+Baseball+-+3rd+Edition+%282015%29.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"13c8c88ebf9c0ca6e15c723d07f82ea74c947407","infoHashBuffer":{"type":"Buffer","data":[19,200,200,142,191,156,12,166,225,92,114,61,7,248,46,167,76,148,116,7]},"announce":[],"urlList":[]}}