{"title":"Diary of an Assassin - Methos, Victor.epub","uid":9150351,"size":273882,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:14fbe12a62cf90ad6ef16d37e8112914f966eaa7&amp;dn=Diary+of+an+Assassin+-+Methos%2C+Victor.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1383680671,"description":"A PROFESSIONAL THAT'S LOST THE DESIRE TO KILL...\n\nTired and sick of a life of violence, hitman Isaac Rhett is ready to retire after one last assignment. But the assignment turns out to be a trap and pits him against the deadliest assassin in the world, Gustav Fabrice. \n\nA MADMAN WITH NO PURPOSE BUT TO DESTROY...\n\nGustav is cunning, ferocious, and insane. Without the inhibitions a person would feel against extreme violence, Gustav is on a rampage with the death of Isaac Rhett as his only goal. A single police officer from Interpol is the only witness to the monster that's been let loose on society and attempts to track him down before Gustav carries out his mission. \n\nA DESPERATE FIGHT FOR SURVIVAL...\n\nRhett's mark turns out to be a congresswoman with no known enemies. Rhett flees with her with Gustav on their heels. But Rhett knows you cannot escape a man like Gustav. At some point, they will have to fight. But there is only one way that Rhett knows to stop Gustav... you must let him kill you first. \n\nAn action-packed thriller that spans the globe, the new novel from Kindle Top 100 bestselling author Victor Methos is sure to keep you on the edge of your seat.\nGenre: Thriller ","torrent":{"xt":"urn:btih:14fbe12a62cf90ad6ef16d37e8112914f966eaa7","amp;dn":"Diary+of+an+Assassin+-+Methos%2C+Victor.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14fbe12a62cf90ad6ef16d37e8112914f966eaa7","infoHashBuffer":{"type":"Buffer","data":[20,251,225,42,98,207,144,173,110,241,109,55,232,17,41,20,249,102,234,167]},"announce":[],"urlList":[]}}