{"title":"Leon Haywood - 1975 - Come And Get Yourself Some [V0]","uid":7108969,"size":63227204,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:158f8c0e4b8820df39327d4157b97cd1546179c5&amp;dn=Leon+Haywood+-+1975+-+Come+And+Get+Yourself+Some+%5BV0%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":-1,"time":1331969428,"description":"Released in 1975, Come and Get Yourself Some boasts one of Leon Haywood's biggest hits: the sexy, alluring &quot;I Want'a Do Something Freaky to You,&quot; which L.A. gangsta rappers Dr. Dre and Snoop Doggy Dogg sampled on their 1993 smash &quot;Nuthin' but a G Thang.&quot; A teen-age hip-hopper of 1993 might not have known the name Leon Haywood -- who is someone the hip-hopper's Baby Boomer parents were more likely to be familiar with -- but he/she no doubt knew Haywood's unforgettable melody from the Dre/Snoop single. Back in 1975, &quot;Freaky&quot; made Come and Get Yourself Some one of Haywood's best selling albums. &quot;Freaky&quot; and the title track were the album's biggest hits, although the rest of the material is also well worth hearing. Smooth, laid-back northern soul items like &quot;Consider the Source&quot; and &quot;This Feeling's Rated Extra&quot; appealed to Haywood's diehard fans, many of whom he had won over with his 1967 hit &quot;It's Got to Be Mellow.&quot; But a tougher, less sleek approach prevails on &quot;Who You Been Giving It up To,&quot; which recalls the Isley Brothers' &quot;It's Your Thing.&quot; ~ Alex Henderson\n\nPersonnel: Leon Haywood (electric piano, organ); David T. Walker, Dean Parks, Tony Drake, Melvin &quot;Wah Wah&quot; Ragin, Ray Parker, Jr., Roland Bautista (guitar); Joe Sample, Larry Nash (piano); Eddie Greene (drums); Joe Clayton, Bobye Hall (congas); Vince Charles (steel drum).\n\nPhotographers: Bob Levy ; Buddy Rosenberg.\n\nRecord Collector (magazine) (p.96) - 3 stars out of 5 -- &quot;It spawned his two big hits: with the funky title track and 'I Want'a Do Something Freaky To You'...&quot;","torrent":{"xt":"urn:btih:158f8c0e4b8820df39327d4157b97cd1546179c5","amp;dn":"Leon+Haywood+-+1975+-+Come+And+Get+Yourself+Some+%5BV0%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"158f8c0e4b8820df39327d4157b97cd1546179c5","infoHashBuffer":{"type":"Buffer","data":[21,143,140,14,75,136,32,223,57,50,125,65,87,185,124,209,84,97,121,197]},"announce":[],"urlList":[]}}