{"title":"ExXxtra Small ~ Gina Gerson ** NEW 25 Feb 2016 ** mp4","uid":13670759,"size":315883983,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:15e418b30cb1709e8b66acfe6e80d5d1f91ba706&amp;dn=ExXxtra+Small+%7E+Gina+Gerson+%2A%2A+NEW+25+Feb+2016+%2A%2A+mp4&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ImgSnaps","files":1,"time":1456318979,"description":"Screenshots:\r\n \nhttp://imgsnaps.com/image/kcB\r\n \nhttp://imgsnaps.com/image/kcJ\r\n \nhttp://imgsnaps.com/image/kcZ\r\n \nhttp://imgsnaps.com/image/kcf\r\n\r\nTeenie tiny teen Gina is here today to show us how Russia makes their ladies. Lucky for us we were in Budapest where she currently resides and we were able to meet up with her. As we spoke to her, she couldnt resist but to start touching her tight twat right in front of the camera. This frail little thing is coming in at 5ft 2in (160cm) and 88lbs (40kg). Once this little Siberian sex pot gets settled in, she starts to take off the almost insignificant garments she brought along and we see her sweet, tiny, little tits and tight curves. Lots of touching and sucking goes on here, with her little moans of acceptance happen as fingers enter her tight spaces. They start to fuck, making his massive dick disappear into her small openings. He continues to plow her, eventually throwing her onto the bed, and gives it to her missionary like she wanted. This little thing just has orgasm one after the other, until she milks his big american dick all over her hands and lips.\r\nTags:\r\n18, 18 Year, Adorable, Amateur, Bed, Bedroom, Big Dicks, BJ, Blowjob, Brunette, Casual, Caucasian, Coed, Completely Naked, Conservative, Cute, Deepthroat, Doggystyle, Fingering, Fondling, Girl Next Door, Handjob, Hardcore, Hispanic, Indoor, Innocent, Jeans, Latin, Latina, Long Hair, Missionary, Natural Tits, Nerd, Nerdy, No Condom, Passive, Petite, Pornstar, Rough Sex, Schoolgirl, Sexy, Shaved Pussy, Short, Shy, Skinny, Slim, Spanish, Student, Swallow, Teen, Tiny, White","torrent":{"xt":"urn:btih:15e418b30cb1709e8b66acfe6e80d5d1f91ba706","amp;dn":"ExXxtra+Small+%7E+Gina+Gerson+%2A%2A+NEW+25+Feb+2016+%2A%2A+mp4","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"15e418b30cb1709e8b66acfe6e80d5d1f91ba706","infoHashBuffer":{"type":"Buffer","data":[21,228,24,179,12,177,112,158,139,102,172,254,110,128,213,209,249,27,167,6]},"announce":[],"urlList":[]}}