{"title":"Toshiaki Toyoda - Kuchu Teien AKA Hanging Garden (2005)","uid":4768661,"size":1564465303,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1651b8e6be2c4da4fb0289494b67c2c9b09605ed&amp;dn=Toshiaki+Toyoda+-+Kuchu+Teien+AKA+Hanging+Garden+%282005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1236964401,"description":"Toshiaki Toyoda - Kuchu Teien AKA Hanging Garden (2005)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0460845/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0460845/&lt;/a&gt;\n\nLanguage\tJapanese\nSubtitles\tincluded: English\n &lt;a href=&quot;\nhttp://img230.imageshack.us/img230/331/kuchucoverdu0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img230.imageshack.us/img230/331/kuchucoverdu0.jpg&lt;/a&gt;\n\n[quote]In 2001, Toshiaki Toyoda adapted the juvenile delinquent manga Blue Spring into an irreverent film about how young men maintain secret lives away from the prying eyes of authority. His 2005 feature, Kuchu teien (Hanging Garden), tackles similar themes, but the approach is more head-on and the target is the modern Japanese family.\n\nThis time adapting a novel by Mitsuyo Kakuta, Toyoda's Kuchu teien is the story of Eriko Kyobashi (Kyoko Koizumi), mother of two. The scene opens at the Kyobashi breakfast table. It's daughter Mana's birthday, and Mana (Anne Suzuki, Initial D) wants to know where she was conceived. While this would be strange conversation for most families, the Kyobashi clan swears to keep no secrets from one another. Mana, as it turns out, was made by her parents at a &quot;love motel&quot; called Wild Monkeys. This, of course, opens a whole can of worms for Mana, who isn't as pleased with the information as she hoped to be. Toyoda's camera pulls away from the scene, spinning and tumbling through the apartment, showing us details, exposing the corners of the Kyobashi home, while also inducing the sense of euphoria all of the secrets and lies are creating. Such is the nature of Kuchu teien: everything is off-kilter; truth has been spun on its head. Of course the family has secrets they aren't sharing! To claim they don't is to create the biggest secret of all.\n\nThus begins a quirky drama that plays out like a Japanese answer to The Squid and the Whale, where the wrong things are revealed and too much pain is left hidden. The interactions of the family are almost like a game of cat and mouse. While out on one of his infidelities, for instance, the father, Takashi (Itsuji Itao), nearly runs into his son, Ko (Mashiro Hirota). The boy is shadowing his father's movements, whether he knows it or not, leading him to take on one of his old man's mistresses, Mina (Sonim), as a tutor. Similarly, father's trysts lead him to the Wild Monkeys, where Mana is next door trying to recapture her own birth energy with inadequate teenage boys. Mana also openly spies on her mother, following Eriko to a rendezvous with a co-worker whom her lies have gotten fired.\n\nOn these little missions, very little is revealed about what any of the Kyobashies discover. That would be breaking the rules of the game. Eriko is the center of these charades, having been the one who invented them. In fact, her biggest secret is that Mana wasn't a mistake, she tricked Takashi into starting a family. Having a perfect family is a sort of obsession for Eriko, and as her son informs her midway through Kuchu teien, obsessions are bad things because they lead to our divorcing ourselves from reality. Eriko is as off-kilter as Toyoda's camera, and often the two collide when Eriko digs back into her memory or the image literally breaks down to unleash one of her violent fantasies. Eriko's fixation on secrets goes back to her mother, Sacchin (Asami Imajuku), whom Eriko feels deprived her of the family experience the younger woman is now trying to create. Ironically, it will be both the grandmother and the mistress, the two outsiders to the core four, that expose the pretense. Mina will stand as the symbol of the unsaid, and Sacchin will provide the solution. Old age has taught her that memories can be re-written, that one can dismantle experience and start over. The central question for both mother and daughter is whether or not the rewrites have already happened. Perhaps everything was not as bad as it seemed, and the true flaw of their life together is misremembering.\n\nToyoda's world is a fascinating one to watch, full of ever-shifting facades and stuttering denials. He guides his actors through his various parallels, encouraging them to reveal more through facial expressions and body language than the dialogue they speak. He also crafts a rather beautiful world, full of wonderful color and interesting locales. Most of the action centers around the apartment, the Wild Monkeys motel, or the aptly named Discovery Mall, creating a space that is as confining for the characters as their own social mores. The vertigo effect he creates is fabulous, and there are moments of visual brilliance throughout, such as Mina's escape from the routine or Eriko's final flight of fantasy.\n\nAt one point, Eriko defends herself by saying, &quot;If you stick to your story, it stops being a lie.&quot; Kuchu teien supports this assertion, while clarifying that it's also important to understand your story. If you're going to live a lie, you have to make sure it's the right one. In a weird way, those falsehoods are the family ties that bind. When Takashi's alleged perversions are exposed, he asks his daughter if he'd have put up with everything the Kyobashi clan has to contend with if, when it's all said and done, he didn't love them. He may have fibbed, but he did it to keep them together, and in the end, that is key to their triumph as a unit.[/quote] \n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg1.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg1.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg2.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg2.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg3.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg4.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg4.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg5.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i672.photobucket.com/albums/vv90/tau-tau_the-egyptian-mau/hg5.png&lt;/a&gt;\n\n----------my rip--------\n\n~~~~~~ Kuuchuu Teien.avi ~~~~~~                                     \n                                                               \nFile Size (in bytes):...........................1,561,817,088                     \n                                                                                \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:53:31                \nFrame Count:....................................163292             \nFrame Width (pixels):...........................704                  \nFrame Height (pixels):..........................384                  \nAspect Ratio:...................................1.833                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1633                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.252&quot;                     \n                                                                                \n--- Audio Information ---                                                       \nAudio Codec:....................................0x0055 MPEG-1 Layer 3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................2           \n\n\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE \n","torrent":{"xt":"urn:btih:1651b8e6be2c4da4fb0289494b67c2c9b09605ed","amp;dn":"Toshiaki+Toyoda+-+Kuchu+Teien+AKA+Hanging+Garden+%282005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1651b8e6be2c4da4fb0289494b67c2c9b09605ed","infoHashBuffer":{"type":"Buffer","data":[22,81,184,230,190,44,77,164,251,2,137,73,75,103,194,201,176,150,5,237]},"announce":[],"urlList":[]}}