{"title":"Classic XXX - Nasse Katzen [1979] - German","uid":4828782,"size":655409152,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1665e99961dc0aa252f52fc53709632798f92e18&amp;dn=Classic+XXX+-+Nasse+Katzen+%5B1979%5D+-+German&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pure_screens","files":1,"time":1239050226,"description":"Nasse Katzen\n\n\n\n\nscreens:\n &lt;a href=&quot;\nhttp://x4xx.blogbugs.org/8298404/Nasse-Katzen---screens.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://x4xx.blogbugs.org/8298404/Nasse-Katzen---screens.html&lt;/a&gt;\n\n\n\n\n\n\nSynopsis [German]:\n\nEigentlich ist Familie Frisch eine ganz normale Familie oder etwa nicht?\n\nTÃƒÂ¶chterchen Gabi kommt immer zu spÃƒÂ¤t zum Unterricht, weil sie die ganze Zeit nur an Sex denkt und das natÃƒÂ¼rlich auch auslebt. doch in der Schule bleibt auch kein Schlitz trocken.\nDer Lehrer fickt die Direktorin und dafÃƒÂ¼r muss er natÃƒÂ¼rlich spÃƒÂ¤ter auch bei den interressierten SchÃƒÂ¼lerinnen herhalten. Auch Gabis Vater, Karl, verbringt seine Zeit nicht nur mit Schachspielen. Gertrude, Gabis Mutter, kann es nicht mal fÃƒÂ¼nf Minuten ohne Schwanz aushalten und verfÃƒÂ¼hrt spontan den Koch in einem Restaurant.\n\n\n\nSynopsis [English]:\n\nThe film is about a day in the life of the Frisch family. The daughter is late for school, and gets detention in the afternoon. There, she and a girlfriend seduce their teacher. Father Frisch (played by Herbert Warnke) has a game of chess with a friend where the prize is a brunette. In the evening, Frisch and his wife (Juditha Arlou) go to a restaurant. While he is imagining various female guests in sexual activities, his wife is off to the kitchen for a quickie with the chef.\n\n\nThe Frisch family takes breakfast (well, the daughter actually doesn't, as she is late for school).\n\nAt school:\n\n* The girls tease their Maths professor, who doesn't initially succumb.\n* The Frisch daughter narrates to her schoolmates the story of her sexual encounter with a chauffeur (a guy with a moustache).\n* The girls watch through a door the Maths Professor fucking the school's headmistress.\n* The Frisch daughter and XNK1772 seduce the Maths Professor who fucks both of them.\n\nHerr Frisch visits a friend (played by the same blond actor with the wig, who starred as Sylvia Engelmann's father in HeiÃƒÅ¸e Schnecken):\n\n* The two men play chess, and the friend of Herr Frisch promises him a big surprise for the winner.\n* Uncredited actress (playing an androgynous-looking maid) rubs XNK2548 in the bathroom and has a lesbian scene with her.\n* Herr Frisch wins the chess game and the androgynous-looking maid brings him his present, a brunette, with whom he has sex.\n* At the same time, the other guy (the blond host with the wig) fucks the first (lesbian) couple in the bathroom.\n\nAt the sauna:\n\n* Two girls (XNK2787 and XNK4617) visit the sauna and are courted by its manager (a sleazy looking dark-haired, relatively old guy).\n* The Frisch daughter visits the sauna and fantasizes about having sex with the guy from scene 1 (the chauffeur) on some kind of oval swing.\n* She then watches the other girls engaged in some lesbian foreplay in the sauna's pool. She joins in.\n* The two girls (without the Frisch daughter) have sex in the sauna with the manager.\n\nAt the restaurant:\n\n* The Frisch couple enjoy their dinner.\n* Herr Frisch fantasizes about the restaurant's female guests being involved in various sex activities, mostly masturbation stuff etc (I think one of them is probably XNK2787 or could she be one of the above mentionned girls? Maybe one of the daughter's schoolmates, who doesn't get fucked in this film).\n* Frau Frisch (Juditha Arlou) is off to the kitchen for a quicky with the chef (a well built redheaded guy with a moustache).\n\nThe film ends with an exact repetition of the first scene (the couple having their breakfast, the daughter being late for school, etc.).\n\n\n\n\n\n\nAlternate Titles\n\n    * Chaudes EcoliÃƒÂ¨res Alpha [France]\n    * Sexschule fÃƒÂ¼r liebestolle TÃƒÂ¶chter\n\nActresses\n\n    * Juditha Arlou plays Frau Frisch\n\n\n\nReleased: \tc. 1979\nDirector: \tFrank Hover (Jan Apfeld)\nCountry: \tGerman \nDuration:       01:20:52\nVideo:          DivX 6 720x576 25.00fps 1006Kbps\nAudio:          MPEG Audio Layer 3 22050Hz stereo 64Kbps \n\n\n\n\n\n\n.\n","torrent":{"xt":"urn:btih:1665e99961dc0aa252f52fc53709632798f92e18","amp;dn":"Classic+XXX+-+Nasse+Katzen+%5B1979%5D+-+German","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1665e99961dc0aa252f52fc53709632798f92e18","infoHashBuffer":{"type":"Buffer","data":[22,101,233,153,97,220,10,162,82,245,47,197,55,9,99,39,152,249,46,24]},"announce":[],"urlList":[]}}