{"title":"No Way Back by Matthew Klein","uid":10096220,"size":637695,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:168c0fe42e6147d1e298ede56630b336faed9398&amp;dn=No+Way+Back+by+Matthew+Klein&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1399302309,"description":"\nThey know everything. They control everyone. Even you\n\nJimmy Thane knows all about crossroads. Every time he's faced with one he's taken the wrong path. At the peak of his career, he chose alcohol. When his job became shaky, he turned to drugs. \n\nAnd when his wife lost faith in him, he turned to other women. Now, Jimmy's clean, and he's at a new crossroad: he's landed the job of a CEO at a failing company in South Florida and has seven weeks to turn it around. Except, from the moment he enters the building, he senses there's something very wrong--the place is too quiet, too empty.\n\nWhen the police come calling about the disappearance of the former CEO, Jimmy begins to wonder what he got himself into.Then he discovers surveillance equipment in his neighbor's house, looking straight into his living room. And he begins to notice that his wife isn't just tired, she's terrified, and trying to hide it.\n\nNothing is as it seems. Jimmy no longer feels like he's living the dream. Instead, he's plunged into the worst kind of nightmare there is. And when he finally gets to the truth, it's more shocking and terrifying than could be imagined.\n\nGenre: Thriller ","torrent":{"xt":"urn:btih:168c0fe42e6147d1e298ede56630b336faed9398","amp;dn":"No+Way+Back+by+Matthew+Klein","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"168c0fe42e6147d1e298ede56630b336faed9398","infoHashBuffer":{"type":"Buffer","data":[22,140,15,228,46,97,71,209,226,152,237,229,102,48,179,54,250,237,147,152]},"announce":[],"urlList":[]}}