{"title":"Guide to remove BIOS CMOS password of Acer computer","uid":4242275,"size":572508,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:16f2e0a7521a0d9f8a40a309d2f79c35272c3092&amp;dn=Guide+to+remove+BIOS+CMOS+password+of+Acer+computer+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thuvn205","files":3,"time":1213614417,"description":"BIOS password remove alternatives:\n\n1. Reset Password BIOS CMOS via Backdoor BIOS Password.\n2. Reset Password BIOS CMOS via Software.\n3. Reset Password BIOS CMOS via hardware.\n4. Reset Password BIOS CMOS via default manufacturers.\n\n\nOK, here is my guide to Remove Acer Bios CMOS password computer via Software. This has been done on testing machine Laptop Acer Aspire 3620/ Travel Mate 2420. Anyway, I&amp;#039;m not sure it will work on every Acer PC/Laptop so just consider to do at your own risk, I?m not responsible for any damages caused by this guide. \n\nAs we know most of Acer computer (Laptop &amp; Desktop) allow us to setup BIOS CMOS in Microsoft Windows (9x/XP/Vista) environment. Great, this is the powerful that help us to remove the BIOS password cuz all we know if we enter Setup Utility at the  boot time we have only three times of filling the password and if all wrong then the system will halt. :(\n\nThe program helps us to enter Acer BIOS setup in Microsoft Windows is ?Acer eSettings Management? which comes with the CD when we buy Acer PC/Laptop. If you lost the CD then just come to Acer website to download the program.\n\n\nBefore you can install ?Acer eSettings Management? you have to install program called: ?Acer Empowering Technology? so you?d better to download both of them from Acer website and install &amp; restart your computer to be ready for the job. Here is the link of Acer website, just come there and sellect right series/model of your computer to download these programs:\n\n[code]ftp://ftp.support.acer-euro.com[/code]\n\nor\n\n[code]ftp://ftp.work.acer-euro.com[/code]\n\n\nAnother one program is also very important we will need called: ?CmosPwd? - CmosPwd is a cmos/bios password recovery tool. CmosPwd is under GNU Public License. You can freely distribute it. It can be compiled under Dos, Windows, Linux, FreeBSD and NetBSD. \n\nDownload it here:\n\n[code]http://www.cgsecurity.org/cmospwd-5.0.zip[/code]\n\nGuide to install CmosPwd and remove password:\n\n1. Download &amp; extract to a folder. I put it in drive D like this: d: cmos\n2. To work on cmos memory, ioperm need to be installed and running. ioperm gives direct port I/O access for specified ports to user-mode process (ring 3) using Ke386SetIoAccessMap and Ke386IoSetAccessProcess kernel functions.\n\nLog on to Windows as Administrator priviledges and do as follow: (see picture): \n\na. Click Start--&gt;Run: type CMD hit Enter on your keyboard. \nb. now us the CD command of Dos to come to d:cmoswindows. (here is: d: hit enter; cd cmos hit enter; cd windows hit enter).\nc. when you are already in d:cmoswindows in drive D then: type ?ioperm.exe ?i? hit enter.\nd. to start ioperm service: type ?net start ioperm? hit enter.\ne. ok, type: ?Cmospwd_win.exe /k? hit enter, we will see:\n\n1 - Kill cmos\n2 - Kill cmos (try to keep date and time)\n0 - Abort\nChoice :\n\nType 1 and hit Enter to clear cmos.\n\n\n\nf. run the Acer eSettings Management program: start--&gt;program--&gt;Acer Empower Technology--&gt;Acer eSettings Management.\n\n\ng. now come to the: Bios Password to see: if you still see password enable, that means we fail but if we see they are Disable so we are done. Remember if we success remove password then we have to create a password for it and then remove it and click Apply to save to cmos memory. This is very important because sometimes we see it Disable but when reboot the computer they are Enable again cuz the password is still in the Eprom and we only clear CMOS settings and make them to default settings so never give up this step.\n\n\n\nThat?s all, good luck &amp; don?t forget to set an easy password later.  :)\n","torrent":{"xt":"urn:btih:16f2e0a7521a0d9f8a40a309d2f79c35272c3092","amp;dn":"Guide+to+remove+BIOS+CMOS+password+of+Acer+computer+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16f2e0a7521a0d9f8a40a309d2f79c35272c3092","infoHashBuffer":{"type":"Buffer","data":[22,242,224,167,82,26,13,159,138,64,163,9,210,247,156,53,39,44,48,146]},"announce":[],"urlList":[]}}