{"title":"Anger Management Season 2 - COMPLETE 720p x264 [MKV, AC3,5.1] Eh","uid":8770701,"size":6711110845,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:17132856e7453a9c01eb95e34d3e87d7aee86235&amp;dn=Anger+Management+Season+2+-+COMPLETE+720p+x264+%5BMKV%2C+AC3%2C5.1%5D+Eh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Ehhhhtozebec","files":-1,"time":1375404919,"description":"\nIn Anger Management, Sheen stars as &quot;Charlie,&quot; a non-traditional therapist specializing in anger management. He has a successful private practice, holding sessions with his group of primary patients each week, as well as performing pro-bono counseling for an inmate group at a state prison. Prior to his career as a therapist, Charlie was a stalled minor league baseball prospect whose road to the majors was sidetracked by his own struggle with anger issues. After a stint in anger management therapy, he made it to the majors and had one terrific season before his anger issues put him on the shelf for good. In the final game of his career, he tried to snap a bat over his leg, which resulted in a career-ending injury. That injury led him back to school and to his current profession. Charlie thrives on the chaos in his life while still battling his own anger issues. His life is complicated by his relationships with his own therapist/best friend, an ex-wife whose positive outlook but poor choice in men frustrates Charlie, and their 13-year-old daughter who has obsessive-compulsive disorder.\n\nCast\nMain\n\nCharlie Sheen as Charlie Goodson, a former professional baseball player whose career ended when he broke a bat over his knee in\nanger, inspiring him to become an anger management therapist\nSelma Blair as Dr. Kate Wales, Charlie's ex therapist-colleague and friend with benefits\nShawnee Smith as Jennifer Goodson, Charlie's ex-wife\nDaniela Bobadilla as Sam Goodson, Charlie's teenage daughter\nNoureen DeWulf as Lacey, Charlie's anger management patient\nMichael Arden as Patrick, Charlie's anger management patient\nDerek Richardson as Nolan, Charlie's anger management patient\nBarry Corbin as Ed, Charlie's anger management patient\nBrian Austin Green as Sean, Charlie's nemesis\n\nRecurring\n\nBrett Butler as Brett, the bartender at a tavern Charlie frequents.\nMichael Boatman as Michael, Charlie's neighbor and friend.\nJames Black as Cleo/Derek, a &quot;gay&quot; member of Charlie's prison anger therapy group. In &quot;Charlie's Patient Gets Out of Jail&quot;, Cleo is\nreleased on parole and reveals to Charlie that his real name is Derek and that he had a wife before going to prison, claiming\nhe's only &quot;prison gay&quot;.\nDarius McCrary as Donovan, a gay member of Charlie's prison anger therapy group and Cleo/Derek's domestic partner.\nStephen Taylor as Wayne, a member of Charlie's prison anger therapy group.\nAldo Gonzalez as Ernesto, a member of Charlie's prison anger therapy group.\nKatlin Mastandrea as Olivia, Sam's best friend.\nMartin Sheen as Martin Goodson, Charlie's hyper-critical father.\n","torrent":{"xt":"urn:btih:17132856e7453a9c01eb95e34d3e87d7aee86235","amp;dn":"Anger+Management+Season+2+-+COMPLETE+720p+x264+%5BMKV%2C+AC3%2C5.1%5D+Eh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"17132856e7453a9c01eb95e34d3e87d7aee86235","infoHashBuffer":{"type":"Buffer","data":[23,19,40,86,231,69,58,156,1,235,149,227,77,62,135,215,174,232,98,53]},"announce":[],"urlList":[]}}