{"title":"The Fat Tail The Power of Political by Ian Bremmer","uid":9412479,"size":1079152,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1741c8d6c0f5596b925117f85f531d7b5a3338d6&amp;dn=The+Fat+Tail+The+Power+of+Political+by+Ian+Bremmer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"420weedman","files":-1,"time":1388338917,"description":"As Ian Bremmer and Preston Keat reveal in this innovative book, volatile political events such as the 2008 Georgia-Russia confrontation--and their catastrophic effects on business--happen much more frequently than investors imagine. On the curve that charts both the frequency of these events and the power of their impact, the &quot;tail&quot; of extreme political instability is not reassuringly thin but dangerously fat.\nFeaturing a new Foreward that accounts for the cataclysmic effects of the 2008 financial crisis, The Fat Tail is the first book to both identify the wide range of political risks that global firms face and show investors how to effectively manage them. Written by two of the world's leading figures in political risk management, it reveals that while the world remains exceedingly risky for businesses, it is by no means incomprehensible. Political risk is unpredictable, but it is easier to analyze and manage than most people think. Applying the lessons of world history, Bremmer and Keat survey a vast range of contemporary risky situations, from stable markets like the United States or Japan, where politically driven regulation can still dramatically effect business, to more precarious places like Iran, China, Russia, Turkey, Mexico, and Nigeria, where private property is less secure and energy politics sparks constant volatility. The book sheds light on a wide array of political risks--risks that stem from great power rivalries, terrorist groups, government takeover of private property, weak leaders and internal strife, and even the &quot;black swans&quot; that defy prediction. But more importantly, the authors provide a wealth of unique methods, tools, and concepts to help corporations, money managers, and policy makers understand political risk, showing when and how political risk analysis works--and when it does not.","torrent":{"xt":"urn:btih:1741c8d6c0f5596b925117f85f531d7b5a3338d6","amp;dn":"The+Fat+Tail+The+Power+of+Political+by+Ian+Bremmer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1741c8d6c0f5596b925117f85f531d7b5a3338d6","infoHashBuffer":{"type":"Buffer","data":[23,65,200,214,192,245,89,107,146,81,23,248,95,83,29,123,90,51,56,214]},"announce":[],"urlList":[]}}