{"title":"Confessions of an IT Manager","uid":5015433,"size":6199983,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:18a5c225b6602b6cbdc655a19175abc1d997f124&amp;dn=Confessions+of+an+IT+Manager&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BookTurd","files":-1,"time":1248202579,"description":"Author: Phil Factor\nPublisher: Red gate books\nNumber of Pages: 316\nPublished: 2009-04-06\nList price: $12.99\nISBN-10: 1906434190\nISBN-13: 9781906434199\nBook Description:\n\n\nPhil Factor is a legend in his own runtime. Scurrilous, absurd, confessional and scathing by turns, Confessions of an IT Manager targets the idiocy, incompetence and overreach of the IT management industry from vantage point all the way up and down the greasy pole. Phil Factor (real name witheld to protest the guilty) has over 20 years experience in the IT industry, specializing in database-intensive applications. For withering insight into the human weaknesses and farcical levels of ineptitude that bring IT projects to their knees, plus occasional escapes into burnished pastiche and cock-a-leg doggerel there is no funnier, more illuminating commentary on the IT crowd.\n &lt;a href=&quot;\nhttp://www.amazon.co.uk/Confessions-Manager-Phil-Factor/dp/1906434190/ref=sr_1_1?ie=UTF8&amp;qid=1248194953&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Confessions-Manager-Phil-Factor/dp/1906434190/ref=sr_1_1?ie=UTF8&amp;qid=1248194953&amp;sr=8-1&lt;/a&gt;\n\n\n\nThis book is just funny, great and a real eye-opener to what has and is going on in the IT world.\nThe author really has a way with words and a life-time of stories to bring you into the deep, dark and mostly ungoverned world of IT.\nA must for any IT Manager.\n\n  \t\n  \nThis is an hilarious book with some laugh-aloud moments. But, more importantly, it outlines many of the absurdities in IT management. Anyone in charge of an IT department MUST read this book and, hopefully, avoid the pitfalls and pratfalls it amusingly describes.\n\n\n\n  \t\nBe warned, if you act as I did and read this book at work or on the train, you will be the subject of many strange looks, as it is impossible to not laugh out loud. This is a hilarious take on life as an IT Manager. As funny as they are recognisable, each story will undoubtedly keep you entertained. This is definitely worth a read, Phil Factor's experiences of a life in IT are not to be missed.","torrent":{"xt":"urn:btih:18a5c225b6602b6cbdc655a19175abc1d997f124","amp;dn":"Confessions+of+an+IT+Manager","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18a5c225b6602b6cbdc655a19175abc1d997f124","infoHashBuffer":{"type":"Buffer","data":[24,165,194,37,182,96,43,108,189,198,85,161,145,117,171,193,217,151,241,36]},"announce":[],"urlList":[]}}