{"title":"[SoM]Il mio nome ÃƒÂ¨ Remo Williams[DvdRip-Xvid-Ita-Mp3]","uid":5295255,"size":1427779584,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:18b53176b4df849c4e1507f6389fad9f16383579&amp;dn=%5BSoM%5DIl+mio+nome+%C3%83%C2%A8+Remo+Williams%5BDvdRip-Xvid-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"misafor","files":1,"time":1264034361,"description":"\n\n\nMakin, un poliziotto newyorkese in normale pattugliamento, ÃƒÂ¨ vittima di una violenta aggressione notturna da parte di un gruppo di teppisti che lo scaraventano nel fiume con la sua auto. L'indomani si svolgono i funerali. Makin perÃƒÂ² non ÃƒÂ¨ morto. Misteriosamente ripescato da un'organizzazione super segreta agli ordini diretti del Presidente, si sveglia in un letto d'ospedale con un volto nuovo, grazie ad una plastica facciale volta a renderlo irriconoscibile da chicchessia. PerchÃƒÂ©? Vista l'inefficienza della polizia e la corruzione nella CIA e nell'FBI, occorre un organismo ristretto e segretissimo per individuare loschi infiltrati, i quali forniscono all'esercito USA armi che scoppiano fra le mani dei militari, minacciando la sicurezza nazionale. Faccia nuova e nome nuovo, Makin, diventato Remo Williams, viene scelto e poi duramente addestrato da un anziano maestro coreano di arti marziali ai piÃƒÂ¹ spericolati acrobatismi e alle astuzie piÃƒÂ¹ sottili fino a schivare i proiettili, correre sulla sabbia senza lasciar traccia o sulle gettate fresche di cemento senza affondare. Sulla pista di una giovane &quot;maggiore&quot; in gonnella, che ha subodorato la spregiudicata truffa, Remo Williams - sempre assistito dal magico Chium - individuerÃƒÂ  il responsabile della sinistra macchinazione, liberando la patria dal tremendo rischio\n","torrent":{"xt":"urn:btih:18b53176b4df849c4e1507f6389fad9f16383579","amp;dn":"%5BSoM%5DIl+mio+nome+%C3%83%C2%A8+Remo+Williams%5BDvdRip-Xvid-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18b53176b4df849c4e1507f6389fad9f16383579","infoHashBuffer":{"type":"Buffer","data":[24,181,49,118,180,223,132,156,78,21,7,246,56,159,173,159,22,56,53,121]},"announce":[],"urlList":[]}}