{"title":"Doctor Who 2007 Voyage of the Damned [HerMes]","uid":3947886,"size":733794040,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:18fd3c3855f4b90eafae4205c574d9808a99351c&amp;dn=Doctor+Who+2007+Voyage+of+the+Damned+%5BHerMes%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"hermes4040","files":1,"time":1198635470,"description":"Doctor Who 2007 Voyage of the Damned (Christmas Special with Kylie Minogue)\n\nFrom the BBC website:\n(http://www.bbc.co.uk/doctorwho/episodes/2007/votd.shtml)\n\nWritten by - Russell T Davies\nDirector - James Strong\n\nRATINGS:\nOvernight: tba\nFinal: tba\nAudience Appreciation: tba\n\nDID YOU KNOW?:\n\nAs explained in the Children In Need special scene Time Crash, the Titanic collided with the TARDIS because the Doctor left its shields down.\n\nKylie Minogue\\&amp;#039;s performance of Can\\&amp;#039;t Get You Out Of My Head during her 2006/7 Showgirl: The Homecoming tour featured disco versions of the Cybermen joining her on stage.\n\nThe bit where the malfunctioning Host stutters Max/Ma/Max/Max/Max is a nod to 1980\\&amp;#039;s virtual presenter Max Headroom. Max would stutter when the computer program that generated him couldn\\&amp;#039;t render his image fast enough.\n\nJimmy Vee played The Moxx of Balhoon in The End of World, the Space Pig in Aliens of London/Word War III and the Graske in the interactive episode Attack Of The Graske. He\\&amp;#039;s also played the Graske and a baby Slitheen in episodes of The Sarah Jane Adventures.\n\nComposer Murray Gold and arranger Ben Foster both cameo as members of the Titanic\\&amp;#039;s band, along with singer Yamit Mamo.\n\nDuring the location filming for the \\&amp;#039;London\\&amp;#039; scenes, Sixth Doctor actor Colin Baker visited the set as he was in Cardiff that week, performing in a play.\n\nAngels seem to be a recurring theme throughout the new series. The Doctor has been referred to as a Lonely Angel, faced The Weeping Angels and made use of the Master\\&amp;#039;s mesmeric communication network, Archangel.\n\nThe theme tune has been revamped for Voyage Of The Damned. \\&quot;I think I just decided to spruce it up - new drums, new rhythm section, new bass line, new little bit of piano,\\&quot; says Murray Gold. \\&quot;I hope people liked it!\\&quot; Did you spot the little nod to the 1980\\&amp;#039;s Peter Howell version in there?\n\nThere were actually six doctors on the original Titanic, only two of which were lucky enough to survive.\n\nOne unproven theory of why the Titanic sank was that it was too expensive to operate and was deliberately directed into icebergs in order to claim insurance money.\n\nOther theories include a cursed Egyptian Mummy being stored in cargo causing the sinking, the bottle not smashing on its christening and the ship numbers (390904) reversed spell out the word \\&amp;#039;NO POPE\\&amp;#039;... although all these possible causes are no more than spooky fiction. No \\&amp;#039;mummy\\&amp;#039; was on board, White Star didn\\&amp;#039;t \\&amp;#039;christen\\&amp;#039; their vessels and the number of the ship was simply 401.\n\nThe episode is dedicated to the late Verity Lambert, the very first producer of Doctor Who and a legend in the TV industry. Verity died on 22 November 2007, one day before Doctor Who\\&amp;#039;s 44th anniversary.\n\nCLASSIC CONNECTIONS:\n\nThere have been several references to the Doctor and the original Titanic - from pictures of him present at the launch (Rose), denial of any responsibility in its unfortunate fate - and how he survived its sinking by clinging to an iceberg (The End Of The World).\n\nEarth was first referred to by its Gallifreyan name of Sol 3 in The Deadly Assassin. It\\&amp;#039;s in Mutter\\&amp;#039;s Spiral, the Gallifreyan name for the Milky Way.\n\nTalking of Gallifreyan names, Voyage Of The Damned marks the first time in the new series that the Doctor has referred to Gallifrey being in the constellation of Kasterborous.\n\nOlder viewers may recall that another race of mechanical men with a habit of chanting \\&quot;Kill, kill, kill\\&quot; and getting their hands stuck in doors appeared in the Fourth Doctor adventure The Robots Of Death.\n\nSeveral of the cast of Voyage Of The Damned have appeared in Classic Doctor Who adventures. Bernard Cribbins played policeman Tom Campbell in the 1965 film Daleks: Invasion Earth 2150 AD. Clive Swift played Jobel in the 1985 adventure Revelation of the Daleks. Geoffrey Palmer previously appeared in The Mutants and Doctor who and Silurians. He\\&amp;#039;s also the father of Charles Palmer - director of Doctor Who adventures Smith and Jones, The Shakespeare Code, Human Nature and The Family of Blood. Jessica Martin, who voiced the Queen, played werewolf Mags alongside Sylvester McCoy in The Greatest Show In The Galaxy.\n\n[HerMes Digital Media]","torrent":{"xt":"urn:btih:18fd3c3855f4b90eafae4205c574d9808a99351c","amp;dn":"Doctor+Who+2007+Voyage+of+the+Damned+%5BHerMes%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18fd3c3855f4b90eafae4205c574d9808a99351c","infoHashBuffer":{"type":"Buffer","data":[24,253,60,56,85,244,185,14,175,174,66,5,197,116,217,128,138,153,53,28]},"announce":[],"urlList":[]}}