{"title":"Real Anatomy Software DVD v1.0 Win &amp; Mac OSX ISO","uid":6760583,"size":2893217792,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:192655c9f7e24c11cd2c537367b05c79f21a7a95&amp;dn=Real+Anatomy+Software+DVD+v1.0+Win+%26amp%3B+Mac+OSX+ISO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"webchella","files":1,"time":1319194321,"description":"Real Anatomy Software DVD v1.0 Win &amp; Mac OSX ISO\n &lt;a href=&quot;\nhttp://eu.wiley.com/WileyCDA/WileyTitle/productCd-EHEP000124.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://eu.wiley.com/WileyCDA/WileyTitle/productCd-EHEP000124.html&lt;/a&gt;\n\nCategory: Progam\nLanguage: English\n\nMark Nielsen and Shawn Miller, of the University of Utah, lead a team of media and anatomical experts in the creation of this powerful new DVD, Real Anatomy. Their extensive experience in undergraduate anatomy classrooms and cadaver laboratories as well as their passion for the subject matter shine through this new, user-friendly program with its intuitive interface. The 3-D imaging software allows students to dissect through 44 layers of a three-dimensional real human body to study and learn the anatomical structures of all body systems from multiple perspectives. Histology is viewed via a virtual microscope at varied levels of magnification. Professors can use the program to capture and customize images from a large database of stunning cadaver photographs and clear histology micrographs for presentations, quizzing, or testing.\nHallmark Features\n- The entire human body, as well as major organs and structures are presented in a 3-D format, and can be rotated to view the image from multiple anatomical perspectives.\n- Users can dissect through up to 44 layers of the body to discover the relationships of the structures to the whole.\n- A built in -zoom- feature allows users the ability to get a close-up look at detail, imitating actually being in a lab.\n- Histology is closely linked to the gross anatomy, providing a better understanding of the links between form and function\n- Snapshots- of any image - with or without labels, zoomed in for detail, or at any layer or perspective - can be saved as a jpeg for use in PowerPoint lectures, quizzes or handouts.\n","torrent":{"xt":"urn:btih:192655c9f7e24c11cd2c537367b05c79f21a7a95","amp;dn":"Real+Anatomy+Software+DVD+v1.0+Win+%26amp%3B+Mac+OSX+ISO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"192655c9f7e24c11cd2c537367b05c79f21a7a95","infoHashBuffer":{"type":"Buffer","data":[25,38,85,201,247,226,76,17,205,44,83,115,103,176,92,121,242,26,122,149]},"announce":[],"urlList":[]}}