{"title":"Gardening With Woodland Plants{BBS}","uid":6632077,"size":6532088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1933548df08e9d6a8cecb4f730f72a0e3c894a9c&amp;dn=Gardening+With+Woodland+Plants%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1314409355,"description":"Junker's is an authoritative and encyclopedic guide to the spectacular variety and beauty of woodland plants. -- Carol Haggas Booklist 20070301 Gardening with Woodland Plants will guide you along a path to discovering just the right combination of unique plants for your own woodland garden. -- Susan Smith-Durisek Lexington Herald-Leader 20070512 [Junker's] vast experience and knowledge of lesser-known trees, shrubs, and plants are neatly demonstrated in this informative, easy-to-read guide. -- Chris Kahn Library Journal 20070615 I have spent a good part of my life studying woodland plants, but when I opened this book I thought I still must have a lot to learn. -- Richard Churchill People Places Plants 20070701 Can take the gardener from concept to completion for shaded gardens of any size for all-season interest and pleasure. The book presents some of the latest woodland garden cultivars and offers detailed cultural tips that come from the author's more than 20 years of experience. -- Lynette Walther Camden Herald 20071108 Junker ... who's gifted with an engaging writing style, has written a complete guide to woodland plants full of ideas and information for the amateur and specialist gardener. SciTech Book News 20071201\n\n\n    * Hardcover: 384 pages\n    * Publisher: Timber Press (March 15, 2007)\n    * Language: English\n    * ISBN-10: 0881928216\n    * ISBN-13: 978-0881928211","torrent":{"xt":"urn:btih:1933548df08e9d6a8cecb4f730f72a0e3c894a9c","amp;dn":"Gardening+With+Woodland+Plants%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1933548df08e9d6a8cecb4f730f72a0e3c894a9c","infoHashBuffer":{"type":"Buffer","data":[25,51,84,141,240,142,157,106,140,236,180,247,48,247,42,14,60,137,74,156]},"announce":[],"urlList":[]}}