{"title":"The Day of the Triffids - John Wyndham  (Unabridged)","uid":6029198,"size":128623293,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:1a1b45e6f2ee90a55912eb22546f3c0d421359a4&amp;dn=The+Day+of+the+Triffids+-+John+Wyndham++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lucy1948","files":10,"time":1292014319,"description":"Unabridged and read by Samual West. 8 hours 56 mins duration. 8 CD's. (Fraunhofer CBR 32 kbit/s 22050 Hz Mono)\n\n\nThis classic sf novel traces the fate of the world after a comet shower blinds most of the world's population. The few with sight must struggle to reconstruct society while fighting mobile, flesh-eating plants called triffids. Samuel West's narration of this powerful and realistic story provides a flawless interpretation of the text. The listener is caught up in the catastrophic chain of events, imagined and told with such skill by narrator as well as author that one can easily visualize the cataclysmic outcomes. All of West's vocal characterizations, including cockney accents, female voices, and children's voices, are excellent.\n\nThis is a post-apocalyptic novel written in 1951 by the English science fiction author John Wyndham. Although Wyndham had already written other novels, this was the first that he had written under this name and it appeared to be by a new author. It was this novel which established him as an important writer, and remains his best known work. ","torrent":{"xt":"urn:btih:1a1b45e6f2ee90a55912eb22546f3c0d421359a4","amp;dn":"The+Day+of+the+Triffids+-+John+Wyndham++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1b45e6f2ee90a55912eb22546f3c0d421359a4","infoHashBuffer":{"type":"Buffer","data":[26,27,69,230,242,238,144,165,89,18,235,34,84,111,60,13,66,19,89,164]},"announce":[],"urlList":[]}}