{"title":"The Discoverers - Daniel J Boorstin   (epub/mobi/PDF)","uid":6838434,"size":19325147,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a1f1ea71f7dbef32e16aa7f0b503e7ea9db86b8&amp;dn=The+Discoverers+-+Daniel+J+Boorstin+++%28epub%2Fmobi%2FPDF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rosie1966","files":4,"time":1322086077,"description":"'The Discoverers' is a vivid, sweeping, and original history of man's greatest adventure: his search to discover the world around him--the relationship of the heavens to his own planet, the elusive and mysterious dimension of time, the vast and colorful range of plants and animals, the intricate workings of his own body, the surprising variety of human societies past and present--by the Pulitzer Prize-winning author of The Americans, now the Librarian of Congress.\n\nReview\nPerhaps the greatest book by one of our greatest historians, The Discoverers is a volume of sweeping range and majestic interpretation. To call it a history of science is an understatement; this is the story of how humankind has come to know the world, however incompletely (&quot;the eternal mystery of the world,&quot; Einstein once said, &quot;is its comprehensibility&quot;). Daniel J. Boorstin first describes the liberating concept of time--&quot;the first grand discovery&quot;--and continues through the age of exploration and the advent of the natural and social sciences. The approach is idiosyncratic, with Boorstin lingering over particular figures and accomplishments rather than rushing on to the next set of names and dates. It's also primarily Western, although Boorstin does ask (and answer) several interesting questions: Why didn't the Chinese &quot;discover&quot; Europe and America? Why didn't the Arabs circumnavigate the planet? His thesis about discovery ultimately turns on what he calls &quot;illusions of knowledge.&quot; If we think we know something, then we face an obstacle to innovation. The great discoverers, Boorstin shows, dispel the illusions and reveal something new about the world.\n\nAlthough The Discoverers easily stands on its own, it is technically the first entry in a trilogy that also includes The Creators and The Seekers. An outstanding book--one of the best works of history to be found anywhere.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:1a1f1ea71f7dbef32e16aa7f0b503e7ea9db86b8","amp;dn":"The+Discoverers+-+Daniel+J+Boorstin+++%28epub%2Fmobi%2FPDF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a1f1ea71f7dbef32e16aa7f0b503e7ea9db86b8","infoHashBuffer":{"type":"Buffer","data":[26,31,30,167,31,125,190,243,46,22,170,127,11,80,62,126,169,219,134,184]},"announce":[],"urlList":[]}}