{"title":"Geospatial Analysis of Environmental Health","uid":6555289,"size":13962290,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1a859aecfc02c14ab53abc829b29ed42ba7669ae&amp;dn=Geospatial+Analysis+of+Environmental+Health&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1311268561,"description":"Juliana A. Maantay, Sara McLafferty, &quot;Geospatial Analysis of Environmental Health&quot; \nPublisher: Springer | ISBN: 9400703287 | edition 2011 | PDF | 498 pages | 13.3 mb\n\nThis book focuses on a range of geospatial applications for environmental health research, including environmental justice issues, environmental health disparities, air and water contamination, and infectious diseases. Environmental health research is at an exciting point in its use of geotechnologies, and many researchers are working on innovative approaches. This book is a timely scholarly contribution in updating the key concepts and applications of using GIS and other geospatial methods for environmental health research. Each chapter contains original research which utilizes a geotechnical tool (Geographic Information Systems (GIS), remote sensing, GPS, etc.) to address an environmental health problem. The book is divided into three sections organized around the following themes: issues in GIS and environmental health research; using GIS to assess environmental health impacts; and geospatial methods for environmental health. Representing diverse case studies and geospatial methods, the book is likely to be of interest to researchers, practitioners and students across the geographic and environmental health sciences. The authors are leading researchers and practitioners in the field of GIS and environmental health.","torrent":{"xt":"urn:btih:1a859aecfc02c14ab53abc829b29ed42ba7669ae","amp;dn":"Geospatial+Analysis+of+Environmental+Health","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a859aecfc02c14ab53abc829b29ed42ba7669ae","infoHashBuffer":{"type":"Buffer","data":[26,133,154,236,252,2,193,74,181,58,188,130,155,41,237,66,186,118,105,174]},"announce":[],"urlList":[]}}