{"title":"The Rules of Attraction ","uid":8845199,"size":1963874,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1c32f15a7f1d4ec4d77e2832d5badb548e1fd2c3&amp;dn=The+Rules+of+Attraction+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"livhre","files":-1,"time":1377362023,"description":"Set at a small, affluent liberal-arts college in New England at the height of the Reagan 80s, The Rules of Attraction is a startlingly funny, kaleidoscopic novel about three students with no plans for the future--or even the present--who become entangled in a curious romantic triangle. Bret Easton Ellis trains his incisive gaze on the kids at self-consciously bohemian Camden College and treats their sexual posturings and agonies with a mixture of acrid hilarity and compassion while exposing the moral vacuum at the center of their lives.\n\nLauren changes boyfriends every time she changes majors and still pines for Victor who split for Europe months ago and she might or might not be writing anonymous love letter to ambivalent, hard-drinking Sean, a hopeless romantic who only has eyes for Lauren, even if he ends up in bed with half the campus, and Paul, Lauren's ex, forthrightly bisexual and whose passion masks a shrewd pragmatism. They waste time getting wasted, race from Thirsty Thursday Happy Hours to Dressed To Get Screwed parties to drinks at The Edge of the World or The Graveyard. The Rules of Attraction is a poignant, hilarious take on the death of romance.","torrent":{"xt":"urn:btih:1c32f15a7f1d4ec4d77e2832d5badb548e1fd2c3","amp;dn":"The+Rules+of+Attraction+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c32f15a7f1d4ec4d77e2832d5badb548e1fd2c3","infoHashBuffer":{"type":"Buffer","data":[28,50,241,90,127,29,78,196,215,126,40,50,213,186,219,84,142,31,210,195]},"announce":[],"urlList":[]}}