{"title":"[SoM]1 Km da Wall Street[DvdRip-Divx-Ita-Mp3]","uid":4910719,"size":732215296,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1c7fd386442c2c328eb45503af22672e80fc045b&amp;dn=%5BSoM%5D1+Km+da+Wall+Street%5BDvdRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mitimex","files":1,"time":1243155663,"description":"\n\nSeth Davis, un giovane ragazzo di 19 anni, dopo aver abbandonato gli studi al college, decide di aprire una bisca clandestina nel suo appartamento del Queens.\nLa bisca si rivela un ottimo affare per Seth, fruttandogli un discreto guadagno. Ma il ragazzo volendo conquistare il rispetto da parte del padre (un giudice), molla l'attivitÃƒÂ  della bisca e decide di impegnarsi in qualcosa di legale ed entra nella J.T.Martin, una societÃƒÂ  di brokeraggio che gli promette una rapida ascesa nel mondo della finanza. L'ambiente, inizialmente, gli sembra quello ideale per entrare a far parte del boom economico di quegli anni, ottenere ricchezza, successo e anche l'approvazione paterna. Seth grazie al suo fiuto degli affari e al suo modo di trattare la clientela, attira molti clienti e in breve tempo si arricchisce.\nEsce spesso con i colleghi, tra cui Chris, broker miliardario, e Greg, arrogante e invidioso incaricato di insegnargli il mestiere, che lo introducono ai piaceri dissoluti della New York notturna. Per un certo periodo frequenta anche Abby, la segretaria della societÃƒÂ  e l'ex di Greg. Ma il successo viene meno: alcune operazioni non vanno a buon fine e provocano un danno consistente per molti clienti.\nQuesta situazione induce Seth a porsi delle domande: che cosa fa girare i soldi alla J.T.Martin? Facendo un'indagine piÃƒÂ¹ approfondita, scopre che la ditta in realtÃƒÂ  vende azioni di societÃƒÂ  che non esistono. Seth informa il padre della situazione, che gli dice che si tratta di operazioni di riciclaggio di denaro.\nL'FBI, che ha avviato un'indagine federale riguardo l'operato della J.T. Martin, arresta Seth. Il giovane messo alle strette, decide di mettere a disposizione le proprie informazioni e collabora a far arrestare tutti i colpevoli. \n","torrent":{"xt":"urn:btih:1c7fd386442c2c328eb45503af22672e80fc045b","amp;dn":"%5BSoM%5D1+Km+da+Wall+Street%5BDvdRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c7fd386442c2c328eb45503af22672e80fc045b","infoHashBuffer":{"type":"Buffer","data":[28,127,211,134,68,44,44,50,142,180,85,3,175,34,103,46,128,252,4,91]},"announce":[],"urlList":[]}}