{"title":"Quick and Easy Jigs and Fixtures (gnv64)","uid":7797634,"size":53803962,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1ca45bd9ac23326b2efe25bee0e67a74e13ac39e&amp;dn=Quick+and+Easy+Jigs+and+Fixtures+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1352190686,"description":"Quick and Easy Jigs and Fixtures: Features Dozens of Pro Tips, Tricks and Techniques\nBy Kerry Pierce\nPopular Woodworking Books | August 2005 | ISBN 1-55870-709-3 | PDF | 128 pages | 51.3 mb &lt;a href=&quot;\nhttp://www.amazon.com/Quick-Fixtures-Popular-Woodworking-ebook/dp/B0051Q8DK2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Quick-Fixtures-Popular-Woodworking-ebook/dp/B0051Q8DK2&lt;/a&gt;\n\nSimple, Astonishingly Effective Jigs You've Never Seen Anywhere Else\n\nAdd speed, accuracy and ease to almost every operation in your shop with this book of 16 ingenious jigs, clever workshop aids and amazing devices that you simply cannot buy in any store. These jigs are the helping hands that turn a bench-pounding frustrating glue-up into a calm, controlled and confident operation. They're the things that tool manufacturers should have added to all your tools, and they're the time-saving shortcuts you wish you'd thought of.\n\n- Cut accurate tenons on any curved shape with a one-piece table saw jig.\n- Trick your drill press to bore accurate mortises at any conceivable angle.\n- Sculpt elegant raised-panel doors with the safest and most adjustable jig ever.\n- Turn parts of any length (yes, any length) without ever moving your lathe's tool rest.\n- Secure parts of any shape to your bench with ever-obedient bench dogs and dirt-simple cradles.\n- Draw accurate arcs and circles that are out of range of all commercial compasses.\n\nAbout the Author\nAfter earning a bachelor's degree in English from Bowling Green State University (and later a master's in art from Ohio University, Kerry Pierce simultaneously began two careers, working for 32 years as a teacher of secondary English and working for 35 years as a furniture maker and writer specializing in Shaker and Shaker-inspired work. He's the author of 18 books, five of which focus on Shaker furniture and woodenware.","torrent":{"xt":"urn:btih:1ca45bd9ac23326b2efe25bee0e67a74e13ac39e","amp;dn":"Quick+and+Easy+Jigs+and+Fixtures+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ca45bd9ac23326b2efe25bee0e67a74e13ac39e","infoHashBuffer":{"type":"Buffer","data":[28,164,91,217,172,35,50,107,46,254,37,190,224,230,122,116,225,58,195,158]},"announce":[],"urlList":[]}}