{"title":"John Coltrane - A Love Supreme (1964) [EAC-FLAC]","uid":13541263,"size":425762182,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1caf9cebf46473fac3c9a650b9fcfc511e4c6372&amp;dn=John+Coltrane+-+A+Love+Supreme+%281964%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":13,"time":1455489639,"description":"John Coltrane - A Love Supreme (1964) \r\n                 EAC rip (secure mode) | FLAC+CUE+LOG -&gt; 220 Mb \r\n                     Full Artwork @ 300 dpi (tiff) -&gt; 85 Mb\r\n\r\n\r\nA LOVE SUPREME is the essential example of the genius of John Coltrane. In what has become the apotheosis of jazz music, this eminently accessible work bridges the gap between music and spirituality, between art and life. With the ultimate incarnation of the jazz quartet, Coltrane brings together all of his turbulent elements into a cohesive paean to spirituality, one which is fully appreciable by the uninitiated.\r\n\r\nA LOVE SUPREME is a 33-minute work divided into four movements. &quot;Acknowledgment&quot; starts the album with a heraldic summoning from Coltrane's tenor saxophone, full and joyous, which approximates the tone of the prayer he provides in the album's liner notes. The solo that follows reveals an artist whose spiritual depth and emotional urgency are matched by an adherence to logic and a resolve to achieve one goal above all–communication. \r\n\r\nEach simple musical statement is either followed by a motivic development or countered with a conversational response. Coltrane climaxes with a distilled four-note motif echoing the album's title, which he plays with by sequencing it through a wide array of tonalities. Finally, the band comes in, reiterating this idea, chanting the mantra &quot;A Love Supreme.&quot;\r\n\r\n&quot;Acknowledgment&quot; is followed by the torrential release of &quot;Resolution,&quot; whose melody Coltrane fervently states to the animated accompaniment of his superb rhythm section. Laying the groundwork is drummer Elvin Jones, who approximates the effect of multiple percussionists feeding off of each other, creating an enormous texture of rhythm. McCoy Tyner's colorful piano clusters act as gusts of wind supporting Trane's soaring expressions. Bassist Jimmy Garrision takes the low road, keeping everyone on track. With support like this, Coltrane is free to explore the uncharted depths of his soul. On &quot;Resolution,&quot; we can hear the very fabric of Trane's voice being stretched to the limit, as if even the horn which he has mastered is not a worthy enough vehicle for this man's spirit.\r\n\r\nThe rousing &quot;Pursuance&quot; features some vigorously swinging playing from Tyner, furiously followed by Coltrane's climaxes in an inspired hurling of ideas. Bassist Garrison brings us to A LOVE SUPREME's conclusion, an extended &quot;Psalm&quot; that acts as a resolved denouement in which Trane slowly muses over a lush bed of tranquil sounds–almost as if he were reflecting upon the wisdom achieved at this apex of his spiritual journey. Although the music is slowed, the level of intensity is maintained, as if we've reached a plateau upon which we may ponder what is pronounced in the liner notes, &quot;Elation–Elegance–Exaltation–All from God.&quot; Via John Coltrane.\r\n\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01. Love Supreme Part I: Acknowledgement\r\n02. Love Supreme Part II: Resolution\r\n03. Love Supreme Part III: Pursuance\r\n04. Love Supreme Part IV: Psalm\r\n\r\n\r\n*2008 Verve / Impulse! | 0602517649033\r\n\r\n\r\nPersonnel:\r\nJohn Coltrane (tenor saxophone)\r\nMcCoy Tyner (piano)\r\nJimmy Garrison (bass)\r\nElvin Jones (drums)\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!\r\n\r\n\r\n\r\nJohn Coltrane Quartet - Crescent (1964) [EAC-FLAC]:\r\n \nhttps://thepiratebay.se/torrent/13526772/John_Coltrane_Quartet_-_Crescent_%281964%29_%5BEAC-FLAC%5D","torrent":{"xt":"urn:btih:1caf9cebf46473fac3c9a650b9fcfc511e4c6372","amp;dn":"John+Coltrane+-+A+Love+Supreme+%281964%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1caf9cebf46473fac3c9a650b9fcfc511e4c6372","infoHashBuffer":{"type":"Buffer","data":[28,175,156,235,244,100,115,250,195,201,166,80,185,252,252,81,30,76,99,114]},"announce":[],"urlList":[]}}