{"title":"The Great St. Louis Bank Robbery","uid":10400107,"size":595690011,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1cd26525839fac1f3aaf90e5c9994719b08469a5&amp;dn=The+Great+St.+Louis+Bank+Robbery&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"strawberry5","files":-1,"time":1403347872,"description":"The Great St. Louis Bank Robbery\n\nIMDB:\nThe decent degree of realism plus one of Steve McQueen's earlier starring movie roles help make this crime feature worth watching. The story has some pretty interesting aspects, and it adds to the realism with the well-publicized inclusion of many of the actual police officers who were involved in the original events on which the movie is based. On the other hand, the rest of the cast does not come up to McQueen's stature as performers, and at times some potentially powerful scenes lack a little something as a result.\n\nThe setup has McQueen's character hired as the getaway driver for a gang of bank robbers. Their careful planning is thrown into complications by an old girlfriend of George's (McQueen), whose brother is also part of the gang. The resulting tensions, plus the various unexpected developments as they carry out their plan, add some interest to the basic story. Many of the scenes are written and filmed rather well, although at times the movie expends some screen time on less interesting material.\n\nMcQueen does a good job with an unsympathetic character, and the supporting cast is mostly solid. Molly McCarthy is believable and generally sympathetic as Ann, but she does not always give her character a lot of depth. Crahan Denton gives the gang's boss a good, solid persona at the beginning, but afterward the character remains rather one-dimensional even when there are chances to bring out some interesting characteristics.\n\nThe straightforward, almost documentary style cinematography works pretty well, and makes a good combination with the downbeat story. Despite a few things that could have been better, this is not bad at all for its genre, and it is certainly worth seeing.","torrent":{"xt":"urn:btih:1cd26525839fac1f3aaf90e5c9994719b08469a5","amp;dn":"The+Great+St.+Louis+Bank+Robbery","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1cd26525839fac1f3aaf90e5c9994719b08469a5","infoHashBuffer":{"type":"Buffer","data":[28,210,101,37,131,159,172,31,58,175,144,229,201,153,71,25,176,132,105,165]},"announce":[],"urlList":[]}}