{"title":"Blues.Breakers.-.John.Mayall.and.The.Bluesbreakers.Ft.Eric.Clapt","uid":6915979,"size":227563259,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1d02b611f124aeb9a1b7946eea5282e0083e7825&amp;dn=Blues.Breakers.-.John.Mayall.and.The.Bluesbreakers.Ft.Eric.Clapt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Spookster","files":14,"time":1325030415,"description":"Bluesbreakers with Eric Clapton was Eric Clapton's first fully realized album as a blues guitarist -- more than that, it was a seminal blues album of the 1960s, perhaps the best British blues album ever cut, and the best LP ever recorded by John Mayall's Bluesbreakers. Standing midway between Clapton's stint with the Yardbirds and the formation of Cream, this album featured the new guitar hero on a series of stripped-down blues standards, Mayall pieces, and one Mayall/Clapton composition, all of which had him stretching out in the idiom for the first time in the studio. This album was the culmination of a very successful year of playing with John Mayall, a fully realized blues creation featuring sounds very close to the group's stage performances, and with no compromises. Credit has to go to producer Mike Vernon for the purity and simplicity of the record; most British producers of that era wouldn't have been able to get it recorded this way, much less released. One can hear the very direct influence of Buddy Guy and a handful of other American bluesmen in the playing. And lest anyone forget the rest of the quartet: future pop/rock superstar John McVie and drummer Hughie Flint provide a rock-hard rhythm section, and Mayall's organ playing, vocalizing, and second guitar are all of a piece with Clapton's work. His guitar naturally dominates most of this record, and he can also be heard taking his first lead vocal, but McVie and Flint are just as intense and give the tracks an extra level of steel-strung tension and power, none of which has diminished across several decades. [Polygram Records issued a remastered version of this album on CD, featuring both the stereo and mono mixes of the original tracks and new notes and a second disc of bonus materials.]\n\n1\t\tAll Your Love\tDixon, Rush\t3:36\n2\t\tHideaway\t\t3:16\n3\t\tLittle Girl\tMayall\t2:36\n4\t\tAnother Man\t\t1:46\n5\t\tDouble Crossing Time\tClapton, Mayall\t3:03\n6\t\tWhat'd I Say\tCharles\t4:30\n7\t\tKey to Love\tMayall\t2:09\n8\t\tParchman Farm\tAllison\t2:22\n9\t\tHave You Heard\tMayall\t5:56\n10\t\tRamblin' on My Mind\tJohnson\t3:09\n11\t\tSteppin' Out\tFrazier\t2:30\n12\t\tIt Ain't Right\tJacobs\t2:43\n &lt;a href=&quot;\nhttp://www.allmusic.com/album/bluesbreakers-with-eric-clapton-r1663674&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/album/bluesbreakers-with-eric-clapton-r1663674&lt;/a&gt;","torrent":{"xt":"urn:btih:1d02b611f124aeb9a1b7946eea5282e0083e7825","amp;dn":"Blues.Breakers.-.John.Mayall.and.The.Bluesbreakers.Ft.Eric.Clapt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d02b611f124aeb9a1b7946eea5282e0083e7825","infoHashBuffer":{"type":"Buffer","data":[29,2,182,17,241,36,174,185,161,183,148,110,234,82,130,224,8,62,120,37]},"announce":[],"urlList":[]}}