{"title":"Nick Warren- Global Underground 24- Reykjavik","uid":4715369,"size":137646692,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1d26685ec6898039f3039e4efe7b1e2165d3d7bd&amp;dn=Nick+Warren-+Global+Underground+24-+Reykjavik&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"piratzee","files":21,"time":1234249176,"description":"Alright everyone please read.  I'm putting up most of my favorite albums of Progressive Trance, Progressive House, Tech House, and Acid House that I have collected over the past 10 years or so.  I'm putting up a few at a time to seed and need everyone that downloads them to PLEASE SEED THEM for atleast a week so everyone can get to DL them and enjoy them.  My broadband is somewhat slow so I can only put up a few at a time and need the help to seed them.  If you build it they will come.  I've got over 50 albums (100+ CDs/mixes) I am going to put up so I do need the help seeding them all.  If anyone has any good albums(this style of music) to put up i'd appreciate it if you did or if you could leave in the comments section where else to find some really good albums or suggestions of really good albums or mixes.  Thanks\n\nThis album is full of nice mellow melodies and stretched out beautiful progressive trance tracks.  Nick Warren releases another classic double disc to not be forgotten.  Hey I'm looking for his GU 28 Shanghai release and also his GU 35 Lima release.  If anyone has it could you please post it up and let me know.  I want a copy of it with track by track instead of the single file disc like the ones that have been floating around since their releases.  Please hook it up if you have it...thanks.","torrent":{"xt":"urn:btih:1d26685ec6898039f3039e4efe7b1e2165d3d7bd","amp;dn":"Nick+Warren-+Global+Underground+24-+Reykjavik","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d26685ec6898039f3039e4efe7b1e2165d3d7bd","infoHashBuffer":{"type":"Buffer","data":[29,38,104,94,198,137,128,57,243,3,158,78,254,123,30,33,101,211,215,189]},"announce":[],"urlList":[]}}