{"title":"The Brave One[2007][Eng][DVDRip]","uid":3980187,"size":733220114,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1d8224959b20329d2870cc479190270be65b03e3&amp;dn=The+Brave+One%5B2007%5D%5BEng%5D%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Sundance38","files":1,"time":1200508864,"description":"Radio host Erica Bain (Jodie Foster) is working and living a wonderful life in New York City without a care in the world. One night she and her fiancÃƒÂ©, David (Naveen Andrews), are brutally attacked by three thugs in the park while being recorded by one of them. David is killed and Erica is beaten within an inch of her life. Erica is traumatized to a point where she can not sleep and will not leave her apartment. To cope and work past this tragic event, Erica becomes someone else. She buys a gun and begins to roam the streets at night looking to take her revenge on the men who were responsible for killing her one true love. One late night, Erica is in the back of a convenience store about to purchase a soft drink when a man comes in and kills his wife, who is a clerk in the store. Erica is a witness and he comes after her, she protects herself and finds that it is very easy to shoot a gun. Days later, Erica is on the subway when she is about to be raped by two men, and again she protects herself. The City of New York is fascinated with the exploits of this vigilante killer, and NYPD Detective Mercer (Terrence Howard) is trying to catch this person, before he kills again. Later on Erica gets a lead of where she can find the three men in the park and goes there to seek vengeance. She manages to kill all but the last one, being then saved by Detective Mercer whom she had already befriended and let her kill the last thug using the Mercer&amp;#039;s gun so no one would link her to the killings.\n &lt;a href=&quot;\nhttp://www.genesis-sp.com/forum/index.php?&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.genesis-sp.com/forum/index.php?&lt;/a&gt;","torrent":{"xt":"urn:btih:1d8224959b20329d2870cc479190270be65b03e3","amp;dn":"The+Brave+One%5B2007%5D%5BEng%5D%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d8224959b20329d2870cc479190270be65b03e3","infoHashBuffer":{"type":"Buffer","data":[29,130,36,149,155,32,50,157,40,112,204,71,145,144,39,11,230,91,3,227]},"announce":[],"urlList":[]}}