{"title":"Black Swan (2010) DVD NTSC WS (eng-spa) [Sk]","uid":6256739,"size":4692428319,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:1d869efd6b9f8453122530b8738a06fce3f911bc&amp;dn=Black+Swan+%282010%29+DVD+NTSC+WS+%28eng-spa%29+%5BSk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FatFreddy007","files":3,"time":1300609457,"description":"Black Swan (El cisne negro) DVD NTSC WS\n\n\nÃ‚Â» TÃƒÂ­tulo Original ..: Black Swan\nÃ‚Â» GÃƒÂ©nero ...........: Drama, Misterio, Suspenso\nÃ‚Â» PaÃƒÂ­s .............: Estados Unidos\nÃ‚Â» AÃƒÂ±o ..............: 2010\nÃ‚Â» DuraciÃƒÂ³n .........: 108 min.\nÃ‚Â» Norma de video ...: NTSC\nÃ‚Â» Pantalla .........: Widescreen\nÃ‚Â» Idioma de audio ..: InglÃƒÂ©s 5.1, EspaÃƒÂ±ol Latino 5.1\nÃ‚Â» Subtitulos .......: InglÃƒÂ©s, EspaÃƒÂ±ol\nÃ‚Â» Menu .............: SI\nÃ‚Â» Extras ...........: No\nÃ‚Â» Removido .........: FBI Advertencia, Trailers, Publicidad\nÃ‚Â» IMDB .............: http://www.imdb.com/title/tt0947798\n\nÃ‚Â» Sinopsis: Nina (Portman) es una bailarina en una compaÃƒÂ±ia de ballet clÃƒÂ¡sico de la ciudad de Nueva York cuya vida, como todo en su profesiÃƒÂ³n esta completamente consumida por el baile. Ella vive con su obsesiva madre Erica (Hersey), antigua bailarina, quien ejerce un sofocante control sobre ella. Cuando el director artÃƒÂ­stico Thomas Leroy (Cassel) decide sustituir a la primera bailarina Beth MacIntyre (Ryder) para la producciÃƒÂ³n de apertura de la nueva temporada, Cisne Negro, Nina es su primera opciÃƒÂ³n. Pero Nina tiene competencia: una nueva bailarina, Lily (Kunis), quien impresiona a Leroy. Cisne Negro requiere una bailarina que interprete a ambos roles, el cisne blanco con inocencia y gracia, y el cisne negro, quien representa astucia y sensualidad. Nina se ajusta perfectamente al rol del cisne blanco pero Lily es la personificaciÃƒÂ³n del cisne negro. Mientras las dos jÃƒÂ³venes bailarinas amplian su rivalidad en una rotorcida amistad, Nina empieza a estar mas en contacto con su lado oscuro que amenaza con destruirla.\n\nÃ‚Â» Storyline: Nina (Natalie Portman) is a ballerina in a New York City ballet company whose life, like all those in her profession, is completely consumed with dance. She lives with her obsessive former ballerina mother Erica (Barbara Hershey) who exerts a suffocating control over her. When artistic director Thomas Leroy (Vincent Cassel) decides to replace prima ballerina Beth MacIntyre (Winona Ryder) for the opening production of their new season, Swan Lake, Nina is his first choice. But Nina has competition: a new dancer, Lily (Mila Kunis), who impresses Leroy as well. Swan Lake requires a dancer who can play both the White Swan with innocence and grace, and the Black Swan, who represents guile and sensuality. Nina fits the White Swan role perfectly but Lily is the personification of the Black Swan. As the two young dancers expand their rivalry into a twisted friendship, Nina begins to get more in touch with her dark side-a recklessness that threatens to destroy her.\n\nÃ‚Â» MPAA: Rated R for strong sexual content, disturbing violent images, language and some drug use.\n_____________________________________________________________________________________\n\nÃ‚Â» Re-encoded .......: CloneDVD2\nÃ‚Â» Watch movie ......: Alcohol 120% (Virtual Drive) Windows media player\nÃ‚Â» Watch movie ......: VLC media player (right click on folder)\nÃ‚Â» ISO file Burn ....: Alcohol 120% (image Burning Wizard)\n_____________________________________________________________________________________","torrent":{"xt":"urn:btih:1d869efd6b9f8453122530b8738a06fce3f911bc","amp;dn":"Black+Swan+%282010%29+DVD+NTSC+WS+%28eng-spa%29+%5BSk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d869efd6b9f8453122530b8738a06fce3f911bc","infoHashBuffer":{"type":"Buffer","data":[29,134,158,253,107,159,132,83,18,37,48,184,115,138,6,252,227,249,17,188]},"announce":[],"urlList":[]}}