{"title":"American_Top_40_1976_June_26th","uid":10465400,"size":364481353,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:1defdca8d7950694a7eeeb03267cc8413f458ca0&amp;dn=American_Top_40_1976_June_26th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RocketMan999","files":-1,"time":1404183010,"description":"&quot;Every week based on Billboard's national statistics of record sales and radio station airplay, we count down the most popular songs in the nation.&quot;\n\n\nAmerican Top 40 with Casey Kasem aired on radio from July 4, 1970 until August 6, 1988. This recording is a rebroadcast from internet radio.\n\nIn this countdown:\n\nThe most successful foreign recording act from a non-English speaking country ever to hit the American charts has their fifth hit song in this countdown.\n\nCasey tells us whatever happened to Paul Revere and the Raiders.\n\nCasey answers the question, &quot;What two records during the rock era spent the most weeks at number one?&quot; The song with the most weeks was an instrumental from 1955, and there is a four-way tie for the number two spot. Details are in the first hour.\n\nThe highest debut of the week is at number 24, &quot;If You Know What I Mean&quot; by Neil Diamond. Casey says in the upcoming bicentennial weekend, Diamond will become the highest paid entertainer in the history of Las Vegas, earning $750,000 over four days.\n\nFor fans of the Beach Boys, they are at number 19 with their hit &quot;Rock And Roll Music,&quot; Todd Rundgren's remake of &quot;Good Vibrations&quot; is at number 38, former Beach Boys back-up musicians 'Captain' Daryl Dragon and 'Toni' Tennille  are at number 5 with &quot;Shop Around&quot; (a remake of a song originally done by Smokey Robinson and the Miracles), and Henry Gross is at number 21 with &quot;Shannon,&quot; a song he wrote as a tribute to the pet dog of Beach Boy member Carl Wilson.\n\nCasey points out the back-to-back hits by the two groups he says had the biggest impact on popular music in the 60's. The previously mentioned Beach Boys record moved up 19 notches this week in 1976, and the Beatles are at number 18 with the re-release of a ten-year-old album cut &quot;Got To Get You Into My Life.&quot; Casey calls the two groups &quot;creators, innovators, and great music makers.&quot;\n\nA listener asks, &quot;Who was the oldest performer ever to hit the top 40?&quot; Casey says the answer has changed since the last time he answered this question. An American Senator with a spoken-word record held that title until 1974 when Canadian (who also hit with a spoken-word record) took his place. Respect your elders.\n\nBack in 1976 when the Six Million Dollar Man was way too expensive and the price of stamps had gone up from ten to thirteen cents, the enthusiasm of Casey's question-asking fans kept right on going. Here is the last question in this broadcast, &quot;In the rock era, how many different duos have hit number one, and which is the most successful?&quot; Casey lists one father and daughter team, two brother and sister duos, three sets of couples, seven duos where the members where unrelated, and three sets of brothers, one of which is the most successful.\n\nI have included &quot;Shop Around&quot; by the Miracles (MP3) as a RocketMan Extra (because they sound so good!).\n\n40: Young Hearts Run Free - Candi Staton\n39: Sophisticated Lady - Natalie Cole\n38: Good Vibrations - Todd Rundgren\n37: Baretta's Theme - Rhythm Heritage\n36: Somebody's Getting' It - Johnny Taylor\n35: Mama Mia - ABBA\n34: Last Child - Aerosmitih\n33: I'm Easy - Keith Carradine\n32: Happy Days - Pratt &amp; McClain\n31: Save Your Kisses For Me - The Brotherhood Of Man\n30: Turn The Beat Around - Vickie Sue Robinson\n29: Tear The Roof Off The Sucker - Parliament\n28: Makin' Our Dreams Come True - Cyndi Greco\n27: That's Where The Happy People Go - The Trammps\n26: Let Her In - John Travolta\n25: Today's The Day - America\n24: If You Know What I Mean - Neil Diamond\n23: You're My Best Friend - Queen\n22: Get Closer - Seals &amp; Crofts\n21: Shannon - Henry Gross\n20: The Boys Are Back In Town - Thin Lizzy\n19: Rock And Roll Music - The Beach Boys\n18: Got To Get You Into My Life - The Beatles\n17: Take The Money And Run - Steve Miller Band\n16: Moonlight Feels Right - Starbuck\n15: I Want You - Marvin Gaye\n14: Movin' - Brass Construction\n13: Takin' It To The Streets - The Doobie Brothers\n12: Never Gonna Fall In Love Again - Eric Carmen\n11: Love Is Alive - Gary Wright\n10: Kiss And Say Goodbye - The Manhattens\n9: I'll Be Good To You - The Brothers Johnson\n8: Love Hangover - Diana Ross\n7: Afternoon Delight - Starland Vocal Band\n6: More, More, More - The Andrea True Connection\n5: Shop Around - The Captain And Tennille\n4: Sara Smile - Daryl Hall &amp; John Oates\n3: Misty Blue - Dorothy Moore\n2: Get Up And Boogie - Silver Convention\n1: Silly Love Songs - Wings","torrent":{"xt":"urn:btih:1defdca8d7950694a7eeeb03267cc8413f458ca0","amp;dn":"American_Top_40_1976_June_26th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1defdca8d7950694a7eeeb03267cc8413f458ca0","infoHashBuffer":{"type":"Buffer","data":[29,239,220,168,215,149,6,148,167,238,235,3,38,124,200,65,63,69,140,160]},"announce":[],"urlList":[]}}