{"title":"Astral Dynamics - A NEW Approach to Out-of-Body Experiences.pdf","uid":4260973,"size":3568721,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1df55acb53a805345d8b2a2b6ecb7bc16a9f2e34&amp;dn=Astral+Dynamics+-+A+NEW+Approach+to+Out-of-Body+Experiences.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"jeanmichel73","files":1,"time":1214476938,"description":"Synopsis\nA guide to participation in out-of-body travel. The author provides advanced advice on achieving and maintaining out-of-body states and explores the how and why of non-physical exploration, from projection techniques and energy manipulation to psychic self-defense and even astral sex.\n\nFrom Amazon.co.uk ...\nDon&amp;#039;t you love it when you pick up a book, and it immediately explains experiences you&amp;#039;ve had, but had no explanation for when they occurred? This doesn&amp;#039;t happen often, but it might with Astral Dynamics, Robert Bruce&amp;#039;s straightforward how-to manual on astral projection. Perhaps you&amp;#039;ve had a spontaneous out-of-body experience and didn&amp;#039;t know it! This extensive tome teaches the reader everything she or he needs to know to accomplish successful planned out-of-body travel; how to exit the body, how to get around on the astral plane, and how to get back in with solid, provable memories of the event. Bruce is a very clear writer who uses down-to-earth terminology so that you learn not only how to create a &quot;real-time double&quot; to astrally project, but he painstakingly explains the physics of the non-physical world so that it makes complete sense. Out-of-body experiences can be so confusing that enjoying them or employing them usefully can be a serious problem. Fortunately, Bruce now brings his 25 years of inter-dimensional experience to the aid of astral explorers the world over, and everywhere else, too.\n\n-- P. Randall Cohan","torrent":{"xt":"urn:btih:1df55acb53a805345d8b2a2b6ecb7bc16a9f2e34","amp;dn":"Astral+Dynamics+-+A+NEW+Approach+to+Out-of-Body+Experiences.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1df55acb53a805345d8b2a2b6ecb7bc16a9f2e34","infoHashBuffer":{"type":"Buffer","data":[29,245,90,203,83,168,5,52,93,139,42,43,110,203,123,193,106,159,46,52]},"announce":[],"urlList":[]}}