{"title":"The Ezekiel Option Joel C. Rosenberg.epub (steelballz)","uid":9390480,"size":1532460,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e0a215d90e7699a5c76985d82191f97c74b72c0&amp;dn=The+Ezekiel+Option+Joel+C.+Rosenberg.epub+%28steelballz%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"steelballz","files":-1,"time":1387876763,"description":"New York Times best-selling author Joel Rosenberg brings readers this thrilling new novel. When Russia's richest oil baron is killed, Moscow suddenly teeters on the verge of political chaos. Tehran races to complete its nuclear arsenal. Washington finds herself dangerously divided from her European allies. And in the dead of night, in the hills overlooking Jerusalem, a senior White House advisor uncovers a chilling ancient conspiracy as real as the morning's headlines. Woven through the writings of the Hebrew prophet Ezekiel, more than 2,500 years old, are eerily prescient descriptions of modern countries then unborn, modern alliances then unformed, and an imminent day of unspeakable terror. Now, with the clock ticking down to war, two Americans are caught in the crossfire, wondering, Is the last judgment at hand?\n\nWhen Russia's richest oil baron is killed, Moscow suddenly teeters on the verge of political chaos. Tehran races to complete its nuclear arsenal. Washington finds herself dangerously divided from her European allies. A new evil looms on the horizon. A dictator is rising in Russia. Iran is feverishly building nuclear weapons. A new axis of evil is emerging, led by Moscow and Tehran. And Jon Bennett and Erin McCoy, two senior White House advisors, find themselves facing the most chilling question of their lives: is the world rushing to the brink of an apocalypse prophesied more than 2,500 years ago? ","torrent":{"xt":"urn:btih:1e0a215d90e7699a5c76985d82191f97c74b72c0","amp;dn":"The+Ezekiel+Option+Joel+C.+Rosenberg.epub+%28steelballz%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e0a215d90e7699a5c76985d82191f97c74b72c0","infoHashBuffer":{"type":"Buffer","data":[30,10,33,93,144,231,105,154,92,118,152,93,130,25,31,151,199,75,114,192]},"announce":[],"urlList":[]}}