{"title":"SIN-ister Secrets - 06 - Aldous Huxleys Brave New World","uid":15741839,"size":2980193275,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e1665e53f6e1c4abb3d8927da77f59b644bd87c&amp;dn=SIN-ister+Secrets+-+06+-+Aldous+Huxleys+Brave+New+World&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"POtHS11","files":62,"time":1472922975,"description":"The novel opens in London in AF 632 (AD 2540 in the Gregorian calendar). The society described above is illuminated by the activities of two of the novel's central characters, Lenina Crowne and Bernard Marx, and the other characters with whom they come into contact. Lenina, a hatchery worker, is socially accepted and contented, but Bernard, a psychologist in the Directorate of Hatcheries and Conditioning, is not. He is shorter in stature than the average of his Alpha caste—a quality shared by the lower castes, which gives him an inferiority complex. His intelligence and his work with hypnopaedia allow him to understand, and disapprove of, the methods by which society is sustained. Courting disaster, he is vocal and arrogant about his differences. Bernard is mocked by other Alphas because of his stature, as well as for his individualistic tendencies, and is threatened with exile to Iceland because of his nonconformity. His only friend is Helmholtz Watson, a lecturer at the College of Emotional Engineering. The friendship is based on their feelings of being misfits (in the context of the World State), but unlike Bernard, Watson's sense of alienation stems from being exceptionally gifted, intelligent, handsome, and physically strong. Helmholtz is drawn to Bernard as a confidant.\r\n\r\nBernard takes a holiday with Lenina at a Savage Reservation in New Mexico. (The culture of the village folk resembles the contemporary Native American groups of the region, descendants of the Anasazi, including the Puebloan peoples of Acoma, Laguna and Zuni.) There they observe ceremonies, including a ritual in which a village boy is whipped into unconsciousness. They encounter Linda, a woman originally from the World State who is living on the reservation with her son John, now a young man. She too visited the reservation on a holiday, and became separated from her group and was left behind. She had meanwhile become pregnant by a fellow-holidaymaker (who is revealed to be Bernard's boss, the Director of Hatcheries and Conditioning). She did not try to return to &quot;civilization&quot; because of her shame at her pregnancy. Neither Linda nor John are accepted by the villagers, and their life has been hard and unpleasant. Linda has taught John to read, although from only two books: a scientific manual from his mother's job in the hatchery and the collected works of Shakespeare","torrent":{"xt":"urn:btih:1e1665e53f6e1c4abb3d8927da77f59b644bd87c","amp;dn":"SIN-ister+Secrets+-+06+-+Aldous+Huxleys+Brave+New+World","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e1665e53f6e1c4abb3d8927da77f59b644bd87c","infoHashBuffer":{"type":"Buffer","data":[30,22,101,229,63,110,28,74,187,61,137,39,218,119,245,155,100,75,216,124]},"announce":[],"urlList":[]}}