{"title":"Thomas Merton - The Nonviolent Alternative (pdf)","uid":8291972,"size":3237301,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e3e26bf701f6390531815afcdc14f6049128a7d&amp;dn=Thomas+Merton+-+The+Nonviolent+Alternative+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1364065659,"description":"Thomas Merton (Gordon Zahn, ed.) - The Nonviolent Alternative (FSG, 1980). 270 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\nCollection of short works on issues of peace and nonviolence by the radical monk who died in 1968.\n\n\nThe writings in this work were precipitated by a variety of events during the last decades of Merton's life - the civil rights and peace movements of the 1960s among them. His timeless moral integrity and tireless concern for nonviolent solutions to war are eloquently expressed.\n\nAbout the Author\n\nThomas Merton (1915-1968) is one of the foremost spiritual thinkers of the twentieth century. Though he lived a mostly solitary existence as a Trappist monk, he had a dynamic impact on world affairs through his writing. An outspoken proponent of the antiwar and civil rights movements, he was both hailed as a prophet and castigated for his social criticism. He was also unique among religious leaders in his embrace of Eastern mysticism, positing it as complementary to the Western sacred tradition. Merton is the author of over forty books of poetry, essays, and religious writing, including Mystics and Zen Masters, and The Seven Story Mountain, for which he is best known. His work continues to be widely read to this day.\n\n---\n\nFor more books by Thomas Merton and for other books on nonviolence, see my other torrents.","torrent":{"xt":"urn:btih:1e3e26bf701f6390531815afcdc14f6049128a7d","amp;dn":"Thomas+Merton+-+The+Nonviolent+Alternative+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e3e26bf701f6390531815afcdc14f6049128a7d","infoHashBuffer":{"type":"Buffer","data":[30,62,38,191,112,31,99,144,83,24,21,175,205,193,79,96,73,18,138,125]},"announce":[],"urlList":[]}}