{"title":"William DeVaughn ~ 12 INCH Classics ON CD (FLAC)","uid":8912773,"size":74865898,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e4e807db35821d549ed4073d1d3dcc805244474&amp;dn=William+DeVaughn+%7E+12+INCH+Classics+ON+CD+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cockymountainoyster","files":-1,"time":1379064502,"description":"William DeVaughn ~ 12 INCH Classics ON CD (FLAC)\n\n01. Be Thankful For What You Got \n02. Hold Onto LoVe\n\n (seeds please)\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/cockymountainoyster&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/cockymountainoyster&lt;/a&gt;\n\n\n Singer/songwriter/guitarist William DeVaughn had a million-seller the first time out with his inspiring &quot;Be Thankful for What You Got.&quot; Those who first heard the smooth track thought it was a new record from Curtis Mayfield. DeVaughn's high tenor does bear some resemblance to Mayfield's and the simple, encouraging lyrics were similar to the kind found in the catalog of the Impressions leader. &quot;Be Thankful for What You Got&quot; also found its way onto the playlist of some gospel radio programs. One of the lyrics: &quot;Diamond in the back / sunroof top / digging the scene with a gangster lean&quot; became a catchphrase and appeared in numerous rap/hip hop records of the '90s.\n\n The Washington, D.C. native was working for the government when he paid $900 for a recording session at Philadelphia's Omega Sound Inc. (basically a &quot;vanity record&quot; operation). Usually the results of such efforts are anything but star-making, but Omega featured the services of MFSB's main rhythm section (guitarist Norman Harris, drummer Earl Young, bassist Ron Baker, and vibist Vince Montana). Omega vice-president Frank Fioravanti was impressed with the record and began shopping it around to various labels.\n\n Finally issued on Wes Farrell's Roxbury imprint and produced by Frank Fioravanti and arranger John Davis, &quot;Be Thankful for What You Got&quot; sold nearly two million copies, gliding up to the top of the R&amp;B charts and number four pop in spring 1974. The album of the same name had an almost religious tone (DeVaughn was a Jehovah's Witness) and yielded several radio-aired LP tracks: &quot;Give the Little Man a Great Big Hand&quot; (the third single), &quot;We Are His Children,&quot; &quot;Sing a Love Song,&quot; and &quot;You Can Do It.&quot; The second single, &quot;Blood Is Thicker Than Water,&quot; made it to number ten R&amp;B and number 43 pop in summer 1974. Akin to the post-heyday performances of a converted Al Green, DeVaughn preached to and admonished his audience from the stage. He lost interest in the music business not long after, though hed did remake &quot;Be Thankful for What You Got&quot; for TEC and charted again with the Top 40 R&amp;B hit &quot;Figures Can't Calculate&quot; in summer 1980 for the label.\n\n Artist Biography by Ed Hogan\n\n","torrent":{"xt":"urn:btih:1e4e807db35821d549ed4073d1d3dcc805244474","amp;dn":"William+DeVaughn+%7E+12+INCH+Classics+ON+CD+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e4e807db35821d549ed4073d1d3dcc805244474","infoHashBuffer":{"type":"Buffer","data":[30,78,128,125,179,88,33,213,73,237,64,115,209,211,220,200,5,36,68,116]},"announce":[],"urlList":[]}}