{"title":"Southland Tales Cannes Cut (Dark Jedi &amp; Rev Beastly rip)","uid":5929334,"size":1468373039,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1e6941ec14697cf6de74fb62ddc9f40ab6b2557c&amp;dn=Southland+Tales+Cannes+Cut+%28Dark+Jedi+%26+Rev+Beastly+rip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdesmet","files":2,"time":1288720249,"description":"Resolution 704x304\nVideo codec: XVID\nAudio codec: MP3\n\nIMDb: &quot;Southland Tales is an ensemble piece set in the futuristic landscape of Los Angeles on July 4, 2008, as it stands on the brink of social, economic and environmental disaster. Boxer Santaros is an action star who's stricken with amnesia. His life intertwines with Krysta Now, an adult film star developing her own reality television project, and Ronald Taverner, a Hermosa Beach police officer who holds the key to a vast conspiracy.&quot;\n\nWikipedia: &quot;Kelly's film premiered at the Cannes Film Festival in May 2006 with a length of 160 minutes. [For the theatrical, final release,] editorial changes were made to restructure the order of the film's scenes, including re-recording all of Timberlake's voice-over. The director also added 90 new visual effects shots to the film and removed 20 to 25 minutes of footage from his initial cut.&quot;\n\nThis torrent is for the initial Cannes version of Southland Tales. It infamously garnered an extremely negative overall reaction in the film festival. It is 2 hours, 38 minutes and 31 seconds long - whereas the theatrical and DVD release spanned approximately 20 minutes less.\n\nThis rip was extracted from a hi-def television broadcast by blokes named Dark Jedi and Rev. Beastly! Props to them - yours truly had nothing to do with it.\n\nThis version was a bit hard to get ahold of, even through torrenting. Enjoy.","torrent":{"xt":"urn:btih:1e6941ec14697cf6de74fb62ddc9f40ab6b2557c","amp;dn":"Southland+Tales+Cannes+Cut+%28Dark+Jedi+%26+Rev+Beastly+rip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e6941ec14697cf6de74fb62ddc9f40ab6b2557c","infoHashBuffer":{"type":"Buffer","data":[30,105,65,236,20,105,124,246,222,116,251,98,221,201,244,10,182,178,85,124]},"announce":[],"urlList":[]}}