{"title":"Fats Domino - Fats Is Back (1968) MP3@256","uid":10480013,"size":57671825,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1e761a57042f70a9d502395d07d294684041c30e&amp;dn=Fats+Domino+-+Fats+Is+Back+%281968%29+MP3%40256&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AaronVincent","files":12,"time":1404393583,"description":"His &quot;comeback&quot; LP, recorded for Reprise Records 1968.\n\n&quot;Like many of the early legends of rock &amp; roll, Fats Domino didn't command a lot of attention in the late '60s. Not only had the British Invasion pushed Fats, Chuck, Little Richard, and their contemporaries off the charts, but post-1965 developments like psychedelia and folk-rock made straightforward rock &amp; roll and rolling New Orleans R&amp;B sound a little old-fashioned. In other words, it was time for the first generation to stage a comeback. Producer Richard Perry never neglects the essentials of Fats' music -- he retains the easygoing charm and endearing shuffles, just updating it slightly. In retrospect, Fats Is Back feels like Perry's blueprint for Ringo Starr's star-studded extravaganzas of the mid-'70s -- he selects an impeccable set of songs, nearly all covers but not just relying on obvious selections, assembles a first-rate cast of musicians, and then puts on a show. After all, this is an album that begins with a roll call of Domino's greatest hits and then ends with &quot;One More Song for You&quot; -- it's intended to be spectacular and it comes damn close to being one. Part of the reason Fats Is Back works is that it's designed to entertain but never oversells itself -- sort of like the man himself, actually. Fats delivers tailor-made new songs, Barbara George's &quot;I Know,&quot; a remake of his classic &quot;I'm Ready,&quot; and two Beatles covers (McCartney's Fats tribute &quot;Lady Madonna&quot; and &quot;Lovely Rita&quot;) with equal gusto. Years on from its initial release, Fats Is Back still sounds like a sly, endearing update of the classic Domino sound. It may not match his classic Imperial recordings, yet it will no doubt please anyone wishing to dig a little deeper.&quot;\n\n/Allmusic","torrent":{"xt":"urn:btih:1e761a57042f70a9d502395d07d294684041c30e","amp;dn":"Fats+Domino+-+Fats+Is+Back+%281968%29+MP3%40256","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e761a57042f70a9d502395d07d294684041c30e","infoHashBuffer":{"type":"Buffer","data":[30,118,26,87,4,47,112,169,213,2,57,93,7,210,148,104,64,65,195,14]},"announce":[],"urlList":[]}}