{"title":"Martin Sexton - Black Sheep [1996] [EAC/FLAC]","uid":11718540,"size":250546413,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:1e7c08fc19fb58669ee00ca59bd435b773cf5618&amp;dn=Martin+Sexton+-+Black+Sheep+%5B1996%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":15,"time":1424705231,"description":"\nFLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Eastern Front #111\nCountry: USA\nYear: 1996\nGenre: Folk,americana\nFormat:CD\n\n1\tBlack Sheep\t4:28\n2\tGlory Bound\t4:22\n3\tDiner\t3:02\n4\tFreedom Of The Road\t4:59\n5\tCaught In The Rain\t4:37\n6\tLove Keep Us Together\t3:58\n7\tOver My Head\t3:35\n8\tGypsy Woman\t4:41\n9\tCandy\t4:58\n10\tCan't Stop Thinking Bout You\t6:27\n11\tAmerica The Beautiful\t1:28\n\nMartin Sexton's acoustic singer/songwriter routine is just one of many flavors here; along with Motown-style R&amp;B, sweeping pop ballads, gypsy fiddling, blues, and jazz, there's even a little rapping. The genre jumping works surprisingly well. Producer Crit Harmon sequences the switches with sensitivity and class, and gives the set a consistent sound -- warm, spontaneous, grounded in acoustics, deeply soulful. Vocally, Sexton handles the stylistic gymnastics with extravagant ease. He'll belt out a tune with all the velvet bombast of Wonder, retreat to a Billie Holiday warble, ascend to an Aaron Neville falsetto, then swagger his way home like Ray Charles or Johnny Popper. There is, however, a cost for his expanded palette: originality. Such soulful singing is rarely set against a sparse folk background (which is often associated with off-key eccentrics like Bob Dylan and Neil Young). As his band imitates the soul masters who influenced his vocals, his act seems less fresh, and stands against somewhat stiffer vocal competition. Sexton has told interviewers that folk music tends to speak only to his head (&quot;like a thick novel&quot;), while simpler pop music hits him in the gut. His songwriting seems to reflect that he edges away from the urban poetry of his Bostonian peers but toward plain old pop, and it's not bad -- his lyrics previously seemed a little overreaching -- but it does make some of the songs on Black Sheep a little less interesting than the ones on his 1991 demo tape, In the Journey. All of the diversity, though, does make the solo acoustic moments all the more gratifying, spotlighting not only Sexton's sensational singing but also his warm, bass-heavy, rhythmically slick acoustic guitar playing","torrent":{"xt":"urn:btih:1e7c08fc19fb58669ee00ca59bd435b773cf5618","amp;dn":"Martin+Sexton+-+Black+Sheep+%5B1996%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e7c08fc19fb58669ee00ca59bd435b773cf5618","infoHashBuffer":{"type":"Buffer","data":[30,124,8,252,25,251,88,102,158,224,12,165,155,212,53,183,115,207,86,24]},"announce":[],"urlList":[]}}