{"title":"Active Directory Cookbook, 3rd Edition","uid":4729732,"size":3972701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:1e9cf12d11ba544c9fc94a8c8c1a2c88eac03f90&amp;dn=Active+Directory+Cookbook%2C+3rd+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"VasiaZozulia","files":1,"time":1234953159,"description":"When you need practical hands-on support for Active Directory, the updated edition of this extremely popular Cookbook provides quick solutions to more than 300 common (and uncommon) problems you might encounter when deploying, administering, and automating Microsoft's network directory service. For the third edition, Active Directory expert Laura E. Hunter offers troubleshooting recipes based on valuable input from Windows administrators, in addition to her own experience. You'll find solutions for the Lightweight Directory Access Protocol (LDAP), ADAM (Active Directory Application Mode), multi-master replication, Domain Name System (DNS), Group Policy, the Active Directory Schema, and many other features. The Active Directory Cookbook will help you: Perform Active Directory tasks from the command line Use scripting technologies to automate Active Directory tasks Manage new Active Directory features, such as Read-Only Domain Controllers, fine-grained password policies, and more Create domains and trusts Locate users whose passwords are about to expire Apply a security filter to group policy objects Check for potential replication problems Restrict hosts from performing LDAP queries View DNS server performance statistics","torrent":{"xt":"urn:btih:1e9cf12d11ba544c9fc94a8c8c1a2c88eac03f90","amp;dn":"Active+Directory+Cookbook%2C+3rd+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1e9cf12d11ba544c9fc94a8c8c1a2c88eac03f90","infoHashBuffer":{"type":"Buffer","data":[30,156,241,45,17,186,84,76,159,201,74,140,140,26,44,136,234,192,63,144]},"announce":[],"urlList":[]}}