{"title":"Red Hot Chili Peppers - The Red Hot Chili Peppers (1984) WMA320","uid":6095745,"size":114270799,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1fc6a3cdf411e1cd079bb6dc15b45062db4d2c44&amp;dn=Red+Hot+Chili+Peppers+-+The+Red+Hot+Chili+Peppers+%281984%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1294766835,"description":"This album is their first, and one of their finest. This is a very different Red Hot Chili Peppers than their present day music, but every bit as good. Twenty years after its release, it holds up powerfully. \nIf you have never heard &quot;True Men Don't Kill Coyotes,&quot; you are missing one of the finest Hollywood/Southern California anthems ever written. Pop? Rap? Rock? I honestly think there is no way to properly classify this song, it's the perfect tune to announce the rival of the Chili Peppers, and pretty much personifies their offbeat charge into the music world. \n\nYou can find the abovementioned song on one of their &quot;Best Of&quot; albums, but the rest of the songs on this CD are too good to pass off. The mightiest tracks are 1 through 6, with &quot;Buckle Down&quot; and the overdrive-paced &quot;Get Up and Jump&quot; stealing the show. The diversity of the songs on these first six tracks is impressive. \n\nThe Chili Peppers were such a rush of fresh air when they hit the scene in 1984. I remember a plethora of heavy metal and new wave all over the airwaves &amp; record stores; some good, lots bad. No new group, however, crashed the music scene that year quite like The Red Hot Chili Peppers. Pick up this CD and compare it to the playlists of the mid 1980s, and I bet the sheer contrast will show you what a cutting edge band The Red Hot Chili Peppers were when they hit the scene. \n\nGive this album a chance, and I think you will find that the Red Hot Chili Peppers didn't get better with time: they started out great, and since then have tinkered with their musical style, all the while keeping their unmistakable Funky spirits in full force. Yes, The Red Hots still have &quot;Baby Appeal!&quot; \n\nby K. Brown &quot;El Rudo Lucky Pierre!&quot;\n\nTRACKLIST:\n\n01 - True Men Don't Kill Coyotes.wma                             \n02 - Baby Appeal.wma                                             \n03 - Buckle Down.wma                                             \n04 - Get Up And Jump.wma                                         \n05 - Why Don't You Love Me.wma                                   \n06 - Green Heaven.wma                                            \n07 - Mommy Where's Daddy.wma                                     \n08 - Out In L.a..wma                                             \n09 - Police Helicopter.wma                                       \n10 - You Always Sing The Same.wma                                \n11 - Grand Pappy Du Plenty.wma                                   \n12 - Get Up And Jump (Demo).wma                                  \n13 - Police Helicopter (Demo).wma                                \n14 - Out In L.a. (Demo).wma                                      \n15 - Green Heaven (Demo).wma                                     \n16 - What It Is (Aka Nina's Song) (Demo).wma    \n\nWMA 320Kbps 44100Hz STEREO","torrent":{"xt":"urn:btih:1fc6a3cdf411e1cd079bb6dc15b45062db4d2c44","amp;dn":"Red+Hot+Chili+Peppers+-+The+Red+Hot+Chili+Peppers+%281984%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fc6a3cdf411e1cd079bb6dc15b45062db4d2c44","infoHashBuffer":{"type":"Buffer","data":[31,198,163,205,244,17,225,205,7,155,182,220,21,180,80,98,219,77,44,68]},"announce":[],"urlList":[]}}