{"title":"The Fresh Prince of Bel-Air Complete Series (DVD-ISO) High Qua","uid":6456219,"size":153181362176,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1fef60943aba6c24c28cc53c653424d93ae57b5e&amp;dn=The+Fresh+Prince+of+Bel-Air+Complete+Series+%28DVD-ISO%29+High+Qua&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"atomicwarfare","files":23,"time":1307597354,"description":"The Fresh Prince of Bel-Air Complete TV Series (DVD-ISO Images Untouched) High Quality.\n\n\nTV Show Info:\n=============\n\nA wealthy family living in Bel-Air, California, receives a dubious gift from their poorer relations in Philadelphia when Grammy Award-winner Will Smith arrives as The Fresh Prince Of Bel-Air. His mother wants him to learn some good old-fashioned values from his successful relatives. But Will shatters the sophisticated serenity of Bel-Air with his streetwise common sense, much to the dismay of his upper-crust uncle, Philip Banks (James Avery), Aunt Vivian (Janet Hubert-Whitten and Daphne Maxwell Reid) and three conceited cousins, Carlton (Alfonso Ribeiro), Hilary (Karyn Parsons) and Ashley (Tatyana Ali) - and even the butler, Geoffrey (Joseph Marcell). As the Banks family opens their home - and their checkbook - to their needy relative, Will adapts easily to their indulgent lifestyle. Yet, he reminds everyone that the simplest pleasures of family life can't be bought at any price.\n\n=============\n\nPlease continue to seed this because the uploader will not be able to continue seeding due to internet limitations. Also because this is a big torrent please DO NOT cap your upload speed, doing this will delay the seeding process which delays me from uploading my next planned uploads.\n\n=============\n\nComing soon will be...\n\n- Tom and Jerry all 161 Classic Episodes (DVD-Rip)\n\n- Tom and Jerry Classic Collection Vol. 1 - 12 (DVD-ISO)\n\n- Alex Haley's Roots - The Complete Ministries Collection\n  + The gift + Queen (DVD-Rip)\n\n- Alex Haley's Roots - The Complete Ministries Collection\n  + The gift + Queen (DVD-ISO)\n","torrent":{"xt":"urn:btih:1fef60943aba6c24c28cc53c653424d93ae57b5e","amp;dn":"The+Fresh+Prince+of+Bel-Air+Complete+Series+%28DVD-ISO%29+High+Qua","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1fef60943aba6c24c28cc53c653424d93ae57b5e","infoHashBuffer":{"type":"Buffer","data":[31,239,96,148,58,186,108,36,194,140,197,60,101,52,36,217,58,229,123,94]},"announce":[],"urlList":[]}}