{"title":"Stardock Fences v2.01 Keymaker AND Patch-RNDD","uid":7864668,"size":11905589,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:201a4bdab9315708d7f689026a057e0ca80acc41&amp;dn=Stardock+Fences+v2.01+Keymaker+AND+Patch-RNDD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rhizzu","files":-1,"time":1354029198,"description":"Stardock Fences 2.01 Incl Keymaker AND Patch| 13 Mb\n\nFences is a program that helps you organize your desktop. It can hide icons when they are not in use as well as make it easy to place icons into moveable groups called &quot;fences&quot;. What makes it so popular? Fences is the world's most popular desktop enhancement for WindowsÂ®. What makes it so compelling is that what it does is so obviously useful and necessary that it is amazing that no one has thought of it before.\n\nA one-of-a-kind tool\nCreate &quot;fences&quot; on your desktop to organize icons\nHide and show your desktop icons with a click\nMirror your folders' contents on the desktop\nHave new desktop icons automatically sorted into an appropriate &quot;fence&quot;\n\nOrganize\n\nNEW! Use your desktop to organize all of your stuff\n\nYou can have pages of fences on your desktop. To flip a page, just take your mouse cursor to the edge of your screen and click and drag. Then a new page of fences can be displayed. This feature makes it easy to use your desktop to organize all of your programs, documents, websites and more.\nKeep your desktop clean\n\nDouble-click any blank space on your desktop and your icons will fade out. Double-click again and they will return. You can even pick icons and individual fences to exclude.\n\nRope off your desktop\n\nFences allows you to create shaded areas on your desktop that you can place icons into called fences. You can label them however you wish and move or resize them anywhere on the desktop.\n\nControl\n\nAutomatically arrange your desktop\n\nDefine rules for how your icons are arranged. When a new icon gets added, from an installer for instance, it can automatically be added to a particular fence.\nNEW! Make your desktop a portal to your files\n\nFences can be made to act as a portal to a particular folder. For example, your documents or pictures folders can be mirrored onto your desktop as fences making them easy to access without cluttering up your desktop. \n\n\nHomepage: &lt;a href=&quot; http://www.stardock.com/products/fences/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.stardock.com/products/fences/&lt;/a&gt;","torrent":{"xt":"urn:btih:201a4bdab9315708d7f689026a057e0ca80acc41","amp;dn":"Stardock+Fences+v2.01+Keymaker+AND+Patch-RNDD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"201a4bdab9315708d7f689026a057e0ca80acc41","infoHashBuffer":{"type":"Buffer","data":[32,26,75,218,185,49,87,8,215,246,137,2,106,5,126,12,168,10,204,65]},"announce":[],"urlList":[]}}