{"title":"American Cars 1946-1959: Every Model, Every Make","uid":5507732,"size":21352536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:203f2a8c057cdc9f14fe3239396e564f7097e228&amp;dn=American+Cars+1946-1959%3A+Every+Model%2C+Every+Make&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"artpepper","files":-1,"time":1271896556,"description":"American Cars 1946-1959: Every Model, Year by Year\n\nJ. Kelly Flory\n\nMcFarland | 2008 | ISBN-10: 0786432292 | 1047 Pages | PDF | 13,2 MB\n\n\n\n\n\n\n\n\nFrom the resumption of automobile production at the close of World War II through the 1950s, the American auto industry would see the births and deaths of several manufacturers, great technological advances, and an era of dramatic styling as a prospering nation asserted its growing mobility. \n\n\nCars of this period are among the most iconic vehicles ever built in the United States: the 1949 Ford, the remarkable Studebaker designs of 1950 and 1953, the 1955-1957 Chevrolets, the &quot;Forward Look&quot; Chrysler products, the ill-fated Edsel and many others.\n\nThis comprehensive reference book details every model from each of the major manufacturers (including independents such as Kaiser-Frazer and Crosley but excluding very low-volume marques such as Tucker) from model years 1946 through 1959. \n\n\nYear by year, it provides an overview of the industry and market, followed by an individual report on each company: its main news for the year (introductions or cancellations of models, new engines and transmissions, advertising themes, sales trends etc.); its production figures and market status; and its powertrain offerings, paint colors and major options. \n\n\nThe company's models are then detailed individually with such information as body styles, prices, dimensions and weights, standard equipment and production figures. Nearly 1,000 photographs are included.\n\n\n","torrent":{"xt":"urn:btih:203f2a8c057cdc9f14fe3239396e564f7097e228","amp;dn":"American+Cars+1946-1959%3A+Every+Model%2C+Every+Make","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"203f2a8c057cdc9f14fe3239396e564f7097e228","infoHashBuffer":{"type":"Buffer","data":[32,63,42,140,5,124,220,159,20,254,50,57,57,110,86,79,112,151,226,40]},"announce":[],"urlList":[]}}