{"title":"Marshall Brain - The Second Intelligent Species (mobi, epub)","uid":11952482,"size":768075,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:209514d864711f4fe30955a6c1a06367777d5f9d&amp;dn=Marshall+Brain+-+The+Second+Intelligent+Species+%28mobi%2C+epub%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":3,"time":1432218201,"description":"\nThe Second Intelligent Species: How Humans Will Become as Irrelevant as Cockroaches (mobi, epub)\n\n\nRight now, as far as we can tell, there is exactly one intelligent species in the universe and it is us: human beings. We currently see no evidence of any kind indicating that extraterrestrials exist outside of our solar system.\n\nBut at this moment, millions of engineers, scientists, corporations, universities and entrepreneurs are racing to create the second intelligent species right here on planet earth. And we can see the second intelligent species coming from all directions in the form of self-driving cars, automated call centers, chess-playing and Jeopardy-playing computers that beat all human players, airport kiosks, restaurant tablet systems, etc.\n\nThe frightening thing is that these robots will soon be eliminating human jobs in startling numbers. The first wave of unemployed workers is likely to be a million truck drivers who are replaced by self-driving trucks. Pilots will be eliminated soon as well. Then, as new computer vision systems come online, we will see tens of millions of workers in retail stores, fast food restaurants and construction sites replaced by robots. Unless we take steps now to change the economy, we will soon have tens of millions of workers who are unemployed and seeking welfare because they will have no other choice.\n\nMarshall Brain's new book &quot;The Second Intelligent Species: How Humans Will Become as Irrelevant as Cockroaches&quot; explores how the future will unfold as the second intelligent species emerges. The book answers questions like:\n\n- How will new computer vision systems affect the job market?\n- How many people will become unemployed by the second intelligent species?\n- What will happen to millions of newly unemployed workers?\n- How can modern society and modern economies cope with run-away unemployment caused by robots?\n- What will happen when the first sentient, conscious computer appears?\n- What moral and ethical principles will guide the second intelligent species?\n- Why do we see no extraterrestrials in our universe?\n\n&quot;The Second Intelligent Species&quot; offers a unique and fascinating look at the future of the human race, and the choices we will need to make to avoid massive unemployment and poverty worldwide as intelligent machines start eliminating millions of jobs. \n\n\nAuthor: Marshall Brain\nPublisher: BYG Publishing, Inc.\nPublication: April 7, 2015\n\nFormats:\n.mobi (compatible with Amazon Kindle, etc.)\n.epub (compatible with Sony Reader, Cruz Reader, iPad, iPodTouch/iPhone, etc.)","torrent":{"xt":"urn:btih:209514d864711f4fe30955a6c1a06367777d5f9d","amp;dn":"Marshall+Brain+-+The+Second+Intelligent+Species+%28mobi%2C+epub%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"209514d864711f4fe30955a6c1a06367777d5f9d","infoHashBuffer":{"type":"Buffer","data":[32,149,20,216,100,113,31,79,227,9,85,166,193,160,99,103,119,125,95,157]},"announce":[],"urlList":[]}}