{"title":"CIA Documents on the Soviet Missile Gap","uid":7816813,"size":582062810,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:20a8b6f27132469e64a29e63a96330b0c1e234b2&amp;dn=CIA+Documents+on+the+Soviet+Missile+Gap&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"CovertHistory","files":181,"time":1352685060,"description":"The Missile Gap was in essence a growing perception in the West, especially in the USA, that the Soviet Union was quickly developing an intercontinental range ballistic missile (ICBM) capability earlier, in greater numbers, and with far more capability than that of the United States. Even as that perception was disproved, it became evident that the Soviets were placing their major effort toward developing strategic missiles against which, once launched, there was no defense. The perceived missile gap that ensued was based on a comparison between US ICBM strength as then programmed, and reasonable, although erroneous estimates of prospective Soviet ICBM strength that were generally accepted.\n\nBoth the Eisenhower and Kennedy administrations struggled to formulate policy in response to what was then believed to be an ever-growing advantage in Soviet strategic missiles. Breakthroughs in technology and innovative use of aerial and satellite photography eventually provided the CIA with a more accurate assessment of Soviet missile capacity, allowing policy makers to shift gears.","torrent":{"xt":"urn:btih:20a8b6f27132469e64a29e63a96330b0c1e234b2","amp;dn":"CIA+Documents+on+the+Soviet+Missile+Gap","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20a8b6f27132469e64a29e63a96330b0c1e234b2","infoHashBuffer":{"type":"Buffer","data":[32,168,182,242,113,50,70,158,100,162,158,99,169,99,48,176,193,226,52,178]},"announce":[],"urlList":[]}}