{"title":"James Gleick - Isaac Newton","uid":4892787,"size":213772613,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:20f4458a57a67f03f9c20ff9c2af1a6210f899cd&amp;dn=James+Gleick+-+Isaac+Newton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"deandominic","files":-1,"time":1242150477,"description":"General Information\n===================\n Title............: Isaac Newton                                  \n Author...........: James Gleick                \n Read By..........: Allan Corduner              \n Copyright........: 2003                              \n Genre............: Biography                \n Publisher........: Harper Collins                             \n Abridged.........: No              \n\nOriginal Media Information\n==========================\n Media............: 5 CDs  \n Condition........: Excellent\n \nFile Information\n================\n Number of MP3s...: 24\n Total Duration...: 5:45:47\n Total MP3 Size...: 202 MB\n Ripped by........: deandominic          \n Ripper...........: Exact Audio Copy                                 \n Encoder..........: LAME 3.97b2          \n Encoder Settings.: ABR 80 kbit/s 44100 Hz Mono      \n ID3 Tags.........: Yes v1.1, v2.3\n Scans............: Covers\n\n\nBook Description\n================ &lt;a href=&quot;\nhttp://www.amazon.com/Isaac-Newton-James-Gleick/dp/1400032954&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Isaac-Newton-James-Gleick/dp/1400032954&lt;/a&gt;\nArticle: http://www.slate.com/Default.aspx?id=2108438&amp;\n\n  James Gleick's biography of Isaac Newton is a mere 191 pages long. So much of a man -- and so many achievements -- and so little of a book ? (Forty-eight pages of (often informative) notes and eighteen pages of acknowledgements and sources only reinforce the feeling that Gleick is merely skimming the surface.)\n       Despite leading what might appear to be an uninteresting personal life -- lacking both romance and adventure (Gleick suggests Newton never even ventured so far as to &quot;set eyes on the ocean&quot;) -- Newton was one of the intellectual giants of recent times and he certainly kept busy. He contributed significantly to the advancement of science and mathematics, ran the English Mint (overseeing and implementing changes that make the debate over embracing the euro look absolutely trivial), and wrote extensively on theology and alchemy. He may not have experienced a great deal -- travelled, loved -- but he did do a great deal, and one of the things Gleick conveys quite well is how incredibly industrious Newton was. (He also wasn't quite as removed from the world at large as is generally thought, especially during his years leading the Mint and the Royal Society.)\n       Gleick races formidably along in his book. Newton did a great deal, and Gleick at least makes an effort to list all his accomplishments, occasionally explaining more about particular discoveries, debates, and activities, but never getting bogged down anywhere. Gleick does all this very well: the presentation is clear, there is a great deal of information, and it reads well. Gleick compresses information into what seems like the smallest possible space, and he doesn't dally. The science -- especially the great leaps Newton made --, the friendships and enmity and competition, the scholarly and scientific life of the day: one gets a good impression of it all.\n       Gleick quotes extensively, generally to good effect (though occasionally one suspects the old-English quotes are there just for that: a bit of theatrical effect), and he explains the science well too (without going into too much detail). He makes a lot out of Newton's curious penchant for secrecy (&quot;He noted the results and told no one&quot; is a recurrent theme) He's good on the personal relationships too, especially Newton's running feud with Robert Hooke (which Gleick has more fun with than the better-known Newton-Leibniz dispute). There are some wonderful details -- such as that Newton preferred &quot;A.C.&quot; to &quot;A.D.&quot; (he didn't believe in the holy Trinity, and so felt it was inappropriate to say &quot;in the year of our Lord&quot; and considered it in the year of Christ instead).\n       It's a whirlwind tour, however, and Gleick skips over some things too quickly, notably Newton's odd alchemical pre-occupations. Like many authors, he appears simply not to know how to reconcile this with the scientific image of Newton that has been carefully cultivated over the past centuries, and so he only makes quick mention of it. Isaac Newton is a good, quick, packed read. One gets a good sense of Newton's accomplishments, and some of the man himself as well.\n       Gleick presents Newton's life about as well as one could conceive it being presented in 191 pages But that's the problem with the book too. Newton's life and accomplishment simply don't fit in such a circumscribed space. There are pages where almost each sentence seems a summary of what should be a whole chapter. Far from living an empty, boring life Newton's was overfull, and while Gleick offers a glimpse of the outlines there's clearly so much more to it. (At least Gleick provides an excellent bibliography that the now eager reader can use as a starting point for really exploring this fascinating man's life.)","torrent":{"xt":"urn:btih:20f4458a57a67f03f9c20ff9c2af1a6210f899cd","amp;dn":"James+Gleick+-+Isaac+Newton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20f4458a57a67f03f9c20ff9c2af1a6210f899cd","infoHashBuffer":{"type":"Buffer","data":[32,244,69,138,87,166,127,3,249,194,15,249,194,175,26,98,16,248,153,205]},"announce":[],"urlList":[]}}