{"title":"Schlesinger&amp;Kinzer-Bitter Fruit-American Coup in Guatemala(1982)","uid":5422978,"size":5193112,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:212e95c0589ac699513269ea466f6f87b199becd&amp;dn=Schlesinger%26Kinzer-Bitter+Fruit-American+Coup+in+Guatemala%281982%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1268147138,"description":"This is Stephen Schlesinger's and Stephen Kinzer's schocking book Bitter Fruit - The Untold Story of the American Coup in Guatemala (1982) which is a comprehensive and insightful account of the CIA operation to overthrow the democratically elected government of Jacobo Arbenz of Guatemala in 1954. It tells the story of Operation Success, in which the CIA, the U.S. State Department and the Executive Branch conspired on behalf of the United Fruit Company to overthrow the government of Guatemala. Based on scores of CIA and State Department documents obtained under the Freedom of Information Act, it is a dramatic rendition of a beautifully planned treachery that may be the most important episode in the history of both the CIA and modern Central America. Indeed, it was the seed of later secret operations in Cuba as well as of the bloody revolutions which convulsed El Salvador, Guatemala and Nicaragua. With US president Eisenhower's approval, secretary of state John Foster Dulles and his brother Allen, director of the CIA, conceived and orchestrated a plot that would put in power a government &quot;compatible&quot; with United Fruit. The plot included a pistol-packing ambassador, a propaganda campaign mounted in the American press, a ragtag &quot;nationalist&quot; army hired by the CIA, a disinformation campaign conducted through clandestine radio stations and mercenary American pilots who bombed Guatemala City. This amazing book is essential reading for anyone who wants to understand why Central America is in flames to this very day. It considers important questions of U.S. intervention, the role of multinational corporations and the mandate of the CIA. Bitter Fruit is indeed a bitter warning of what happens when the United States abuses its power. 320 pages, some pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:212e95c0589ac699513269ea466f6f87b199becd","amp;dn":"Schlesinger%26Kinzer-Bitter+Fruit-American+Coup+in+Guatemala%281982%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"212e95c0589ac699513269ea466f6f87b199becd","infoHashBuffer":{"type":"Buffer","data":[33,46,149,192,88,154,198,153,81,50,105,234,70,111,111,135,177,153,190,205]},"announce":[],"urlList":[]}}