{"title":"Atwill-Caesar's Messiah-Roman Conspiracy to Invent Jesus(2005","uid":4533104,"size":2406127,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:217090cda64c56625874addbad22feb7ffa613b8&amp;dn=Atwill-Caesar%5C%27s+Messiah-Roman+Conspiracy+to+Invent+Jesus%282005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227633933,"description":"This is Joseph Atwill&amp;#039;s mindblowing book Caesar&amp;#039;s Messiah - The Roman Conspiracy to Invent Jesus (2005) which makes a most convincing case that the Christian Gospels, considered by belivers as an act of god, were actually written under the direction of first-century Roman emperors to serve their selfish geopolitical goals. Was Jesus the invention of a Roman emperor? The author of this ground-breaking book believes he was but this is only the start of the giant controversy which follows. Caesar&amp;#039;s Messiah reveals the key to a new and revolutionary understanding of Christian origins. The clues leading to its startling conclusions are found in the writings of the first-century historian Flavius Josephus, whose War of the Jews is one of the only historical chronicles of this period as no other accounts of any Jesus have ever been found, not even in fields of archeology. Closely comparing the work of Josephus with the New Testament Gospels, Caesar&amp;#039;s Messiah demonstrates that the Romans secretly directed the writing of both. Their purpose: to offer a vision of a &quot;peaceful Messiah&quot; who would serve as an alternative to the revolutionary leaders who were rocking first-century Israel and threatening Rome. Similarly, Caesar&amp;#039;s Messiah will rock our understanding of Christian history as it reveals that Jesus was a fictional character portrayed in four Gospels written not by Christians but Romans themselves - who after all crucified him at the end only to make the case even more convincing so that the believers would blindly think Jesus was against Rome. Reading Josephus&amp;#039;s chronicle, The War of the Jews, the author found detail after detail that closely paralleled events recounted in the Gospels. Atwill skillfully demonstrates that the emperors used the Gospels to spark a new religious movement that would aid them in secretly maintaining power and order in Israel and elsewhere. What is more, by including hidden literary clues, they took the story of the Emperor Titus&amp;#039; glorious military victory, as recounted by Josephus, and embedded that story in the Gospels - a sly and satirical way of glorifying the emperors through the ages without the believers noticing anything. In other words Titus WAS the real-life Jesus and skillfull Roman propagandists transformed his bloody terror campaign into the most magical journey you can possibly imagine as he &quot;saves&quot; the people of Israel. Are the symbolic phrases like &quot;eating the flesh of my son&quot; in reality just a disguised version of the real-life cannibalism that took place in Jerusalem as a result of a horriffic famine inflicted upon the people there by the Roman armies which surrounded the city and didn&amp;#039;t let any food in? And what do the terms &quot;walking on water&quot; and &quot;fishing for men&quot; really mean? Atwill&amp;#039;s book offers a most scholarly analysis of the meanings of those puzzling words in context of the Josephus&amp;#039; chronicles to which the Gospels are just a satirical version of the real events. The Roman geopoliticians must of laughed all the way to the bank as the trick succeeded in full. Even more, it was so successfull that it is still in use today by today&amp;#039;s &quot;empires&quot; (especially American) to convince the believers to just sit in place and wait for a &quot;second comming of Christ&quot; - a second establishment of a Roman empire which really created all those stories to calm down the people who have just been either slaughtered alive, starved to death or simply enslaved by the merciless Roman armies. Is America a second Rome and is Christianity only a conspiracy against all conquered people of the Roman empire which thus wishes them to remain in the chains of slavery forever? Is Jesus only a false messiah who does everything you would expect from a rebel but in the end offers &quot;his other cheek&quot; and lets himself be crucified only to make the trick more believable? Caesar&amp;#039;s Messiah will certainly be one of the most controversial books you will ever read about the history of religions - and after all empires too as &quot;the empire always strikes back&quot;. 360 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:217090cda64c56625874addbad22feb7ffa613b8","amp;dn":"Atwill-Caesar%5C%27s+Messiah-Roman+Conspiracy+to+Invent+Jesus%282005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"217090cda64c56625874addbad22feb7ffa613b8","infoHashBuffer":{"type":"Buffer","data":[33,112,144,205,166,76,86,98,88,116,173,219,173,34,254,183,255,166,19,184]},"announce":[],"urlList":[]}}