{"title":"Handbook of Mechanical Nanostructuring - Mahmood Aliofkhazraei","uid":15331424,"size":14277448,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:21922cdf79ec577fdcd0df025e2379be05cb1c4a&amp;dn=Handbook+of+Mechanical+Nanostructuring+-+Mahmood+Aliofkhazraei&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468728013,"description":"Handbook of Mechanical Nanostructuring - Mahmood Aliofkhazraei (Wiley-VCH, 2015).pdf\r\n\r\nISBN 978-3-527-33506-0\r\n\r\nProviding in-depth information on how to obtain high-performance materials by controlling their nanostructures, this ready reference covers both the bottom-up and the top-down approaches to the synthesis and processing of nanostructured materials.\r\nThe focus is on advanced methods of mechanical nanostructuring such as severe plastic deformation, including high pressure torsion, equal channel angular processing, cyclic extrusion compression, accumulative roll bonding, and surface mechanical attrition treatment. As such, the contents are inherently application-oriented, with the methods presented able to be easily integrated into existing production processes. In addition, the structure-property relationships and ways of influencing the nanostructure in order to exhibit a desired functionality are reviewed in detail. The whole is rounded off by a look at future directions, followed by an overview of applications in various fields of structural and mechanical engineering.\r\nWith its solutions for successful processing of complex-shaped workpieces and large-scale specimens with desired properties, this is an indispensable tool for purposeful materials design","torrent":{"xt":"urn:btih:21922cdf79ec577fdcd0df025e2379be05cb1c4a","amp;dn":"Handbook+of+Mechanical+Nanostructuring+-+Mahmood+Aliofkhazraei","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21922cdf79ec577fdcd0df025e2379be05cb1c4a","infoHashBuffer":{"type":"Buffer","data":[33,146,44,223,121,236,87,127,220,208,223,2,94,35,121,190,5,203,28,74]},"announce":[],"urlList":[]}}