{"title":"Madonna - Lucky Star (Remix Version)","uid":8733306,"size":52453152,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:22016f5a18183c6dab823c9786e0c9d89fa45dad&amp;dn=Madonna+-+Lucky+Star+%28Remix+Version%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fiveofseven","files":1,"time":1374640380,"description":"Same video only an extended remix...\n\nThe music video was directed by Arthur Pierson, and was produced by Glenn Goodwin, while Wayne Isham was in charge of photography. At the time of the song's release, Madonna's style of dress was catching on as a fashion statement among club kids and her fans. The most prominent among her fashion accessories were the crucifixes she wore as earrings and necklaces. Madonna commented that wearing a rosary and a crucifix is &quot;kind of offbeat and interesting. I mean, everything I do is sort of tongue-in-cheeks. Besides, the crucifixes seem to go with my name.&quot; In reality, she was trying to find a separate image for herself, being inspired by then artists like Boy George, Cyndi Lauper and David Bowie, and their constantly shifting image and persona. Madonna realised the importance of her music videos and its popularity via MTV - launched in 1981 - was instrumental in popularising her image.\n\nThe rush for Madonna's fashion started with the music video for &quot;Lucky Star&quot;. In the video, Madonna wore an all-black outfit with leggings, ankle boots, and belly button, with her tangled hair tied in a floppy black ribbon. This was coupled with a shiny black miniskirt, an earring on her right ear, cut-off gloves and rubber bangles. Madonna's friend Erika Belle was credited with designing the outfit, although biographer Mary Cross noted that Madonna was after all wearing her day-to-day outfit. Mary Lambert, then a Rhode Island School of Design graduate, was decided for directing the video. However, Arthur Pierson replaced her as the director. Warner Bros. gave Pierson a small budget to make the video, shot in an afternoon. The video starts with the close-up of Madonna's face, as she slides her sunglasses down her nose. This scene was a reference to the character of Lolita in Stanley Kubrick's 1962 film of the same name, and Audrey Hepburn in the movie Breakfast at Tiffany's (1961). The image then fades to white, denoting the celestial stars dazzle, and then resumes itself in color. Madonna is shown dancing against a stark white background, along with closeups of her mesmerised gaze. She is accompanied by Belle and brother Christopher, as backup dancers. The video ends with the initial black-and-white image repeated, but in retrograde, as Madonna puts back on the sunglasses. The taking down and putting up of those sunglasses provided a frame to contain the song, functioning like a curtain that marks the opening and closing of a stage performance.\n\n\n\nFile Name:\nMadonna Lucky Star Remixed Version\n\nFile Format:\nmp4\n\nDuration:\n00:05:05\n\nBit Rate:\n1374k\n\nFile Size:\n50.02 MB\n\nVideo Codec:\nh264\n\nVideo Bitrate:\n1245k\n\nVideo Size:\n720x544\n\nAspect Ratio:\n1.32:1\n\nFrame Rate:\n23.98fps\n\nAudio Codec:\nmp3\n\nAudio Bitrate:\n128k\n\nChannels:\n2\n\nSample Rate:\n48000","torrent":{"xt":"urn:btih:22016f5a18183c6dab823c9786e0c9d89fa45dad","amp;dn":"Madonna+-+Lucky+Star+%28Remix+Version%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22016f5a18183c6dab823c9786e0c9d89fa45dad","infoHashBuffer":{"type":"Buffer","data":[34,1,111,90,24,24,60,109,171,130,60,151,134,224,201,216,159,164,93,173]},"announce":[],"urlList":[]}}