{"title":"Dead Man Walking_Ita_1995(DVDRip)","uid":4847492,"size":726941696,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:225d4553dddfaad5476565735f7b6b2eeca53844&amp;dn=Dead+Man+Walking_Ita_1995%28DVDRip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mrgiox","files":1,"time":1239740070,"description":"Da movies.yahoo\n\nDead Man Walking - Condannato a Morte (Dead Man Walking)\n\nCast\n    Susan Sarandon, Sean Penn, Robert Prosky, Lois Smith, Jon Abrahams, Eva Amurri, Ray Aranha, Raymond Barry, Jack Black\n\nRegia\n    Tim Robbins\n\nSceneggiatura\n    Tim Robbins\n\nData di uscita\n    1995\n\nGenere\n    Drammatico\n\n\nTrama\n\nIl giovane Matthew Poncelet, condannato a morte in Louisiana, scrive alla suora Helen Prejean per avere colloqui ed assistenza in carcere. Con l'amico Carl Vitello, ora all'ergastolo, il giovane ha ucciso una notte due fidanzati che si erano appartati in un bosco. Vitello avendo tanto denaro ha potuto scampare con validi avvocati alla pena capitale, mentre Matthew ÃƒÂ¨ stato condannato a morte. Con l'approvazione dei suoi superiori, suor Helen (che svolge i propri compiti in un centro di servizi sociali) si appresta alla insolita missione. Matthew ÃƒÂ¨ un tipo fra il bullesco e lo sprezzante, ma in realta ÃƒÂ¨ disperato e dopo qualche contatto la suora entra in crisi. Tuttavia visita la madre del detenuto, Lucille Poncelet (con altri figli minorenni a carico cui provvedere) e raccoglie notizie ed elementi sull'infanzia del giovane, che ha contro l'opinione pubblica, la stampa e la televisione, oltre che i comitati favorevoli alla pena di morte. La minoranza invece, contraria alla barbarie delle esecuzioni in carcere, lotta invano. Ingaggiato un solerte difensore, vengono attivati gli ultimi strumenti giuridici utilizzabili, tra i quali la domanda di grazia al Governatore dello Stato, che la negherÃƒÂ . Suor Helen contatta i familiari delle due vittime: Earl Delacroix per il ragazzo Walter; Clyde e Mary Beth Percy per la figlia Hope, violentata e straziata prima dell'assassinio. Costoro non comprendono come la suora &quot;difenda&quot; un criminale non accettando loro l'idea del perdono. Malgrado lo scarsissimo tempo residuo, Matthew ha qualche cedimento: le parole della sua assistente spirituale e la Bibbia che essa gli ha dato cominciano ad avere effetto mentre le visite e l'evidente stato di angoscia e di crisi della suora aprono spiragli nel suo cuore. Suor Helen ottiene di poter assistere alla terribile prova dell'esecuzione pubblica, perchÃƒÂ© lui la vuole vicina: alla vigilia e fra le prime lacrime le confessa che lei soltanto ha dimostrato di volergli bene. GiÃƒÂ  legato al lettuccio per essere sottoposto ad iniezioni di sostanze chimiche secondo le norme in vigore per l'esecuzione, le ultime parole di Matthew sono una richiesta di perdono ai parenti presenti, la confessione della propria delittuosa complicitÃƒÂ  (ha ucciso, tuttavia, solo il ragazzo, violentando Hope) e la dichiarazione di affetto a quella suora che tende fino alla morte la propria mano verso di lui.\n\nNote\n\nREVISIONE MINISTERO MARZO 1996.\n\nOSCAR 1996: MIGLIOR ATTRICE PROTAGONISTA (SUSAN SARANDON).\n\nCOSTUMI DI RENEE EHRLICH KALFUS.\n\nDAVID DI DONATELLO 1996 PER MIGLIORE ATTRICE STRANIERA A SUSAN SARANDON.","torrent":{"xt":"urn:btih:225d4553dddfaad5476565735f7b6b2eeca53844","amp;dn":"Dead+Man+Walking_Ita_1995%28DVDRip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"225d4553dddfaad5476565735f7b6b2eeca53844","infoHashBuffer":{"type":"Buffer","data":[34,93,69,83,221,223,170,213,71,101,101,115,95,123,107,46,236,165,56,68]},"announce":[],"urlList":[]}}