{"title":"MOUSE GUARD - THE BLACK AXE 01-06 (2010-2013) Complete (Archaia)","uid":8143765,"size":149628190,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:227c8082be20a647c0c71a4a97e09b42e84f0796&amp;dn=MOUSE+GUARD+-+THE+BLACK+AXE+01-06+%282010-2013%29+Complete+%28Archaia%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STFmaryville","files":-1,"time":1360863425,"description":"In the world of Mouse Guard, mice struggle to live safely and prosper amongst harsh conditions and a host of predators. Thus the Mouse Guard was formed: more than just soldiers, they are guides for common mice looking to journey without confrontation from one village to another. They see to their duty with fearless dedication so that they may not simply exist, but truly live.\n\n------\n\nMouse Guard is an Eisner Award Winning comic book series written and illustrated by David Petersen. Digging into his love of animal stories and medieval roleplaying games, David created a fantasy adventure world of cloaked, sword wielding mice who protect the common mouse against threats of predator, weather, &amp; wilderness. The stories are released as a series of mini series available as individual comic issues first, and then collected into hardcover volumes.\n\nIn the United States, Mouse Guard is published by Archaia Entertainment.\n\nMouse Guard returns for its third volume: the Black Axe. This prequel set in 1115, fulfils the promise the wise oldfur Celanawe made to tell Lieam of the day his paw first touched the Black Axe. The arrival of distant kin takes Celanawe on an adventure that will carry him across the sea to uncharted waters and lands all while unraveling the legend of Farrer, the blacksmith who forged the mythic axe. Issues of the series start Dec. 2010 running bi-monthly for 6 issues.\n\n------\n\nYeah, about that bi-monthly thing ... Petersen only produced one issue in 2010, 2 each year for 2011 and 2012, and the final issue (#6) arrived on Wednesday, about 28 months after #1.\n\nAll credit to the scanners, at least 4 are the work of Minutemen-DTs -- I suspect the uncredited #2 is also -- and digital-Empire released #6 ... I considered waiting for a DTs scan of #6, but decided to compile these 6 files together for now.\n\nPlease seed and enjoy! --STFmaryville","torrent":{"xt":"urn:btih:227c8082be20a647c0c71a4a97e09b42e84f0796","amp;dn":"MOUSE+GUARD+-+THE+BLACK+AXE+01-06+%282010-2013%29+Complete+%28Archaia%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"227c8082be20a647c0c71a4a97e09b42e84f0796","infoHashBuffer":{"type":"Buffer","data":[34,124,128,130,190,32,166,71,192,199,26,74,151,224,155,66,232,79,7,150]},"announce":[],"urlList":[]}}