{"title":"The World's Greatest Sinner (1962) TVRip","uid":4474751,"size":3704313856,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:22dd5a1e84a38f1413c95d414f45805ba4c5e2ca&amp;dn=The+World%5C%27s+Greatest+Sinner+%281962%29+TVRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"peteophile","files":-1,"time":1225296190,"description":"&quot;THE WORLD&amp;#039;S GREATEST SINNER&quot; Carey, the hepcat messiah&amp;#039;s self-made 1961 masterpiece where an ordinary man declares himself &quot;God&quot; is an astounding parable of Good and Evil in SoCal.  A jaw-dropping fusion of Garage Rock (Zappa style), drive-in madness and Friedrich Nietzsche it deserves it&amp;#039;s reputation as one of the most notorious underground films ever made!&quot;\n\nWritten, Directed, Starring TIMOTHY CAREY\nMusic by FRANK ZAPPA\n\n&quot;The obscurity of this film is one of film-making&amp;#039;s greatest injustices. At the time this film received a small release, the world just wasn&amp;#039;t ready for cinema this revolutionary. It seems Timothy Carey is still ahead of us all with the ideas presented on screen. This film is surreal and even blasphemous, a blow to the so-called &quot;controversial&quot; films of the day. Despite the lack of talent (not on his part) and resources, Carey pulled through and made a masterpiece. This film demands a bigger cult following that it currently has.\n\nClarence Hilliard is an insurance salesman who one day is fired from his job for giving everybody the day off. He at this point comes to the revelation that the only God is man, and begins calling himself &quot;God&quot;. With the help of his gardener, he plans to bring the Gospel of Clarence to the masses. To bring his message to the masses, he begins his own rock &amp;#039;n&amp;#039; roll band, garnering the attention of a slimy political manager. The manager convinces him to give up the band and run for president. He agrees and is on his way to the top. (slight spoiler alert) However, he meets God in the end, and God and God have a final duel to the death. God wins (end spoiler).\n\nThis concept is weird and out there enough, imagine anyone trying to make it in the late 50s (when the film-making began)! Hollywood would never touch the idea, prompting Timothy Carey to make the film himself with his own money. This was before independent and underground cinema was hip, before John Cassavetes or Andy Warhol ever made their films. Carey was fighting the Hollywood system with his own little movie, and was doomed to fail. The film never received a wide distribution, and played only at a select few drive-ins. Over the years it became an underground cult classic, with Martin Scorcese and Bruce Springsteen reportedly among its fans. John Cassavetes claimed Carey had the brilliance of Sergei M. Eisenstein (the Russian director best-known for &quot;Battleship Potemkin&quot;). The depressing thing is, despite all this acclaim, the film largely still remains unknown. The only way to obtain it legally is through Carey&amp;#039;s son&amp;#039;s company Absolute Films.\n\nAs for the film itself, it works well despite the fact it shouldn&amp;#039;t. The acting is (aside from Carey) horrible. However, that doesn&amp;#039;t matter because it is all Carey&amp;#039;s show. His presence is amazing, and you wonder if Carey is even playing a character. He is creepy and slimy, and his dialog is completely gonzo. A character actor who had several small but memorable roles in &quot;The Killing&quot; and &quot;Paths of Glory&quot;, this is the only film where he truly gets to shine as it is his only lead role. The actors around him can&amp;#039;t compete, but they add to the strange dreamlike quality of the film. Carey is an amazing individual who should have a larger cult following than he already has. Anything with him is worth watching, no matter how small the part or how bad the movie. This film is the greatest showcase of the genius, and is recommended to anyone who is a serious film fan. Timothy Carey&amp;#039;s son has had plans to release a DVD of this film for a while, hopefully it will be out soon. Also, any cult film fan should watch this film. It&amp;#039;s as surreal and dreamlike as &quot;Eraserhead&quot; or &quot;Carnival of Souls&quot;. A true cult classic and my personal favorite film.&quot;\n\n&quot;Recently I had the privilege of viewing a poor quality bootleg videotape of this film. Boy, was I in for a surprise.\n\nFor starters, I&amp;#039;m not one to typically enjoy cult classics or films that are in the &quot;so-bad-they-are-good category.&quot; My initial attraction to this film was based on one thing - Timothy Carey.\n\nI first learned of Timothy Carey when I purchased a Stanley Kubrick DVD of &quot;The Killing&quot;. Carey has a small but important role in this film, and the minute he first appeared on screen I knew there was something special about this guy. There was a magnetic bizarreness to him that simply transcended the role. The character he played didn&amp;#039;t have to be creepy, but Carey _was_ creepy. The weird way he looked with his eyes almost always at half mast, the way he spoke with his peculiar voice and heavy New York accent, and his unconventional looks (like a bizarro version of John Turturro) all worked together to really pique my curiosity about him.\n\nWell, onto the Internet I went. I found out more about him. He made a living generally playing seedy characters in supporting roles in all movies he appeared in, except for one. &quot;The World&amp;#039;s Greatest Sinner&quot; would be not only his sole staring role, but also the only movie he wrote, produced, and directed. And never released.\n\nOnce I got a chance to watch the bootleg, I could see why it never received a proper release in its day.\n\nCarey plays an insurance salesman that is seemingly depressed and bored with his job and life and decides to change. He gets inspired by rock-n-roll, becomes a rock star of sorts, a preacher, a politician, and finally sells himself as God to his cult of followers.\n\nThis movie has some pretty dark humor, at least one shocking scene (even by today&amp;#039;s standards, never mind 1962), and takes some potshots at organized religion.\n\nMaybe the thing that struck my the most about this movie is it&amp;#039;s vitality. It feels fresh, which is so different than how many older movies hold up. This is because this film was and continues to be so far ahead of its time.\n\nIf you are a fan of cult movies, I urge you to track this film down. If you are a fan of offbeat actors, ala Dennis Hopper, Crispin Glover, etc., I urge you to track this film down.\n\nIt certainly is a sin that this wonderful movie is not available through normal channels.&quot;\n\n&quot;Run, do not walk, to check out this movie! Timothy Carey, the character actor fave who appeared in everything from Kubrick&amp;#039;s THE KILLING to The Monkees&amp;#039; HEAD, spent several years directing, writing and financing this below-low budget blast. One of the most bizarre movies ever made, and over three decades later, it&amp;#039;s STILL ahead of its time! A grotesque parable that&amp;#039;s as innovative and subversive as any film ever made. Carey sticks himself in the lead as Clarence Hilliard, a middle-aged insurance agent who goes nutzo and decides to become a rockabilly messiah. Abandoning his normal life, he changes his name to &quot;God&quot; and stands on street corners, handing out flyers, recruiting white-trash greasers to his fire &amp;#039;n&amp;#039; brimstone &quot;Life is Hell&quot; doctrine. To raise money for his cause, he seduces old ladies for cash, and performs in an Elvis-like silver-lame suit. He even starts his own &quot;Eternal Man&quot; political party, which promises to make everyone a &quot;superhuman being&quot; (their motto: &quot;There&amp;#039;s only one God, and that&amp;#039;s Man.&quot;). This is seriously whacked stuff, folks, and Carey pulls off one of the most intense, overwrought performances of all time (putting novice scenery-chewers like Dennis Hopper to shame) -- ranting, crying, dancing, and looking wasted, his eyelids at half-mast throughout. Eventually, Clarence&amp;#039;s followers begin rioting and vandalizing, but that type of social upheaval has to be expected when a new God emerges -- especially one promising &quot;No Death&quot;. When the political machines get wind of his rock&amp;#039;n&amp;#039;roll charisma, they run him as an independent candidate for president, but Clarence is corrupted when his dogma takes on fascist overtones and he starts seducing cute, 14-year-old volunteers. Though lacking in little things like coherency, Carey packs this volatile tale with venom toward modern politics, the media, dried-up religion, and the entire sorry state of the human race. It&amp;#039;s even narrated by The Devil, represented by a snake! Carey is dead serious with all this craziness (even the heavily religious finale) and his outrageous direction is beyond belief! Most of the extras seem like they were simply pulled off the streets, and the score was provided by a young musician named Frank Zappa. Even its theme song is hilariously unforgettable: &quot;As a sinner he&amp;#039;s a winner/ Honey, he&amp;#039;s no beginner/ He&amp;#039;s rotten to the core/ Daddy, you can&amp;#039;t say no more/ He&amp;#039;s the world&amp;#039;s greatest sinner.&quot; Complete with cinematography by Ray Dennis Steckler (RAT PHINK A BOO BOO), this is a work of warped genius.&quot;\n\nMenuless DVD-R of this shamefully neglected cult gem. I got this from http://cinemageddon.org but am uploading it here because I think it needs to be seen. Sourced from a TCM Underground broadcast.","torrent":{"xt":"urn:btih:22dd5a1e84a38f1413c95d414f45805ba4c5e2ca","amp;dn":"The+World%5C%27s+Greatest+Sinner+%281962%29+TVRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22dd5a1e84a38f1413c95d414f45805ba4c5e2ca","infoHashBuffer":{"type":"Buffer","data":[34,221,90,30,132,163,143,20,19,201,93,65,79,69,128,91,164,197,226,202]},"announce":[],"urlList":[]}}