{"title":"Elvis Presley - Prince from another planet dvd (2012)","uid":7972241,"size":4669224960,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:22fc8cba4355e30cf3b5ee2c4f1b9a42c54d17a2&amp;dn=Elvis+Presley+-+Prince+from+another+planet+dvd+%282012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Hounddog","files":-1,"time":1356885185,"description":"The DVD contains actual film footage taken by a fan in the audience with an 8mm film camera. The film has undergone restoration and color correction but is still noticeably from an 8mm source, however this is not a concern as you sit in awe watching something you never thought you would. Sony have quite amazingly synced up the audio to the film, and to make it more so, there is only 20 minutes of actual film recorded and it is in bits and pieces starting from outside the auditorium and the opening That's All Right [in full] to the closing with Elvis leaving the stage. In between when there is no film the screen goes blank but the audio continues and keeps in sync when the next piece of film comes along, this must have taken some work! So by doing this you can in fact listen the same way as a CD but with 20 minutes of film as a bonus. \n\nThe 'blank' spots are explained in the booklet as being caused by when the camera operator has had to change tape cartridge - which clearly took some time to do - however I think as there is only 20 minutes in total and the length of the blank spots vary that the camera operator has needed also to preserve tape - and indeed he succeeded as he managed not only to film Elvis opening his cape at the end of the concert but then his leaving the stage which is kind of important, somehow it just seems to make it 'compete', certainly better.\n\nAlso on the DVD is a documentary and the June 9 press conference. Now the latter runs exactly as WNBC gave it to Sony and an oddity here is we hear the question 'are you happy with the image you have established' yet it is sometime after this that we see Elvis look behind himself as a joke and answers the question. Why Sony have not attempted a correction here I can't be sure but it is good to have the film included.\n\nThanks to THE blog!!!!\n\nHappy Newyear!\n\nJeroep","torrent":{"xt":"urn:btih:22fc8cba4355e30cf3b5ee2c4f1b9a42c54d17a2","amp;dn":"Elvis+Presley+-+Prince+from+another+planet+dvd+%282012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22fc8cba4355e30cf3b5ee2c4f1b9a42c54d17a2","infoHashBuffer":{"type":"Buffer","data":[34,252,140,186,67,85,227,12,243,181,238,44,79,27,154,66,197,77,23,162]},"announce":[],"urlList":[]}}