{"title":"Solar Panel Blueprint","uid":4420449,"size":3247516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:22fef19f38b4aabde4ec06a6b502bc174d4506f4&amp;dn=Solar+Panel+Blueprint&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Punkristo","files":11,"time":1222748079,"description":"I bought this blueprints on ebay, I bring them to you for free. I hope they help!\n\nIf you want to support the person that made them buy them on solar.110mb.com\n\n----------------------------------\n\nFree Heat &amp; Free AC forever!\nCan you get a better energy price than that?\n\nNo electricity required with this thermosiphoning design, just free Heat &amp; AC.\n* We are promoting do-it-yourself Solar Thermal Panels to heat &amp; cool your home.\nThis is the most efficient/effective design available. They add beauty and will\nmodernize your home. This design has gone through extensive testing at a great\neffort. Test engineered to focus in on the perfect materials and dimensions\nneeded to achieve the highest efficiency over an entire range.\nStep by step instructions included. Any good handy-person can create these beautiful\nSolar Panels for about $100 of standard durable building materials, (much lower if\nleftover material is used). Then enjoy free energy forever. This is the best time of\nyear to install Solar Panels.\n\n* Solar Panels will add value to your home. The design and function of the\nupper/lower vents allows for easier home installation. South sun facing wall\ninstallation with no obstructions is the ideal location to install Solar Thermal Panels.\n\n* Exterior Solar Panels do not interfere with windows or block energy already\nentering windows. All the heat generated is free extra heat.\n(3) times more efficient than a photovoltaic Solar Panel. A typical PV Solar Panel\nof this size puts out 266 watts, these Solar Thermal Panels put out about 2500 BTU\nof peak heat which is equivalent to 750 watts of heat.\n\n* Efficiency is so high that these Solar Panels will put out 50-75% efficiency\non a cold winter partly cloudy day. On a winter sunny day, they give heat steady\nwith the vents blowing wide open as shown in the pictures. On a partly cloudy\nday the vents open half way. On a cloudy day when the sun peaks out for a few\nminutes here and there, the vents will open and close by themselves all day.\nUsually on a cloudy day they stay closed, unless the clouds are thin.\n\n* Construction: Solid and durable building construction materials are part of the\ndesign. The genius of this engineered design is to take advantage of such a high\noptical clarity of glazing, and the design thermally protects the heated air from the\nglazing. This Solar Panel design is perfect for cold climates. It will put out a huge\namount of heat no matter how cold it is outside.\nIt is great to watch the vents open by themselves with the sun and see the heat\ncoming in.\n\n* Summer Cooling: Yes, primarily these Solar Panels are heaters, but as a\nbonus they are also used to create some geothermal type cooling in the summer.\n(If you live in a warm climate such as Florida where the difference between the days\nhigh and low temperature is little, than the cooling feature will not work.) For all others it will\nbe used for cooling also, this can be used together with AC because it does not\ninterfere with AC operation since the cool air produced is interior air being cooled.\n\nFree Heat &amp; Free AC forever! Can you get a better energy price than that?\n\nEngineered blueprint transferred CAD to JPEG so it is viewable on all computers.\n\nIn order to get these blueprints into universal compatibility, a bit of noise was introduced due to the way technology works, this could not be avoided. Still they are very legible and with reasonable clarity when viewed at full size on your computer and even when printed. Each page can be easily adjusted to any size if desired, just like a picture.\nI am very helpful if you need assistance.\nIncludes detailed step by step instructions on where to buy the material and what size exactly each piece needs\nto be in order to achieve maximum efficiency.\n\nThese blueprints will be delivered free to your email address within 48 hours.\nCheck your bulk folder if you do not get them, &amp; contact me. I will resend. Thanks.\nI started this auction really low with no reserve.\n(Only if requested, I will print and ship hard copies worldwide at a small extra cost for printing and shipping.)\n\nWhatever this auction gets will help keep the effort going to promote Alternative Energy,\nand will put in your hands the very best looking and efficient/effective Solar Panel Design\navailable.\n\n\nBid with Confidence, and stay warm &amp; cool for free.","torrent":{"xt":"urn:btih:22fef19f38b4aabde4ec06a6b502bc174d4506f4","amp;dn":"Solar+Panel+Blueprint","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"22fef19f38b4aabde4ec06a6b502bc174d4506f4","infoHashBuffer":{"type":"Buffer","data":[34,254,241,159,56,180,170,189,228,236,6,166,181,2,188,23,77,69,6,244]},"announce":[],"urlList":[]}}