{"title":"Adele - 19 [24 bit FLAC] vinyl","uid":8173434,"size":935752520,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:23099a6c20e90d9566a7294a45225876d0a67e9e&amp;dn=Adele+-+19+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"24.96","files":-1,"time":1361469133,"description":"  Adele - 19 (2008) [24 bit FLAC] vinyl\n\n  Released: 2008\n  Duration: 43:33\n  Genre: Pop/Rock\n  Style: Adult Alternative Pop, Soul\n  Codec: FLAC\n  Bit Rate: ~ 3,000 kbps\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  01. Daydreamer 3:40\n  02. Best For Last 4:18\n  03. Chasing Pavements 3:30\n  04. Cold Shoulder 3:11\n  05. Crazy For You 3:28\n  06. Melt My Heart To Stone 3:23\n  07. First Love 3:10\n  08. Right As Rain 3:17\n  09. Make You Feel My Love 3:32\n  10. My Same 3:15\n  11. Tired 4:18\n  12. Hometown Glory 4:31\n\n  With just a couple of cursory listens to the few tracks that popped up all over the Internet through 2007, comparisons were made between Adele, the much-hyped brassy British songstress, and Amy Winehouse, the...much-hyped brassy British songstress. However, after a solid listen to 19, the first full sampling by the up-and-coming Adele, listeners are forced to throw all comparisons to the wind; Adele is simply too magical to compare her to anyone. Bluesy like it's no one's business yet voluptuously funky in a contemporary way, Adele rocks out 19 with a unique voice and gritty sound that dazzle endlessly. Synthesizing blues, jazz, folk, soul, and even electric pop, Adele mystifies through her mature songwriting skills and jaw-dropping arrangements. As the album opens with &quot;Daydreamer,&quot; Adele's illusionary instrument -- over minimal sounds -- engulfs the listener with a gorgeous feeling of awe and wonderment. On &quot;Melt My Heart to Stone&quot; and the bona fide hit &quot;Chasing Pavements,&quot; Adele allows herself to soar over the strings and power her way through these incredible songs. The upbeat &quot;Right as Rain&quot; is just wonderful, with clear Ashford &amp; Simpson influences speckled all over it in an upbeat set. Nearly all the tracks seem to have been nurtured to glory over months as labors of love. What's simply awesome on 19 is its capability to capture the listener through mere teasing; Adele doesn't shout for attention, and doesn't rely on anyone but herself to prove she's worth it, in the same vein as Sara Bareilles, another heavily praised artist of 2007. The jazzy &quot;Best for Last&quot; is as retro as the tunes get on the album, yet it still manages to steer away from being boring or old-fashioned. The only awkwardness throughout all of 19 is the overly poppy galactic &quot;Tired,&quot; which sounds as though it might have fallen off a Lily Allen track list, something that doesn't suit Adele as a musician. As far as artistic drive goes, it seems as though Adele is hoping to capitalize on the sounds of 2007 by borrowing elements of Feist, Regina Spektor, Norah Jones, and even, yes, Amy Winehouse; yet Adele blends all the artistic pizzazz of all those ladies into her own set of manipulative, glamorous wonder. Plus, as a terrific songwriter at merely 20 years of age, the Brit has so much room to expand her artistic dimensions into a full-fledged artist that it's no wonder most critics see her as the top new talent of 2008. This debut isn't an empty promise of a great career; 19 is a fleshed-out stunning portrayal of a young woman with a talent beyond her years who deserves immense credit for a unique style that never fails. A beyond stellar debut in both quality and originality.","torrent":{"xt":"urn:btih:23099a6c20e90d9566a7294a45225876d0a67e9e","amp;dn":"Adele+-+19+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23099a6c20e90d9566a7294a45225876d0a67e9e","infoHashBuffer":{"type":"Buffer","data":[35,9,154,108,32,233,13,149,102,167,41,74,69,34,88,118,208,166,126,158]},"announce":[],"urlList":[]}}