{"title":"Glenn Greenwald - Great American Hypocrites (2008) [epub]","uid":12058525,"size":272016,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2434079bcdb9f8083c6cc5f054e55e5099587733&amp;dn=Glenn+Greenwald+-+Great+American+Hypocrites+%282008%29+%5Bepub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Eugene_Debs","files":1,"time":1435183584,"description":"Ever since the cowboy image of Ronald Reagan was sold to Americans, the Republican Party has used the same John Wayne imagery to support its candidates and take elections. We all know how they govern, but the right-wing propaganda machine is very adept at hijacking debate and marketing their candidates as effectively as the Marlboro Man.\n\nWith this provocative book, Greenwald, a former constitutional lawyer and author of A Tragic Legacyand How Would a Patriot Act, purports to expose the &quot;rank myth-making and exploitation of cultural, gender and psychological themes&quot; by the Republican Party. The author begins his attack by targeting John Wayne, whom he sees as a template for right-wing notions of &quot;American courage and conservative manliness.&quot; Wayne's avoidance of military service and his string of divorces, both at odds with his public image, are emblematic in this account of a fundamental hypocrisy implicit in conservative mythologies. Greenwald goes on to argue that prominent Republicans from Ronald Reagan to Mitt Romney display the same hypocrisy in their public ideologies and personal lives. Shouldering much of the blame are the press and the media, including Matt Drudge, Ann Coulter, Chris Matthews and even Maureen Dowd, all of whom propagate popular attitudes about virile Republicans and effeminate Democrats. Despite the antipathy the author feels for Coulter, his writing is much like hers. More a partisan screed than a reasoned argument meant to persuade undecided readers, this repetitive text frequently devolves into personal attacks and vast generalizations","torrent":{"xt":"urn:btih:2434079bcdb9f8083c6cc5f054e55e5099587733","amp;dn":"Glenn+Greenwald+-+Great+American+Hypocrites+%282008%29+%5Bepub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2434079bcdb9f8083c6cc5f054e55e5099587733","infoHashBuffer":{"type":"Buffer","data":[36,52,7,155,205,185,248,8,60,108,197,240,84,229,94,80,153,88,119,51]},"announce":[],"urlList":[]}}