{"title":"Sexually Broken--The Unit - The Conclusion Darling Hazel Hypnoti","uid":8958089,"size":3171150157,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:24791a4ba0f66cbe19ff2b32a116e59d2b0a3c7d&amp;dn=Sexually+Broken--The+Unit+-+The+Conclusion+Darling+Hazel+Hypnoti&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"merzedes","files":-1,"time":1380045510,"description":"The Unit: The Conclusion. A full Feature BaRS Presentation! Amazing Bondage Brutal Sex! | Darling | Hazel Hypnotic | Matt Williams\n\nSeptember 23, 2013 \n \n\nMP4 only.\n \n \nTHE UNIT: PART TWO\n\nSexually Broken is proud to deliver another Feature Presentation. This weeks's update, &quot;The Unit&quot; is the conclusion, part 2 of a true life fantasy from Darling, one of the Original Bondage Models, from the birth of the internet. All of our feature presentations are ACTUAL fantasies from the women that appear in these special high budget Bondage and Rough Sex(BaRS)feature presentations. \n\nThis update is the Conclusion of last weeks offering. It features, rough anal sex, brutal deep throating, squirting, and an uncut extended quicksand scene, Plus extra deleted scenes and hi-res photos. Special custom bondage devices and amazing rope work. No other BaRS site in the world brings you such high quality outdoor bondage feature movies. Sexually Broken is the only site you need for brutal bondage and rough sex with out all the pain and impact play that most people are uncomfortable with. \n\nTHE UNIT is a collection of highly skilled, former military, former bondage producers, former porn actors. It operates across the World and is currently running ops in the Adirondack Mountains on the east coast of North America. The Unit is highly funded and equipped with state-of-the-art technology and resources. Funding comes from civilian clients around the globe. The wealthy, the Privileged, and occasional pro bono client, all females, all vetted, all beautiful. They pay handsomely for their sexually fantasies, and the UNIT provides.\n\nAll over the world, everyday, some of the hottest, richest females in the world look at bondage and rough sex sites and wish they were the girl in the production. They all dream of it, they all desire it, but it could never happen. The sad truth is this: if you are not in porn, you will never ever, have an experience like you see on the internet, period. What if there was a way to experience something like this without being on the internet? What if you could get the same experience you see in porn, but no one would ever, ever, find out? \n\nWhat if the perfect storm of talent assembled, and created a UNIT. A UNIT with all the skills to deliver the highest quality fantasies, rough sex and amazing bondage, all in a safe and sane environment? Would you sign up? Would you pay? What would you pay? You would pay any price, the UNIT knows, The UNIT does, The UNIT... is! \n \nScreens &lt;a href=&quot;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_23darling4/SexuallyBroken-Darling-Hazel-Hypnotic-Matt-Williams-The-Unit-The-Conclusion--A-full-Feature-BaRS-Presentation-Amazing-Bondage-Brutal-Sex.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.sexuallybroken.com/sexual/bondage/2013/09_23darling4/SexuallyBroken-Darling-Hazel-Hypnotic-Matt-Williams-The-Unit-The-Conclusion--A-full-Feature-BaRS-Presentation-Amazing-Bondage-Brutal-Sex.php&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:24791a4ba0f66cbe19ff2b32a116e59d2b0a3c7d","amp;dn":"Sexually+Broken--The+Unit+-+The+Conclusion+Darling+Hazel+Hypnoti","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24791a4ba0f66cbe19ff2b32a116e59d2b0a3c7d","infoHashBuffer":{"type":"Buffer","data":[36,121,26,75,160,246,108,190,25,255,43,50,161,22,229,157,43,10,60,125]},"announce":[],"urlList":[]}}