{"title":"Return To Zork GoG","uid":8184168,"size":214444810,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:24e058f261c0752040bd462de7735a56611426a5&amp;dn=Return+To+Zork+GoG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1361695144,"description":"\nUnlike the previous games in the Zork franchise, which were text adventures, Return to Zork takes place from a first-person perspective and makes use of video-captured actors as well as detailed graphics; a point-and-click interface replaced the text parser for the first time in a Zork game. The overall gameplay style was somewhat similar to Myst, although Return to Zork predated Myst by a few months. Unlike Myst, which had no extraspatial dimensions of functionality, Return to Zork featured multiple ways of interacting with each object in the game world, as well as with several non-player characters also present in the world via a menu which appeared on the left side of the screen.\n\nAmong the actors who appeared in the game were a number of instantly recognizable (by face, if not necessarily by name) character actors as well as a number of well-known younger actors: Robyn Lively of Twin Peaks as &quot;The Fairy&quot;, Jason Hervey of The Wonder Years as &quot;The Troll King&quot;, and Sam J. Jones from the 1980 film Flash Gordon as &quot;The Blind Bowman&quot; and A.J. Langer of My So-Called Life as fellow Zork explorer Rebecca Snoot whom the player encounters on several occasions.\nFeelies\n\nAs a tribute to the original Infocom, Return to Zork included feelies. The feelies include:\n\n    * A sweepstakes letter; some packages also included a sweepstakes letter written in French and/or German\n    * The envelope for the sweepstakes letter\n    * The 966 GUE edition of the Encyclopedia Frobozzica, which was combined with the game manual\n\nPlot\n\nThe player's character is a sweepstakes winner who wins an all expenses paid holiday to the Valley of the Sparrows, in Zork. Upon arrival, however, the player quickly learns that the entire area has fallen under some dark and sinister influence, becoming decayed and dysfunctional. Whole buildings have mysteriously vanished, murderous vultures infest the land, people have frequent and disturbing nightmares featuring some dark being which refers to itself as Morphius, and many of those who have survived have become reclusive and paranoid. The player must survive countless perils whilst exploring the valley, investigating the causes of the powers that have gripped the land and ultimately putting a stop to them.\n\n\nMinimum system requirements: Windows XP or Windows Vista, 1 GHz Processor (1.4 GHz recommended), 256MB RAM (512 recommended), 3D graphics card compatible with DirectX 7 (compatible with DirectX 9 recommended), Mouse, Keyboard.\n\n\nInstall as admin and play\n\n","torrent":{"xt":"urn:btih:24e058f261c0752040bd462de7735a56611426a5","amp;dn":"Return+To+Zork+GoG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24e058f261c0752040bd462de7735a56611426a5","infoHashBuffer":{"type":"Buffer","data":[36,224,88,242,97,192,117,32,64,189,70,45,231,115,90,86,97,20,38,165]},"announce":[],"urlList":[]}}