{"title":"Twitter Marketing : An Hour a Day","uid":6309782,"size":11077816,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:24eeddbbabe276b317a738d04d51867c5302f1b6&amp;dn=Twitter+Marketing+%3A+An+Hour+a+Day&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"N00pteen","files":-1,"time":1302497357,"description":"S.bex (Jan. 12, 2010) | ISBN: 0470562269 | English | 504 pages | PDF | 10,5 MB\nThe complete guide to a successful Twitter marketing campaign\n\nTwitter is a microblogging service that's changing the way we communicate. Marketers recognize its value, and Twitter Marketing: An Hour a Day offers marketers, advertisers, brand managers, PR professionals, and business owners an in-depth guide to designing, implementing, and measuring the impact of a complete Twitter strategy.\n\nExpert author Hollis Thomases acquaints you with the Twitterverse, its conventions, and its fascinating demographics and statistics. She then teaches you step by step how to effectively craft successful branding and direct response strategies that can be scaled to any organization and its objectives. Twitter Marketing: An Hour a Day uses interesting case studies, success stories, anecdotes, and examples to demonstrate how to use Twitter metrics in order to inform strategic direction. You'll discover how top companies-large and small-have leveraged this exciting communications platform.\n\n* Twitter has become a phenomenon with 32 million users, including major companies such as Apple, JetBlue, and CNN\n* This step-by-step guide explains the demographics, shows how companies are using Twitter, and explains how to scale the approach to your enterprise\n* The detailed coverage includes the basics for Twitter newcomers and explores all elements of a successful strategy\n* Expert author Hollis Thomases shows how to set goals, develop and implement a plan, attract followers, and measure the impact of a campaign\n* The in-depth book explains how to maintain momentum and explores such issues as contests, promotions, and crisis management\n\nTwitter Marketing: An Hour a Day is the ultimate guide to succeeding one tweet at a time! ","torrent":{"xt":"urn:btih:24eeddbbabe276b317a738d04d51867c5302f1b6","amp;dn":"Twitter+Marketing+%3A+An+Hour+a+Day","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24eeddbbabe276b317a738d04d51867c5302f1b6","infoHashBuffer":{"type":"Buffer","data":[36,238,221,187,171,226,118,179,23,167,56,208,77,81,134,124,83,2,241,182]},"announce":[],"urlList":[]}}