{"title":"Bitwig Studio 1.0.8","uid":10116968,"size":128040960,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:25d2c64ce2c6c9e15f0f45a699719daba35c09b2&amp;dn=Bitwig+Studio+1.0.8&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cabolombo","files":1,"time":1399604240,"description":"Bitwig Studio is a dynamic software solution for music creation and performance to realize all of your musical ideas in every stage of production.\nFrom sound design to music creation, discover the new standard in customized workflow. Bitwig Studio inspires you to take greater control of your productions, giving you access to every aspect of your workflow as needed. Streamline your creative process and quickly take your music from ideas to complete songs, tracks and compositions. With Bitwig Studio, youÎ“Ã‡Ã–re in command of a workflow that works best for you.\n\nRecord and arrange, improvise and perform, or do it all at once. Choose between several display profiles. Design your own sounds with dedicated container devices. Combine built-in instruments, effects, and VST plug-ins. Bitwig StudioÎ“Ã‡Ã–s unified mapping system allows you to modulate any device or VST parameter using macro controls and modulator devices.\n\nExplore a new world of creative possibilities, including audio and note expressions, histogram-based value editing, layered editing, extensive bounce-in-place functions, automatic slicing, smart controller integration, and the Open Controller Scripting API. Every feature in Bitwig Studio was developed by musicians, for musicians. Welcome to the next generation of music creation and performance software for Windows, Mac OS X, and Linux.\n\n\n\nChanges in Bitwig Studio 1.0.8\n\nReleased on 05.05.2014.\n\nFIXED\tModulated value pie was not shown correctly for some values\nFIXED\tChanging the length of multiple selected notes spread over multiple clips in track note editor behaves erratic.\nFIXED\tVisual glitch in preview when drawing expression events over multiple audio events using pencil tool.\nChanges in Bitwig Studio 1.0.8 RC3\n\nReleased on 28.04.2014.\n\nIMPROVED\tAdded symmetry control to distortion device which controls the mix of even/odd harmonics\nIMPROVED\tAdded Slope control for the decay of the E-Hat device\nIMPROVED\tBetter solo behavior for return tracks\nIMPROVED\tNote pencil tool should disconnect mouse cursor during dragging to avoid limitations of movement.\nIMPROVED\tCan't drop MIDI file on existing track.\nIMPROVED\tUse pixel threshold for adjusting note length and velocity using pencil tool.\nIMPROVED\tIndividual note-length memory per track.\nIMPROVED\tChanged default install location for windows installer not to include the version number, which was causing shortcuts to the executable to stop working after upgrading\nIMPROVED\tAllow release-candidate builds to be installed in without uninstalling the normal builds on windows\nIMPROVED\tEQ2/5 display now show modulation\nFIXED\tExternal instrument didn't send MIDI CC to the selected channel\nFIXED\tSampler playback was missing the first 7 samples of the attack\nFIXED\tMidi drag&amp;drop from microtonic didn't work on windows\nFIXED\tWrong default value for Step MOD (32/1).\nFIXED\tmetadata with sub-paths (shell plugs-ins/soundfont patches) no longer work\nFIXED\tWhen adjusting note velocity, only audition changes when auditioning is actually enabled.\nFIXED\tHanging note when auditioned track changes while a key on the piano roll keyboard is pressed.\nFIXED\tQuantize regression: quantizing a chord kills all but one note.\nFIXED\tCrash when moving track with clips into FX section and then moving it out again.\nChanges in Bitwig Studio 1.0.8 RC2\n\nReleased on 22.04.2014.\n\nFIXED\tCrash on startup of fresh install\nFIXED\tRandom crashes when using library\nFIXED\tRecover the latest state of a plugin when recovering documents\nFIXED\tCrash when exporting empty arrangement as MIDI file.\nFIXED\tThere's no way to remove a bookmark from the browser.\nChanges in Bitwig Studio 1.0.8 RC1\n\nReleased on 21.04.2014.\n\nNEW\tAutomatically backup the state of plugins every minute when the engine is not playing\nNEW\tMIDI file export.\nIMPROVED\tImporting type-0 MIDI files should split events into different tracks based on MIDI channels.\nIMPROVED\tImporting MIDI file should consider track name metadata.\nIMPROVED\tImporting MIDI file should consider tempo meta events.\nIMPROVED\tAllow to adjust note length and velocity when inserting notes via double click and drag.\nIMPROVED\tAllow velocity adjustment when drawing notes using pencil tool by dragging vertically.\nIMPROVED\tAudition notes when clicking on them (if enabled).\nIMPROVED\tAvoid note start jumping when using note pencil tool.\nIMPROVED\tRemember last note length when using pencil tool for notes.\nIMPROVED\tImproved efficiency of monitoring library locations when new files are copied or deleted from library locations.\nIMPROVED\tAudition notes (if enabled) when adjusting note velocity.\nIMPROVED\tChange the minimum LFO rate in various devices to 0.01Hz and minimum synced rate to 32/1\nIMPROVED\tBetter VST keyboard handling on windows\nIMPROVED\tNormal sustain pedal behavior\nFIXED\tdevice controller mappings didn't reload correctly after saving them\nFIXED\tSplit at onset wasn't limited to the range of the selected event(s)\nFIXED\tPDC for meters &amp; automation limited to 32768 samples\nFIXED\tGraphical glitch in note expressions\nFIXED\tCrash when reversing very long files\nFIXED\tSaving a clip with a device containing a layer device in a slot would crash\nFIXED\tBouncing sometimes missed notes if it was started at the exact same location as the transport last stopped\nFIXED\tNovation Launchpad does not work on Linux.\nFIXED\tCrash when saving plugin state for a plugin that is no longer in the document\nFIXED\tRemoving a directory under a library location that started with the same name as another directory alongside it would remove indexed information for the other directory too\nFIXED\tDragging note or audio event start can result in overlapping notes.\nFIXED\tChanging velocity in piano roll editor via Ctrl/Cmd+Shift+Drag should also work when the target note is not selected yet.\nFIXED\tStretching audio events might result in overlapping events.\nFIXED\tCrash when splitting at onsets, then quantising to wider grid than event lengths, then dragging event start.\nFIXED\tRare crash when double-clicking on clip in clip-launcher to show its contents.\nFIXED\tNote velocity cannot be changed by dragging not with modifier if note is not selected.\nFIXED\tRandom crash when tooltip hides on Mac OS X.\nFIXED\tCrash when moving clip from effect to non-empty master track.\n\n\n\nSometimes their servers are down, so here it is.","torrent":{"xt":"urn:btih:25d2c64ce2c6c9e15f0f45a699719daba35c09b2","amp;dn":"Bitwig+Studio+1.0.8","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25d2c64ce2c6c9e15f0f45a699719daba35c09b2","infoHashBuffer":{"type":"Buffer","data":[37,210,198,76,226,198,201,225,95,15,69,166,153,113,157,171,163,92,9,178]},"announce":[],"urlList":[]}}