{"title":"Blue Rodeo - In Our Nature [2013][EAC,log,cue.FLAC]","uid":9237135,"size":416290564,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:25efc5791c62b02976a42d4cd33a25646cc707c3&amp;dn=Blue+Rodeo+-+In+Our+Nature+%5B2013%5D%5BEAC%2Clog%2Ccue.FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":17,"time":1385197594,"description":"Artist: Blue Rodeo\nRelease: In Our Nature\nReleased: 2013\nLabel: TeleSoul Records\nCatalog#: AUDD27322614\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: CAN\nStyle: Americana,rock\n\nimage\n\n\n01. New Morning Sun (4:35)\n02. Wondering (5:07)\n03. Over Me (3:26)\n04. Never Too Late (4:52)\n05. When The Truth Comes Out (3:55)\n06. Paradise (4:28)\n07. Tell Me Again (3:53)\n08. Mattawa (3:49)\n09. Made Your Mind Up (5:26)\n10. In Our Nature (5:25)\n11. In The Darkness (2:55)\n12. You Should Know (3:25)\n13. Tara's Blues (4:29)\n14. Out Of The Blue (7:01)\n\n\nIn many ways, Blue Rodeo are the Canadian version of the Eagles. Led by two distinct yet thematically similar songwriters and singers, Greg Keelor and Jim Cuddy, the band has been delivering a rootsy folk and country-rock-pop sound since 1984 across some dozen albums or so, and has won nearly every award given in the Canadian music industry, all without making barely a commercial dent in the U.S. Like the Eagles, Blue Rodeo usually feature acoustic guitars with rock dynamics, sharp harmonies, and songs that explore broken or troubled romances, vanishing dreams, busted promises, and lost or uncertain futures. Whatever personnel changes the band has had over the years, the core has always been Keelor and Cuddy (the two share songwriting credit in the Lennon/McCartney style, but apparently write alone), much in the way that Glenn Frey and Don Henley have always sat in the creative driver's seat of the Eagles, although in Blue Rodeo's case, without the acrimony. And also like the Eagles, Blue Rodeo have been doing the same kind of thing for a long time, and like the Eagles, they sound a little worn, tired, and overly serious these days. In Our Nature is the group's 13th album, recorded at Keelor's farmhouse, much like one of the band's best albums, Five Days in July, was some 20 years earlier. There the resemblance ends. In Our Nature is full of well-recorded, warm-sounding songs that are brimming with personal commitment and passion, but unfortunately little in the way of melodies that stick in the head. That's a problem for a band that depends on its pop skills to temper the declarative nature of its songwriters. Almost everything here is at a slow to medium tempo, and whether it's Keelor or Cuddy, every song seems downcast, full of emotional turmoil that is unfortunately communicated with overblown, sophomoric lyrics -- every song literally seems to have storm clouds in it. There are a couple highlights, most notably the slightly Byrdsian &quot;Over Me,&quot; which is maybe one rewrite away from being a great pop song, and &quot;Tell Me Again,&quot; which is a great honky tonk jukebox country song by any standards. The rest of the album, though, sounds theatrically melancholy, full of bad poetry and not enough real hooks, however sincere and serious Keelor and Cuddy are about what they're doing. It just sounds tired, and maybe a little desperate, much like where the the Eagles find themselves a decade and change into the 21st century..\n","torrent":{"xt":"urn:btih:25efc5791c62b02976a42d4cd33a25646cc707c3","amp;dn":"Blue+Rodeo+-+In+Our+Nature+%5B2013%5D%5BEAC%2Clog%2Ccue.FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"25efc5791c62b02976a42d4cd33a25646cc707c3","infoHashBuffer":{"type":"Buffer","data":[37,239,197,121,28,98,176,41,118,164,45,76,211,58,37,100,108,199,7,195]},"announce":[],"urlList":[]}}