{"title":"Before Pornography - Erotic Writing in Early Modern England (200","uid":10594398,"size":3389230,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26411135101768c3d75aa010eb3c0e5728fc92e4&amp;dn=Before+Pornography+-+Erotic+Writing+in+Early+Modern+England+%28200&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1405849267,"description":"Title: Before Pornography - Erotic Writing in Early Modern England \nAuthor: Ian Frederick Moulton\nCategory: Academic/Sexuality/Cultural Studies\nSeries: Studies in the History of Sexuality\nPublisher: Oxford University Press (October 26, 2000)\nLanguage: English\nISBN-10: 0195137094\nISBN-13: 978-0195137095\n\nPromotional info/Publisher's summary - &quot;Before Pornography explores the relationship between erotic writing, masculinity, and national identity in Renaissance England. Drawing on both manuscripts and printed texts, and incorporating insights from modern feminist theory and queer studies, the book argues that pornography is a historical phenomenon: while the representation of sexual activity exists in nearly all cultures, pornography does not. The book includes analyses of the social significance of eroticism in such canonical texts as Sidney's Defense of Poesy and Spenser's Faerie Queene.&quot;\n\nReviews:\n&quot;This is emphatically an important book, valuable both as a useful addition to the expanding field of Renaissance studies of sexuality and gender, and as a significant contribution to a key area of debate in contemporary culture....Moulton has written a series and sensitive study of a difficult subject and he has done so with much wit and grace, not to mention scholarship and substance.&quot; -Willy Maley, University of Glasgow\n\n&quot;Before Pornography is an impressive achievement. Most attempts to explain what is early modern pornography have concentrated on the sexually explicit, obscene nature of the material. Moulton clears away many old debates and refreshingly reminds us to think about the historical specificity of early modern Europe and to see erotic writing as a commodity that circulated widely among literate culture. His is a rich and lively recreation of that world's 'way of reading' that looks from the inside out rather than the other way around.&quot; -Margaret F. Rosenthal, University of Southern California\n\nThis is a scanned copy of the book, an excellent one however; it is of the Paperback edition in PDF form. The front cover image is also included. Please seed, and enjoy.","torrent":{"xt":"urn:btih:26411135101768c3d75aa010eb3c0e5728fc92e4","amp;dn":"Before+Pornography+-+Erotic+Writing+in+Early+Modern+England+%28200","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26411135101768c3d75aa010eb3c0e5728fc92e4","infoHashBuffer":{"type":"Buffer","data":[38,65,17,53,16,23,104,195,215,90,160,16,235,60,14,87,40,252,146,228]},"announce":[],"urlList":[]}}