{"title":"Hopi Silver - The History and Hallmarks of Hopi Silversmithing (","uid":10756761,"size":15346350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:26f1fa831da7f1c825487fb1cddac69a18ce12b7&amp;dn=Hopi+Silver+-+The+History+and+Hallmarks+of+Hopi+Silversmithing+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1407939477,"description":"Pdf / English / 1999 / 147 pag / 14.6 MB\n\nCollectors all over the world prize the distinctive silver jewelry crafted by the Hopi people of northern Arizona. Margaret Wright's comprehensive guide, first published over thirty years ago and updated in 1998 to include new artisans, has long been considered the best available reference on Hopi silversmithing and is now available only from UNM Press.\n\nBeginning with a brief look at the geographic area that helped form Hopi identity and culture, Wright moves on to examine Hopi silversmiths from the late nineteenth century to the end of the twentieth century. Included is the important role played by Mary Russell-Colten of the Museum of Northern Arizona, Flagstaff. Russell-Colten encouraged the Hopis to adopt a unique design style that would set their work apart from other Indian silver work, thereby making it more easily distinguishable and profitable. Wright also provides a survey of the tools utilized by the artisans.\n\nThe index of hallmarks utilized by more than 300 Hopi silversmiths, arranged chronologically and by type of symbol, with brief information about each artist is a necessity for anyone collecting Hopi silver work.\n\n","torrent":{"xt":"urn:btih:26f1fa831da7f1c825487fb1cddac69a18ce12b7","amp;dn":"Hopi+Silver+-+The+History+and+Hallmarks+of+Hopi+Silversmithing+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"26f1fa831da7f1c825487fb1cddac69a18ce12b7","infoHashBuffer":{"type":"Buffer","data":[38,241,250,131,29,167,241,200,37,72,127,177,205,218,198,154,24,206,18,183]},"announce":[],"urlList":[]}}