{"title":"Assassins Creed Pirates v2.9.1 mega mod + data [apkpita]","uid":15341695,"size":927436361,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:27185c373b20858d65884702a68ed109b7fecfd2&amp;dn=Assassins+Creed+Pirates+v2.9.1+mega+mod+%2B+data+%5Bapkpita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"tiropitaki","files":4,"time":1468845631,"description":"***More than 10 million pirates already***\r\n***More than 200 million heroic naval battles fought***\r\n\r\nOne of the world’s greatest action franchise is available on your mobile device! Become one of the most feared pirates of the Caribbean in this exclusive Assassin's Creed adventure! \r\nPlay as Alonzo Batilla, a young and ambitious pirate captain, break the rules, challenge empires and amass gold!\r\n\r\nENGAGE IN BRUTAL NAVAL COMBATS\r\nFight in real-time naval battles all over the Caribbean Sea.\r\nChoose from a wide range of weapons from the pivot cannon to the mortar, to destroy your foes and manoeuver to dodge enemy shots. \r\nShow your skills, defeat legendary ships in battle and become a true pirate legend!\r\n\r\nBUILD UP YOUR CREW AND YOUR SHIP\r\nRaise your flag on the most iconic boats of the Golden Age of Piracy; ranging from the smallest ship to the Man O’War floating fortress.\r\nUpgrade your vessel with legendary customizations and the massive bounty plundered on the wild seas.\r\nBuild your naval empire by recruiting the finest crew members and learn more than 50 new pirating techniques, cannon &amp; sail upgrades to become a better captain and master naval battles.\r\n\r\nEXPLORE THE IMMENSITY OF THE CARIBBEAN... AND MUCH MORE!\r\nSail throughout a vast array of islands as you explore a huge map.\r\nSearch for nearly one hundred treasures and lost files.\r\nRun through dozens of lost Mayan temples, dodge obstacles using epic assassin’s parkour moves and collect mayans stones. \r\nParkour temples to find the fragments of ancient treasure maps.\r\nHunt sharks, whales and exotic fish to never run out of supplies.\r\nFurnish your fish collection with marvelous sea trophies, from small fry to massive sharks. \r\nLive the epic pirate life, raise the black flag and loot a merchant ship loaded with gold or set sail on quest to battle a slave ship.\r\nBeware of the English empire and the Spanish crown and their powerful master ship, as a pirate you are always on the run.\r\nCompete with your friends for the highest bounty.\r\n\r\nDISCOVER GROUNDBREAKING 3D VISUALS ON MOBILE AND TABLETS\r\nBask in the West-Indies sunshine, admire beautiful sea sunsets, navigate ice mazes and sail through the night along breathtaking coastlines.\r\nChanging weather conditions directly impact the way you run your ship and redefine every landscape. \r\nBeware of storms and of the treacherous fog that will conceal your enemies until the last moment!\r\nMaster the sea to become the most skillful pirate of the Caribbean Sea and be victorious in battles.\r\n\r\nEMBARK ON AN EPIC QUEST FOR A LEGENDARY TREASURE\r\nLive a naval adventure that will reveal the truth about the mysterious lost treasure of the famous French pirate and assassin La Buse.\r\nCross paths with Assassins and Templars and take part in their age-old struggle.\r\nMeet the most notorious and colorful pirates of the era, including Sam Bellamy, Ben Hornigold, Charles Vane and Blackbeard!\r\n\r\nGame available in: English, French, Italian, German, Spanish, Brazilian Portuguese, Chinese, Japanese, Korean, Russian, Turkish and Indonesian\r\n\r\nStay on top of your game! Get the latest news, deals, and more at....\rhttp://\r\nTWITTER: http:// tw .com/ubisoftmobile\r\nYOUTUBE: http:// you .com/user/Ubisoft\r\n* Some links are not allowed in the torrent decription\r\n\r\nWhat’s new:\r\nWe regularly bring you updates and new features to improve your experience. Have fun!\r\n\r\nMod1 Info:\r\n- 9,999,999 golds\r\n- 9,999 all resources\r\n- Has Ultimate Hook\r\n- Unlock latest level 6 ship with max upgraded\r\n- Unlock some Legendary Perks and max upgraded\r\n\r\nMod2 Info:\r\n- 9,999,999 golds\r\n- 9,999 all resources\r\n- Unlock and max upgraded all Hooks\r\n- Unlock and max upgraded all Ships\r\n- Unlock and max upgraded all Perk\r\n- Level is 40\r\n- Unlock all Areas\r\n\r\nRequirements: Android OS 4.0 and up\r\nInstall APK. Place data folder in SDCard/Android/Obb/ and play","torrent":{"xt":"urn:btih:27185c373b20858d65884702a68ed109b7fecfd2","amp;dn":"Assassins+Creed+Pirates+v2.9.1+mega+mod+%2B+data+%5Bapkpita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27185c373b20858d65884702a68ed109b7fecfd2","infoHashBuffer":{"type":"Buffer","data":[39,24,92,55,59,32,133,141,101,136,71,2,166,142,209,9,183,254,207,210]},"announce":[],"urlList":[]}}