{"title":"three o'clock high 1987 dvdrip","uid":4511381,"size":900639678,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27965eee1fd17c44ba4fc0c596db35cee535a299&amp;dn=three+o%5C%27clock+high+1987+dvdrip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GrandTheftBinary4200","files":1,"time":1226788981,"description":"three o&amp;#039;clock high 1987 dvdrip\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0094138/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0094138/&lt;/a&gt;\n\n3 O&amp;#039;Clock High is a wonderful film. It bears little resemblance to the 80&amp;#039;s teen archetypes, such as _Fast Times at Ridgemond High_ or the Hughes films, excellent as those films may be. 3 O&amp;#039;Clock is purely plot-based; a sensitive view of teenage angst can be found elsewhere.\n\nThe basic plot: Jerry Mitchell, everyman adolescent, manages to get himself into an after-school fight with the school psychopath Buddy Revell by 8:00 am, and spends the next 7 hours contriving every scheme to escape the certain flogging which awaits him at 3pm. The film opens with a clicking alarm clock (peculiar for an electric clock) and ends with an image of the school clock; in between, clock dials, and class bells serve as symbolic death watch beetles.\n\nJerry&amp;#039;s gradual disintegration amongst his friends, the school administration, and the school store manager as well as his physical and moral decline as the day wears on is very amusing.\n\nWhat&amp;#039;s memorable about the film is its radical cinematography which we presume is the contribution of long-time Coen collaborator cinematographer Barry Sonenfeld. Extreme wide-angle shots, and a clever technique of high-speed crane shots make for a very distinctive look (which I have never seen duplicated). While clever technique this could create a ponderous over-theatrical look (like some of Spielberg&amp;#039;s 80&amp;#039;s work as viewed today) or a vapid MTV look, Joanou uses the showy technique to great effect and the film looks as fresh today as it did nearly 20 years ago.\n\nThe enigmatic Buddy Revell is a wonderful creation, masterfully introduced by a continuous moving shot following, in succession, three sets of exchanges between students recounting Buddy&amp;#039;s legendary reputation for psychotic violence. The roving camera threads through each group of students as deftly as if in a Fellini film, (at the risk of being bombastic).\n\nAs well as a sharp plot and dialog, and an innovative technique and excellent production values, the assembled cast is uniformly superb. Casey Siemaszko is perfect for the role, and Richard Tyson gives an absolutely straight interpretation of Buddy Revell. Seconday roles are played by character actors Jeffrey Tambor, John P. Ryan, Mitch Pileggi among others.\n\nIn conclusion, you know it&amp;#039;s a special film because so many of the images and the dialog stick in one&amp;#039;s mind. The cheerleaders tearing apart the effigy and skull as the horrified Jerry watches, the library shelves toppling like dominoes to reveal Jerry and Vince cowering in the corner, all of the scenes with &quot;The Duker&quot;, the Dean of Discipline&amp;#039;s dungeon of an office, the educational 8mm insect film, the sinister retelling of the Iliad, Jerry frantically attempting to break open a cash register using a world globe and fire extinguisher. \n\nThe film probably didn&amp;#039;t make it big because no big names were connected to it. Joanou would go on to do a curiously unrelated string of projects, some music videos, television documentaries, and even sitcom work. He did do another mainstream film _State of Grace_ (1990) with Sean Penn, another excellent and underrated film. \n\n\none of my fave lines- &quot;don&amp;#039;t fuck this up, mitchell!&quot; \n\nSouth park recently did a slight spoof of this movie, where cartman tries to get out of a fight for commments he made about breast cancer. It made me revisit this one, i noticed it wasn&amp;#039;t on the bay, so here ya go. SEED. ","torrent":{"xt":"urn:btih:27965eee1fd17c44ba4fc0c596db35cee535a299","amp;dn":"three+o%5C%27clock+high+1987+dvdrip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27965eee1fd17c44ba4fc0c596db35cee535a299","infoHashBuffer":{"type":"Buffer","data":[39,150,94,238,31,209,124,68,186,79,192,197,150,219,53,206,229,53,162,153]},"announce":[],"urlList":[]}}