{"title":"Cold Turkey (1971) Dick Van Dyke, Bob Newhart, Laserdic Rip, RAR","uid":6083443,"size":1430853060,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:27d00b9f2f3a3c9348cc69f0d3f733202bdb0d6b&amp;dn=Cold+Turkey+%281971%29+Dick+Van+Dyke%2C+Bob+Newhart%2C+Laserdic+Rip%2C+RAR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"brynrocks","files":5,"time":1294213725,"description":"Cold Turkey (1971)\nWritten and Directed by Norman Lear\nStarring Dick Van Dyke, Pippa Scott, Bob Newhart, Jean Stapleton, Vincent Gardenia, Tom Poston, Bob and Ray, the list goes on...\nOriginal Score by Randy Newman\n\nOh my, where to start with this little labor of love on my part...\n\nFirst of all, the movie itself. Brilliant. Decades ahead of its time. Hilarious. Dick Van Dyke is a small town preacher, who tries to motivate his tiny Iowa town of Eagle Rock to quit smoking for 30 days, in exchange for a 25 million dollar prize (big money even today, but HUGE money in 1971). Bob Newhart is the sleaziest of tobacco executives, the man who concocted the idea believing that no one would rise to the challenge. Tom Poston, later to head to television with Newhart, turns in a volcanic supporting performance as the town drunk.\n\nHistorically, this movie is fascinating for many reasons. It is the big screen debut of TV impresario Norman Lear, the man who brought us All In The Family, Sanford and Son, The Jeffersons, and countless other hits in the 70s and 80s. It is also the first film to feature a score by Randy Newman, who contributes both the song &quot;He Gives Us All His Love&quot; as well as a score that perfectly captures the film's sense of slightly skewed small-town America. Another small slice of trivia--second unit direction duties were handled by Robert Downey, Sr.,--Jr.'s father, and director of some pretty skewed work himself in his own right (check out &quot;Putney Swope&quot; if you ever get the chance). \n\nNOW THEN... ABOUT THIS VERSION...\n\nI was ecstatic a few months ago, when I heard that MGM was finally releasing this on DVD. Talk about overdue, I thought... However, what I found was a pretty sore disappointment. MGM has released this as a &quot;DVD on demand&quot;--which means that you get a DVD-R, not a &quot;pressed&quot; DVD. The version that they are selling--for $18 a pop, I might add--is widescreen, and this version is pan-and-scan. So be it. As far as pan-and-scans go, I don't feel this movie suffers too much for it. Having said that, theirs is not anamorphic, it's simply a widescreen version, and a little grainy at that. Far more importantly, the sound quality on that version is ATROCIOUS. It's a travesty to hear Newman's score get screwed up like that. Of course, on such a bare bones reissue, there are no extras whatsoever. Just the movie itself. \n\nSo, I've done what I had intended to do before I heard about the DVD release. I've gone back to my original MGM laserdisc and transferred that instead. As I said, it's pan-and-scan (the only way it was released, on VHS or laserdisc), but the digitally mastered audio is flawless. I've also transferred, as a separate file, the original theatrical trailer which came included on the laserdisc. So along with a good clear picture and much better sound, I've got exactly one more extra here than the DVD release. I've also scanned, at hi-res, the original artwork from my laserdisc jacket, and reformatted it as a DVD sleeve. So if you care to burn this to disc and add it to your collection on the shelf, you can print the cover artwork. Again, my scan of the laserdisc materials is far superior to the generic &quot;DVD On Demand&quot; cover that MGM will give you if you buy this on Amazon. \n\n I sincerely hope that MGM will one day give this movie the digital remastering and deluxe packaging job that it deserves--I'll be first in line to buy that version. Until then, I still feel that this version is the best you're going to get. MGM should be ashamed of the way they're misleading people into believing that they've done a DVD release of this classic film. Just because you recorded it onto DVD, that doesn't constitute a true reissue. So enjoy this, the best you'll get for now. ","torrent":{"xt":"urn:btih:27d00b9f2f3a3c9348cc69f0d3f733202bdb0d6b","amp;dn":"Cold+Turkey+%281971%29+Dick+Van+Dyke%2C+Bob+Newhart%2C+Laserdic+Rip%2C+RAR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27d00b9f2f3a3c9348cc69f0d3f733202bdb0d6b","infoHashBuffer":{"type":"Buffer","data":[39,208,11,159,47,58,60,147,72,204,105,240,211,247,51,32,43,219,13,107]},"announce":[],"urlList":[]}}