{"title":"The Next 100 Years: A Forecast for the 21st Century","uid":5836672,"size":8133708,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:283fa04b9ac11b2ab35c32de4c237906315d55ac&amp;dn=The+Next+100+Years%3A+A+Forecast+for+the+21st+Century&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Djofullinn","files":1,"time":1284743518,"description":"Amazon.com Review\nAmazon Best of the Month, January 2009: &quot;Be Practical, Expect the Impossible.&quot; So declares George Friedman, chief intelligence officer and founder of Strategic Forecasting, Inc. (Stratfor), a private intelligence agency whose clients include foreign government agencies and Fortune 500 companies. Gathering information from its global network of operatives and analysts (drawing the nickname &quot;the Shadow CIA&quot;), Stratfor produces thoughtful and genuinely engrossing analysis of international events daily, from possible outcomes of the latest Pakistan/India tensions to the hierarchy of Mexican drug cartels to challenges to Obama's nascent administration. In The Next 100 Years, Friedman undertakes the impossible (or improbable) challenge of forecasting world events through the 21st century. Starting with the premises that &quot;conventional political analysis suffers from a profound failure of imagination&quot; and &quot;common sense will be wrong,&quot; Friedman maps what he sees as the likeliest developments of the future, some intuitive, some surprising: more (but less catastrophic) wars; Russia's re-emergence as an aggressive hegemonic power; China's diminished influence in international affairs due to traditional social and economic imbalances; and the dawn of an American &quot;Golden Age&quot; in the second half of the century. Friedman is well aware that much of what he predicts will be wrong--unforeseeable events are, of course, unforeseen--but through his interpretation of geopolitics, one gets the sense that Friedman's guess is better than most. --Jon Foro\n--This text refers to the Hardcover edition.\nFrom Publishers Weekly\nWith a unique combination of cold-eyed realism and boldly confident fortune-telling, Friedman (Americas Secret War) offers a global tour of war and peace in the upcoming century. The author asserts that the United States power is so extraordinarily overwhelming that it will dominate the coming century, brushing aside Islamic terrorist threats now, overcoming a resurgent Russia in the 2010s and 20s and eventually gaining influence over space-based missile systems that Friedman names battle stars. Friedman is the founder of Stratfor, an independent geopolitical forecasting company, and his authoritative-sounding predictions are based on such factors as natural resources and population cycles. While these concrete measures lend his short-term forecasts credence, the later years of Friedmans 100-year cycle will provoke some serious eyebrow raising. The armed border clashes between Mexico and the United States in the 2080s seem relatively plausible, but the space war pitting Japan and Turkey against the United States and allies, prognosticated to begin precisely on Thanksgiving Day 2050, reads as fantastic (and terrifying) science fiction. Whether all of the visions in Friedmans crystal ball actually materialize, they certainly make for engrossing entertainment. (Feb.)\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to the Hardcover edition.","torrent":{"xt":"urn:btih:283fa04b9ac11b2ab35c32de4c237906315d55ac","amp;dn":"The+Next+100+Years%3A+A+Forecast+for+the+21st+Century","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"283fa04b9ac11b2ab35c32de4c237906315d55ac","infoHashBuffer":{"type":"Buffer","data":[40,63,160,75,154,193,27,42,179,92,50,222,76,35,121,6,49,93,85,172]},"announce":[],"urlList":[]}}