{"title":"Aquino - Gravitational-Electromagnetic Field Theory (1992).pdf","uid":4233590,"size":2296880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:284a8520aa02ef34f0eca1ec8af9a5b49e72cde6&amp;dn=Aquino+-+Gravitational-Electromagnetic+Field+Theory+%281992%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1213190277,"description":"This is Fran De Aquino&amp;#039;s amazing book Gravitational-Electromagnetic Field Theory (1992) which describes in a consistent and rigorous way the unification of the four interactions in nature: strong, weak, electromagnetic and gravitational. It establishes the interrelation between gravitation and electromagnetism, showing that it is possible to control the gravitational interaction by means of the action of electromagnetic fields. It is an extensive theory in which a great number of different things are interconnected. We can meet in it the incorporation of Mach&amp;#039;s principle in the gravitation theory; the elimination of the initial singularity in Friedmann&amp;#039;s cosmological model; explanation for anomalies verified in red shifts of stars and galaxies. It explains also the bases for the control of gravitation leading to some technological applications such as: gravitational propulsion, nuclear cold fusion, transmutation of chemical elements through gravitational process, superconductivity at ambient temperature by Cooper&amp;#039;s pairs formation through intensification of the gravitational forces and so on. In addition to these, we have to emphasize two other important aspects: It is possible to deduce directly from this theory the expression of the uncertainty principle that means the incorporation of quantum mechanics in Gravitational-Electromagnetic Field Theory. It is foreseen the existence of a fifth interaction, the psychic interaction, identified in the ascertainment of the apparent parity violation in beta decay reactions. 130 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:284a8520aa02ef34f0eca1ec8af9a5b49e72cde6","amp;dn":"Aquino+-+Gravitational-Electromagnetic+Field+Theory+%281992%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"284a8520aa02ef34f0eca1ec8af9a5b49e72cde6","infoHashBuffer":{"type":"Buffer","data":[40,74,133,32,170,2,239,52,240,236,161,236,138,249,165,180,158,114,205,230]},"announce":[],"urlList":[]}}