{"title":"Robert Fisk on Israel: The Obama Years ^ Robert Fisk ^ azw3","uid":15310448,"size":409996,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:284f265c150813d93bce1624193e06bc8278aea2&amp;dn=Robert+Fisk+on+Israel%3A+The+Obama+Years+%5E+Robert+Fisk+%5E+azw3&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"heliiaruy","files":1,"time":1468576400,"description":"Robert Fisk on Israel: The Obama Years: A unique anthology of reporting and analysis of a crucial period of history ^ Robert Fisk ^ azw3\r\n\r\n\r\nNo journalist has chronicled the tragedies of the Israelis and the Palestinians so exhaustively, so authoritatively ­- or so controversially - as Robert Fisk, the Independent’s correspondent in the region for 25 years. No US president has entered the White House carrying so much hope of peace and progress in the region as Barack Obama. Yet how much has the Nobel prize-winning icon of reconciliation actually delivered, halfway through his second term of office? And how much objectivity has the world’s media brought to its coverage of his Middle-Eastern initiatives?\r\n\r\nThis unique anthology of six years of reporting and analysis allows you to re-examine a crucial period of history by following it episode by episode, through the ferociously clear-sighted eyes of one of the great foreign reporters of our times.\r\n\r\nBased on decades of first-hand experience of the Holy Land’s troubles and intrigues, it is a saga of cruelty, betrayal, complacency, selfishness, missed chances, broken promises – and inextinguishable hope.\r\n\r\nPassionate but unprejudiced, outspoken but free from spin, this collection should be considered essential reading for anyone hoping to understand what has really happened in Israel (and the occupied territories) since 2008.\r\n\r\n---------------\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy.\r\n\r\n\r\n\r\nBest\r\nLove\r\nPeace\r\nShare\r\nCare\r\nAwake","torrent":{"xt":"urn:btih:284f265c150813d93bce1624193e06bc8278aea2","amp;dn":"Robert+Fisk+on+Israel%3A+The+Obama+Years+%5E+Robert+Fisk+%5E+azw3","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"284f265c150813d93bce1624193e06bc8278aea2","infoHashBuffer":{"type":"Buffer","data":[40,79,38,92,21,8,19,217,59,206,22,36,25,62,6,188,130,120,174,162]},"announce":[],"urlList":[]}}