{"title":"Infernal Restraints--Application Denied  Ella Nova High","uid":10398615,"size":3076450910,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:286e1fe6ef0bc7af542e84b99a5b49a16b71bff8&amp;dn=Infernal+Restraints--Application+Denied++Ella+Nova+High&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"merzedes","files":-1,"time":1403314777,"description":"\nApplication Denied | Ella Nova\n\nJune 20, 2014\n\n\nHigh bitrate MP4 only.\n\n\nElla Nova has a fantasy and she's come to us to have it fulfilled. She wants to feel exploited. She wants to have an experience where someone controls her fate and makes her do something that she doesn't want to do. Or rather, something that she knows she wants but knows she shouldn't do. She showed up wearing a short school girl skirt and knee high stockings. We took it from there.\n\nShe has a boyfriend but she also has a secret. Ella has been cheating on him for a while and it came up during a background check. She wants to attend the university but since admissions officer OT has this sweet bit of leverage against her it is not going to be as simple as she had hoped. With incriminating photographs AND her academic future resting in his control, OT has everything he needs to get her to agree to his dirty deal.\n\nIt's a simple trade. In fact, it's really in Ella's favor. She offers up her body, a worthless piece of meat belonging to a useless slut, and OT gives her a future in his school and keeps her secret safe. He shackles her down and bends her over and discovers that she isn't even wearing panties. If she didn't have a ball gag in her mouth she might be able to explain. He doesn't care. She is going to get spanked until her ass cheeks are bright pink. Hot wax across her tits will make the front of her match the back.\n\nShe won't be able to sit for days so it is a good thing Ella is used to spending a lot of time on her back and knees. It isn't just his bare hand that leaves its marks on her ass. He canes her and paddles her to tears, leaving huge bruises across her back side. But true to her word, Ella complies. She begs to go home but she never resists. And when a metal dildo is pushed inside of her, when the celebrator starts vibrating across her clit, suddenly it becomes clear why. Her pussy is dripping wet and she cums in a matter of seconds. Ella may be crying but she is loving every second of the humiliation. \n \nScreens &lt;a href=&quot;\nhttp://infernalrestraints.com/device/bondage/2014/06_20enova/InfernalRestraints-Ella-Nova-Application-Denied.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://infernalrestraints.com/device/bondage/2014/06_20enova/InfernalRestraints-Ella-Nova-Application-Denied.php&lt;/a&gt;\n\n14 000 down, but how much more to come ?? You decide ;) \n\nThe more you appreciate it, the more we want to do it. Can we get to 15k ??? \n\nWell, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:286e1fe6ef0bc7af542e84b99a5b49a16b71bff8","amp;dn":"Infernal+Restraints--Application+Denied++Ella+Nova+High","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"286e1fe6ef0bc7af542e84b99a5b49a16b71bff8","infoHashBuffer":{"type":"Buffer","data":[40,110,31,230,239,11,199,175,84,46,132,185,154,91,73,161,107,113,191,248]},"announce":[],"urlList":[]}}