{"title":"God's Problem: Why We Suffer - Bart D. Ehrman","uid":15174027,"size":297277812,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:2882cded1a0eb6dbad2f410c0130e4909896d225&amp;dn=God%27s+Problem%3A+Why+We+Suffer+-+Bart+D.+Ehrman&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"twp6045","files":1,"time":1467408170,"description":"In times of questioning and despair, people often quote the Bible to provide answers. Surprisingly, though, the Bible does not have one answer but many &quot;answers&quot; that often contradict one another. Consider these competing explanations for suffering put forth by various biblical writers:\r\n\r\nThe prophets: suffering is a punishment for sin.\r\n\r\nThe book of Job, which offers two different answers: suffering is a test, and you will be rewarded later for passing it; and suffering is beyond comprehension, since we are just human beings, and God, after all, is God.\r\n\r\nEcclesiastes: suffering is the nature of things, so just accept it.\r\n\r\nAll apocalyptic texts in both the Hebrew Bible and the New Testament: God will eventually make right all that is wrong with the world.\r\n\r\nFor renowned Bible scholar Bart Ehrman, the question of why there is so much suffering in the world is more than a haunting thought. Ehrman's inability to reconcile the claims of faith with the facts of real life led the former pastor of the Princeton Baptist Church to reject Christianity.\r\n\r\nIn God's Problem, Ehrman discusses his personal anguish upon discovering the Bible's contradictory explanations for suffering and invites all people of faith - or no faith - to confront their deepest questions about how God engages the world and each of us.\r\n\r\nBart D. Ehrman is the author of more than twenty books, including the New York Times bestselling Misquoting Jesus and God's Problem. Ehrman is the James A. Gray Distinguished Professor of Religious Studies at the University of North Carolina, Chapel Hill, and is a leading authority on the Bible and the life of Jesus. He has been featured in Time and has appeared on Dateline NBC, The Daily Show with Jon Stewart, CNN, the History Channel, major NPR shows, and other top media outlets. He lives in Durham, N.C.\r\n\r\nIncluded here is the drm-free Audible file. Enjoy!","torrent":{"xt":"urn:btih:2882cded1a0eb6dbad2f410c0130e4909896d225","amp;dn":"God%27s+Problem%3A+Why+We+Suffer+-+Bart+D.+Ehrman","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2882cded1a0eb6dbad2f410c0130e4909896d225","infoHashBuffer":{"type":"Buffer","data":[40,130,205,237,26,14,182,219,173,47,65,12,1,48,228,144,152,150,210,37]},"announce":[],"urlList":[]}}