{"title":"Consciousness - A Very Short Introduction (Susan Blackmore)","uid":7557256,"size":2779211,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:28a64fa8048b9b34017f605538625f32ff93edca&amp;dn=Consciousness+-+A+Very+Short+Introduction+%28Susan+Blackmore%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"WUAmin","files":-1,"time":1345651562,"description":"Title:\t\tConsciousness: A Very Short Introduction\nAuthors:\tSusan Blackmore\nFormats:\tPDF\nIds:\t\t9780192805850\n\n\n&quot;The last great mystery for science,&quot; consciousness has become a controversial topic. Consciousness: A Very Short Introduction challenges readers to reconsider key concepts such as personality, free will, and the soul. How can a physical brain create our experience of the world? What creates our identity? Do we really have free will? Could consciousness itself be an illusion? Exciting new developments in brain science are opening up these debates, and the field has now expanded to include biologists, neuroscientists, psychologists, and philosophers. This book clarifies the potentially confusing arguments and clearly describes the major theories, with illustrations and lively cartoons to help explain the experiments. Topics include vision and attention, theories of self, experiments on action and awareness, altered states of consciousness, and the effects of brain damage and drugs. This lively, engaging, and authoritative book provides a clear overview of the subject that combines the perspectives of philosophy, psychology, and neuroscience--and serves as a much-needed launch pad for further exploration of this complicated and unsolved issue.\n\nAbout the Series: Combining authority with wit, accessibility, and style, Very Short Introductions offer an introduction to some of life's most interesting topics. Written by experts for the newcomer, they demonstrate the finest contemporary thinking about the central problems and issues in hundreds of key topics, from philosophy to Freud, quantum theory to Islam.\n\n\n\n\nAbout the Author\n----------------\nSusan Blackmore is a psychologist, freelance writer, and lecturer. Previously Reader in Psychology at the University of the West of England, Bristol, she left in 2000 to write an undergraduate textbook on consciousness. The author of numerous scientific articles and book contributions, she writes for several magazines and newspapers and is a frequent contributor on radio and television, both in the UK and abroad. She has presented several television programs including a Channel 4 documentary on the intelligence of apes. She has been training in Zen for twenty years. Her books include an autobiography, In Search of the Light (1996), The Meme Machine (1999), Consciousness: An Introduction (2003), and Conversations about Consciousness (forthcoming in 2005).","torrent":{"xt":"urn:btih:28a64fa8048b9b34017f605538625f32ff93edca","amp;dn":"Consciousness+-+A+Very+Short+Introduction+%28Susan+Blackmore%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28a64fa8048b9b34017f605538625f32ff93edca","infoHashBuffer":{"type":"Buffer","data":[40,166,79,168,4,139,155,52,1,127,96,85,56,98,95,50,255,147,237,202]},"announce":[],"urlList":[]}}