{"title":"TLC - Fanmail - (1999)[FLAC-EAC-CUE]","uid":4532097,"size":496831171,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2963ae69cdd4d2186729aa1d0c4f83f3692bfd8c&amp;dn=TLC+-+Fanmail+-+%281999%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"seanprince","files":26,"time":1227594910,"description":"TLC - Fanmail - (1999)[FLAC-EAC-CUE]\n\n\n\nTrack list\n\nTLC - Fanmail\n\n01. Fanmail 03:59\n02. The Vic-E Interpretation (Interlude) 00:18\n03. Silly Ho 04:15\n04. Whispering Playa (Interlude) 00:52\n05. No Scrubs 03:34\n06. I&amp;#039;m Good At Being Bad 04:37\n07. If They Knew 04:04\n08. I Miss You So Much 04:56\n09. Unpretty 04:38\n10. My Life 04:01\n11. Shout 03:57\n12. Come On Down 04:17\n13. Dear Lie 05:10\n14. Communicate (Interlude) 00:51\n15. Lovesick 03:52\n16. Automatic 04:31\n17. Don&amp;#039;t Pull Out On Me Yet 04:33\n\nBiography by Steve Huey\n\nTLC were one of the biggest-selling female R&amp;B groups of all time, riding a blend of pop, hip-hop, and urban soul to superstardom during the &amp;#039;90s. Tionne &quot;T-Boz&quot; Watkins, rapper Lisa &quot;Left Eye&quot; Lopes, and Rozonda &quot;Chilli&quot; Thomas managed to appeal equally to pop and R&amp;B audiences, blending catchy hooks and bouncy funk with a sassy, sexy attitude. Initially, their image was equal parts style and spirit, bolstered by a flamboyant, outrageous wardrobe. As time passed, they became equally well known for their chaotic personal lives, leaving a trail of headlines that read like a soap opera plot: arson, rehab, bankruptcy, serious illness, high-profile romances, and countless intragroup squabbles. After their star-making second album, CrazySexyCool, TLC fell into disarray, taking over four years to record the follow-up, Fanmail; even so, they returned more popular than ever, and the hits kept on coming. Unfortunately, tragedy struck in early 2002, when Lopes was killed in a car accident in Honduras.\nTLC were formed in Atlanta, GA, in 1991, when Watkins and Lopes decided to split off from another all-female group. In short order, they met Thomas, locally based producer Dallas Austin, and &amp;#039;80s R&amp;B singer Pebbles, who became their manager. They quickly scored a record deal with L.A. Reid and Babyface&amp;#039;s new label, LaFace, and in 1992 issued their new jack-styled debut album, Ooooooohhh...On the TLC Tip. The video for the sexy, aggressive lead single, &quot;Ain&amp;#039;t 2 Proud 2 Beg,&quot; established their quirky, colorful fashion sense, and true to her nickname, Lopes stirred some attention by wearing a condom over her left eye to promote safe sex. The song became a Top Ten hit as did its follow-ups, the ballad &quot;Baby-Baby-Baby&quot; (a number two hit) and &quot;What About Your Friends.&quot; TLC were definitely a success, but they weren&amp;#039;t quite stars yet, and it remained to be seen whether they could maintain their momentum over the long haul.\nNot long before the release of their second album in late 1994, Lisa Lopes was arrested on arson charges. In an alcohol-fueled fit of rage, Lopes vented all the frustrations from her often-stormy relationship with NFL wide receiver Andre Rison, burning his Atlanta mansion to the ground and vandalizing several of his cars. Lopes&amp;#039; lawyers claimed that she had a drinking problem, and while Lopes herself wasn&amp;#039;t happy with that defense, she avoided jail time with a sentence of five years&amp;#039; probation; she was also later admitted to an alcohol rehab program. All the publicity certainly didn&amp;#039;t hurt CrazySexyCool, which became a blockbuster success, albeit for other reasons. Taking a cue from Salt-n-Pepa&amp;#039;s makeover on Very Necessary, CrazySexyCool toned down the boisterousness of their first record in favor of a smoother, more mature presentation; they were still strong and sexual, but now fully adult as well, and were more involved (especially Lopes) in crafting their own material. The slinky lead single, &quot;Creep,&quot; became TLC&amp;#039;s first number one pop hit, topping the charts for four weeks. It was followed by three more Top Five singles: &quot;Red Light Special,&quot; &quot;Waterfalls&quot; (which became their biggest hit ever, spending seven weeks at number one), and &quot;Diggin&amp;#039; on You.&quot; TLC were a bona fide phenomenon, and their stylish videos and live performances kept upping the ante for outrageous fashion sense. CrazySexyCool eventually sold over 11 million copies in the U.S. alone, and won a Grammy for Best R&amp;B Album.\nAll was not well, however. In 1995, TLC filed for bankruptcy, claiming debts of over 3.5 million dollars, in part stemming from Lopes&amp;#039; insurance payments over the arson incident. They also claimed they hadn&amp;#039;t seen their fair share of royalties from CrazySexyCool; LaFace countered that they were simply trying to get a bigger contract. TLC did wind up splitting from Pebbles&amp;#039; management company over the money issues (not helped by the fact that Pebbles&amp;#039; marriage to LaFace head L.A. Reid had gone through a nasty breakup). What was more, it was announced that for some time Watkins had been battling sickle cell anemia, which sapped her energy and often made performing difficult. TLC spent much of 1996 getting their financial affairs in order, and were set to re-enter the studio in the summer of 1997. The sessions had trouble getting off the ground, though, thanks to the group&amp;#039;s public spat with producer Dallas Austin, claiming that his fee was far too high; not only had Austin played a significant role in the creation of their music, but the split was all the more awkward because he and Thomas had just had a son together. It took until early 1998 to finally resolve the producer situation, and Austin wound up handling the vast majority of the record. Still, it took quite some time to put together; Lopes announced in the summer of 1998 that she was working on a solo record, and Watkins tried her hand at acting with an appearance in the Hype Williams-directed Belly. All the delays, tension, and side projects fueled rumors of the group&amp;#039;s impending breakup.\nTLC&amp;#039;s third album was finally released at the beginning of 1999. The hotly anticipated Fanmail debuted at number one, and its first single, &quot;No Scrubs&quot; -- a dismissal of men who didn&amp;#039;t measure up -- topped the charts as well for four weeks. The critically acclaimed follow-up, &quot;Unpretty,&quot; tackled unrealistic beauty standards and spent three weeks at number one. Fanmail wound up going six times platinum, and won another Best R&amp;B Album Grammy. As TLC prepared to tour in late 1999, tensions between the individual members spilled over into a public feud; Watkins and Thomas criticized Lopes for putting herself before the group, and Lopes responded by blasting TLC&amp;#039;s recent music and challenging her bandmates to record solo albums, so that fans could see who the real talent lay with. The blowup was only temporary, but rumors about TLC&amp;#039;s future continued to swirl. Lopes continued to publicize her upcoming solo project, and Thomas eventually began working on her own album as well. Watkins married rapper Mack 10 in the summer of 2000 and had their first child not long after. Meanwhile, tabloid favorite Lopes continued to make headlines when she disappeared for over a week, missing a family function and a press conference (she turned out to be with a new boyfriend).\nIn 2001, TLC somehow managed to regroup and enter the studio together to work on material for a new album. That summer, a report surfaced that Lopes had postponed a wedding with, of all people, Andre Rison. Meanwhile, her solo debut, Supernova, was scheduled for release and then scrapped on several occasions; it eventually came out overseas, but domestically Arista pulled the plug. Meanwhile, TLC&amp;#039;s recording halted while Watkins was hospitalized from complications with her anemia. At the beginning of 2002, Lopes announced that she had signed a solo deal with the infamous Suge Knight&amp;#039;s new label Tha Row, for which she would begin recording a follow-up to the unreleased Supernova under the name N.I.N.A. (New Identity Non-Applicable). Sadly, she would never get the chance. Vacationing in her favorite getaway spot, Honduras, Lopes was driving a rented SUV with at least seven (possibly eight) passengers. Reportedly speeding, she lost control of the vehicle, which flipped over; she was the only member of the party\nto be seriously injured, and died from severe head trauma on April 25, 2002. The surviving members of TLC announced their intention to complete the album they&amp;#039;d begun, though without their most vibrant character the group&amp;#039;s long-term future remained in doubt.\n\n\nReview by Stephen Thomas Erlewine\n\nCrazysexycool was one of those records that defined an era. Few records before it combined hip-hop and classic soul songwriting quite as intoxicatingly or gracefully -- the performances and productions were utterly seamless. It would have been difficult to top anyway, but TLC had it doubly bad, since a number of behind-the-scenes problems delayed a sequel for nearly five years. As with any eagerly anticipated record, that follow-up, FanMail, arrived with too many expectations. And initially, it may be disappointing to realize TLC doesn&amp;#039;t forge new ground with FanMail, but after a few spins, it settles in that nobody else makes urban soul quite as engaging as this. Not that it was easy to make this record, as the head-spinning list of collaborators indicates. Almost ten producers worked on the record, all trying to replicate the easy, appealing sound of Crazysexycool. And &quot;replicate&quot; is the right word, since there are no new innovations on FanMail, apart from a few lifts from the Timbaland book of tricks. Nevertheless, that may be for the best, since TLC and their army of producers have spent time crafting the songs and productions, turning FanMail into a record that almost reaches the peaks of its predecessor. By the end of the record, it appears that they can do it all -- funky, hip-hop-fueled dance-pop, seductive ballads, and mid-tempo jams -- and they can do it all well. Other groups try to reach these heights, but they don&amp;#039;t have the skills or the material to pull it off quite so well. True, the five-year wait felt interminable, and they&amp;#039;re now standard-bearers instead of pioneers, but if takes TLC as long to make a sequel to FanMail, so be it -- they have one of the best track records in &amp;#039;90s urban soul.\n\nEnjoy","torrent":{"xt":"urn:btih:2963ae69cdd4d2186729aa1d0c4f83f3692bfd8c","amp;dn":"TLC+-+Fanmail+-+%281999%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2963ae69cdd4d2186729aa1d0c4f83f3692bfd8c","infoHashBuffer":{"type":"Buffer","data":[41,99,174,105,205,212,210,24,103,41,170,29,12,79,131,243,105,43,253,140]},"announce":[],"urlList":[]}}