{"title":"Foreigner - Foreigner (EAC.FLAC)","uid":5211006,"size":256768901,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2964f755bd463fd7fb77afc3c8d2eba162f01468&amp;dn=Foreigner+-+Foreigner+%28EAC.FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bobnjeff","files":13,"time":1260594361,"description":"Foreigner - Foreigner (EAC.FLAC)\n\nall music files are in flac format\nwith cue &amp; m3u files bitrate at 1024 kBit/s\n# of Discs 1 \n\nCategory  Rock/Pop, Rock, Hard Rock \nLabel  Rhino \nOrig Year  1977 \nAll Time Sales Rank    4339   \nCD Universe Part number  3029844 \nCatalog number  74270 \nDiscs  1 \nRelease Date  Apr 02, 2002 \nStudio/Live  Studio \nMono/Stereo  Stereo \nPersonnel  Ian Mcdonald - vocals, guitar, horns, keyboards\nMick Jones - vocals, guitar\nLou Gramm - vocals\nDennis Elliott - drums\nAl Greenwood - keyboards, synthesizer\nEd Gagliardi\n\nAlso: Ian Lloyd \n\nAlong with bands like Styx, Journey, and Boston, Foreigner was one of the first hard rock acts to add overt Top-40 pop sensibilities to the mix. The result was mass crossover success, something that both the pop and rock audiences could easily ...    Full Descriptionlatch onto. Foreigner's self-titled debut from 1977 is the epitome of classic rock: big guitar hooks, melodicism, simple driving rhythms, and sexually charged lyrics. Two of Foreigner's best-known tracks, &quot;Double Vision&quot; and &quot;Cold as Ice,&quot; are included here, as are such strong album cuts as &quot;Long Way From Home.&quot; FOREIGNER was a multi-platinum success--with just one try, the band found itself at the top of the hard rock heap.\n\nAlong with bands like Styx, Journey, and Boston, Foreigner was one of the most popular 1970s arena rock acts to add overt Top 40 pop sensibilities to the mix. The result was massive crossover success, something that both the pop and rock audiences could easily latch onto. Foreigner's self-titled debut from 1977 is the epitome of classic rock: big guitar hooks, melodicism, simple, driving rhythms, and sexually charged lyrics. Two of Foreigner's best-known tracks, &quot;Double Vision&quot; and &quot;Cold as Ice,&quot; are included here, as are such strong album cuts as &quot;Long Way From Home.&quot; FOREIGNER was a multi-platinum success--with just one try, the band found itself at the top of the AOR heap.\n\nAlthough punk rock's furious revolution threatened to overthrow rock's old guard in 1977, bands like Foreigner came along and proved that there was plenty of room in the marketplace for both the violent, upstart minimalism of punk and the airbrushed slickness of what would be called &quot;arena rock.&quot; Along with Boston, Journey, Heart, and others, Foreigner celebrated professionalism over raw emotion. And, looking back, it's easy to see why they sold millions; not everyone in the world was pissed off, dissatisfied with the economy, or even necessarily looking for a change. In fact, for most suburban American teens, Foreigner's immaculate rock sound was the perfect soundtrack for cruising through well-manicured neighborhoods in their Chevy Novas. The album spawned some of the biggest FM hits of 1977, including the anthemic &quot;Feels Like the First Time&quot; and &quot;Cold As Ice,&quot; both of which were anchored -- like most of Foreigner's songs -- by the muscular but traditional riffing of guitarist Mick Jones, the soaring vocals of Lou Gramm, and the state-of-the-art rock production values of the day, which allowed the band to sound hard, but polished. As pure rock craftsmanship goes, Foreigner was as good as it got in the late '70s. [The expanded edition adds four demos: &quot;Feels Like the First Time,&quot; &quot;Woman Oh Woman,&quot; &quot;At War With the World,&quot; and &quot;Take Me to Your Leader.&quot;] ~ Andy Hinds\n\nExpanded &amp; remastered edition of their 1977 debut with 4 added bonus demo versions of 'Feels Like The First Time', 'Woman Oh Woman', 'At War With The World' &amp; 'Take Me To Your Leader'.\n\n 1. Feels Like the First Time    \n 2. Cold As Ice    \n 3. Starrider \n 4. Headknocker   \n 5. Damage Is Done, The  \n 6. Long, Long Way From Home    \n 7. Woman Oh Woman  \n 8. At War With the World    \n 9. Fool for You Anyway  \n 10. I Need You \n\n &lt;a href=&quot;\nhttp://www.torrent-downloads.to:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrent-downloads.to:2710/announce&lt;/a&gt; &lt;a href=&quot;\nhttp://tracker.openbittorrent.com/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.openbittorrent.com/announce&lt;/a&gt; &lt;a href=&quot;\nhttp://denis.stalker.h3q.com:6969/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://denis.stalker.h3q.com:6969/announce&lt;/a&gt; &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n","torrent":{"xt":"urn:btih:2964f755bd463fd7fb77afc3c8d2eba162f01468","amp;dn":"Foreigner+-+Foreigner+%28EAC.FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2964f755bd463fd7fb77afc3c8d2eba162f01468","infoHashBuffer":{"type":"Buffer","data":[41,100,247,85,189,70,63,215,251,119,175,195,200,210,235,161,98,240,20,104]},"announce":[],"urlList":[]}}