{"title":"Reboot Your Life - A 12-day Program - Paul Gibbons","uid":11072126,"size":4514126,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:299d4eb0236d2e32d595085b37abec8fd3d560e1&amp;dn=Reboot+Your+Life+-+A+12-day+Program+-+Paul+Gibbons&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DethHolly","files":7,"time":1411290083,"description":"Reboot\nYour Life is a 12-day process for reflecting on where you are in life, clearing\nout aspects that don't work, designing your mission and vision, creating goals,\nand learning strategies for realizing those goals with the latest productivity\nstrategies. Each day has a few minutes reading, but then practical exercises\nand tools to get you quickly into action. &quot;Reboot&quot; is the same\nprocess used by life-coaches who charge thousands of dollars, but after\ncompleting the process, you will be your own greatest coach.\n\n\nWhat have people said about the Reboot process:\n\n&quot;I do Reboot religiously every year. I spring into January on fire and reconnected to my passion and dreams.&quot; (Management Consultant, London)\n\n\n\n&quot;I used to have big inspiring dreams in my twenties, but as I became more successful, I lost track of the big picture and felt as if I were going through the motions. After Reboot , life feels exactly as it did in my twenties.&quot; (Senior partner, KPMG)\n\n\n\n&quot;Since working through that process, my life has never been the same, and I've never looked back.&quot; (Senior IT Director)\n\n\n\n&quot;Just the vision- and goal-setting process was worth its weight in gold.&quot; (Entrepreneur, Madison, Wisconsin)\n\n\n\n&quot;The transitions of the last two years were really hard, especially coming one after another. I needed a fresh start, and working through the process gave me much more value than I expected.&quot; (Director, Public Relations)\n\n\n\n&quot;I had a lot of great things in my life, but I still woke up some days thinking 'What's the point?' I needed to reconnect with the big picture: why I was on the planet, what I cared about, and what I was doing to do about that.&quot; (CEO, Leadership Consultancy)\n\n\n\nReboot Your Life's author, Paul Gibbons, was named 'CEO super coach' by CEO magazine for his work with dozens of CEOs. He has been an entrepreneur, management consultant, investment banker and university lecturer over his 30 year career.\n\n- - -\n\nFormats: EPUB, MOBI, AZW3, PDF, LIT\nASIN#: B00H4XKYX4\nISBN#: 1494470365\nISBN13#: 9781494470364\nPublished: November 28, 2013\nLanguage: English","torrent":{"xt":"urn:btih:299d4eb0236d2e32d595085b37abec8fd3d560e1","amp;dn":"Reboot+Your+Life+-+A+12-day+Program+-+Paul+Gibbons","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"299d4eb0236d2e32d595085b37abec8fd3d560e1","infoHashBuffer":{"type":"Buffer","data":[41,157,78,176,35,109,46,50,213,149,8,91,55,171,236,143,211,213,96,225]},"announce":[],"urlList":[]}}