{"title":"Flashman and the Angel of the Lord","uid":8198254,"size":305505330,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:299eb43ad305b93af82e0188329db80eacdc926f&amp;dn=Flashman+and+the+Angel+of+the+Lord&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gruntfutock","files":-1,"time":1361966081,"description":"Harry Flashman: the unrepentant bully of Tom Brown's schooldays, now with a Victoria Cross, has three main talents -- horsemanship, facility with foreign languages and fornication. A reluctant military hero, Flashman plays a key part in most of the defining military campaigns of the 19th century, despite trying his utmost to escape them all. If only Flashman had got on with his dinner and ignored the handkerchief dropped by a flirtatious hussy in a Calcutta hotel ! Well, American history would have been different, a disastrous civil war might have been avoided, and Flashman himself would have been spared one of the most hair-raising adventures of his misspent life. If only ! But, alas, the arch-rotter of the Victorian age could never resist the lure of a pretty foot. This latest extract of the Flashman Papers soon finds Flashman careering towards the little Virginian town of Harper's Ferry, where John Brown and his gang of rugged fanatics were to fire the first shot in the great war against slavery.","torrent":{"xt":"urn:btih:299eb43ad305b93af82e0188329db80eacdc926f","amp;dn":"Flashman+and+the+Angel+of+the+Lord","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"299eb43ad305b93af82e0188329db80eacdc926f","infoHashBuffer":{"type":"Buffer","data":[41,158,180,58,211,5,185,58,248,46,1,136,50,157,184,14,172,220,146,111]},"announce":[],"urlList":[]}}