{"title":"Periodic Operation of Reactors","uid":12085091,"size":29060780,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:29ccbc644e71600c87bab27732e8da9919904545&amp;dn=Periodic+Operation+of+Reactors&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"clouderone","files":1,"time":1435880321,"description":"Periodic Operation of Reactors - Peter Silveston, Robert Hudgins (Elsevier, 2013).pdf\n\nISBN: 978-0-12-391854-3\n\nThis comprehensive review, prepared by 24 experts, many of whom are pioneers of the subject, brings together in one place over 40 years of research in this unique publication. This book will assist R &amp; D specialists, research chemists, chemical engineers or process managers harnessing periodic operations to improve their process plant performance.\n\n&quot;Periodic Operation of Reactors&quot; covers process fundamentals, research equipment and methods and provides &quot;the state of the art&quot; for the periodic operation of many industrially important catalytic reactions. Emphasis is on experimental results, modeling and simulation. Combined reaction and separation are dealt with, including simulated moving bed chromatographic, pressure and temperature swing and circulating bed reactors. Thus, &quot;Periodic Operation ofReactors&quot; offers readers a single comprehensive source for the broad and diverse new subject. This exciting new publication is a &quot;must have&quot; for any professional working in chemical process research and development.\n\nKey features:\n\nProvides the only comprehensive reference on the fundamentals, development and applications of periodic reactor operation, using contributions from the research pioneers.\n\nThis authoritative reference focuses on applications helping readers to use this book to deliver results in their own work.\n\nComplete literature references will be an invaluable assistance for readers collecting data and models from past research.\n\nAbout the editors:\n\nPeter L. Silveston is a Distinguished Professor Emeritus at the University of Waterloo in Canada. Professor Silveston has authored or co-authored three previous books on reactor engineering topics as well as close to 300 research publications. He is a graduate of M.I.T. and the Technical University of Munich (Germany).\n\nRobert Hudgins is a Professor Emeritus at the University of Waterloo. His research interests are reactor engineering, specifically periodic operation of catalytic reactors, and he has about 250 research publications. He is a graduate of the University of Toronto and Princeton University. \nFEATURE: A comprehensive reference on the fundamentals, development and applications of periodic operation.\n\nBENEFIT: Provides readers with a single comprehensive source for this extremely broad and diverse subject\n\nFEATURE: Contributors and editors include the pioneers of the subject as well as the leading researchers in the field.\n\nBENEFIT: Has the authority and experience of the leading players in the field\n\nFEATURE: Covers both fundamentals and the state of the art for each operation scenario, and brings all types of periodic operation together in a single volume.\n\nBENEFIT: Provides a succinct reference to the most important applications in the filed, allowing readers to understand how to apply techniques or technologies to their own situation\n\nFEATURE: Discussion is focused on experimental results rather than theoretical ones; provides a rich source of experimental data, plus process models.\n\nBENEFIT: Applied approach that is geared helping practicing engineers and researchers solve problems\n\nFEATURE: Accompanying website with modelling data\n\nBENEFIT: Engineers can engage with experimental and actual performance data","torrent":{"xt":"urn:btih:29ccbc644e71600c87bab27732e8da9919904545","amp;dn":"Periodic+Operation+of+Reactors","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29ccbc644e71600c87bab27732e8da9919904545","infoHashBuffer":{"type":"Buffer","data":[41,204,188,100,78,113,96,12,135,186,178,119,50,232,218,153,25,144,69,69]},"announce":[],"urlList":[]}}