{"title":"Discovery.Mighty.Ships.USS.Nimitz.720p[AGENT]","uid":5492891,"size":1510015650,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:29cf0e0fe0deb42ed374c4d17855923020fe519d&amp;dn=Discovery.Mighty.Ships.USS.Nimitz.720p%5BAGENT%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"agentpiratebay","files":-1,"time":1271105544,"description":"The USS Nimitz - a nuclear powered aircraft carrier. A floating city. And the most powerful weapon on the planet.\n\nShe's the biggest, meanest, most lethal weapon in the arsenal of a global power. The USS Nimitz, like the whole US Navy, has to be ready for any mission, anywhere in the world. That's why she undergoes a rigorous - and often dangerous - evaluation before every deployment. And for four days in February, Mighty Ships was aboard while the supercarrier and her young crew were put through their paces. \n\nEveryone on board trains, tests and trains some more as they get ready for deployment to the war in Afghanistan. We follow several key players - a junior pilot who's never before made the treacherous landing on a carrier; a shooter, who catapults jets off the flight deck, the most dangerous workplace in the world; a senior pilot, getting ready for his third deployment and counting on making it home alive for his wedding. And, reigning supreme over them all, the captain, a decorated fighter pilot who has to get all 5000 of his crew ready for combat, and bring them through their training safely.\n\nAs we follow their stories, we'll get to know our mighty ship, from the 4.5 acre flight deck to the labyrinth below decks, where crew live tucked away like rabbits in a warren, supported by the infrastructure of a small city. We'll see her impressive weaponry, led by the F-18 Super Hornets that are her stock in trade. And we'll taste the pressure as the tension builds toward deployment.","torrent":{"xt":"urn:btih:29cf0e0fe0deb42ed374c4d17855923020fe519d","amp;dn":"Discovery.Mighty.Ships.USS.Nimitz.720p%5BAGENT%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29cf0e0fe0deb42ed374c4d17855923020fe519d","infoHashBuffer":{"type":"Buffer","data":[41,207,14,15,224,222,180,46,211,116,196,209,120,85,146,48,32,254,81,157]},"announce":[],"urlList":[]}}