{"title":"(1982) Duran Duran - Rio [VinylRip 24-192] {100.XY}","uid":10237277,"size":1742659273,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:29e83dba00ff4f2ed186b9c4d170096b087eb429&amp;dn=%281982%29+Duran+Duran+-+Rio+%5BVinylRip+24-192%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"100.XY","files":-1,"time":1401200571,"description":"(1982) Duran Duran - Rio [VinylRip 24-192]\n\n\n\nReview:\nReview Summary: In their second try, Duran Duran release their biggest album and continue their tradition of releasing big singles and having undervalued hits.\nYes. Rio. This is Duran Duran's definitive disc and one of the highlights of the New Wave movement. Not only does this disc capsize the band in the 80's, it capsizes what people think of when they think of 80's music. Synths blazing, people dressed in casual suits, beach parties and shaggy hair. Being one of the first straight up pop bands, Duran Duran must have been under pressure to follow up their surprise hit eponymous debut. The album itself had reached number 6 on the pop charts and peaked at number 101 overall. This doesn't seem like a lot, but being a British pop band who had just released their second album, it was big for them.\nBeing that track by track reviews are lame an ineffective, these songs will be reviewed in a way that is sort of like that, but hopefully less painful.\n\nThe Smash Hits\n\nRio\nDespite the success and constant airplay of the album's videos, Rio peaked at only number five on the Billboard charts. While even the big popularity the song gained, it still would play second fiddle to Hungry Like the Wolf. While more people are familiar with the other song, they should get to know Rio as well. Sporting one of John Taylor's best and most remembered bass backdrop in the back of Andy Taylor's cool guitar riffs leading into the chorus which ties the whole song together. &quot;Her name is Rio and she dances on the sand.&quot; This tells the story of Rio. Does she really exist? Who knows. Does this track provide the perfect intro to this consistent album and provide a good preview of what to expect? You bet.\n\n\nHungry Like the Wolf\nIdentifiable at any good 80s themed party, Hungry Like the Wolf begins with a woman's laugh, flash forward to Simon being backed on vocals by the band with a round of &quot;do do do do do do do do do's&quot; after each line in the verse. Each of the instruments in the band is highlighted here, weather it be Simon's howling, Nick's frantic high pitched synth lines, or John's present bass undertones. The song itself, which is defined by the video of the band going on a faux-safari, reached number one on the Billboard charts.\n\n\nThe Smaller Hits\n\nNew Religion\nJudging from the two songs on this disc being so big, it would seem they are the only reasons to purchase this CD. That is very wrong and this statement is made true by the quality of the other songs on the disc. New Religion pops in and exists as one of their more atmospheric songs, giving Rhodes room to play without having to duet with any of the other members. John Taylor's highly underrated bass lines eventually catch up with Rhodes and provide the main backdrop. On this track Andy drops back to play a well-executed role as rhythm guitarist.\n\nSave a Prayer\nThe typical ballad type song that the band gets around to about one per album. This kind of song for Duran Duran was the first of its kind in the sense of it being slow and having a more serious approach. More focus is placed on lyrical content, but the band at whole still holds most of the attention with backing up Simon on the chorus, and Andy providing the perfect bridge in the middle of the song to move it along. Nick provides the backdrop with Roger and guides the band through their first ballad, it would not be their last.\n\nThe Sleeper Hit\n\nThe Chauffeur\nReally one of the standouts on this album, and not because of the quality, but because its so much different than the other songs. Nick Rhodes plays a whimsical sounding synth on top of piano keys until the second verse where the effects become louder and it seems to just be a Rhodes/LeBon piece. LeBon's voice is really put on display here as he puts up and holds up notes while the whimsical backdrop which he sings over bridges the song and guides it through. Chances are you'll never hear this on the radio, but it could have and should have been on there.\n\nRomance, action, synth. This album has all 3 of these things and this is why it is regarded as the band's best. If you are looking for a vague overview of the band's discography then maybe a best of CD (Greatest is a good one) would suit your needs. But if you really wanna look back and capture Duran Duran in their prime, this is for you.\nReview by Zachary Powell\nRate 4.0 excellent\n\n\n\n\n\n\nTrack List:\nA1. Rio (5:34)\nA2. My Own Way (4:49)\nA3. Lonely In Your Nightmare (3:49)\nA4. Hungry Like The Wolf (3:39)\nA5. Hold Back The Rain (3:59)\nB1. New Religion (5:30)\nB2. Last Chance On The Stairway (4:18)\nB3. Save A Prayer (5:34)\nB4. The Chauffeur (5:09)\n\n\nSummary:\nCountry: UK\nGenre: Synthpop, new wave\n\n\nMedia Report:\nSource : Vinyl\nFormat : FLAC\nFormat/Info : Free Lossless Audio Codec, 24-bit PCM\nBit rate mode : Variable\nBit rate : ~ 5.2 - 5.6 Mbps\nChannel(s) : 2 channels\nSampling rate : 192 KHz\nBit depth : 32 bits (float)","torrent":{"xt":"urn:btih:29e83dba00ff4f2ed186b9c4d170096b087eb429","amp;dn":"%281982%29+Duran+Duran+-+Rio+%5BVinylRip+24-192%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29e83dba00ff4f2ed186b9c4d170096b087eb429","infoHashBuffer":{"type":"Buffer","data":[41,232,61,186,0,255,79,46,209,134,185,196,209,112,9,107,8,126,180,41]},"announce":[],"urlList":[]}}