{"title":"Miroslav Vitous Group - Remembering Weather Report (2009)","uid":6220915,"size":307112875,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a4634e9141aaefdc24a1e311c2a1a121970c283&amp;dn=Miroslav+Vitous+Group+-+Remembering+Weather+Report+%282009%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mariorg","files":-1,"time":1299324288,"description":"ECM 2073 &lt;a href=&quot;\nhttp://www.ecmrecords.com/Catalogue/ECM/2000/2073.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ecmrecords.com/Catalogue/ECM/2000/2073.php&lt;/a&gt;\n\n* Miroslav Vitous: double-bass\n* Franco Ambrosetti: trumpet\n* Gary Campbell: tenor saxophone\n* Gerald Cleaver: drums\n* Michel Portal: bass clarinet\n\n01 - Variations On W. Shorter\n02 - Variations On Lonely Woman\n03 - Semina (in 3 parts)\n04 - Surfing With Michel\n05 - When DvoÃ…â„¢ÃƒÂ¡k Meets Miles\n06 - Blues Report\n\nRecorded Recorded fall 2006 and spring 2007\n\nReview\n~~~~~~\nÃ‚Â© stef\n\nCzech bassist Miroslav Vitous co-founded Weather Report in the early 70s with\nWayne Shorter as an acoustic band. They asked Austrian keyboardist Joe Zawinul\nto join, who after a while wanted the band to become more electric, with synths,\nand a little more funky, with repetitive bass phrases, something that was not to\nVitous' liking, and he quit the band to be replaced by Alfonso Johnson. Vitous\nis a true virtuoso on the bass, classically schooled, his precision and clarity\nof tone when playing arco are absolutely awsome, as are his rhythmic and\nimprovisational skills. I am not too sure what the title of this album refers\nto: about what Weather Report could have been without a piano? how Weather\nReport could have sounded in a purely acoustic setting? None of the tunes refer\nback to Weather Report compositions, except to the reference to Wayne Shorter in\nthe title of the first track. In any case, in the liner notes he says it is not\nthe intention to play the music of Weather Report but rather to work with the\nconcept that he introduced in the band at its creation, that of direct\nconversation and equality between the instruments.\n\nWhatever the ego thing, the music on this album is stellar. It starts with a\npowerful opener, with Gerald Cleaver's drumming kicking the thing of, and Vitous\nalternates pizzi and arco on bass, giving the impression of playing two\ninstruments at the same time, then the trumpet of Franco Ambrosetti and the sax\nof Gary Campbell play some piercing unison phrases, referencing Wayne Shorter's\n&quot;Nefertiti&quot;. There aren't many bassists who are able to give their instrument so\nmuch voice, putting it on the same level as a horn. After the great opening\ntrack, it gets even better, with a cover of Ornette Coleman's &quot;Lonely Woman&quot;,\nhesitatingly, moving, dark, gripping. But the real highlight is the long\n&quot;Semina&quot;, a suite in three pieces, on which Vitous gives some gut-wrenching,\nheart-rending and terrifying arco sounds out of his bass, then later equalled by\nboth Campbell and Ambrosetti. &quot;Surfing with Michel&quot; brings an exciting duet\nbetween the bassist and French saxophonist Michel Portal. The second\npiÃƒÂ¨ce-de-rÃƒÂ©sistance is the long &quot;When DvoÃ…â„¢ÃƒÂ¡k meets Miles&quot;, in reference to the\ngreat Czech composer and Miles Davis with whom Vitous played in the late\n60s. The composition is abstract, dense and complex, moving with bursts of\nsound, and sounding possibly the most like what Weather Report could have been:\nvery intense, building on the broad musical background of its musicians and\nhence not limited to style and genre, switching moods from joyful to sad, adding\nsome traditional central European phrases in the mix, in full compatibility with\nthe dark muted sounds of the trumpet, with Cleaver demonstrating his skills of\nplaying around the beat, adding accents, texture and depth. The horns do not\nreally play themes, but rather just a harmonic and rhythmic backdrop for the\nsoloing. The album ends with &quot;Blues Report&quot;, a paradoxically joyful sounding\nmelody based on a blues basis.\n\nIf this what Vitous had in mind with Weather Report from the very beginning,\nit's clear that the match with Zawinul was a bad one. And nothing bad of the\ndead, but it's also clear that Vitous becomes musically better with the years,\nwhereas Zawinul was stuck in his commercial dead-end streat. Don't miss this\nalbum. Four brilliant musicians, but especially Vitous' open compositions and\nfree musical vision are fantastic, and you will hear possibly the best arco bass\never played. Let's hope he continues in this vein.","torrent":{"xt":"urn:btih:2a4634e9141aaefdc24a1e311c2a1a121970c283","amp;dn":"Miroslav+Vitous+Group+-+Remembering+Weather+Report+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a4634e9141aaefdc24a1e311c2a1a121970c283","infoHashBuffer":{"type":"Buffer","data":[42,70,52,233,20,26,174,253,194,74,30,49,28,42,26,18,25,112,194,131]},"announce":[],"urlList":[]}}