{"title":"Ghost.Asylum.Season.1.Complete.720p.HDTV.x264-DHD","uid":14827623,"size":8145601544,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2a8e19c609e40b0cc1e5357485e6d9eba8942b56&amp;dn=Ghost.Asylum.Season.1.Complete.720p.HDTV.x264-DHD&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"modemslayer","files":6,"time":1465315138,"description":"The complete first season of Ghost Asylum in 720p\r\n\r\nSeason 1 (2014)\r\n\r\n1.1\t&quot;Old War Memorial&quot;\tOld War Memorial Hospital, Scottsville, Kentucky\tSeptember 7, 2014\r\nIn the series premiere, a group of ghost hunters called the Tennessee Waith Chasers (TWC) hunt for ghosts at Kentucky's Old War Memorial Hospital, where they search for the spirit of a doctor rumored to be haunting the halls of the facility.\r\n1.2\t&quot;Kuhn State Hospital&quot;\tKuhn State Hospital, Vicksburg, Mississippi\tSeptember 14, 2014\r\nThe team investigates Mississippi's massive Kuhn State Memorial Hospital, built in 1835 because of a smallpox outbreak; and it also treated wounded Confederate soldiers during the Civil War. They invent a Faraday cage-like box to trap a spirit while ghost hunting.\r\n1.3\t&quot;Hayswood Infirmary&quot;\tHayswood Infirmary, Maysville, Kentucky\tSeptember 21, 2014\r\nTWC investigate the Hayswood Infirmary, which once served as a home for servicemen suffering from PTSD (known then as shell shock) after surviving the attack on Pearl Harbor. The guys also review a disputed raw unedited video capturing a supposed apparition in the hospital's window known as the &quot;Hayswood Ghost&quot;.\r\n1.4\t&quot;St. Vincent's Home&quot;\tSt. Vincent's Home, Oklahoma City, Oklahoma\tSeptember 28, 2014\r\nThe team investigates the abandoned St. Vincent's Home, once operated by the Brothers of Mercy. They discover the home had its share of tragedy, including an incident in 1962 when a male nurse went insane and suffocated two patients, and the murder of a priest years later. They build a vacuum trap with crystals to capture an evil entity they sense.\r\n1.5\t&quot;Old Ironton Psychiatric&quot;\tOld Ironton Psychiatric, Ironton, Missouri\tOctober 5, 2014\r\nTWC investigate the dark history of Missouri's Old Ironton Psychiatric, an abandoned asylum that harbors the local legend that tells of a deranged patient in the 1950s killing three nurses on the premises and now allegedly haunts the halls. To trap this ghost, the guys build a big battery shaped like a pyramid that covers a Telsa coil.\r\n1.6\t&quot;Cannon Memorial Banner&quot;\tCannon Memorial Hospital, Banner Elk, North Carolina\tOctober 12, 2014\r\nThe team investigates North Carolina's Cannon Memorial Hospital with a psych ward that drove its patients insane. One such patient held a doctor and some nurses at gunpoint in the 1960s before he was apprehened by the police. To trap a spirit, they build an infrasound generator to boost the sound that pushes the entitiy towards an infinity mirror.\r\n\r\nCredit to DHD","torrent":{"xt":"urn:btih:2a8e19c609e40b0cc1e5357485e6d9eba8942b56","amp;dn":"Ghost.Asylum.Season.1.Complete.720p.HDTV.x264-DHD","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a8e19c609e40b0cc1e5357485e6d9eba8942b56","infoHashBuffer":{"type":"Buffer","data":[42,142,25,198,9,228,11,12,193,229,53,116,133,230,217,235,168,148,43,86]},"announce":[],"urlList":[]}}