{"title":"Kevin Kern - More Than Words - The Best of .. [NewAge][mp3 320][","uid":4650340,"size":154033511,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2a9bd9f1bb7ea44da9b9f5b26b7a9b65112d27e6&amp;dn=Kevin+Kern+-+More+Than+Words+-+The+Best+of+..+%5BNewAge%5D%5Bmp3+320%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":18,"time":1232026272,"description":"Kevin Kern - More Than Words - The Best of .. \nAudio CD: September 3, 2002 \nOriginal Release Date: September 3, 2002 \nLabel: Real Music \nBitrate: 320 kbps\n\n&quot;More Than Words&quot; is an enchanting &quot;best of&quot; collection from Kevin Kern's five previous albums and includes two new pieces. My only argument with the selection of the fourteen tracks is the inclusion of both of the cover tunes Kern had on his &quot;In My Life&quot; album over any of his original work from that album. Both &quot;In My Life&quot; and &quot;We All Fall in Love Sometimes&quot; are great arrangements, but there was some beautiful original work on that album, too, and none of those pieces were included. Other than that, most of these pieces HAD to be on a &quot;best of&quot; collection - &quot;After the Rain,&quot; &quot;Sundial Dreams,&quot; and &quot;Through the Arbor&quot; from &quot;In the Enchanted Garden&quot; are pretty-much Kern's signature pieces, as is &quot;Twilight's Embrace&quot; from &quot;Summer Daydreams.&quot;. &quot;Above the Clouds&quot; and &quot;Blossom on the Wind&quot; from last year's &quot;Embracing the Wind&quot; open and close the collection with warmth and serenity. &quot;From This Day Forward&quot; from the same album was written for Kern's wedding and is so warm and loving that my CD player almost smiles whenever I play it! &quot;Out of the Darkness Into the Light&quot; was composed for the &quot;Freedom to Love&quot; compilation, and appeared there as a piano solo. Kern orchestrated the piece, and included it on this CD - a beautiful tribute to those lost in the attacks of 9/11. The other new piece is &quot;Children At Play,&quot; is a wistful piano and guitar duet that is full of Kern's trademark gentleness and warmth. Even if you have all of Kern's albums, the grouping of the pieces on this CD is wonderful, making the pieces fresh and new again. If you are new to Kevin Kern's work, this is an outstanding introduction! My only words of warning are to not use this CD in a wake-up CD player. I slept through 45 minutes of it one morning, and although I had some lovely little dreams in the process, woke up late and in a panic when I realized what time it was! Yep, the music is that peaceful! Very highly recommended for all other purposes! ~ Kathy Parsons\n\nKevin Kern's Best Of... is one of the most beautiful CDs I have in my collection. A wonderful 14-track compilation of some of the enchanting, soothing piano solos he has become famous for, this CD is soothing, melodious and enchanting, exactly what anyone needs after a hard day in school or at work. \n\nKern's music does not deviate from his New Age roots - there is still the fair amount of humming and the genteel of the tunes are much different from what is on other piano CDs out there. \n\nIt is wonderfully crafted, from a true master, and it brings a smile to anyone's face. This music is a reprieve from busy business worlds and brings to life a whole other world of magic and enchanting song. ~ Karl G &quot;Jerry&quot;\n\nKevin Kern - More Than Words - The Best of ..  Tracklist:\n01 Above the Clouds 05:26\n02 Sundial Dreams 04:46\n03 Out of the Darkness, Into the Li 04:17\n04 In My Life 03:29\n05 Through the Arbor 03:46\n06 From This Day Forward 04:50\n07 Threads of Light 03:10\n08 Pastel Reflections 04:31\n09 We All Fall in Love Sometimes 04:24\n10 Where Paths Meet 05:15\n11 After the Rain 04:12\n12 Children at Play 05:08\n13 Twilight's Embrace 07:00\n14 Blossoms on the Wind 04:00","torrent":{"xt":"urn:btih:2a9bd9f1bb7ea44da9b9f5b26b7a9b65112d27e6","amp;dn":"Kevin+Kern+-+More+Than+Words+-+The+Best+of+..+%5BNewAge%5D%5Bmp3+320%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a9bd9f1bb7ea44da9b9f5b26b7a9b65112d27e6","infoHashBuffer":{"type":"Buffer","data":[42,155,217,241,187,126,164,77,169,185,245,178,107,122,155,101,17,45,39,230]},"announce":[],"urlList":[]}}