{"title":"Little House: The Last Farewell (1984 Series Finale)","uid":6065256,"size":851625880,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2adf6de4174a6d0a4f90b41ed5fe63dc32cc3d6e&amp;dn=Little+House%3A+The+Last+Farewell+%281984+Series+Finale%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"brynrocks","files":3,"time":1293326527,"description":"Little House: The Last Farewell\nWritten and Directed by Michael Landon\n\nFirst aired on February 6th, 1984, this TV-movie series finalÃƒÂ© was the last project in the Little House series to be filmed--although ensuing episodes of the completed Season Ten and the TV-movie 'Bless All the Dear Children' were aired later. It was clearly designed to be the end of the entire series.\n\nThe story deals with the townspeople of Walnut Grove finding out that, after all these years, their town has been built on land owned by a real estate developer. The developer has now returned, and intends to take back what he sees as rightfully his. Of course, the people of Walnut Grove have made it their home, and have no intention of leaving peacefully. The law gets involved, and sides with the developer. The citizens of Walnut Grove decide to take matters into their own hands, in one of the more famously devastating series conclusions in television history. \n\nIn later seasons, much of the original cast had left the show. Season Nine was retitled &quot;Little House: A New Beginning&quot;, and concentrated mostly on Laura's new adult life with her husband. This finalÃƒÂ© reunited much of the original cast that had left the show--although still notably and noticeably absent are Melissa Sue Anderson as Mary Ingalls, Alison Arngrim as Nellie Oleson, and Scottie MacGregor as Harriet Oleson. \n\nWhether or not this was a satisfactory ending to a much-beloved series that ran for a decade is up for much debate, which I won't go into here. Instead I'm posting it for you to decide and make up your own mind. It's become a little on the rare side in recent years--not impossible to find, but certainly not rerun or publicized as much as other Little House episodes or TV movies. Enjoy.","torrent":{"xt":"urn:btih:2adf6de4174a6d0a4f90b41ed5fe63dc32cc3d6e","amp;dn":"Little+House%3A+The+Last+Farewell+%281984+Series+Finale%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2adf6de4174a6d0a4f90b41ed5fe63dc32cc3d6e","infoHashBuffer":{"type":"Buffer","data":[42,223,109,228,23,74,109,10,79,144,180,30,213,254,99,220,50,204,61,110]},"announce":[],"urlList":[]}}