{"title":"Revising Fiction: A Handbook for Writers by David Madden.pdf","uid":9886833,"size":5861520,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2ae9a95029eed844cfd2920f6c018cfe096f71c3&amp;dn=Revising+Fiction%3A+A+Handbook+for+Writers+by+David+Madden.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1396593505,"description":"185 practical techniques for improving your story or novel\n\nCustomer Reviews\n\n27 of 27 people found the following review helpful\nRevising is complicated\nRevising is complicated enough; however, if one is unable to identify the problem, revising becomes impossible. Many writing problems have to do with structural errors. Madden's book elegantly and clearly defines a myriad of structural elements that might be at the root of such errors and poses each element as a question, such as: &quot;Does the protagonist fail to affect the other characters?&quot; or, &quot;Have you in some way diffused the impact of the climax?&quot; or, &quot;Do passages that reflect your own biases or judgments intrude?&quot; Each question is followed by a detailed answer that includes examples from the writing of Faulkner, James Dickey, Ray Carver, Fitzgerald, V. Woolf, James Joyce, to name but a few. Madden sometimes gives, by way of example, an earlier version of a famous writer's text and compares it to the writer's revised version. For example, Madden discusses the &quot;device of implication&quot; in &quot;...the five versions of the opening of Mrs. Dalloway.&quot; I found this book to be invaluable, not only for its practical advice, but for its inherent encouragment. There is nothing like being able to see that one's favorite writers struggled constantly with issues of revision, sometimes even after the publication of a book, such as Fitzgerald's post-publication restructuring of Tender is the Night.","torrent":{"xt":"urn:btih:2ae9a95029eed844cfd2920f6c018cfe096f71c3","amp;dn":"Revising+Fiction%3A+A+Handbook+for+Writers+by+David+Madden.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ae9a95029eed844cfd2920f6c018cfe096f71c3","infoHashBuffer":{"type":"Buffer","data":[42,233,169,80,41,238,216,68,207,210,146,15,108,1,140,254,9,111,113,195]},"announce":[],"urlList":[]}}