{"title":"The Bravery - The Sun And The Moon Complete (2CD) FLAC","uid":4775074,"size":588249954,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2b510d562acf8e1be32b8f9ba6e126a0069f012c&amp;dn=The+Bravery+-+The+Sun+And+The+Moon+Complete+%282CD%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sradams777","files":26,"time":1237183039,"description":"Like many of-the-moment bands, the Bravery know that yesterday's trends are today's trash. And, like the band's former sparring partners and fellow new wave revivalists the Killers, the Bravery move away from the style that made them famous (or, at the very least, incorporate new sounds into their music) on their second album. Unlike the Killers, who cross-pollinated their love for Bruce Springsteen, U2, and the mythic American West into the rambling but intriguing Sam's Town, on The Sun and the Moon the Bravery try different ideas on for size, but don't commit enough to make them completely convincing. The band spends a significant chunk of the album trying to be as serious and earnest as they were stylish and giddy on The Bravery. On &quot;Time Won't Let Me Go,&quot; they adopt a more mainstream rock sound, ditch the synths, and even name-drop Bryan Adams' &quot;Summer of '69&quot; in the lyrics; &quot;The Ocean&quot; delivers strings, acoustic guitars, and all the other trappings of a formerly fun band getting too serious for their own good. Worst of all is &quot;Tragedy Bound,&quot; a song about loving a damaged woman that has questionable lyrics like &quot;I'm starting to suspect she likes the abuse.&quot; Elsewhere on The Sun and the Moon, the band delivers competent pop songs that fall just short of being truly memorable; &quot;Bad Sun,&quot; which could pass for a Dandy Warhols B-side, is the best of the bunch. In between all of their attempted makeovers, the Bravery return to their bracing, '80s-inspired sound, albeit with sleeker, slicker production than on their debut. And while &quot;Every Word Is a Knife in My Ear&quot; is melodramatic and &quot;Split Me Wide Open&quot; is pure Cure pastiche, this is still the sound that the Bravery seem to feel the most, and do the best. \n\nThis is the import version with the original cd plus the 2nd cd remixed by the band.","torrent":{"xt":"urn:btih:2b510d562acf8e1be32b8f9ba6e126a0069f012c","amp;dn":"The+Bravery+-+The+Sun+And+The+Moon+Complete+%282CD%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b510d562acf8e1be32b8f9ba6e126a0069f012c","infoHashBuffer":{"type":"Buffer","data":[43,81,13,86,42,207,142,27,227,43,143,155,166,225,38,160,6,159,1,44]},"announce":[],"urlList":[]}}