{"title":"Dolly Parton - Little Sparrow [2001][EAC,log,cue. FLAC]","uid":8986250,"size":320618292,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2b75d5b148a867840c0dde208b90bc180b046b03&amp;dn=Dolly+Parton+-+Little+Sparrow+%5B2001%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":16,"time":1380673650,"description":"Artist: Dolly Parton\nRelease: Little Sparrow\nReleased:  2001\nLabel:   Sugar Hill\nCatalog#:  3927\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:  Americana,bluegrass\n\n1. Little Sparrow 4:13\n2. Shine 5:11\n3. I Don't Believe You've Met My Baby 3:02\n4. My Blue Tears 3:02\n5. Seven Bridges Road 3:29\n6. Bluer Pastures 4:10\n7. A Tender Lie 3:44\n8. I Get A Kick Out Of You 2:30\n9. Mountain Angel 6:51\n10. Marry Me 3:17\n11. Down From Dover 5:09\n12. The Beautiful Lie 2:34\n13. In The Sweet By And By 3:53\n14. Little Sparrow Reprise 1:36\n\n\nThough Dolly Parton had been exploring her musical roots to various degrees throughout the last half of the '90s, her true return to form didn't occur until the release of the Grammy-winning The Grass Is Blue, and its 2001 follow-up, Little Sparrow. Critics and fans alike agreed that the latter record was easily among the best Parton had ever recorded, and that was certainly saying something. One of the leading tracks on Little Sparrow was its love-wary title track, which kicked off an album that was filled with enough heartache-related songs to cover three separate country records. Parton's lyrics use the familiar folk metaphor of symbolizing a bird as freedom and rebirth, and she looks to it wishing to escape a world that has crumbled due to a insincere lover. She grippingly moans, &quot;Little sparrow, flies so high, feels no pain,&quot; while fantasizing, &quot;If I were a little sparrow, oe'r these mountains I would fly/I would find him, I would find him/look into his lying eye.&quot; Besides simple escape, Parton also wants justification for her sorrow, singing &quot;I would flutter all around him...I would ask him/why he let me love him then.&quot; By the end of the song, however, she realizes she is merely a victim of an &quot;evil cunning scheme,&quot; leaving no other lesson to pass on to her &quot;maidens fair and tender&quot; other than &quot;never trust the hearts of men, for they will crush you like a sparrow.&quot; By this time, Parton has realized that even the sparrow is a victim of man's evil, and it is only free until it meets up with a man, who will casually destroy it. It's an ingenious metaphor that, along with a slow, aching melody, and a flawless production and performance, helps round out what is truly one of the best songs Dolly Parton has written in years.\n","torrent":{"xt":"urn:btih:2b75d5b148a867840c0dde208b90bc180b046b03","amp;dn":"Dolly+Parton+-+Little+Sparrow+%5B2001%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b75d5b148a867840c0dde208b90bc180b046b03","infoHashBuffer":{"type":"Buffer","data":[43,117,213,177,72,168,103,132,12,13,222,32,139,144,188,24,11,4,107,3]},"announce":[],"urlList":[]}}