{"title":"Stephanie Black - Life and Debt (2001) (Globalization and the Ja","uid":3569311,"size":734220454,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ba5190611b8fbaffe69a2047296e59493687205&amp;dn=Stephanie+Black+-+Life+and+Debt+%282001%29+%28Globalization+and+the+Ja&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"grinreaper_CCE","files":2,"time":1165079740,"description":"Stephanie Black - Life And Debt\n\nGreat insight to the upheavals in Jamaica since 1970&amp;#039;s.\n\nBY ROGER EBERT / October 26, 2001\n\nMost Americans have been bewildered by the anti-globalization protesters at recent meetings of the International Monetary Fund and the World Bank. Isn&amp;#039;t free trade a good thing? Isn&amp;#039;t a global economy great for everyone? What could the protesters possibly be objecting to? &amp;#039;&amp;#039;Life and Debt,&amp;#039;&amp;#039; a documentary by Stephanie Black, with a commentary written by Jamaica Kincaid, looks at the effect of the International Monetary Fund on the economy of Jamaica. The result, she argues, has been the destruction of Jamaican industry and agriculture, the end of Jamaica as a self-sufficient economic entity, and its conversion into a market for North American goods and a source of underpaid labor.\n\nA harsh indictment, but the film is persuasive, showing how powdered milk from America, (purchased from subsidized American dairy farmers and dumped at a loss) has destroyed the Jamaican fresh milk industry, and how even the one remaining market for Jamaican bananas--England--is threatened by the Chiquita-Dole-Del Monte forces, who think one Jamaican banana not sold by them is too many. Latin American banana workers earn $1 a day; Jamaicans can&amp;#039;t live on that. Other markets reflect the same policies: Subsidized Idaho potatoes have bankrupted Jamaican potato farmers, McDonald&amp;#039;s refuses to buy local meat; sweet Jamaican onions are underpriced by American onions sold at a loss, and so on.\n\nOne scheme to help the Jamaican economy, the film says, has been the establishment of &amp;#039;&amp;#039;free zones,&amp;#039;&amp;#039; fenced-in manufacturing areas where workers are paid $30 a week to assemble goods which arrive and leave by container ship without legally being on Jamaican soil. Labor unions are banned, working conditions are subhuman, strikers are forced back to work at gunpoint, and paychecks are taxed for health and retirement schemes that don&amp;#039;t seem to exist. The Hanes clothing division of Chicago&amp;#039;s Sara Lee company was one of the beneficiaries, until, the movie says, it pulled out to find even cheaper workers elsewhere.\n\nThe IMF ideally lends money, which can be used to help local businesses, but as former Jamaican prime minister Michael Manley observes, it charges twice the world rate for interest and forbids the country from charging its own lenders less. An IMF-backed small business loan in Jamaica might carry 25 percent interest.\n\n&amp;#039;&amp;#039;You ask, whose interest is the IMF serving?&amp;#039;&amp;#039; Manley says. &quot;Ask--who set it up?&amp;#039;&amp;#039; IMF policies can be changed only by an 80 percent vote. The United States, Japan, Germany, England, Canada and Italy control more than 80 percent of the votes. The bottom line: Developing economies of the Third World are deliberately destroyed and turned into captive markets for the rich nations, while their once self-sufficient inhabitants become cheap labor and local competition is penalized.\n\nAre these charges true? I do not have the expertise to say. I only bring you the news that this documentary, which has played twice on PBS and is now at the Music Box, exists. If you&amp;#039;re curious about why the demonstrators are so angry, this is why they&amp;#039;re so angry.\n &lt;a href=&quot;\nhttp://www.us.imdb.com/title/tt0284262/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.us.imdb.com/title/tt0284262/&lt;/a&gt; \n\nThanks to GrandPedh @ demonoid for uploading. \n\nTech Specs:\n\nGeneral #0 \nFileSize/String : 700 MiB \nFormat/String : Audio Video Interleave \nOveralBitRate/String : 1137 Kbps \nPlayTime/String : 1h 26mn \nEncoded_Application : VirtualDubMod 1.5.4.1 (build 2178/release) \n\nVideo #0 \nCodec/String : XviD \nCodec/Info : XviD project \nBitRate/String : 1016 Kbps \nWidth : 560 \nHeight : 320 \nAspectRatio/String : 16/9 \nFrameRate/String : 23.976 fps \nBits/(Pixel*Frame) : 0.236 \n\nAudio #0 \nCodec/String : MPEG1/2 L3 \nCodec/Info : MPEG1 or 2 Audio Layer 3 \nBitRate/String : 108 Kbps \nChannel(s)/String : 2 channels \nSamplingRate/String : 48 KHz \n\n===============================================================================\nLearn the true nature of the world, come visit our huge dedicated e-library and forums @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:2ba5190611b8fbaffe69a2047296e59493687205","amp;dn":"Stephanie+Black+-+Life+and+Debt+%282001%29+%28Globalization+and+the+Ja","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ba5190611b8fbaffe69a2047296e59493687205","infoHashBuffer":{"type":"Buffer","data":[43,165,25,6,17,184,251,175,254,105,162,4,114,150,229,148,147,104,114,5]},"announce":[],"urlList":[]}}