{"title":"Handbook to Life in Ancient Greece","uid":11728521,"size":11716458,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2bbadb3c8aa72a0ab9055cde18c0dad5403a1eae&amp;dn=Handbook+to+Life+in+Ancient+Greece&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425186781,"description":"This handy reference provides comprehensive access to over three millennia of ancient Greek history and archaeology, from the beginning of the Minoan civilization to the fall of the Greek states to the Romans by 30 B.C. Clear, authoritative, and highly organized, the Handbook to Life in Ancient Greece provides an engaging look at a civilization that once stretched from what is now modern Greece, to Spain, India, and beyond; a civilization that has had an enormous and lasting influence on the development of myriad aspects of Western culture, from philosophy and medicine to democracy and town planning.The thematically arranged chapters cover an exhaustive range of topics: armies and weapons, rulers from Alexander the Great to Xerxes, the rise and fall of numerous city-states, notably Sparta and Athens, agriculture, architectural styles, craft industries, religious festivals, deities, travel and transport, mythological figures, even Greek concepts of the afterlife. The guide includes a wide-ranging bibliography for each chapter, as well as over 180 maps, photographs, and line drawings","torrent":{"xt":"urn:btih:2bbadb3c8aa72a0ab9055cde18c0dad5403a1eae","amp;dn":"Handbook+to+Life+in+Ancient+Greece","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bbadb3c8aa72a0ab9055cde18c0dad5403a1eae","infoHashBuffer":{"type":"Buffer","data":[43,186,219,60,138,167,42,10,185,5,92,222,24,192,218,213,64,58,30,174]},"announce":[],"urlList":[]}}