{"title":"Bullet For My Valentine - Temper Temper (2013) [FLAC]","uid":8144225,"size":453633943,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2bf29a29322d067452e842c9dee75de39f1b9f05&amp;dn=Bullet+For+My+Valentine+-+Temper+Temper+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1360870078,"description":"\n  Bullet For My Valentine - Temper Temper (2013) [FLAC]\n\n  Released: 2013\n  Duration: 57:11\n  Genre: Pop/Rock\n  Style: Melodic Metal\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kpbs\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n  Cover: Front\n\n  01 Breaking Point \n  02 Truth Hurts\n  03 Temper Temper \n  04 P.O.W. \n  05 Dirty Little Secret\n  06 Leech \n  07 Dead To The World\n  08 Riot \n  09 Saints &amp; Sinners \n  10 Tears Don't Fall (Part 2) \n  11 Livin' Life (On The Edge Of A Knife) \n  12 Not Invincible \n  13 Whole Lotta Rosie (Live at BBC Radio 1)\n  14 Scream Aim Fire (Live at BBC Radio 1)\n\n  On Temper Temper, the fourth studio album from Bullet for My Valentine, the Welsh thrashers return with a looser, more organic sound that feels more focused on intensity than technicality. Taking a cue from the less rigid writing process Matthew Tuck used while working on his side project AxeWound, the bandmembers wrote more in the moment, getting their ideas out without having time to overthink them. This more instinctual writing process really comes through on the album, providing Temper Temper with the immediacy that classic thrash albums had, a feeling particularly evident on straight-ahead rockers like &quot;Riot&quot; and &quot;Not Invincible,&quot; two songs that rumble right along at a satisfying, take-no-prisoners gallop. While the album also has its more plaintive moments, like the emotional &quot;Tears Don't Fall, Pt. 2,&quot; even that song erupts into a frenzy of harmonized soloing, showing that even when they're trying their hands at something approaching a ballad, Bullet for My Valentine have classic metal running through their veins. \n\n  Though Bullet for My Valentine still have just enough post-hardcore and screamo in their sound to keep metal purists from coming completely around to their way of thinking, Temper Temper feels like a gateway album into thrash, showing the influence that chugging riff-masters like Metallica, Megadeth, and Overkill have had on the current metal landscape, and will hopefully get some of their fans to look backwards to see the foundation those bands laid down back in the '80s.","torrent":{"xt":"urn:btih:2bf29a29322d067452e842c9dee75de39f1b9f05","amp;dn":"Bullet+For+My+Valentine+-+Temper+Temper+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2bf29a29322d067452e842c9dee75de39f1b9f05","infoHashBuffer":{"type":"Buffer","data":[43,242,154,41,50,45,6,116,82,232,66,201,222,231,93,227,159,27,159,5]},"announce":[],"urlList":[]}}