{"title":"A Cowboy In The Kitchen: Recipes From Reata And Texas West Of Th","uid":11542648,"size":9665933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c06b8949e880d3c5533d355db46e13e2b0e15df&amp;dn=A+Cowboy+In+The+Kitchen%3A+Recipes+From+Reata+And+Texas+West+Of+Th&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MentalZero","files":-1,"time":1416684700,"description":"Cookbook buyers and foodies the world over have come to count on Ten Speed to introduce exciting young chefs and up-and-coming cuisines. In the tradition of Mark Miller's COYOTE CAFE, ROY'S FEASTS FROM HAWAII, and CHARLIE TROTTER'S, we are proud to bring you a haute take on one of America's most traditional cuisines-that of the Texas ranch. But don't be thinking ribs, beans, and biscuits . . . . unless, of course, you're thinkin' South Texas Venison Ribs with Peanut Dipping Sauce, Black Bean Nachos with Chargrilled Chicken, and West Texas Biscuit Pudding with Southern Comfort en Glace. You see, at the Reata Restaurant in West Texas, hot new chef Grady Spears is cooking cowboy cuisine with an emphasis on the cuisine. Filled with fresh, strong flavors, fascinating ranch memorabilia (these Texans take their history seriously!), gorgeous full-color food photography, and truly marvelous, utterly real food, this is American cooking at its kick-off-your-boots-and-get-down-to-business greatest","torrent":{"xt":"urn:btih:2c06b8949e880d3c5533d355db46e13e2b0e15df","amp;dn":"A+Cowboy+In+The+Kitchen%3A+Recipes+From+Reata+And+Texas+West+Of+Th","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c06b8949e880d3c5533d355db46e13e2b0e15df","infoHashBuffer":{"type":"Buffer","data":[44,6,184,148,158,136,13,60,85,51,211,85,219,70,225,62,43,14,21,223]},"announce":[],"urlList":[]}}