{"title":"HandsOnHardcore - Evelina Darling (Ham and Eggs For Breakfast, T","uid":12645999,"size":655639656,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:2c74f1da62ccb5266d5c50a83f0c0435eb73f150&amp;dn=HandsOnHardcore+-+Evelina+Darling+%28Ham+and+Eggs+For+Breakfast%2C+T&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"EndYou","files":1,"time":1446059384,"description":"~~~~~~~~~~~~~\r\n~Screenshots~\r\n~~~~~~~~~~~~~ \nhttp://imgpremium.com/image/Zg8 \nhttp://imgpremium.com/image/ZgE \r\n\r\n~~~~~~~~~~~~~\r\n~Description~\r\n~~~~~~~~~~~~~\r\nThe name of the actress: Evelina Darling\r\nName movie: Ham &amp; Eggs For Breakfast: Two Studs Bang New Face In The Ass\r\nNPP site and the site: HandsOnHardcore.com / DDFNetwork.com\r\n\r\nYear: 2015\r\nGenre: Anal creampie, Anal, Deep throat, Handjob, Hardcore, MMF, Multidick sucking, Blowjob\r\nDuration: 00:18:37\r\n\r\nDDF Network proudly presents our new face from Russia. Her name says it all: Evelina Darling. She's just everybody's darling and loves to party. This morning, she wakes up with two studs next to her in the bed. Ricky Mancini and Chad somehow made it into her bedroom and naughty Evelina can not wait to get her breakfast ham &amp; eggs right into her gorgeous face. The two lads are still asleep when she wakes up and starts rubbing their cocks under the blanket. Those two morning glories make her horny instantly and she takes off their pants, eager to cram her face with boner number one for a serious deep throat blowjob.\r\n\r\nChad enjoys her juicy shaved pussy while she blows Ricky's dick and when she shifts over to Chad's rod, Ricky enjoys her tight butt cheeks and makes her tight pink pussy gape for our DSLR cameras. We deliver Full HD pictures when Ricky inserts his hard prick deep into her fuckhole and bangs her doggy style while she swallows Chad's ham and plays with his balls. Then she rides him like a cowgirl when the threesome heats up and the two studs start ass fucking that young brunette babe with green eyes.\r\n\r\nHer seductive college girl looks make the two guys wanna bang her all day long and after fucking her twat spoon style, with her hot black nylon stockings still on her toned thighs, they give us a nice insight of her gaping asshole. Finally, Ricky penetrates her butthole and shoots his load all over that ass. Then it's Chad's turn and he gives her his cum on her asshole as well! Her hard nipples and natural small tits is the last thing you'll see before today's Hands on Hardcore scene comes to an end.\r\n\r\nVideo Quality: SiteRip\r\nVideo Format: MP4\r\nVideo: MPEG4 Video (H264) 950x540 29.97fps 4500kbps\r\nAudio: AAC 48000Hz stereo 189kbps","torrent":{"xt":"urn:btih:2c74f1da62ccb5266d5c50a83f0c0435eb73f150","amp;dn":"HandsOnHardcore+-+Evelina+Darling+%28Ham+and+Eggs+For+Breakfast%2C+T","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c74f1da62ccb5266d5c50a83f0c0435eb73f150","infoHashBuffer":{"type":"Buffer","data":[44,116,241,218,98,204,181,38,109,92,80,168,63,12,4,53,235,115,241,80]},"announce":[],"urlList":[]}}