{"title":"Nostradamus books and other stuff","uid":4909673,"size":12430074,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2c7feb96eca4486a56e2106ae5795856029ee655&amp;dn=Nostradamus+books+and+other+stuff&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"milarepa12","files":6,"time":1243088983,"description":"Conversations with Nostradamus\nby Dolores Cannon\nAmerica West Publishing, 1989\nReviewed by Laura Bryannan\n\nReaders interested in the prophesies of Nostradamus might like to check out the book Conversations with Nostradamus by Dolores Cannon. For those not familiar with Nostradamus, he lived in the 1500's, and was known as a great healer of people stricken with the Black Plague raging throughout Europe in those days. However he is famous in our time for writing a series of almost a thousand prophesies, each written in a group of four sentences, called &quot;quatrains.&quot; Some of the quatrains are easy to decipher; for example, he refers to the second &quot;anti-Christ&quot; as Hilter. However most of them are worded very obscurely, and people have puzzled over them for centuries, trying to understand what he was alluding to.\n\nMs. Cannon's work comes from a unique and very useful perspective. During a routine past-life regression, her client remembered being the student of a great teacher. The client noted, &quot;He's teaching me the study of life. How to heal the body. How to heal the mind. How to see the future. He knows more than any man on earth...he is a good doctor. But he's also a doctor of all things. Some of the things he believes in, he keeps secret.&quot;\n\nTo make a long story short, at one point during a subsequent regression Nostradamus makes his presence known to the client and says that he wants to work through them to explain the quatrains that pertain to this day and age. The client explained, &quot;If the knowledge from the quatrains can be translated, it would be beneficial for the people of your time.&quot; Nostradamus also noted that some of the things he saw were not carved in stone, and that the time lines might possibly be turned to more positive outcomes if enough people heeded his warnings.\n\nThe first third of the book is mostly set-up and background information about how the arrangement for these communications became finalized. I'll skip over that information, leaving it to interested readers, and report on some of the juicier things Nostradamus had to say about what's to come; in some cases, first giving the quatrain number and then his explanation.\n\nI'd also like to note that I'm not going to try to defend Nostradamus' predictions, or the manner in which his explanations were obtained for this book. I present them for informational (and perhaps entertainment) purposes only, and hope that most readers will find them intriguing enough to explore further. To begin, then, he gives many &quot;signposts&quot; that show the onset of the world changes to come:\n\nCENTURY IV-67. &quot;He says it's in the not too distant future...there will be a comet. This will be a very bright, easily seen comet. But it will be perhaps previously unknown. This coincides with the time of great geological troubles...Nations that are considered prosperous and powerful, particularly western nations, will be revealed as being not as prosperous as everyone had thought. And they will be torn with civil strife and rioting as people try to move out of the areas of drought toward areas that still have some water and where they can grow food.&quot;\n\nCENTURY III-12. &quot;He says that this refers to the earth changes that will be taking place, that the Anti-Christ will be taking advantage of in the process of his world conquest. In central Europe, southern Europe and in the Near East, particularly around the eastern end of the Mediterranean, there'll be several severe floods...the Anti-Christ will move his troops in under the disguise of helping the people restore order in the wake of these disasters.&quot;\n\nNostradamus refers in his quatrains to three Anti-Christs: Napoleon and Hitler were the first two. For many quatrain analyzers, trying to determine when the third Anti-Christ will turn up (and who he might be) has been a major goal. Here are some bits and pieces, from the explanations of several different quatrains, of what Ms. Cannon's client reported Nostradamus saying about this third Anti-Christ:\n\n&quot;He knows [he] is in the Middle East somewhere...He says this Anti-Christ at the present time is a young man at a very crucial time in his life...He will be a threat to all, but particularly to the east because he will be successful in conquering both China and Russia, and will have the entire Asian continent under his control...Russia will be his first major Asian conquest and he will not do it through force but through guile...He will take advantage of the world situation to make his move to power. And he will succeed...[He], surprisingly enough, will refuse to use nuclear weapons and do this through conventional warfare. He saves the nuclear weapons for other unspeakable deeds...He will have connections with Libya and Syria...At the present time [1986] he is in Egypt.&quot;\n\nConsidering the world situation in 1986 (when this book was written) it was not surprising that Ms. Cannon asked her client to ask Nostradamus if either Kadaffi or the Ayatollah Khomeni was this third Anti-Christ. Nostradamus replied that Kadaffi is helping set the stage in that part of the world for the Anti-Christ to rise to power, but that &quot;...as the years progress he will become increasingly more crazy so that when the major conflict is reached he will no longer be capable of handling anything or functioning.&quot; He said that the Ayatollah was too old, and that the Anti-Christ would not arise until later: &quot;One [of these men] will be dead and the other will have passed from power.&quot;\n\nThis next quatrain seems to be a very strong signpost, one that is particularly eerie considering the situation in Iraq as I write this column [early September, 1990]. From CENTURY II-4: &quot;He says that the first event, the atomic weapon being dropped by one of the Middle Eastern countries, will spark off yet another war...Other countries, particularly European and Western nations, will feel they need to interfere to try to stop the war because of fuel. So when the European countries try to interfere, the same crazed leader that dropped an atomic weapon before, will use up the rest of his arsenal on Europe...This leader is not the Anti-Christ. What purpose this leader serves, since this leader is crazed...is that he weakens the major nations so that the third Anti-Christ will be able to rise to power with little or no opposition.&quot; Could he be describing Saddam Hussain?\n\nHere is another signpost: CENTURY II-98 gives an astrological forecast. Cannon had a local astrologer provide the dates, and they asked Nostradamus, &quot;Jupiter is in Leo from August of 1990 to September 1991. Is this the period when the Anti-Christ will be taking power?&quot; The client answered, &quot;He says this is when he is beginning the realization of his ambition. This is when he is able to start his political career, so to speak.&quot;\n\nAnother striking revelation in Cannon's book is Nostradamus' report that many of his quatrains pertain to the fall of the Catholic Church. He predicts that there will be only two more popes after John Paul II. From CENTURY VIII-46: &quot;He says that the present pope will be on one of his many journeys when he dies...He says the present pope will be assassinated.&quot;\n\nNostradamus said that the two popes following John Paul will not be around very long. From CENTURY I-4: &quot;He says...it refers to the pope that will come between the present pope and the last pope. This one will have a short reign. He says that some of the political blunders and mistakes made by this pope is what makes it easier for the last pope to be a tool of the Anti-Christ.&quot;\n\nThe comet, referred to earlier from CENTURY IV-67, will be a sign leading up the assassination of the pope succeeding John Paul II. Nostradamus noted that John Paul will be killed because his concern for the human condition, and his many travels, will put him in too many vulnerable situations. The pope following him, however, will be assassinated by the Anti-Christ's forces in order that a pope under their control can be set in his place. It is this last pope that will bring about the downfall of the Catholic Church. Here's what Nostradamus was reported saying about him:\n\nCENTURY IV-86: &quot;This man will have a physical deformity of some sort...either of the shoulder or of the foot...he was born that way...His parents were involved with the Nazi movement in France.&quot; From CENTURY II-76: &quot;The lame priest refers to the French pope who is of service to the Anti-Christ...He voluntarily contributes the inner resources of the information that he, as pope, has access to. Information that the Anti-Christ could not have gotten in a million years just through his spies, had the pope remained true to the other side.&quot;\n\nNostradamus reports that the Anti-Christ will focus much attention on undermining the authority of the Catholic Church. One thing he will do, with the help of the last pope, is ransack the Vatican Library. From CENTURY V-43: &quot;He will do this by revealing all the controversial things he finds that are hidden away in the Vatican Library. Things the church has declared people should not read for it would be threatening to their faith. He will be sure that these things are distributed about.&quot; He also notes, however, from CENTURY I-62: &quot;It will bring to light information and facts and knowledge that have been suppressed for several centuries...In a way the Anti-Christ will be doing a good thing by ransacking the Vatican Library. Because later on that knowledge...will be open to the whole world and available for everyone to use.&quot;\n\nNostradamus described devastating warfare in Europe and Asia as the Anti-Christ gains dominion over these areas. He warns that many new and terrible weapons, already under development, will be used in this war. He describes a machine that is able to create earthquakes; probably none other than the inferometer, a weapon that many right-wing groups believe the Soviet Union has already perfected (and used). He said that the use of this machine will be the cause of some of the widespread physical changes that will occur on the planet, and that it will eventually fall into the hands of the Anti-Christ when he conquers the country that developed it.\n\nHe describes new kinds of nuclear weapons, unlike the ones stockpiled today, that cause plagues in many areas. Biological warfare seems to figure in many of Nostradamus' explanations. From CENTURY II-6: &quot;The scourges that hit these two cities [New York and London] will be as a result of some secret research into bacteriological warfare...He says as a result of this plague the service systems within these great metropolises will break down...the people within the cities will be starving to death due to lack of food...because no one will deliver it and risk being exposed to the plague.&quot;\n\nMore bits and pieces: a mistake in weapons research that ruptures some protective earth fields so that the earth actually attracts meteors and other space debris; experiments in eugenics that he says have been ongoing since the 1930's; weapons that alter the weather patterns on the planet that also cause major outbreaks of birth defects; visitations by the &quot;Watchers,&quot; extraterrestrials who keep an eye on humankind's development.\n\nOne of the most interesting aspects of this book is Nostradamus' political commentary. For example, when explaining CENTURY II- 60, he notes that Republican presidents put our country into depressions and Democratic presidents pull us out by getting us involved in wars. He said it will be a Democratic president who gets the U.S. involved in the war against the Anti-Christ in order to stimulate the economy.\n\nNostradamus also described the world economic power structure. From CENTURY II-58: &quot;He says there is a group of...puppet-masters behind the scenes pulling the strings of the figures on stage...The figures on stage are the political figures in the major world capitals...These puppet-masters...are organized together in a single organization, and they're working for their own ends...They hold positions that appear to be relatively minor, like advisors...and such, but are key positions for their power...He says a hint to their existence is to trace the family histories of the banking powers and the money powers in the world.&quot;\n\nFrom CENTURY II-88, he further describes this group. Beyond their banking backgrounds he adds that they are &quot;Other commodity-related families, such as families into gold mines and diamond mines, leather, tins and such as this. The basic colonial barons associated with the European world empires who started their families' fortunes by exploiting the raw materials of the Third World nations...They manipulate the economy to cause the unemployment rate to rise or fall at their whim...inflation to rise of fall at their whim.&quot;\n\nNow, just as you've gotten thoroughly disgusted with these folks and their power-trips, there's good news. One good thing the Anti-Christ does is wipe these guys out! From CENTURY II-58: &quot;At first when the Anti-Christ comes along, they feel he's just a new, dynamic youthful leader from the Middle East they can use to help unite that part of the world and get it under their power. But the Anti-Christ ends up turning the tables on them.&quot; From CENTURY II-18: &quot;Somehow through the espionage powers of the Anti-Christ they will be discovered and destroyed...But, it's a little bit shortsighted of him, because it's this cabal that has been instigating the warfare that has been going on through the decades and centuries. His destroying them will in effect write the beginning of the end for him because it's the activities of this cabal that have supported what he's trying to do.&quot; Nostradamus said that once these manipulators are out of the way, the world's natural inclination toward peace will be able to reassert itself, setting the stage for the downfall of the Anti-Christ!\n\nIn describing the downfall of the Anti-Christ, Nostradamus says that there will be many forces acting against him. Eventually Russia will be able to break away from his dominion, and will join forces with the United States and Canada. These countries are the &quot;three brothers&quot; described in CENTURY VIII-17. CENTURY V-80 mentions someone called &quot;Ogmios.&quot; Nostradamus explained that he will be a great leader of the underground movement in central Europe who will conquer many of the Anti-Christ's finest commanders. Furthermore, the underground organization that this man heads will serve as a basis for future governments after the Anti-Christ is destroyed.\n\nHeard enough doom and gloom? Okay. After the long years of devastation by natural and man-made earth changes, and the wars instigated by the activities of the Anti-Christ are over, Nostradamus saw a period of human renaissance unparalleled in our history. From CENTURY IV-29: &quot;People will be brought back to the source. They will realize from whence they sprang and where they are going. This is when the time of healing will take place. People will become more mature spiritually and be able to heal themselves and heal the world, going much further in preparing to join the community of the Watchers.&quot; He discusses a movement &quot;back to the earth,&quot; when people will be tearing down cities to have more land to farm; not because there is a desperate need for food, but because of the profound shift in values after the troubled times.\n\nNostradamus describes the coming of a great scientific genius that will help rebuild human society. From CENTURY IV-31: &quot;This man...will be one of the highest, most developed geniuses ever to appear in our present history of man. He...made the decision to use his genius to help rather than to hurt mankind...One of the things he envisions...is self-contained, self-supporting space stations...It was very easy for him to spot this man along the nexus of time paths because he creates such a large ultimate effect...This man is one of the major forces who will help the earth recover from the scars of war.&quot;\n\nThis great genius will be influential in pointing out the mistaken premises that today's science has built itself on. His ability to perceive scientific truths will cause major breakthroughs in our technological capabilities. From CENTURY VII-14: &quot;[He will] make clear the connections between the physical universe and the metaphysical universe as dealt with by religions.&quot; Because of these great advances, Nostradamus describes a time when a majority of people will be aware of higher powers and energies: &quot;It will make every person a philosopher.&quot; What kind of time frame are we looking at here? Nostradamus reported that this great genius will show up in the mid-twenty-first century.\n\nMany people have avoided working with Nostradamus' predictions because they foretold so many awful events. During the course of their work together, Ms. Cannon noted this fact to Nostradamus through her client and was answered with, &quot;He glares with his eyes and says, 'They're supposed to be disturbing. I try to point out to them the very worst of what can happen so maybe they can avoid some of it.'&quot;\n\nI'll end with the following quote: &quot;He says that the ray of hope is there and his purpose for communicating with these quatrains is to try to at least alter, if not prevent, the worst aspects of these events from coming up. Whether the events are altered or not, even if the very worst that can happen happens, there will still be a great spiritual rebirth throughout the entire world...This will cause a great rebirth of philosophy and a great blending of the best aspects of eastern and western religions...This will bring about the best aspects of the Age of Aquarius.&quot;","torrent":{"xt":"urn:btih:2c7feb96eca4486a56e2106ae5795856029ee655","amp;dn":"Nostradamus+books+and+other+stuff","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2c7feb96eca4486a56e2106ae5795856029ee655","infoHashBuffer":{"type":"Buffer","data":[44,127,235,150,236,164,72,106,86,226,16,106,229,121,88,86,2,158,230,85]},"announce":[],"urlList":[]}}