{"title":"Simon &amp; Garfunkel - Bridge Over Troubled Water (Remastered) [ReP","uid":4460143,"size":466553536,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2caebab3aed44905bc6c09be18ce24347cd9ea05&amp;dn=Simon+%26+Garfunkel+-+Bridge+Over+Troubled+Water+%28Remastered%29+%5BReP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"repopo","files":-1,"time":1224658889,"description":"*******************************************************************************\n          Simon &amp; Garfunkel - Bridge Over Troubled Water (Remastered)\n*******************************************************************************\n\nSimon &amp; Garfunkel - Bridge Over Troubled Water (Remastered)\n\n01.- Bridge Over Troubled Water  [04:55]\n02.- El Condor Pasa (If I Could)  [03:09]\n03.- Cecilia  [02:54]\n04.- Keep The Customer Satisfied  [02:37]\n05.- So Long, Frank Lloyd Wright  [03:45]\n06.- The Boxer  [05:12]\n07.- Baby Driver  [03:17]\n08.- The Only Living Boy In New York  [04:01]\n09.- Why Don't You Write Me  [02:46]\n10.- Bye Bye Love  [02:52]\n11.- Song For The Asking  [01:59]\n12.- Feuilles-O  [01:45]  **\n13.- Bridge Over Troubled Water (Demo) [04:46]  **\n\n\n\n** = BONUS TRACKS, exclusive to this release\n\n\nOriginally Released in 1970.  This remastered version, which includes two bonus tracks was released on August 21st, 2001.\n\nRipped with EAC, creating a .cue/.wav audio file, preserving the CD structure, gaps and volume levels as in the original CD.\n\n-------------------------------------------------------------------------------\n\nAlbum Review by Bruce Eder\n\nBridge Over Troubled Water was one of the biggest-selling albums of its decade, and it hasn't fallen too far down on the list in years since. Apart from the gospel-flavored title track, which took some evolution to get to what it finally became, however, much of Bridge Over Troubled Water also constitutes a stepping back from the music that Simon &amp; Garfunkel had made on Bookends -- this was mostly because the creative partnership that had formed the body and the motivation for the duo's four prior albums literally consumed itself in the making of Bridge Over Troubled Water. The overall effect was perhaps the most delicately textured album to close out the 1960s from any major rock act. Bridge Over Troubled Water, at its most ambitious and bold, on its title track, was a quietly reassuring album; at other times, it was personal yet soothing; and at other times, it was just plain fun. The public in 1970 -- a very unsettled time politically, socially, and culturally -- embraced it; and whatever mood they captured, the songs matched the standard of craftsmanship that had been established on the duo's two prior albums. Between the record's overall quality and its four hits, the album held the number one position for two and a half months and spent years on the charts, racking up sales in excess of five million copies. The irony was that for all of the record's and the music's appeal, the duo's partnership ended in the course of creating and completing the album.\n\n-------------------------------------------------------------------------------\n                 Wikipedia/AllMusicGuide Track-by-track Review\n-------------------------------------------------------------------------------\n\nBRIDGE OVER TROUBLED WATER\n\n&quot;Bridge Over Troubled Water&quot; is the most celebrated song of celebrated songwriter Paul Simon's career and the most successful song associated with the very successful 1960s duo Simon &amp; Garfunkel. Simon, who wrote nearly all the team's material, came up with it in the late '60s while composing songs for their fifth album. At the time, the combined success of their fourth album, Bookends, and the soundtrack to The Graduate (which featured their music) in 1968 had vastly expanded their commercial clout and given them time to prepare a worthy follow-up, which was good, since Simon was not a fast writer. Garfunkel, meanwhile, had turned to acting and been cast in Catch-22, directed by Mike Nichols, who had directed The Graduate. The film had a lengthy shoot in Mexico that kept Garfunkel from participating as fully as usual in the record. Simon, having written some up-tempo songs, decided to write a ballad.\n\nHe was particularly inspired by the work of the Reverend Claude Jeter and the Swan Silvertones, a gospel group, especially the song &quot;Oh, Mary Don't You Weep for Me,&quot; on which Jeter improvised the line, &quot;I'll be your bridge over deep water if you trust in my name.&quot; Writing on the guitar in the key of G, Simon came up with a stately melody and two verses in which a narrator (who could be God, a parent, a lover, or a friend) pledges to help someone in adversity, to be &quot;like a bridge over troubled water.&quot; Later deciding the song was too short, he added a third verse in a slightly different style, beginning with the line, &quot;Sail on, silver girl, sail on by.&quot; Commentators have since suggested that this was a reference to the Swan Silvertones or to Simon's prematurely gray fiancÃƒÆ’Ã‚Â©e, and one extreme interpretation held that it was a reference to heroin and that, in fact, the whole song was about drugs, a particularly fanciful case of late-'60s/early-'70s drug paranoia. Simon tried singing the song in falsetto, but decided it was better suited to Garfunkel's angelic tenor. Garfunkel, upon hearing the song, disagreed, and also disputed Simon's contention that it was the best song he'd ever written, another in the series of disputes that eventually broke up their partnership. But Garfunkel eventually agreed to sing &quot;Bridge Over Troubled Water,&quot; which was then transposed into E flat for him. The recording prominently featured the piano playing of Los Angeles session musician (and later member of Bread) Larry Knechtel, though it built to a tremendous, string-filled climax. Simon &amp; Garfunkel began performing the song at their concerts in 1969, and used it as the underlying music to a collage of newsreel footage of late-'60s political events in their network television special Songs of America, broadcast on November 30, 1969. Though they thought enough of the song to title their new album Bridge Over Troubled Water, it was CBS Records president Clive Davis who insisted it be released as the LP's leadoff single; the duo didn't think using a ballad as a first single was a good idea. &quot;Bridge Over Troubled Water&quot; was released as a single in January 1970, just in advance of the Bridge Over Troubled Water album. It was an instantaneous success, topping the charts by the end of February, going gold, and becoming the top pop single of the year; the album enjoyed identical success on the LP charts.\n\nThe song's lovely melody and generalized message of support, coming at the end of the turbulent 1960s, struck a chord with listeners. Indeed, it was one of a number of songs released in 1969-1971 that offered such comfort in the face of difficulties, including Peter, Paul and Mary's &quot;Day Is Done,&quot; the Beatles' &quot;Let It Be,&quot; and James Taylor's &quot;You've Got a Friend&quot; (the last written and also recorded by Carole King). But &quot;Bridge Over Troubled Water&quot; was the most popular of them. Also, at a time when record companies were encouraging middle-of-the-road artists to contemporize their repertoires, it was a perfect choice for covers, since, though current, it really wasn't a rock &amp; roll song at all. At the same time, its gospel feel made it a natural for R&amp;B performers, while its religious implications were not lost on country singers. Before 1970 was over, &quot;Bridge Over Troubled Water&quot; had appeared on 24 chart LPs, including ones by Johnny Mathis, Ray Conniff, B.J. Thomas, Peggy Lee, Andy Williams, Jerry Vale, Ed Ames, King Curtis, Quincy Jones, Jim Nabors, Paul Mauriat, the Jackson 5, Glen Campbell, Boots Randolph, the Ventures, Smokey Robinson &amp; the Miracles, the Supremes, Nancy Wilson, Ferrante &amp; Teicher, and Elvis Presley. In January 1971, Buck Owens released a cover of &quot;Bridge Over Troubled Water&quot; as a single that reached the Top Ten of the country charts. In February, the composition won the 1970 Grammy Awards for Song of the Year and Best Contemporary Song in a sweep that also saw Simon &amp; Garfunkel win grammys for Album of the Year (the Bridge Over Troubled Water LP), Record of the Year (the &quot;Bridge Over Troubled Water&quot; single), and, along with Jimmie Haskell, Ernie Freeman, and Knechtel, Best Arrangement Accompanying Vocalist(s) ( &quot;Bridge Over Troubled Water&quot;). In March 1971, Aretha Franklin released a cover single of &quot;Bridge Over Troubled Water&quot; that topped the R&amp;B charts, just missed topping the pop charts, and went gold. Her version was featured in May on her Aretha Live at the Fillmore West album, one of 12 chart albums released in 1971 that featured covers of the song, including discs by Shirley Bassey, Ray Price, Perry Como, Tom Jones, the Boston Pops Orchestra, Roberta Flack, and Gladys Knight &amp; the Pips. The flurry of covers eased somewhat after the first couple of years, but, over time, &quot;Bridge Over Troubled Water&quot; was recorded by hundreds of artists, including Chet Atkins and Jerry Reed, Betty Buckley, Richard Clayderman, Floyd Cramer, Linda Eder, Waylon Jennings, the Lettermen, Bill Medley, the Mormon Tabernacle Choir, Nana Mouskouri, Anne Murray, Willie Nelson, LeAnn Rimes, the Shadows, Jimmy Smith, Bonnie Tyler, Billy Vaughn, and Bobby Womack. In 1979, Linda Clifford scored a modest pop and R&amp;B hit with her cover of the song, and the Dramatics got into the R&amp;B charts with their version a decade after that. Naturally, Paul Simon, who wrote it, and Art Garfunkel, who sang it, have retained &quot;Bridge Over Troubled Water&quot; in their repertoires regularly since 1970. It appeared on their compilations Simon &amp; Garfunkel's Greatest Hits (1972) and The Best of Simon and Garfunkel (1999), on their box set Old Friends (1997), and on their reunion album The Concert in Central Park (1982). Simon has performed it in concert, and his live versions appear on Paul Simon in Concert/Live Rhymin' (1974) and Paul Simon's Concert in the Park (1991); it is also on his box set, 1964/1993 (1993). Garfunkel put a version on his live album Across America in 1997. \n\nTHE BOXER\n\nPaul Simon's &quot;The Boxer&quot; is a long, thoughtful ballad that reflects on the struggles that one encounters in life. It is set in the form of an autobiography of a man who leaves home early. Arriving in New York City, he seeks work, but can't find any and is comforted only by prostitutes. Near the end of the song, he declares that he is going home, but in the final verse the song shifts into the third person to describe a scarred boxer who says he is leaving, but does not. (There is actually one more verse usually left off recorded versions of the song, but frequently sung by Simon in concert, in which the character talks about the passage of time, concluding that, &quot;after changes, we are more or less the same.&quot;) The song thus represents the tension between a determination to succeed and the experience of apparently insurmountable barriers. But the tension is expressed calmly, breaking into passion only at the wordless chorus.\n\nSince its appearance in 1969, &quot;The Boxer&quot; has attracted several interpretations, including one from Bob Dylan scholars that holds the song is about Dylan, a competitor of Simon's, and is a criticism of him. By this reading, the &quot;poor boy&quot; who arrives in New York is Dylan, of course, and the famous &quot;whores on Seventh Avenue&quot; line -- prostitution not actually being a noticeable feature of that generally upscale midtown-Manhattan business street -- refers to the offices of Columbia Records, for which both Simon and Dylan recorded, located during the 1960s on Seventh Avenue. It is more likely, however, that, as Simon acknowledged in an interview, &quot;The Boxer&quot; is an extrapolation of himself, commenting on his own pugnacious persistence in the music business.\n\n&quot;The Boxer&quot; was originally recorded by Simon &amp; Garfunkel. At a time when major recording artists were expected to release two albums and three or four singles a year, the duo operated at a surprisingly slow pace, and &quot;The Boxer&quot; was released as a one-off single in March 1969, nearly a year after their previous recording, the half-a-dozen new songs on Bookends. With a running time over five minutes (which may explain why that extra verse was left off), the recording had an elaborate, yet delicate arrangement, paced by fingerpicked acoustic guitar and discreet clip-clop percussion in the verses, but utilizing an unusual combination of added instruments, including a bass harmonica, a high trumpet, and a pedal steel guitar, plus strings and thunderous percussion on the stirring &quot;lie-la-lie&quot; chorus. It peaked in the Top Five of the singles charts in May.\n\n&quot;The Boxer&quot; was included on the next Simon &amp; Garfunkel album, Bridge Over Troubled Water, released in January 1970. It was quickly covered by Bob Dylan, who either didn't interpret it as being about him or didn't mind. Dylan's version appeared on his Self Portrait album, released in June. Before the year was out, another cover had been released on Paul Butterfield's album The Butterfield Blues Band/Live. The next notable cover came in 1980, when Emmylou Harris recorded &quot;The Boxer&quot; for her Roses in the Snow album and released it as a single that made the country Top 20.\n\nBut the song remains most closely associated with Paul Simon, and with Simon &amp; Garfunkel. It has been included on Simon &amp; Garfunkel's Greatest Hits (1972), The Concert in Central Park (1982), the box set Old Friends (1997), and The Best of Simon &amp; Garfunkel (1999), while Simon has included it on Paul Simon in Concert/Live Rhymin' (1974), Paul Simon's Concert in the Park (1991), and the box set 1964/1993. \n\nTHE ONLY LIVING BOY IN NEW YORK\n\nWhile there's definitely some Beatles influence in the production of Simon &amp; Garfunkel's atmospheric &quot;The Only Living Boy in New York&quot; (listen to those Ringo-like drum fills), the song is really a unique piece in and of itself. The production manages to encompass the duo's influences while encapsulating their unique and hugely successful and influential folk-pop blend. In fact, in the use of distant-sounding, thickly layered backing vocals, one can hear foreshadows of similar tricks used on records by Elton John, among countless others, in the '70s. Listen to &quot;The Only Living Boy in New York&quot; -- with its mix of strumming acoustic guitars, start-and-stop drums, and a far-off wall of harmonies -- and then John's &quot;Rocket Man&quot; and you realize it is a direct line from the former to the latter. Paul Simon was a restless and ambitious studio innovator, aspiring to the same level as the Beatles and Brian Wilson in terms of scope and desire for new textures and depth of sound. Simon basically produced or co-produced many of the Simon &amp; Garfunkel records, collaborating with engineer Roy Halee.\n\nOne can continue to trace the influence onto such navel-gazing melancholy as Belle and Sebastian's lovely meditations, a group also given to introspection and who also understand the emotional resonance of a young adult referring to himself as a &quot;boy.&quot; Like the latter's best songs, the narrator of &quot;The Only Living Boy in New York&quot; uses irony while bemoaning his lousy state of affairs and generally feeling sorry for himself; while he knows he's not the only one with issues, he still feels like &quot;the only living boy in New York&quot; after he is left alone by the song's addressee: &quot; Tom, get your plane right on time/I know you've been eager to fly now/Hey let your honesty shine, shine, shine/Da-n-da-da-n-da-da-n-da-da/Like it shines on me/The only living boy in New York.&quot;\n\nThere is a purposeful feyness to the lyric, the &quot;boy&quot; self-reference, and a man singing about what seems to be the end of a relationship with another man. When one remembers that Simon and Art Garfunkel had a minor hit as the Everly Brothers-modeled Tom and Jerry -- where Garfunkel was Tom -- the significance of the song becomes clearer; the chart-topping, Grammy-winner for album of the year, Bridge Over Troubled Water (1970), was the duo's last studio project together. &quot;The Only Living Boy in New York&quot; was about the dissolution of the musical partnership, and likely, the friendship as they knew it. Anyone who has been in a band with the same partners for any length of time will liken the relationship to a marriage. A more accurate description, perhaps, would be close siblings, but either way, the end of such deep bonds could be as devastating as the end of any other relationship, marriage notwithstanding. Simon, singing the lead vocal, sounds resigned, defeated, just barely breathing out the wispy melody. One can only imagine the drama of the two men -- friends since high school -- singing it together in the studio.\n\nIn an interview with Song Talk magazine, Simon commented, &quot;I like that record, and I like the song, too. That was written about Artie's going off to make Catch 22 in Mexico,&quot; referenced in the song's first verse: &quot; Tom, get your plane right on time/I know your part'll go fine/Fly down to Mexico.&quot;\n\nIn the same interview, Simon goes on to comment on the arrangement: &quot;I liked the 'aaahhhs,' the voices singing 'aaah.' That was the best I think that we ever did it. It was quite a lot of voices we put on, maybe 12 or 15 voices. We sang it in the echo-chamber, I remember that, too.&quot; In Simon and Garfunkel -- A Musical Biography by John Swenson (1984), Garfunkel claims the layered vocals were his idea, noting, &quot;It's us around eight times screaming, and we mixed it down very softly...I started getting into open-mouth harmony, in a very loud, strident way. We were screaming at the top of our lungs and inside an echo chamber. I remember that day that Dylan dropped by to visit. We came out of the booth after all this screaming, and there he was. Anyway, we got a very foreign sound.&quot;\n\nThe loneliness and emotional ache of the song positions it as a standout in Simon's stellar catalog. He is a master of melancholy, a man whose voice seems to always have a tinge of sadness, even when he is singing &quot;up&quot; material. And when blended with that of his partner, Garfunkel, the result could be heartbreaking, especially on a personal song such as this. \n\nEL CONDOR PASA (IF I COULD) (info from Wikipedia)\n\nEl CÃƒÆ’Ã‚Â³ndor Pasa is a song from the zarzuela El CÃƒÆ’Ã‚Â³ndor Pasa by the Peruvian composer Daniel AlomÃƒÆ’Ã‚Â­a Robles written in 1913 and based on traditional Andean folk tunes.\n\nIt is possibly the best-known Peruvian song worldwide due to a cover version by Simon &amp; Garfunkel in 1970 on their Bridge Over Troubled Water album, which is called El Condor Pasa (If I Could). Paul Simon used the instumental version of Los Incas as the basic-track (wihhout permission) and wrote entirely new, unrelated lyrics. Later that year, Perry Como released a cover of Simon's English version on his album It's Impossible, while Julie Felix took advantage of Simon and Garfunkel's decision not to release their version as a UK single, and had a UK Top 20 hit with it. Simon &amp; Garfunkel did release their version as a single in the U.S. and it reached # 18 on the Billboard Pop Singles chart in the fall of 1970.\n\nHistory of the Song\n\nIn 1913 AlomÃƒÆ’Ã‚Â­a Robles composed &quot;El cÃƒÆ’Ã‚Â³ndor pasa&quot; and the song was first performed publicly at the Teatro Mazzi in Lima.[2]\n\nIn the 1960's the musical group, &quot;Los Incas&quot; performed the song in Paris where it was heard by Paul Simon of Simon and Garfunkel.&quot;Los Incas&quot; told Simon, perhaps through ignorance, that the song was a 19th century musical composition by an anonymous composer.Simon became interested in the song and composed new lyrics for the melody.The song appeared on Simon and Garfunkel's 1970 album Bridge over Troubled Waters.\n\nIn 1970 AlomÃƒÆ’Ã‚Â­a Robles' son, Armando Robles Godoy, filed a copyright lawsuit against Simon and demonstrated that song had been composed by his father and that his father had copyrighted the song in the United States in 1933.Robles Godoy said that the lawsuit was almost friendly and that he bears no ill will towards Simon for what he considers a misunderstanding.&quot;It was an almost friendly court case, because Paul Simon, besides being a genius, was a great culture-loving guy. It was not carelessness on his part,&quot; says Robles Godoy.&quot;He happened to hear the song in Paris from a vernacular group. He liked it, he went to ask them and they gave him the wrong information. They told him it was a popular tune from the 18th Century and not my fatherÃƒÂ¢Ã¯Â¿Â½Ã¯Â¿Â½s composition. It was a court case without further complications.&quot;\n\nCECILIA (info from Wikipedia)\n\n&quot;Cecilia&quot; is a song by Paul Simon, from the Simon and Garfunkel 1970 album Bridge Over Troubled Water. When released as a single, it reached #4 in the US charts. The song begins &quot;Cecilia, you're breaking my heart / You're shaking my confidence daily...&quot; then ends with &quot;Jubilation! / She loves me again...&quot;\n\nThe single did not chart in the UK, despite being released as the follow-up to Simon and Garfunkel's number one hit &quot;Bridge Over Troubled Water&quot;.\n\nThe &quot;Cecilia&quot; of the title is generally interpreted as being a capricious lover, causing both anguish and jubilation to the singer. However, another interpretation is that Cecilia might refer to St. Cecilia, patron saint of music in the Catholic tradition, and thus the song might refer to the frustration of fleeting inspiration in songwriting. St. Cecilia is mentioned in another Paul Simon song, &quot;The Coast&quot; (from his 1990 album The Rhythm of the Saints): &quot;A family of musicians took shelter for the night in the little harbor church of St. Cecilia.&quot;\n\nWhen the original album was released on vinyl, the song included sounds out of the human hearing range. This has led to rumors that Cecilia was actually written about Simon's black lab, Cecilia. When being transferred to CD in 1996, producers removed the ultrasonic sounds in order to lower the file size,allowing them to fit a 14th song on the &quot;best of&quot; album. When interviewed, Simon refused to comment. Garfunkel was quoted as saying that Simon had never dated anyone named Cecilia and the song was probably about the dog.\n\nBYE BYE LOVE (info from Wikipedia)\n\n&quot;Bye Bye Love&quot; is a popular song written by Felice and Boudleaux Bryant and published in 1957. It is best known in a debut recording by The Everly Brothers, issued by Cadence Records as catalog number 1315. The song reached #2 on the US Billboard Pop charts and #1 on the Cash Box Best Selling Record charts. Ray Charles included his version of the song on his 1962 album Modern Sounds in Country and Western Music.\n\nRory Blackwell and his Blackjacks recorded it the UK in 1957 issued by Parlophone/EMI\n\nThe Everly Brothers' version also enjoyed major success as a country song, reaching No. 1 in the spring of 1957. Its country success was concurrent with another country version recorded by Webb Pierce, at the time one of country music's top entertainers. Pierce's version reached No. 7 that summer.\n\nThe duo Simon &amp; Garfunkel recorded it live for their 1970 Bridge Over Troubled Water album. A &quot;goof&quot; may be heard in the sixth line of the third refrain, where one or both singers begin singing &quot;happiness&quot; as in the second line of the refrain but correct themselves to sing &quot;sweet caress.&quot; The listener hears something akin to &quot;Bye bye ha-sweet caress.&quot;\n\nThe song was featured in the film All That Jazz, sung by Ben Vereen and Roy Scheider, with some lyrics rewritten to fit that story. A cover of the song by the Scottish band The Proclaimers is heard in the film Bye Bye Love.\n\n&quot;Bye Bye Love&quot; was also included in the Ditty Bops album &quot;Moon Over The Freeway,&quot; published in 2006.\n\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:2caebab3aed44905bc6c09be18ce24347cd9ea05","amp;dn":"Simon+%26+Garfunkel+-+Bridge+Over+Troubled+Water+%28Remastered%29+%5BReP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2caebab3aed44905bc6c09be18ce24347cd9ea05","infoHashBuffer":{"type":"Buffer","data":[44,174,186,179,174,212,73,5,188,108,9,190,24,206,36,52,124,217,234,5]},"announce":[],"urlList":[]}}