{"title":"Grateful Dead - Terrapin Station (1977) 2013 HDTracks 24-96-FLAC","uid":11155360,"size":778715372,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2d0f80d4509555e4dbef58edc35dd9aa6b4b7016&amp;dn=Grateful+Dead+-+Terrapin+Station+%281977%29+2013+HDTracks+24-96-FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"hal4000","files":-1,"time":1412407592,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nIt is generally agreed that the Grateful Dead's late-'70s studio releases left even the most enthusiastic Deadheads longing for something more. The theory is that the band's momentum is best experienced during the ebb and flow of a live performance rather than the somewhat clinical tedium of a recording studio. Terrapin Station marks several milestones for the Grateful Dead: it was the band's first studio album in two years, as well as their return to a major label -- in this case Arista Records. More significant however is the use of an outside (read: non-Grateful Dead) producer. This was only the second time in which the Dead did not seize complete control. And the first time in a decade that they would relinquish their production reigns. They chose Keith Olsen -- a former member of the '60s garage rock band Music Machine -- whose production roster also included other Bay Area notables including the Sons of Champlin and Santana. Musically, Terrapin Station offers a few choice glimpses of the band doing what it does best. While the most prominent example is the album's extended title suite, there are a few others such as the cover of the Rev. Gary Davis gospel-blues &quot;Samson and Delilah&quot; and a resurrection of the Martha &amp; the Vandellas hit &quot;Dancin' in the Streets.&quot; The latter tune was originally performed by the Dead in their mid-'60s repertoire. What was once a garage rock and psychedelic reading has evolved into a 4/4-time, brass-influenced disco arrangement. Luckily, their extended versions during concert performances were infinitely more tolerable. Parties interested in examining the contrast between the studio and live performance versions of Terrapin Station material should seek the archival concert release Dick's Picks, Vol. 3. This two-disc set not only captures the band exactly two months and two days prior to the release of Terrapin Station, it also features stellar performances of every track from the album sans the up-tempo rocker &quot;Passenger.&quot;\n\nHDTracks PCM-24Bit-96Khz-FLAC.","torrent":{"xt":"urn:btih:2d0f80d4509555e4dbef58edc35dd9aa6b4b7016","amp;dn":"Grateful+Dead+-+Terrapin+Station+%281977%29+2013+HDTracks+24-96-FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d0f80d4509555e4dbef58edc35dd9aa6b4b7016","infoHashBuffer":{"type":"Buffer","data":[45,15,128,212,80,149,85,228,219,239,88,237,195,93,217,170,107,75,112,22]},"announce":[],"urlList":[]}}