{"title":"Love - The Forever Changes Concert (2003) (2CD) [FLAC]","uid":6511737,"size":477735843,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2dfe2122e9bb5baf1bde0661c3930075036be3b8&amp;dn=Love+-+The+Forever+Changes+Concert+%282003%29+%282CD%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zibbik","files":24,"time":1309650193,"description":"\nArtist: Love\nTitle: The Forever Changes Concert\nGenre: Rock / Folk-Rock / Psychedelic Rock / Blues\nCountry: US\n\n\nIf These are good times for hippie retrospection. Hot on the heels of the reformed Magic Band collection, Back to the Front, comes this CD release of Love's Forever Changes show, which effectively bestows upon Arthur Lee the luxury recently afforded Brian Wilson on his Pet Sounds concerts, with the original classic album sequence being rendered virtually note for note, complete with all the string and horn parts. It's fitting that it should have been recorded at Lee's Royal Festival Hall shows, as the UK was always more open to his idiosyncratic genius than his fellow Americans; this empathy is apparent right from the opening &quot;Alone Again Or&quot;, in the cheers which acclaim the trumpet solo like some matador's deft flourish, and particularly in the way the audience stays respectfully pin-drop silent at the song's conclusion, as if reluctant to shatter the mood - in the USA, you could guarantee some boozy yahoo would have trampled on the moment with a selfish whoop. &quot;We waited 13 years for this, Arthur,&quot; someone calls out when the applause subsides. &quot;I waited 13 years for this, too!&quot; responds Lee, whose errant ways seemed until recently to have doomed him to a life of recidivism and jail. He's on fine form here, though, offering his most Johnny Mathis-ised delivery over the emollient horns and strings of &quot;The Good Humor Man He Sees Everything Like This&quot;, and tackling the fragile romantic poesy of &quot;Andmoreagain&quot; with assurance. The arrangements are virtually identical to the originals, save for small differences in lead guitar tones, and the (entirely justified) triumphant re-entry of the coda to &quot;The Red Telephone&quot;, the sunniest paranoia song ever written. \n\nTracklist:\n\nDisc One\n\n01. Alone Again Or - 4.20 min\n02. House Is Not A Motel - 4.06 min\n03. Andmoreagain - 4.06 min\n04. Daily Planet - 3.43 min\n05. Old Man - 3.29 min\n06. Red Telephone - 7.13 min\n07. Maybe The People Would Be The Times Or Between Clark And Hilldale - 3.57 min\n08. Live And Let Live - 5.14 min\n09. Good Humor Man He Sees Everything Like This - 3.42 min\n10. Bummer In The Summer - 2.34 min\n11. You Set The Scene - 7.51 min\n\nDisc Two - Bonus Disc\n\n1. Seven &amp; Seven Is - 3.00 min\n2. Your Mind and We Belong Together - 4.13 min\n3. Signed DC - 6.46 min\n4 .MyLittle Red Book - 2.31 min \n\n\n\n\n\n","torrent":{"xt":"urn:btih:2dfe2122e9bb5baf1bde0661c3930075036be3b8","amp;dn":"Love+-+The+Forever+Changes+Concert+%282003%29+%282CD%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2dfe2122e9bb5baf1bde0661c3930075036be3b8","infoHashBuffer":{"type":"Buffer","data":[45,254,33,34,233,187,91,175,27,222,6,97,195,147,0,117,3,107,227,184]},"announce":[],"urlList":[]}}