{"title":"Pool.Nation.Repack-RELOADED","uid":9088393,"size":864402281,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2e3ad5b65513871103b9957eff292bc20c95ec8e&amp;dn=Pool.Nation.Repack-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mr.Stifmeister","files":2,"time":1382541180,"description":"\nnERv\n\nPool Nation REPACK (c) Cherry Pop Games\n\n10/2013 :..... RELEASE.DATE .. PROTECTION .......: Steam\n1 :.......... DISC(S) .. GAME.TYPE ........: Indie, Sports\n\nRepack Notes\n\nThe recent game update cuts the install size down from roughly 12Gb to 4Gb\nThis is why we decided to repack our first release\n\nSee included whatsnew.txt for Update notes\n\nPool Nation, is the ultimate pool game - with eleven addictive game modes,\nincluding the adrenaline pumping Endurance, extensive career modes and seven\nexciting online modes including the new Speed Pool Not forgetting the Box of\nTricks coming soon to Steam, giving you the ability to imagine, build and\nshare your most outlandish trickshots with the world. Utilizing a variety of\nobjects, including Ramps, Pikes, Loop the Loops and Speed up strips, the Box\nof Tricks is limited only by your imagination.\n\nWith Pool Nation, gameplay is king Online or offline, the ease of control\ngives you the ability to pull off shots you wouldn't dream of in the real\nworld. The balls behave exactly as they should use the table surround to\ncreate the most unbelievable trickshots and view them back in super slow mo.\n\nThe graphics are as shiny and pixel-perfect as the physics, with beautiful\nlocations, stunning exterior landscapes, eye-catching interiors, the ability\nto change the time of day, and customize your games with a huge array of\nballs, cues and table decals creating your ideal pool playing environment\nEvery detail has been considered and polished, from the super-detailed table\nbaize and deforming cushions, to the explosions of chalk dust from the cue\ntip.\n\n1. Unrar\n2. Burn or mount the image\n3. Install the game.\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT\n\n","torrent":{"xt":"urn:btih:2e3ad5b65513871103b9957eff292bc20c95ec8e","amp;dn":"Pool.Nation.Repack-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e3ad5b65513871103b9957eff292bc20c95ec8e","infoHashBuffer":{"type":"Buffer","data":[46,58,213,182,85,19,135,17,3,185,149,126,255,41,43,194,12,149,236,142]},"announce":[],"urlList":[]}}