{"title":"The Men - Tomorrow's Hits (2014) [FLAC]","uid":9730440,"size":253636851,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2e55fa54028bafbda07b37e30ba48458fb72c7c4&amp;dn=The+Men+-+Tomorrow%27s+Hits+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1394371402,"description":"\n  The Men - Tomorrow's Hits (2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 KHz\n\n  01 Dark Waltz \n  02 Get What You Give \n  03 Another Night \n  04 Different Days \n  05 Sleepless \n  06 Pearly Gates \n  07 Settle Me Down\n  08 Going Down \n\n  Their fifth album in as many years, the Men prove themselves to be not only prolific, but wildly versatile on Tomorrow's Hits. Following suit with 2013's New Moon, the album finds the Brooklyn band continuing their astounding evolution from abrasive noisemakers to full-on bar band. Embracing the sounds of Tom Petty, Bruce Springsteen, and Bob Seger, the band merge the earnest, rollicking sounds of rock's past with a production aesthetic that still feels like their own. Given the band's starting point, what makes Tomorrow's Hits such a surprise isn't so much how much the band has changed, but how fast. Recorded just before the release of New Moon, the album really captures the excitement of a group of musicians following their muse wherever it might lead them. And that unfettered sense of exploration and growth really comes through on the album, which feels effortlessly adventurous, as the band goes full-on E Street Band, with horns and all, on the rollicking &quot;Another Night.&quot; While there are plenty of bands who like to change things up from album to album, and even more willing to flood you with more releases than you know what to do with, the Men are unique in their ability to do both, and do them well at that. Though it's titled Tomorrow's Hits, the album is a well-written love letter to yesterday's rock &amp; roll. Though this means the album's sound isn't nearly as revelatory as the sonic assaults of their earlier work, the Men continue to prove that, above all, they're a band that know what they're doing, even if they don't know what they're doing next.","torrent":{"xt":"urn:btih:2e55fa54028bafbda07b37e30ba48458fb72c7c4","amp;dn":"The+Men+-+Tomorrow%27s+Hits+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e55fa54028bafbda07b37e30ba48458fb72c7c4","infoHashBuffer":{"type":"Buffer","data":[46,85,250,84,2,139,175,189,160,123,55,227,11,164,132,88,251,114,199,196]},"announce":[],"urlList":[]}}