{"title":"Cannibal Women in the Avocado Jungle of Death (1989)","uid":4414105,"size":737063234,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e603da269b0651e7a5b13a6c0b063a7691b6052&amp;dn=Cannibal+Women+in+the+Avocado+Jungle+of+Death+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JayRay","files":-1,"time":1222420312,"description":"CANNIBAL WOMEN IN THE AVOCADO JUNGLE OF DEATH - 1989\n\nIMDb Rating: 4.5\n\n  Shannon Tweed (of Playboy Playmate of the Year fame) and Bill Maher (Politically Incorrect and just as sarcastic as ever) travel deep into the Uncharted Avocado Jungle of southern California on a mission for the U.S. government to find the ancient Piranha Women. The government wants to avert an avocado shortage caused by the Piranha Women's occupation of the jungle; that and the Piranha Women have this little peccadillo of eating their men, thus posing a threat to our phallocentric way of life. Tweed is supposed to convince them to move to Malibu condos, where they can continue eating men if they like, so long as we can get those avocados. Accompanying the duo on their mission is a Home Ec major named Bunny whose secret fantasy is to be tied up with red licorice whip, and who wants to join the Piranha Women so she can get one of those cute outfits. The previous envoy for the Military, one Dr. Kurtz (Adrienne Barbeau), an anthropologist and feminist, never came back, instead becoming the leader of the threatening Piranha Women. Yet she's really interested in writing an expose about her time in the jungle (&quot;a kiss-sacrifice-and-tell book&quot;) so she can get back on the talk show circuit. &quot;You don't know what it's like trying to face David Letterman with a book on male insensitivity.... The horror, the horror!&quot;\n\n  Starring: Bill Maher, Shannon Tweed, Karen Mistal, Adrienne Barbeau, Brett Stimely.\n\n  Directed by: J.F. Lawton.\n\n  Quality: Very Good Xvid from DVD.\n\n  Length: 1hr. 26min.\n\n  Language: English.\n\n  Size: 600 x 450\n\n  Frame Rate: 29fps","torrent":{"xt":"urn:btih:2e603da269b0651e7a5b13a6c0b063a7691b6052","amp;dn":"Cannibal+Women+in+the+Avocado+Jungle+of+Death+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e603da269b0651e7a5b13a6c0b063a7691b6052","infoHashBuffer":{"type":"Buffer","data":[46,96,61,162,105,176,101,30,122,91,19,166,192,176,99,167,105,27,96,82]},"announce":[],"urlList":[]}}