{"title":"David Irving: Hitler's War.pdf","uid":4769417,"size":4860275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2e62848bca5710489349af5707675c769fe1e007&amp;dn=David+Irving%3A+Hitler%5C%27s+War.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"fire45","files":1,"time":1236987509,"description":"\t\nHitler's War [Originally published in Britain on June 13, 1977]\n\n\n\nEVEN THE not easily corrupted Board of Deputies of British Jews were impressed by David Irving's Hitler's War, assessing in a secret intelligence report on Mr Irving in 1991:\n\n&quot;The book however was far more than a simple denial of Hitler's role. It was thoroughly researched and employed a variety of themes . . . It also confirmed Irving's reputation as one of the world's most thorough researchers and an exciting and readable 'historian'.&quot;\nReviewing two other books in The Daily Telegraph on April 25, 1980 their eminent defence correspondent John Keegan began his review: &quot;Two books in English stand out from the vast literature of the Second World War: Chester Wilmot's The Struggle for Europe, published in 1952, and David Irving's Hitler's War, which appeared three years ago.&quot;\n\nKeegan repeated this generous assessment elsewhere in 1980\nMax Hastings, who later became editor-in-chief of The Daily Telegraph, wrote the author on November 11, 1977: &quot;Congratulations on the Hitler book to add to all the others you have received. I much lament the fact that I was unable to review it for anybody, although heaven knows the big guns turned out for you.&quot;\n\nEXTRACTS FROM U.K. REVIEWS:\n&quot;NO PRAISE can be too high for his [Irving's] indefatigable scholarly industry. He has sought and found scores of new sources, including many private diaries. He has also tested hitherto accepted documents and discarded many of them as forgeries. His portrait of Hitler is thus, he claims, firmly based on solid primary evidence . . . An exact and scrupulous historian . . . One of the most interesting of his (new) sources is the diary of Walther Hewel, Ribbentrop's liaison officer with Hitler, part of which was enciphered by being written in an Indonesian language (Hewel had lived some time in Java). I particularly enjoyed one vivid detail from this source. On the eve of Hitler's attack on Russia, the Soviet ambassador sought an audience. Hitler and Ribbentrop were terrified lest he should offer concessions so vast as to take away any pretext for their invasion. They therefore decided that both of them must disappear, until their armies were on the march. Fortunately, the ambassador had no inkling of the true position: when he called on the state secretary, he &quot;discussed purely routine matters and left after cracking a few jokes&quot;. Many such new details enliven this book, which is also well organised and well written: Mr Irving's craftsmanship as a writer has improved immensely, and I have enjoyed reading his long work from beginning to end.\n\n--Professor Hugh Trevor-Roper, The Sunday Times\n\n&quot;THE READER is gripped at once, because the writer is so obviously in his element; he is there . . . For he is presenting the events of 1939-45 &quot;as far as possible through Hitler's eyes, from behind his desk&quot;. In this it seems to me he is brilliantly successful -- I have read nothing except the Table Talk which gives so immediate a feeling of Hitler's thinking -- and although there are enormous limitations to this approach it is carried out consistently to the end . . . It is in the area of disguised autobiography -- Hitler's, not Mr Irving's -- that the interest of this extraordinary book lies . . . Crown to an absorbing and highly talented book.&quot;\n\n-- The Times\n\n&quot;HIS BOOK can hardly be described as an exercise in whitewash . . . The core of this book is provided by Mr Irving's narrative of Hitler's day-by-day conduct of the war . . . This ground is traversed with a sense of immediacy and grasp of detail lacking in many of the recent FÃƒÂ¼hrer biographies . . . Mr Irving's mastery of the German sources is superb.&quot;\n\n-- Professor Donald Watt, The Daily Telegraph\n\n&quot;IT MUST be said at once that the book makes the most fascinating reading. Mr Irving possesses the gift of narrative and the art of arrangement. He has spent ten years researching into the subject. He is bilingual as regards German and he has a knack of persuading the heirs of various prominent Nazi figures to produce letters, diaries and other documents which they have kept carefully guarded from previous inquirers. He has also induced some of those who are still alive and were closely connected with Hitler to speak with a candour which they seldom displayed in any other context . . . Mr Irving has achieved this [projecting the reader into the Hitlerian court] brilliantly and the publishers' claim that his description of events &quot;give us the uncanny feeling of having been there&quot;is fully justified.&quot;\n\n-- The Spectator\n\n&quot;I FOUND the book riveting reading.&quot; -- Sheffield Morning Telegraph\n\n&quot;DAVID IRVING has ransacked the world's archives; he has discovered eye-witness accounts; he has unearthed diaries and correspondence which were thought to have been destroyed; he has interviewed survivors of the Hitler entourage and he has drawn significance from the memoirs of men whose part in the story hitherto passed unconsidered.\n\n&quot;All this evidence he has welded into a narrative which is, for all its inevitable complexities, remarkably comprehensible and, for all that is both dense and long, surprisingly readable.&quot;\n\n-- Professor J.E. Molpurgo, The Yorkshire Post.\n\n&quot;THERE IS no denying his ability as a master of narrative. From the cosy domesticity of some God-forsaken war command in Prussia to the strident atmosphere of the Army's command headquarters, Irving passes with ease, finding quotations and facts to paint vivid pictures of Hitler and his entourage as they crowded with delight over some victory or sat gloomily around after some upset on one of the many fronts. There is also great scope to his [Irving's] work. We are constantly reminded that Hitler had his hands occupied with North Africa, Greece, Italy and Russia . . . Irving is good too, when he is describing the advance of armies and the wrangling of generals trying to get more men and materials into their particular areas.&quot;\n\n-- Irish Independent\n\n&quot;DAVID IRVING might well wonder whether he can expect justice. Before one has even opened this large book, one is only too well aware that it has been both denounced and derided by many historians in Europe and in America, and that it is the source of much high feeling . . . In fact this disposes one favourably to Irving. It is high time that Hitler studies moved on . . . It could be that a dedicated worker such as Irving, who is prepared to take nothing for granted and who is free from the tram-like mentality which affects many academics, might succeed in revealing new and hitherto unsuspected aspect of this challenging and baffling enigma . . . His book is hugely interesting, his narrative is compelling and his arguments forceful . . . His book has it own unity. It is an excellent description of Germany at war, and of Hitler's part in that war.&quot;\n\n-- New Society\n\nWhat the American Press has said about Hitler's War:\n\n&quot;IRVING IS a tireless and adroit researcher, whose forte is coaxing unpublished material out of private hands . . . By documenting Hitler's activities in the detail that he has, Irving has refined considerably our picture of this extremely complex man.&quot; -- Liberal Journey\n\n&quot;THE AUTHOR has combined impressive research and beautiful writing to produce a meticulously recorded portrait of the man who led his nation to disaster.&quot;\n-- Boston Herald American\n\n&quot;TWELVE YEARS in the making, this massive volume is a model of careful scholarship, historical objectivity and readability . . . Irving could scarcely be described as a Hitler fan, but he does enable us to understand why the German leader held such absolute power for so long.&quot; -- Publishers Weekly\n\n&quot;IRVING'S ACCOUNT of the climatic campaigns, invasions, collapsing alliances, and chaotic outcome of Hitler's War often reads like Carlyle's French Revolution. He sustains his narrative masterfully; his scholarly documentation is impressive, but never distracting. From the opening scene on Hitler's special train, his command post in 1939, to his wedding in the doomed bunker in Berlin, this is a brilliantly executed book that provides provocative and memorable reading.&quot; -- Charles Ewing, The National Observer\n\n&quot;IT IS wonderful how Mr Irving, without any confusion or any dull stretches, ranges over the entire German war effort. He shows us the precise importance of each problem, from the squabbles between Rumania and Hungary to the decay of the Luftwaffe, from the sources of raw materials to the roles that individual generals played. The book is a brilliant study of war which makes military problems fascinating, and -- possibly because the loosing side becomes so vivid -- war loathsome.\n\n-- Naomi Bliven, The New Yorker\n\n&quot;AND IT IS wryly, bitterly amusing to reflect that a British historian, David Irving, perhaps the greatest living authority on the Nazi era, has recently asserted in his book HITLER'S WAR that there is not a shred of evidence to prove that Hitler himself knew anything about the methods adopted by Himmler to achieve the 'final solution of the Jewish problem.'&quot;\n\n-- Stephen Spender, The New York Times review of books,\nSunday . . . March 1977.","torrent":{"xt":"urn:btih:2e62848bca5710489349af5707675c769fe1e007","amp;dn":"David+Irving%3A+Hitler%5C%27s+War.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e62848bca5710489349af5707675c769fe1e007","infoHashBuffer":{"type":"Buffer","data":[46,98,132,139,202,87,16,72,147,73,175,87,7,103,92,118,159,225,224,7]},"announce":[],"urlList":[]}}