{"title":"Metal Church - Discography (1984 - 2008)","uid":6765420,"size":1150418972,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2e869929ccfb6b38b2f14545ebabd8adb6afb532&amp;dn=Metal+Church+-+Discography+%281984+-+2008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":93,"time":1319366248,"description":"Metal Church (1984)\nThe Dark (1986)\nBlessing in Disguise (1989)\nThe Human Factor (1991)\nHanging in the Balance (1993)\nMasterpeace (1999)\nThe Weight of the World (2004)\nA Light in the Dark (2006)\nThis Present Wasteland (2008)\n\n\n320 kbps\n\n\n \n\n\nBorn out of the West Coast Metal scene of the 80\\\\\\'s, Metal Church quickly became one of the standout talents of the genre. After signing a deal with Elektra records, they released two critically acclaimed albums. Their self-titled release \\\\\\&quot;Metal Church\\\\\\&quot; postured the band as one of the pioneers of the thrash/metal scene. The All Music Guide had this to say about the debut: \\\\\\&quot;The band\\\\\\'s incredibly tight musicianship is a highlight all on it\\\\\\'s own. This album remains an overlooked classic of straight-ahead American-bred heavy metal.\\\\\\&quot; With the heavy metal scene starting to rise in the U.S., Metal Church set out on a very successful tour with label mates Metallica. \n\nNext came \\\\\\&quot;The Dark,\\\\\\&quot; the fury of its opening track, \\\\\\&quot;Ton of Bricks\\\\\\&quot; was championed as one of the premier metal releases of the 80\\\\\\'s. The Dark also led to one of a few lineup changes with the departure of vocalist David Wayne. However, more success was yet to come. With the addition of former Heretic vocalist Mike Howe, and Metallica guitar tech extraordinaire John Marshall, the riffing became heavier and the subject matter deeper. They tackled political and social issues of the day with the releases of \\\\\\&quot;Blessing In Disguise\\\\\\&quot; and \\\\\\&quot;The Human Factor.\\\\\\&quot; At a time when heavy metal bands moved from the underground and became part of the hair band/pop fad, Metal Church stayed true to their roots. \n\nDuring the mid 90\\\\\\'s, the members of Metal Church headed in their own directions. Kurdt Vanderhoof worked on his namesake project, Vanderhoof, while Kirk Arrington was playing on various sessions including a recording with Sir Mix-A-Lot. 1999 led to a well-received reunion of the original Metal Church lineup with the release of \\\\\\&quot;Masterpeace\\\\\\&quot;. The band went back to their classic sound and played several festivals overseas. \n\n2004 saw them back with new vocalist, Ronny Munroe, whose style has been described as \\\\\\&quot;Rob Halford meets Dio\\\\\\&quot;, as well as Jay Reynolds (Malice) on guitar and Steve Unger on bass. With a new record \\\\\\&quot;The Weight of the World\\\\\\&quot; and some new blood, heavy metal legends Metal Church picked up where their aptly titled last release \\\\\\&quot;Masterpeace\\\\\\&quot; left off. \n\nIn 2006, twenty years after their cult album \\\\\\&quot;The Dark\\\\\\&quot;, Metal Church presented their brand new release, \\\\\\&quot;A Light In The Dark\\\\\\&quot;, forging a creative arch that skillfully links the band\\\\\\'s past with the present. Ten new tracks, (plus a new version of the classic \\\\\\&quot;Watch The Children Pray\\\\\\&quot;, a tribute to original frontman David Wayne), document the development of a band that, despite all innovation, has never denied it\\\\\\'s typical trademarks. The current lineup consists of Kurdt Vanderhoof, Ronny Munroe, Jay Reynolds, Steve Unger and new addition Jeff Plate on drums. \\\\\\&quot;Jeff is an incredibly dynamic and professional drummer,\\\\\\&quot; Vanderhoof points out. \\\\\\&quot;He has propelled us to a musical level that surprised even ourselves.\\\\\\&quot; Plate has replaced Kirk Arrington, who left the group for health reasons, and proves a real stroke of luck on \\\\\\&quot;A Light In The Dark\\\\\\&quot;.\n\nIn 2008, guitarist Jay Reynolds was replaced by Rottweiler guitar player Rick Van Zandt. This Present Wasteland, Metal Church\\\\\\'s ninth release, is a return to their roots and contains some of their strongest material to date.\n\nGet ready to join the congregation!\n","torrent":{"xt":"urn:btih:2e869929ccfb6b38b2f14545ebabd8adb6afb532","amp;dn":"Metal+Church+-+Discography+%281984+-+2008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e869929ccfb6b38b2f14545ebabd8adb6afb532","infoHashBuffer":{"type":"Buffer","data":[46,134,153,41,204,251,107,56,178,241,69,69,235,171,216,173,182,175,181,50]},"announce":[],"urlList":[]}}