{"title":"Transcendental Mind Series [9 CDs]","uid":4145022,"size":504421539,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2e99212e3b11c4f741049c395c90edb252a61b4b&amp;dn=Transcendental+Mind+Series+%5B9+CDs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Theli93","files":11,"time":1208690144,"description":"Dane Spotts Transcendental Mind Series 9 CDs AUDIO SET\nVisionary Technology | ASIN: B000COCCUU | mp3 | 9 cds | 224 Kbps | 55.8 x 7 67.8 27.4 MB | English\n\nBook Info\n\nThe spiritual leaders of ancient cultures used a combination of beating drums and flickering firelight to induce trance states of consciousness. Using primitive instruments combined with the human voice, they created powerful, complex musical forms and sonic textures for spiritual and physical healing, entering deep states of meditation, and creating rituals of sensual pleasure. Just as in ancient ceremonies these soundtracks help induce altered states experiences. The result-- you experience a ?mind trip? and your imagination is driven into alternate dimensions of reality where magic and mystery rule.\n\nZen Healing Chants - ASIN: B000CQOYFE\nYou?re in a Buddhist Temple high in the Himalayas. The only sound is of the distant wind. You?re at peace. A lonely voice softly chants. Others join in. From the far reaches of the temple, transformed beings bathe you in a chorus of unearthly sound, cleansing your soul and renewing your energy. Based on healing chants of Tibetan Buddhist Monks, this transformational soundtrack is designed to invoke the divine forces of the inner spirit world to guide you to a universe of peace and serenity.\n\nAmazon Shaman, Incantations of an Amazon Shaman - ASIN: B000COCCUU\nIn the heart of a tropical rain forest an amazon shaman chants mystical incantations into the darkness. His voice is not of this world. And for the moment, neither is his body as it moves in a trance, silhouetted by the flames of flickering fire. He knows you are there. And he beckons you to come forth. The dancing and chanting of the shaman is mesmerizing...the forest becomes alive...and you feel yourself flow within the circle of life.\n\nVoodoo Mating Ritual\nA full moon rises over the beach, as the breaking waves take on a hypnotic sound. In the distance a bonfire illuminates shadows of natives dancing and chanting to a sensuous, pulsing rhythm. The alluring beat moves your body, drawing you closer to the circle in a passionate trance state of consciousness. You join the dancers in a Voodoo Mating Ritual. Woven into this program are authentic sounds of voodoo rituals recorded in a remote corner of the world, where even today, public performance is forbidden.\n\nMayan Sun Rituals - ASIN: B000DZY87I\nIt is dawn. You awaken to the song of an ancient flute carried on a cool morning breeze. As you open your eyes a beautiful garden unfolds before you. Walking barefoot, you are embraced by a sense of peace and serenity. And as you turn to face the rising sun (the Mayan source for great power) you feel the power of your being rising within you. This empowering soundscape is based on thousand-year old ceremonies to achieve higher states of consciousness and eternal life.\n\nIndonesian Karma, Balinese Ghost Ceremony - ASIN: B000CQP1DI\nIt is dark. The soft chime of distant bells grows louder as a chorus of voices surrounds you. A flash of light illuminates shadows of dancing ghosts. They embrace and guide you into a world of eternal peace and joy. The people of Bali (Indonesia) believe spirits who hold the key to universal truth and wisdom live in ?the shadow world.? Based on their ancient ceremonies that open a window to this world, the ghost-like spirits evoked by this soundscape invite you to tap into the power of eternal life.\n\nEskimo Spirits, An Inuit Journey - ASIN: B000CO8BCI\nThe light of a winter?s day fades into a long Arctic night. Snow and ice extend to every horizon. Distant drums begin to play as a small fire appears. Strange figures dance, while chanting to the spirits in the Land Beyond. The spirits answer and you join them on an Inuit journey. The Inuit believe in the ?Land Beyond??a sacred universe of benevolent spirits who grant eternal life. Based on authentic ceremony recordings, this soundscape invites you into a universe of ancient spirits born of snow and ice.\n\nPyramid Visions, An Egyptian Journey to the Afterlife - ASIN: B000COCCJQ\nA cool river breeze rushes through the valley. Ahead, a procession of chanting figures march towards the shadow cast by a towering pyramid. You join them. Collectively your voices call to the forces of eternity, as the power of the pyramid guides you on an Egyptian journey into the afterlife. The pyramids were sources of great power, ensuring safe passage into the afterlife. Based on 6,000-year-old ceremonies and funerary rituals, this haunting soundscape lets you transcend with kings.\n\nAvatar Transformation, A Hindu Reincarnation - ASIN: B000CQR1UO\nImagine sitting in an ancient temple. Distant voices of divine spirits call you. You feel yourself floating...free of your body...free of this world. As the rhythm of the ritual builds, your life takes on new meaning, new purpose. You are changed forever as you experience a Hindu transformation. Hindus believe in reincarnation, and an Avatar is a god who is reborn in an earthly form. This is truly a beautiful soundscape, derived from ancient Hindu ceremonies which evoke the power of divine forces to rebirth the soul.\n\nAboriginal Dreamtime, Entering the Aboriginal Spirit World - ASIN: B000CQR2R6\nIt is twilight in a surreal desert landscape. A solitary voice sings softly...then others join in. As you move towards the voices, your breathing becomes extremely easy and you feel light. Now is the time to go to a place where past and future become one...to a world called Dreamtime. The Aborigines believe Earth was created by spirits of the Dreamtime world, and that great powers are granted to all who enter this sacred domain. This unique soundtrack is based on ancient Aborigine ceremonies still performed today.\n","torrent":{"xt":"urn:btih:2e99212e3b11c4f741049c395c90edb252a61b4b","amp;dn":"Transcendental+Mind+Series+%5B9+CDs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e99212e3b11c4f741049c395c90edb252a61b4b","infoHashBuffer":{"type":"Buffer","data":[46,153,33,46,59,17,196,247,65,4,156,57,92,144,237,178,82,166,27,75]},"announce":[],"urlList":[]}}