{"title":"Capt. Beefheart - Grow Fins: Rarities (1965-1982) 1999 [FLAC]","uid":4710031,"size":1701757756,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2ea6b5e23468bde8c100056105f5923f4f95026c&amp;dn=Capt.+Beefheart+-+Grow+Fins%3A+Rarities+%281965-1982%29+1999+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"storoa","files":92,"time":1233982390,"description":"Review\tby Richie Unterberger\n\nAn unprecedented project in the rock field: a five-CD box set of unreleased material by a cult artist that never had anything close to a chart hit. Of course Captain Beefheart is the ultimate cult artist, and one with a following so rabid (if limited) that the compilation has a wider audience than many would anticipate. Despite the impressive chronological span and variety of demos, live performances, backing tracks, and outtakes, be cautioned that this is not a best-of or ad hoc career overview. A good deal of the tracks (some of which have long been available on bootleg) are of slightly substandard or low fidelity, and Beefheart's most significant work is ultimately contained on his numerous official releases. However, this is an important addition to his catalog, and one that many of his fanatics will find essential, though it won't do much to convert the casual fan due to the difficult nature of much of the material. Disc one, with live cuts and demos from 1966-67 that include a few songs recorded on Safe as Milk, is certainly the most interesting and accessible of the quintet. Disc two is more shambling and experimental, with its assortment of 1968 live performances. Disc three is for the hardcore: home-recorded (though in okay fidelity) run-throughs of Trout Mask Replica material from 1969, without vocals. Disc four is for the harder core: 12 more minutes of Trout Mask home sessions, plus enhanced-CD live performance footage from 1968-73. CD five is an interesting, erratic assortment of live, radio, demo, and work tape material from 1969-82, fidelity varying from good to poor. The liner notes are exceptionally detailed, with many first-hand quotes by band members and much historical narrative by frequent Magic Band drummer John French. ","torrent":{"xt":"urn:btih:2ea6b5e23468bde8c100056105f5923f4f95026c","amp;dn":"Capt.+Beefheart+-+Grow+Fins%3A+Rarities+%281965-1982%29+1999+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea6b5e23468bde8c100056105f5923f4f95026c","infoHashBuffer":{"type":"Buffer","data":[46,166,181,226,52,104,189,232,193,0,5,97,5,245,146,63,79,149,2,108]},"announce":[],"urlList":[]}}