{"title":"Brasileirinho - Grandes Encontros do Choro","uid":4829280,"size":897673280,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ee7e3d4428e688e0330b0cc79c5f789e57a9fd4&amp;dn=Brasileirinho+-+Grandes+Encontros+do+Choro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"guicampos","files":1,"time":1239068069,"description":"Brasileirinho - Grandes Encontros do Choro (2005)\nThe sound of Rio - Brasileirinho\nDir.: Mika KaurismÃƒÂ¤ki\nÃ‚Â©2005 Switzerland - Finland - Brazil, \n90 minutes, 35mm\n\nBrazilian portuguese with english subs.\n\nVideo: 720x576 Divx\nFrame rate: 25 fps\nData rate: 163 kbps\nAudio: 128 kbps MP3\n\nBrasileirinho is a 90-min musical documentary film about Choro, the first genuinely Brazilian urban music. It was back in the late 19th century in Rio de Janeiro when Brazilian musicians started to blend European melodies, Afro-Brazilian rhythms and the melancholic interpretation of the Brazilian Indians' music to create Choro. Choro is credited as being the first musical expression of Brazil's melting pot and had a prominent place in the development of Brazil's cultural identity. Choro remained a major popular music style until the 1920s, leading directly into Samba and later to Bossa Nova. After a slight decline in popularity, Choro music has made a remarkable comeback over the past few decades.\n\nThe film remembers the history but shows, above all, a colorful picture of Choro's vitality today. The guiding line of the film is the combo &quot;Trio Madeira Brasil&quot; composed of three of Brazil's outstanding Choro musicians. During a &quot;Roda de Choro&quot;, a traditional Brazilian kind of private jam session, the Trio brings up a concert project. During these sessions or at their homes, some of the most interesting Choro musicians play and remember key events in the history of this Brazilian urban music. A look into a Choro workshop with over 450 participants of all ages illustrates the off-hand genuine Brazilian way to play. &quot;Playing&quot; interviews with well-known Samba and Bossa Nova artists like ZezÃƒÂ© Gonzaga, Elza Soares and Guinga illustrate the reciprocal inspiration with Samba and Bossa Nova music. A final show of the &quot;Trio Madeira Brasil&quot; with their guests in one of Rio's traditional music halls show once more the opulence of rhythms and melodies in Choro that has evolved over the past 130 years into a fascinating form of modern tropical sound.","torrent":{"xt":"urn:btih:2ee7e3d4428e688e0330b0cc79c5f789e57a9fd4","amp;dn":"Brasileirinho+-+Grandes+Encontros+do+Choro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ee7e3d4428e688e0330b0cc79c5f789e57a9fd4","infoHashBuffer":{"type":"Buffer","data":[46,231,227,212,66,142,104,142,3,48,176,204,121,197,247,137,229,122,159,212]},"announce":[],"urlList":[]}}