{"title":"Expert Techniques - (Stillwater Fly Fishing)","uid":4481394,"size":4624410671,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2f33eba294265d2edf6a2d363eeec9d9684413c8&amp;dn=Expert+Techniques+-+%28Stillwater+Fly+Fishing%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"6FiRE9","files":152,"time":1225581352,"description":"Expert Techniques - (Stillwater Fly Fishing)\n\nLet Fisheries Biologist and Professional Fly Fisherman Brian Chan show you his time tested methods that catch fish. We combine two very popular elements in this DVD. First we tie 11 flies that fish love and then we use those exact flies out on the lake and catch fish. Also, because Brian Chan is a left handed fly tier, we programmed the DVD so that both Left handed and Right handed fly tiers can easily follow his methods. Brian Chan shows you step-by-step, how to tie 11 favorite stillwater flies that he has been successfully using throughout his career as a fly fisherman. Brian then shows you the techniques he uses to catch fish with those same flies. It&amp;#039;s fascinating even for the experienced fly-fisherman. Not only that, Brian catches the insects his flies immitate and then shows you where to look for the signs or clues that indicate which fly would be a good bet to fish with.\n\nHere&amp;#039;s what&amp;#039;s on the DVD:\n\nBloodworm\nIce Cream Cone Chironomid Pupa ( Kelly Davison Pattern)\nMaroon and Silver Chironomid Pupa\nChromie ( Phil Rowley Pattern)\nLady McConnell ( Adult Chironomid)\nGreen Shrimp\nDamselfly Nymph\nStillwater Caddis Pupa\nMaroon Ruby Eyed Leech\nPeacock Plastic Chenile Leech\nSimple Water Boatman\n\nWe show you step by step how to tie these 11 patterns on beautifully shot video. No guess work, we show you all the steps.\n\nThen we show you how to use them!\n\nIf you&amp;#039;ve ever wished that you could have a professional fisherman coach you on how to fish, this is a DVD you must have. It&amp;#039;s like Brian is standing right there with you showing and explaining to you, the skills that he has successfully used for many years. This DVD will teach you how to become a better fly-fisherman. You will watch the DVD over and over again and still pick up extra knowledge for your next fishing trip.\n\nEnjoy &amp; Please Seed!","torrent":{"xt":"urn:btih:2f33eba294265d2edf6a2d363eeec9d9684413c8","amp;dn":"Expert+Techniques+-+%28Stillwater+Fly+Fishing%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f33eba294265d2edf6a2d363eeec9d9684413c8","infoHashBuffer":{"type":"Buffer","data":[47,51,235,162,148,38,93,46,223,106,45,54,62,238,201,217,104,68,19,200]},"announce":[],"urlList":[]}}