{"title":"Las Alas De La Vida.(Docu.Spanish)","uid":5541991,"size":1165895844,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:2f3b61d2cc9268e0f3dbb6e043f07a5d5c579318&amp;dn=Las+Alas+De+La+Vida.%28Docu.Spanish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cholo24","files":1,"time":1273263049,"description":"Las Alas de la Vida \n\nEn el aÃƒÂ±o 2003, al doctor Carlos Cristos le diagnosticaron una rara enfermedad degenerativa del sistema nervioso, para la que no se conocÃƒÂ­a curaciÃƒÂ³n. El pronÃƒÂ³stico suponÃƒÂ­a pocos aÃƒÂ±os de vida, durante los cuales se producirÃƒÂ­a un deterioro progresivo. Amigo del cineasta Antoni P. Canet, a Cristos se le ocurriÃƒÂ³ la idea de proponerle el rodaje de un documental sobre ese tiempo de vida que le quedaba, con idea de que pudiera servir de ayuda a otras personas, a la hora de afrontar su enfermedad.\n\nValioso film acerca del verdadero significado de vivir y morir dignamente. El documental de Canet nos acerca a la gran calidad humana de Carlos Cristos, que se esfuerza por vivir lo que le queda de vida amorosamente, asumiendo las limitaciones de la enfermedad, afrontÃƒÂ¡ndolas con una sonrisa, en la medida de lo posible. Aparte de la movilidad, que se iba reduciendo, el doctor tenÃƒÂ­a problemas con el habla, algo especialmente duro para ÃƒÂ©l, que habÃƒÂ­a tenido un programa radiofÃƒÂ³nico sobre medicina.\n\nCristos confiesa haber acompaÃƒÂ±ado antes a otros pacientes en su sufrimiento, y que sentÃƒÂ­a como la obligaciÃƒÂ³n de dar testimonio en primera persona, haciendo ver que ese dolor puede ser positivo. El espectador compartirÃƒÂ¡ o no todo lo que dice el protagonista, por ejemplo en las lÃƒÂ­neas de investigaciÃƒÂ³n para luchar contra su enfermedad. Pero resulta imposible no reconocer su enorme coraje. Con su ejemplo, hace toda una pedagogÃƒÂ­a del llamado testamento vital, distinguiendo bien entre lo que es el suicidio y la eutanasia, que rechaza, y lo que supone rehusar tratamientos mÃƒÂ©dicos desproporcionados que prolongan inÃƒÂºtilmente la vida, aplicados en parte por la no-aceptaciÃƒÂ³n de la muerte como un paso natural e inevitable en la existencia de todo hombre. Y hay una muy adecuada descripciÃƒÂ³n de los cuidados paliativos, que pueden eliminar el dolor fÃƒÂ­sico, y que ayudan a sobrellevar el dolor moral de sentirse inÃƒÂºtil, con un cuerpo cuyos mecanismos fisiolÃƒÂ³gicos mÃƒÂ¡s elementales no se pueden controlar.\n\nHay espacio en el film tambiÃƒÂ©n para el amor de los seres queridos, sostÃƒÂ©n de primera magnitud en una situaciÃƒÂ³n como la de Cristos. AllÃƒÂ­ estÃƒÂ¡n su esposa Carmen, tambiÃƒÂ©n mÃƒÂ©dico y guionista del film, su pequeÃƒÂ±a hija, sus padres, su hermano, sus amigos entre los que se cuenta una religiosa, con cuya labor en Ruanda ha colaborado Cristos desinteresadamente. Aunque al principio parece que se eluden cuestiones como la fe y la trascendencia, la esperanza de otra vida, ÃƒÂ©stas tambiÃƒÂ©n acaban surgiendo, como era natural. Cristos dice no creer, al menos no al modo usual, pero admite tener la esperanza de encontrarse con Dios al otro lado del tunel, de entrar en una eternidad cuya naturaleza no se ve capaz de entender, pero que le fascina.\n\nEn un trabajo de este tipo, uno de los peligros a los que se enfrentaba Canet era el respeto a la intimidad de Cristos, no cruzar una frontera que nunca se deberÃƒÂ­a cruzar. Se notan y agradecen la amistad y delicadeza del cineasta para quedarse en el punto justo. Su cÃƒÂ¡mara es testigo de excepciÃƒÂ³n de los ÃƒÂºltimos dÃƒÂ­as de Cristos, pero hay un pudor, una contenciÃƒÂ³n. En algunos momentos en que a Cristos se le saltan las lÃƒÂ¡grimas, no falta esa pregunta, tan humana, &quot;Ã‚Â¿paramos?&quot;, a la que sigue una no menos humana respuesta &quot;no, es bueno que se vean estos momentos de fragilidad&quot;.\n","torrent":{"xt":"urn:btih:2f3b61d2cc9268e0f3dbb6e043f07a5d5c579318","amp;dn":"Las+Alas+De+La+Vida.%28Docu.Spanish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2f3b61d2cc9268e0f3dbb6e043f07a5d5c579318","infoHashBuffer":{"type":"Buffer","data":[47,59,97,210,204,146,104,224,243,219,182,224,67,240,122,93,92,87,147,24]},"announce":[],"urlList":[]}}