{"title":"The Colour of Disease: Syphilis and Racism in South Africa, 1880","uid":8797550,"size":808184,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:2fb4a6de61fe857051ede8c6e89af89d635a6fd4&amp;dn=The+Colour+of+Disease%3A+Syphilis+and+Racism+in+South+Africa%2C+1880&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1376110150,"description":"The Colour of Disease: Syphilis and Racism in South Africa, 1880-1950 \n\n\n|With A special thanks to &quot;wetworx12&quot; - The bitter, racist troll who has inspired this upload. | filetype: pdf |\n\n\n\nPublication Date: July 6, 2001 | ISBN-10: 0333740440 | ISBN-13: 978-0333740446\nToday AIDS dominates the headlines, but a century ago it was fears of syphilis epidemics. This book looks at how the spread of syphilis was linked to socio-economic transformation as land dispossession, migrancy and urbanization disrupted social networks--factors similarly important in the AIDS crisis. Medical explanations of syphilis and state medical policy were also shaped by contemporary beliefs about race. Doctors drew on ideas from social darwinism, eugenics, and social anthropology to explain the incidence of syphilis among poor whites and Africans, and to define &quot;normal&quot; abnormal sexual behavior for racial groups.\n\n\n\nReview\n\n&quot;Highlly recommended for historians of medicine, public health, and Africa and its people in the 19th and 20th centuries. &quot; --Choice\nAbout the Author\nKaren Jochelson taught at the University of York, and then held a Wellcome research fellowship at the Institute of Commonwealth Studies at the University of London. Since completing an MBA at the London Business School she has consulted to business on sustainable development, human rights, biotechnology and stakeholder relations.\n\n\nHardcover: 260 pages\nPublisher: Palgrave Macmillan (July 6, 2001)\nLanguage: English\nISBN-10: 0333740440\nISBN-13: 978-0333740446\n\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Colour-Disease-Syphilis-1880-1950-Antonys/dp/0333740440/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Colour-Disease-Syphilis-1880-1950-Antonys/dp/0333740440/&lt;/a&gt;\n\n\n\n\nTags: race, racism, oppression, South Africa, Boer, apartheid, Afrikaans, Dutch, medicine, health, British, Boer, war, uk, united, kingdom, england, syphilis, Tuskegee, men, medical experimentation, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, experimentation, tuskeegee, unethical, ethics, doctor, medicine, medical, hospital, health, healthcare, illegal, united, states, usa, america, american, disease, disorder, death, unit 731, hirohito, china, chinese, japan, japenese, dachau, belgen bersen, treblinka, auschwitz, josef, mengele,\t","torrent":{"xt":"urn:btih:2fb4a6de61fe857051ede8c6e89af89d635a6fd4","amp;dn":"The+Colour+of+Disease%3A+Syphilis+and+Racism+in+South+Africa%2C+1880","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fb4a6de61fe857051ede8c6e89af89d635a6fd4","infoHashBuffer":{"type":"Buffer","data":[47,180,166,222,97,254,133,112,81,237,232,198,232,154,248,157,99,90,111,212]},"announce":[],"urlList":[]}}