{"title":"The Perfect Stranger (Christian Movie)","uid":4551828,"size":281179338,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2fc58c04a980ae29ba82a11b32e20549c7ce1f80&amp;dn=The+Perfect+Stranger+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"IndianChristian","files":4,"time":1228334656,"description":"The Perfect Stranger (Christian Movie)\n\nA must buy movie for all Christians. Infact I would recommend that Christians buy several copies of this movies and distribute it to friends and foes alike. This movie has to be in the top three of all Christian movies produced ever. \n\nThe movie version of the bestselling novel, &quot;Dinner With a Perfect Stranger&quot; by David Gregory. Capturing the book&amp;#039;s wit, intimacy and desire to enlighten almost line for line, &quot;THE PERFECT STRANGER&quot; is a thought-provoking tale of one woman&amp;#039;s journey through the realms of doubt and disbelief - with the most unforgettable man she would ever meet.\n\nThe plot is simple. A lawyer named Nikki gets a dinner invitation on the night her husband is going to a ball game with his friends. She believes that the invitation is really from her husband who feels bad about leaving her alone on a Friday night, so she accepts. When she arrives at the resteraunt she finds instead someone she has never seen before, a man, well dressed, who claims to be Jesus Christ. At first she thinks it&amp;#039;s a joke and wants to leave, but hey, why give up a free meal? She goes along with his story that he is Jesus Christ and proceeds to ask him questions about everything she can think of from various religions to the creation of the universe. What follows is one of the most interesting conversations put on film.\n\nLanguage: English\nSubtitles: None\nRun Time: 74 minutes\nMy Rating: 10/10\nQuality: 8.5/10 \n\nIf financially possible, please buy this CD/DVD to keep Christian films in business. If Christians won&amp;#039;t buy Christian films then who will?\n\nPlease seed. Let each one of us who call ourself Christians seed 2-3 movies each. So that these movies may become a blessing to all those who are hungry for God&amp;#039;s word &amp; grace. May Jesus bless all those who are seeding the christian torrents.\n\n&quot;Don&amp;#039;t ask me what Christ can do for you! \nHe has done all he could. \nTell me what you can do for Christ?&quot;\n\nUploaded by Indian Christian\n","torrent":{"xt":"urn:btih:2fc58c04a980ae29ba82a11b32e20549c7ce1f80","amp;dn":"The+Perfect+Stranger+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2fc58c04a980ae29ba82a11b32e20549c7ce1f80","infoHashBuffer":{"type":"Buffer","data":[47,197,140,4,169,128,174,41,186,130,161,27,50,226,5,73,199,206,31,128]},"announce":[],"urlList":[]}}