{"title":"The Training Of O 2007 Jade Marxxx Day 1-4 4753 4754 4755 4756","uid":11741796,"size":12072796029,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:3018e001717da115d50e58d906b80843ae56ed65&amp;dn=The+Training+Of+O+2007+Jade+Marxxx+Day+1-4+4753+4754+4755+4756&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"merzedes","files":12,"time":1425842917,"description":"\nThe Training Of O Jade Marxx Day 1-4 Complete\n\n\nMed and HD WMV and HD MP4.\n\n\nThe Training of Jade Marxxx, Day One\n\nSep 28, 2007 - Performers: Jade Marxxx \n\n\nJade Marxxx makes her way into The Program and finds herself tied up, blindfolded and transported to the Armory in the back of the company truck along with all the other equipment. She is taken inside, tied to the interview chair and grilled on her reasons for wanting to be trained while her cunt is vibrated. She begs, squirms and cums over and over while being slapped, choked and whipped until she finally divulges enough personal information to formulate the week's training goals. \n\nHer cunt is painfully clamped to the platform to teach her to present herself, keep her cunt open and available, and maintain position through a whipping. Reactions are tested and notes are made. \n\nShe is then rigged to test her cocksucking skills and the depth and tightness of her now dripping wet cunt. She cums hard again with the hard cock deep in her cunt then is afforded the opportunity to show her appreciation by sucking off the cock and wearing the cum on her face and tits. \n\nAfter a long day she is shuttled to her quarters where she is assigned homework, placed under curfew, and kept for the week.\n\n\nThe Training of Jade Marxxx, Day Two\n\nOct 26, 2007 - Performers: Jade Marxxx  and  Princess Donna Dolore \n\n\nTraining Report \n\nTraining Goals: \n-Orgasm control \n-Leash training \n-Cock sucking \n-Pussy eating \n-Slave positions \n-Speech training \n\nRecommendations: \n\nPut her on a leash and invite Princess Donna to teach her to walk like a lady. \n\nTeach her that she is tougher than she thinks she is by putting her in stress positions till failure.  \n\nReview her homework while Princess Donna whips, spanks and vibrates her, all the time taunting her about rewards and begging. \n\nAllow her to crawl to a filthy bathroom to stall to suck off Princess Donna's pussy while under the whip. \n\nInvade her quarters in the middle of the night to invade her privacy and give her a thorough fucking and sloppy facial.  \n\n\nThe Training of Jade Marxxx, Day Three\n\nNov 23, 2007 - Performers: Jade Marxxx  and  Mark Davis \n\n\nTraining Report \n\nTraining Goals Progress: \n\n-Orgasm control: Trainee has learned to ask for them and stop sneaking them in. \n-Leash training: Much improved. \n-Cock sucking: Still is not deep-throating, more work required here \n-Pussy eating: Loves to eat pussy, and learned to do it under a whip \n-Slave positions: Much improved in maintaining position \n-Speech training: Has learned some basics \n\nRecommendations: Review the work to date, then blindfold her and turn her over to Mark Davis for further lessons in controlling her greedy cunt. \n\nTie her securely and have Mr. Davis continue her lessons in deep throating cock. She needs to get his cock all the way in her slut throat to succeed. \n\nMake sure she is roughly fucked and has many orgasms before cumming on her face and sending her back to her quarters for the night.  \n\n\nThe Training of Jade Marxxx, Day Four\n\nDec 28, 2007 - Performers: Claire Adams  and  Jade Marxxx \n\n\nTraining Report, Final Day \n\nGoals Review \n\n-Orgasm Control: She is much improved, although I bet she still sneaks the occasional O. \n-Leash Training:  Learned the hard way how to crawl on a leash. She has earned the right to wear one. \n-Cock Sucking: She can take it all the way down her throat. \n-Pussy Eating: Good reports from the Donna and Claire. \n-Slave Positions: It is a beautiful sight to see her move through positions and maintain an eye line. \n-Speech Training: Yes Sir, No Sir, Thank you Sir - what else is needed? \n\nFinal Lessons: Her comfort is secondary to her dominant's amusement. \n\nShe is capable of more than she thinks she is. \n\nMaintain composure at all cost. \n\nObedience is central to submission. \n\nMiss Marxxx is in a fragile state at this point. She has been searching for a deeper understanding of the things she does, and we have opened her eyes to her own inner workings and what is possible in the sea of submission. She enjoys being scared and giving over control, and this training has allowed her to safely experience some of that. She now leaves us with a deeper understanding of what BDSM may hold for her. Congratulations Miss Marxx, you have truly graduated.  \n\nScreens &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4753&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4753&lt;/a&gt; &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4754&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4754&lt;/a&gt; &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4755&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4755&lt;/a&gt; &lt;a href=&quot;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4756&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.thetrainingofo.com/site/shoot.jsp?shootId=4756&lt;/a&gt;\n\nUploaded by Merzedes and Shallow2\n\n16 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\n\nJust keep on leaving us the nice comments below and we are happy :)\n\nAny Questions ?? Read our FAQ!!\n  \n &lt;a href=&quot;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg&lt;/a&gt;\n\nCheers  :-)","torrent":{"xt":"urn:btih:3018e001717da115d50e58d906b80843ae56ed65","amp;dn":"The+Training+Of+O+2007+Jade+Marxxx+Day+1-4+4753+4754+4755+4756","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3018e001717da115d50e58d906b80843ae56ed65","infoHashBuffer":{"type":"Buffer","data":[48,24,224,1,113,125,161,21,213,14,88,217,6,184,8,67,174,86,237,101]},"announce":[],"urlList":[]}}