{"title":"Righteous Victims: A History of the Zionist-Arab Conflict...","uid":10076309,"size":3722832,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:30388873cd5d5de0f84f1dfe4716440587b4eb41&amp;dn=Righteous+Victims%3A+A+History+of+the+Zionist-Arab+Conflict...&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1398923982,"description":"\n...1881-2001 by Benny Morris\n\n\nAt a time when the Middle East has come closer to achieving peace than ever before, eminent Israeli historian Benny Morris explodes the myths cherished by both sides to present an epic history of Zionist-Arab relations over the past 120 years.\nTracing the roots of political Zionism back to the pogroms of Russia and the Dreyfus Affair, Morris describes the gradual influx of Jewish settlers into Palestine and the impact they had on the Arab population. \n\nFollowing the Holocaust, the first Arab-Israeli war of 1948 resulted in the establishment of the State of Israel, but it also shattered Palestinian Arab society and gave rise to a massive refugee problem. Morris offers distinctive accounts of each of the subsequent Israeli-Arab wars and details the sporadic peace efforts in between, culminating in the peace process initiated by the Rabin Government. \n\nIn a new afterword to the Vintage edition, he examines Ehud Baraks leadership, the death of President Assad of Syria, and Israels withdrawal from Lebanon, and the recent renewed conflict with the Palestinians. Studded with illuminating portraits of the major protagonists, Righteous Victims provides an authoritative record of the middle east and its continuing struggle toward peace.\n\nGenre: Non Fiction, History","torrent":{"xt":"urn:btih:30388873cd5d5de0f84f1dfe4716440587b4eb41","amp;dn":"Righteous+Victims%3A+A+History+of+the+Zionist-Arab+Conflict...","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"30388873cd5d5de0f84f1dfe4716440587b4eb41","infoHashBuffer":{"type":"Buffer","data":[48,56,136,115,205,93,93,224,248,79,29,254,71,22,68,5,135,180,235,65]},"announce":[],"urlList":[]}}