{"title":"Armstrong-The Zionists(roots of zionism)(1950)","uid":4627049,"size":525822,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:306a6ee0105816665fcfa25eb609f94838efc13a&amp;dn=Armstrong-The+Zionists%28roots+of+zionism%29%281950%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1231254246,"description":"This is George Washington Armstrong's shocking book The Zionists (1950) which exposes the roots of Zionism, their financial backers, political organizations, historic global plan and rasistic guiding philosophy. The Zionists of Wall Street are the financial backers of the Zionism of the world and of the Zionist state of Israel. Their names can be found among the heads of the Zionist political organizations. Over 50 years ago they successfully conspired to create the state of Israel and as this fascinating book reveals, they had to bring about two world wars for that purpose. Following the Talmudic doctrine to the point, their motives are greed and power as they seek to acquire the wealth of the world and to enslave the gentiles. As Aryan Nazis before them they claim that they and only they are &quot;God's chosen people&quot; and that he himself promised them that they should rule the world. It is this secret wish that motivates them to destroy all gentiles and all governments that interfere with their plans. Because wars and depressions are necessary to accomplish these purposes, we at the end do have wars and depressions. The Zionists discusess a wide range of topics from armistice of World War I, Theodore Herzl's plan for an Israeli state, Roosevelt's and Truman's pro-Zionist policy to Zionist victory at Nuremberg trial, the non-persecution of Jewish war criminals and creation of United Nations as a major stepping stone towards their global goals. 130 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:306a6ee0105816665fcfa25eb609f94838efc13a","amp;dn":"Armstrong-The+Zionists%28roots+of+zionism%29%281950%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"306a6ee0105816665fcfa25eb609f94838efc13a","infoHashBuffer":{"type":"Buffer","data":[48,106,110,224,16,88,22,102,95,207,162,94,182,9,249,72,56,239,193,58]},"announce":[],"urlList":[]}}