{"title":"The Cooper Temple Clause - Make This Your Own &amp; Kick Up the Fire","uid":4939641,"size":191613247,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:307082b67e9cfcf647f1cf2c31876259f790e541&amp;dn=The+Cooper+Temple+Clause+-+Make+This+Your+Own+%26+Kick+Up+the+Fire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"tweekins","files":24,"time":1244399046,"description":"This torrent contains the second and third albums from The Cooper Temple Clause.\n\nAllMusic Band Biography:\nFormed in Reading, England, in the late '90s by Ben Gautrey (vocals), Tom Bellamy (guitar, synthesizer, bass), Dan Fisher (bass, guitar), Didz (bass), Kieran Mahon (keyboards), and Jon Harper (drums), the Cooper Temple Clause bring forth an original and powerful compound of alternative rock. Riding across different styles such as post-grunge or punk, the Cooper Temple Clause present an exciting and artful kind of hard rock. Assembled out of several local bands, the squad swiftly started conquering its own fan base after their first live shows. In 2000, the group signed a deal with RCA Records, opening the road for the release of their debut record. By the end of 2001, the group offered its first disc, the EP Hardware/Warfare. Entering an extensive tour shortly afterward, the crew also started being recognized by the British alternative scene. Following the tour, the band issued yet another winning single, Film Maker/Been Training Dogs, that quickly ascended to the top spot of the major U.K. chart. In February 2002, the Cooper Temple Clause delivered its debut album, See This Through and Leave, solidly reaffirming their notability, by then not only in the U.K but also in the rest of Europe. One year later, the band earned wide international distribution with Kick Up the Fire, And Let the Flames Break Loose. ","torrent":{"xt":"urn:btih:307082b67e9cfcf647f1cf2c31876259f790e541","amp;dn":"The+Cooper+Temple+Clause+-+Make+This+Your+Own+%26+Kick+Up+the+Fire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"307082b67e9cfcf647f1cf2c31876259f790e541","infoHashBuffer":{"type":"Buffer","data":[48,112,130,182,126,156,252,246,71,241,207,44,49,135,98,89,247,144,229,65]},"announce":[],"urlList":[]}}