{"title":"brainwave mind voyages (series 28) the awakened mind brain patte","uid":4168610,"size":369618257,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:31f7d654de84bad013f250147f33856e8f2aa76c&amp;dn=brainwave+mind+voyages+%28series+28%29+the+awakened+mind+brain+patte&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Tomeck","files":3,"time":1209740729,"description":"Brainwave Mind Voyages XXVIII - The Awakened Mind Brain Pattern [FLAC]\n\nBrainwave Mind Voyages (Series 28) The Awakened Mind Brain Pattern (BMV Entrainment)\n\nPosted by eurotrash \n\nDescription:\n\nSERIES 28: AWAKENED MIND BRAINWAVE PATTERN CD\nBRAINWAVE ENTRAINMENT - VIBRATIONAL SOUND THERAPY\n\n\nCD Tracks include: (Cover Image) (Disc Image)\n\n1. Awakened Mind Waves Session\n2. Awakened Mind Soundscape Session\n3. Awakened Mind Pure Tones Session\n\n*Roughly 60 minutes of Psychoacoustic Audio\n\nCD Description:\n\nThis BMV CD contains three powerful brainwave entrainment sessions that are specifically engineered to tune your brainwaves to the AWAKENED MIND BRAINWAVE PATTERN. This complex combination of brainwave ranges (alpha, theta, delta) will take your consciousness to the next level.\n\nYou can experience the same brainwave activity as monitored from experienced meditators, Buddhist monks, mystics, healers and other masters who experience this specific pattern state of enlightened awareness. It is an amazingly powerful collection of brainwave sessions.\n\nWhen you experience the BMV Series 28: The Awakened Mind Brainwave Pattern CD, your mind will naturally float inwards and your consciousness will expand as you listen to the soothing sounds of nature or simply the tones.\n\nYour awareness will become free to explore new states of clarity and new modes of perception as you experience the effects of the embedded brainwave entrainment technology. Your conscious awareness will become free to take flight into your mind&amp;#039;s eye.\n\nYou will explore new depths as the embedded brainwave entrainment ensures that you will enter the ideal brainwave range for maximizing your inner explorations.\n\nThis BMV CD is an excellent audio tool for biofeedback training and consciousness development.\n\nThe BMV Series 28: The Awakened Mind Brainwave Pattern CD contains no guided vocals (*no spoken words) so it can be used for any meditational purposes or simply as a tool for experiencing profound states of relaxation. You can repeat your favorite track or loop the entire psychoacoustic CD for amazing results!\n\nEvery time you use this CD, you will become more and more relaxed. With time and practice, you can learn to access these profound states of awareness at will. In the meanwhile, you can be assured that your brainwaves will be tuned to the correct frequency ranges to maximize your results.\n\nAs the hypnotic wrap-around sounds create a 3-D atmosphere in your mind&amp;#039;s eye, you will become more and more relaxed. This psychoacoustic voyage also contains our new Autonomic Audio-Pacing Technology? (AAPT). You will hear the sounds of heartbeats and controlled breathing patterns floating in the distance.\n\nThe heart rate and breathing cycle on the CD continually slows down at specific rates. Experienced meditators whose bodily functions were monitored using Biofeedback Equipment (EEG/EKG/GSR) show the exact same lowered rates of heartbeat and breathing. The same decreased rates that you will experience when you listen to this CD!\n\nAs the pacing slows down even more, you will see yourself slowing down too. Deeper and deeper, you go. Your heart rate and your breathing cycle naturally slows down even more to mirror the rhythm of this powerful progressive relaxation.\n\nBy simply listening to this CD for 10 minutes or less, your physical body will be so relaxed that you will ready for any type of inner work: meditation, creativity, reverie, problem solving, brainstorming, trancework and more.\n\nOver time, you can learn to achieve this state of ultra-deep physical relaxation, naturally and instantaneously.\n\nThe brainwave entrainment technology on this CD ensures your success. Like the magical beat of a shaman&amp;#039;s drum, the embedded brainwave entrainment frequencies slow down your brainwaves to induce deeply expanded states of consciousness.\n\nThe brainwave stimulation techniques are based upon EEG readings of brainwave activity experienced by experienced meditators, Buddhist monks, healers and other adepts.\n\nYou now have the physical relaxation AND the required brainwave activity to complete the process.\n\nNow, you can experience these powerful brainwave patterns, simply by listening to this BMV CD!\n\nUSING BRAINWAVE ENTRAINMENT TECHNOLOGY TO TUNE YOUR BRAINWAVES TO SPECIFIC FREQUENCIES!\n\nTHIS BMV CD CONTAINS:\n\n* Brainwave Entrainment Technology\n*\nAdvanced Brainwave Training\n*\nMulti-channel binaural beats/binaural beat frequencies\n*\nMonophonic brainwave entrainment tones - New BMV entrainment technique that works without the use of headphones!\n*\nAutonomic Audio Pacing Technology? (AAPT) - Only found on BMV CDs!\n*\nCutting-Edge Vibrational Sound Therapy\n* 3D Psychoacoustic Soundscapes","torrent":{"xt":"urn:btih:31f7d654de84bad013f250147f33856e8f2aa76c","amp;dn":"brainwave+mind+voyages+%28series+28%29+the+awakened+mind+brain+patte","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f7d654de84bad013f250147f33856e8f2aa76c","infoHashBuffer":{"type":"Buffer","data":[49,247,214,84,222,132,186,208,19,242,80,20,127,51,133,110,143,42,167,108]},"announce":[],"urlList":[]}}