{"title":"The Book of Eibon by Robert Price","uid":9720182,"size":6707671,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:32300b174d86f038016a978589e838104c6c7d49&amp;dn=The+Book+of+Eibon+by+Robert+Price&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1394221396,"description":"\nIn the first real post from Dr. Evil's House of Pancakes, I present the Book of Eibon, the creation of Clark Ashton Smith, which ranks behind Lovecraft's Necronomicon as a shunned repository of mystical horrors surviving blasphemously from elder eons. \n\nTales of lore tell of the Book of Eibon, a tome so ancient that it was originally written in the Hyperborean language of Tsath-Yo, long before Atlantis was born from the sea. It goes by dozens of names and predates even the Necronomicon and Unaussprechlichen Kulten.\n\nNot content with his own and Lovecraft's citations of the Book, Clark Ashton Smith actually wrote two chapters of it, his famous stories &quot;The Door to Saturn&quot; and &quot;The Coming of the White Worm.&quot; Lin Carter knew a good thing when he saw it and decided it would be fun to write and to read the remaining Eibonic chapters. \n\nSo he took in hand to write a number of them, intending to finish the book one day. Robert Price, Richard Tierney, Joseph Pulver, and a number of other authors have helped complete the text, resulting in a tome that reveals all the secrets of the Cthulhu Mythos, from the history of the first alien races to come to Earth, to the histories of the Elder Magi of Hyperborea, and the and the story of Eibon's life and death.\n\nGenre: Horror","torrent":{"xt":"urn:btih:32300b174d86f038016a978589e838104c6c7d49","amp;dn":"The+Book+of+Eibon+by+Robert+Price","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"32300b174d86f038016a978589e838104c6c7d49","infoHashBuffer":{"type":"Buffer","data":[50,48,11,23,77,134,240,56,1,106,151,133,137,232,56,16,76,108,125,73]},"announce":[],"urlList":[]}}