{"title":"Rome's Saxon Shore: Coastal Defences of Roman Britain, AD 250-50","uid":11865983,"size":14949404,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:342603b24861974eca53f03307063a5838d47ded&amp;dn=Rome%27s+Saxon+Shore%3A+Coastal+Defences+of+Roman+Britain%2C+AD+250-50&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"HowdyDooDoo","files":1,"time":1430349930,"description":"Although the exact dates of construction of the so-called Saxon Shore forts are uncertain, the development of the frontier system that ran form the Wash to the Solent on the south-east coast of Roman Britain was spread over at least a century and a half. Many of the new forts were notable for the superior strength of their defences, with thicker stone walls bristling with projecting curved bastions. These and other features were clearly designed to them more difficult to storm than old-style frontier forts with their classic playing-card shape and internal towers. Defense earlier in the Roman era had meant aggressive response in the open field or even offensive pre-emptive strikes into enemy territory. The new trend was to build stronger, the emphasis being on solid, more static defense, anticipating attack and absorbing it rather than going out to meet it. Most of the major harbours and estuaries of the east and south-east coasts of Britain were fortified in this manner. There was a similar series of military installations across the Channel in Gaul, extending along the northern coast as far as what is now Brittany.\n\nWhatever their precise tactical and strategic function, a continuing debate to which this book contributes, the construction of these stone forts represented a huge outlay of money, and commitment of manpower and materials. The Saxon Shore Forts are among the most impressive surviving monuments of Roman Britain. This book addresses a number ofthe fascinating questions they provoke - Who built these Forts? When and for what purposes? How were they built? How did they operate? Who garrisoned them, and for how long?","torrent":{"xt":"urn:btih:342603b24861974eca53f03307063a5838d47ded","amp;dn":"Rome%27s+Saxon+Shore%3A+Coastal+Defences+of+Roman+Britain%2C+AD+250-50","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"342603b24861974eca53f03307063a5838d47ded","infoHashBuffer":{"type":"Buffer","data":[52,38,3,178,72,97,151,78,202,83,240,51,7,6,58,88,56,212,125,237]},"announce":[],"urlList":[]}}