{"title":"Viudas [DVDRip-mp3][Spanish-Argentina]","uid":6842993,"size":735748096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:344f16786f94967c04a60008ee3117ba7089177f&amp;dn=Viudas+%5BDVDRip-mp3%5D%5BSpanish-Argentina%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"traperoyo","files":-1,"time":1322230707,"description":"TITULO: Viudas\n\nTITULO ORIGINAL: Viudas\n\nANO:  2011\n\t\nDURACION:  100 min.\n\nPAIS: Argentina\n\nDIRECTOR: Marcos Carnevale\n\nREPARTO:  Graciela Borges, Valeria Bertuccelli, Rita Cortese, MartÃƒÂ­n Bossi\n\nGENERO: Comedia. Drama\n\nSINOPSIS: Elena (Graciela Borges) es una reconocida directora de documentales, felizmente casada con Augusto, un mÃƒÂºsico de su misma edad, con quien no tuvo hijos. Una maÃƒÂ±ana Elena recibe un llamado anÃƒÂ³nimo: Augusto se descompuso y estÃƒÂ¡ en el hospital. En el sanatorio y acompaÃƒÂ±ada por su amiga y asistente Esther (Rita Cortese), Elena descubre que quien trae a Augusto es Adela (Valeria Bertuccelli), una joven de treinta aÃƒÂ±os, que resulta ser su amante. Elena no sÃƒÂ³lo tiene que soportar semejante revelaciÃƒÂ³n. Al borde de la muerte, su marido le pide que cuide de la joven. Elena atraviesa el duelo con furia y dolor. A los pocos dÃƒÂ­as del fallecimiento, Adela aparece en su casa, intentando un acercamiento que Elena inicialmente rechaza. Desesperada, Adela intenta suicidarse, pero sobrevive. Elena, acorralada por su promesa, decide llevarla a vivir con ella hasta que la chica se recupere. La diferencia de sus personalidades, de su manera de vivir el duelo y la forzada convivencia las enfrenta una y otra vez. A su pesar, les toca atravesar juntas el dolor de la pÃƒÂ©rdida y aprender a vincularse, no solo como las viudas del mismo hombre, sino tambiÃƒÂ©n, como las dos grandes mujeres que son.","torrent":{"xt":"urn:btih:344f16786f94967c04a60008ee3117ba7089177f","amp;dn":"Viudas+%5BDVDRip-mp3%5D%5BSpanish-Argentina%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"344f16786f94967c04a60008ee3117ba7089177f","infoHashBuffer":{"type":"Buffer","data":[52,79,22,120,111,148,150,124,4,166,0,8,238,49,23,186,112,137,23,127]},"announce":[],"urlList":[]}}