{"title":"Knocking on Heaven's Door (audiobook) - Katy Butler 2013","uid":9147283,"size":452730880,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:345254ca1318479d5361150b58c4484aff4bea3b&amp;dn=Knocking+on+Heaven%27s+Door+%28audiobook%29+-+Katy+Butler+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":32,"time":1383613989,"description":"\nKnocking on Heaven's Door: The Path to a Better Way of Death (Audiobook) By Katy Butler, read by the author\nUnabridged edition 2013 | 10 hours and 27 minutes | ISBN: n/a , ASIN: B00EVXAZAM | MP3 96 kbps | 454 MB\n\nLike so many of us, award-winning writer Katy Butler always assumed her aging parents would experience healthy, active retirements before dying peacefully at home. Then her father suffered a stroke that left him incapable of easily finishing a sentence or showering without assistance. Her mother was thrust into full-time caregiving, and Katy became one of the 24 million Americans who help care for aging parents. In an effort to correct a minor and non - life threatening heart arrhythmia, doctors outfitted her father with a pacemaker. The device kept his heart beating but did nothing to prevent his slide into dementia, incontinence, near-muteness, and misery. After several years, he asked his wife for help, telling her, &quot;I am living too long.&quot;\n\n\nMother and daughter faced a series of wrenching moral questions: When does death cease being a curse and become a blessing? Where is the line between saving life and prolonging a dying? When is the right time to say to a doctor, &quot;Let my loved one go?&quot;\nWhen doctors refused to disable the pace-maker, sentencing her father to a protracted and agonizing death, Katy set out to understand why. Her quest had barely begun when her mother faced her own illness, rebelled against her doctors, refused open-heart surgery, and instead met death head-on. Knocking on Heaven's Door, a revolutionary blend of memoir and investigative reporting, is the fruit of the Butler family's journey.\nWith a reporter's skill, a poet's eye, and a daughter's love, Butler explores what happens when our terror of death collides with the technological imperatives of modern medicine. Her provocative thesis is that advanced medicine, in its single-minded pursuit of maximum longevity, often creates more suffering than it prevents. Butler lays bare the tangled web of technology, medicine, and commerce that modern dying has become and chronicles the rise of Slow Medicine - a growing movement that promotes care over cure. ","torrent":{"xt":"urn:btih:345254ca1318479d5361150b58c4484aff4bea3b","amp;dn":"Knocking+on+Heaven%27s+Door+%28audiobook%29+-+Katy+Butler+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"345254ca1318479d5361150b58c4484aff4bea3b","infoHashBuffer":{"type":"Buffer","data":[52,82,84,202,19,24,71,157,83,97,21,11,88,196,72,74,255,75,234,59]},"announce":[],"urlList":[]}}