{"title":"Evolusi.KL.Drift.[2008].DVDRip.XVID.(malaysia movie)","uid":4250005,"size":734429184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:34659bdd5ec7267de5cc76bff726306358e28d40&amp;dn=Evolusi.KL.Drift.%5B2008%5D.DVDRip.XVID.%28malaysia+movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dal4741","files":1,"time":1213966875,"description":"Sinopsis: Evolusi KL Drift\n\nZack dan Sham adalah dua nama yang sinonim dengan istilah keakraban. Hubungan sebagai dua sahabat karib yang sama-sama berkongsi hobi dan minat dalam perlumbaan kereta `driftÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½. Kelazimannya bidang perlumbaan kereta `driftÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ didominasi oleh golongan maskulin tetapi ianya tidak menghalang Fasha, teman wanita Zack untuk memecahkan monopoli itu dan menjadikannya sebagai satu hobi yang dikira `daringÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ dan agresif. Diari kehidupan Fasha di masa lampau agak mengecewakan kerana pernah menjalani kehidupan yang mengkhayalkan akibat daripada pengaruh yang negatif.\n\n\n\nRentetan daripada sejarah kehidupan Fasha yang telah mengakibatkan krisis identitinya mendorong Zack lebih bersikap protektif terhadap pergaulan Fasha. Perjalanan kehidupan Fasha telah dikongkong bagi menghalangnya daripada bergaul semula dengan golongan yang pernah menjerumuskan Fasha ke lembah yang tidak sihat.\n\nDalam mengharungi pergolakan hubungan antara Zack dan Fasha secara tidak langsung Sham telah bertindak sebagai orang tengah dalam menyelesaikan dilema yang melanda mereka berdua.\n\n\n\nDalam kesibukan melegakan pergolakan Zack dan Fasha, rupa-rupanya dalam diam dan tanpa disedari telah lahir bibit-bibit cinta dalam diri Sham terhadap Fasha. Namun perasaan itu terpaksa diketepikan kerana tidak mahu merosakkan hubungan akrabnya dengan Zack. Di sebalik kekalutan ini, Joe dan Karl merasa tercabar apabila kegiatan mereka dalam menjerumuskan anak-anak muda yang meminati bidang lumba kereta `driftÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ ke alam yang mengkhayalkan dihalang oleh Zack dan rakan-rakannya.\n\n\n\nMaka bagi menyelesaikan masalah yang timbul antara Zack dan Joe mereka yelah membuat keputusan untuk berlumba kereta yang dianggap sebagai satu ekspresi bagi melepaskan keegoan masing-masing. Sementara itu hubungan Sham dan Fasha semakin intim. Perasaan Zack yang menyedari hubungan ini mula bergolak. Keadaan menjadi lebih kalut apabila Zack dikejutkan dengan satu tragedi menimpa rakannya angkara Joe dan Karl\n\n\n\nDirected by :Syamsul Yusof\n\nStarring : Fasha Sandha, Farid Kamil, Syamsul Yusof, Diana Danielle, Aaron Aziz, Ikram Dinzly\n\nDistributed by : Skop Productions Sdn Bhd, Grand Brilliance Sdn Bhd\n\n\nCredit to jiwang torent","torrent":{"xt":"urn:btih:34659bdd5ec7267de5cc76bff726306358e28d40","amp;dn":"Evolusi.KL.Drift.%5B2008%5D.DVDRip.XVID.%28malaysia+movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34659bdd5ec7267de5cc76bff726306358e28d40","infoHashBuffer":{"type":"Buffer","data":[52,101,155,221,94,199,38,125,229,204,118,191,247,38,48,99,88,226,141,64]},"announce":[],"urlList":[]}}