{"title":"Blind Lemon Jefferson - King Of The Country Blues","uid":9501326,"size":166440238,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:348d4e82cb5076d373cb17cb117037ca2dd875a9&amp;dn=Blind+Lemon+Jefferson+-+King+Of+The+Country+Blues&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1390236171,"description":"mp3 320\n\n\n\nAfter proclaiming Charlie Patton Founder, and eventually King of the Delta Blues, the experts at Yazoo declared Blind Lemon Jefferson King of the Country Blues. A weighty claim considering their own catalog of early American acoustic blues would eventually include titles by Skip James, Blind Willie Johnson, and Mississippi John Hurt (as well as the exceptional Patton sets). The detailed liner notes by Stephen Calt, however -- along with the 23 performances on this disc -- make a rather convincing argument. In his heyday, few could rival Jefferson for sheer record sales or musical artistry. He was quite simply an inimitable guitarist who resided outside the Texas blues tradition he was born into. At its most impressive, his style was a complex combination of chords and patterns that seemed almost freely deployed behind his rich tenor. His tendency to string contrasting figures end to end (rather than on top of each other, in the more common, syncopated style) can be heard here on &quot;That Crawlin' Baby Blues,&quot; &quot;Matchbox Blues,&quot; and &quot;Rabbit Foot Blues,&quot; among others. Heralded as classic country blues by fans, such material earned Jefferson a great deal of criticism from his musical contemporaries who felt his style was rhythmically inconsistent. Not everything present here is as stunning as the sides mentioned above, yet even when Jefferson relies on convention (&quot;He Arose From the Dead,&quot; &quot;Beggin' Back&quot;), he remained the equal of his fellow bluesmen. Though Document Records have given Jefferson their complete recorded works treatment on four CDs, King of the Country Blues provides a much needed, single-disc primer of this blues great.\n","torrent":{"xt":"urn:btih:348d4e82cb5076d373cb17cb117037ca2dd875a9","amp;dn":"Blind+Lemon+Jefferson+-+King+Of+The+Country+Blues","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348d4e82cb5076d373cb17cb117037ca2dd875a9","infoHashBuffer":{"type":"Buffer","data":[52,141,78,130,203,80,118,211,115,203,23,203,17,112,55,202,45,216,117,169]},"announce":[],"urlList":[]}}