{"title":"Scary Monsters and Super Creeps - Dom Joly","uid":10735227,"size":703163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:348f79ba4888f4a44fa102408dbebd25cbf5cd88&amp;dn=Scary+Monsters+and+Super+Creeps+-+Dom+Joly&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ZamKhan","files":-1,"time":1407687319,"description":"Dom Joly sets off round the world again, but this time he's not looking to holiday in a danger zone - he's monster hunting.\n\nEver since he was given a copy of Arthur C. Clarke's Mysterious World for his ninth birthday Dom has been obsessed with the world of cryptozoology (monster hunting), and in Scary Monsters and Super Creeps he heads to six completely different destinations to investigate local monster sightings. He explores the Redwood Curtain in northern California in search of Sasquatch; in Canada he visits Lake Okanagan hoping to catch a glimpse of a thirty-foot snake-like creature called Ogopogo; and near Lake Tele in Congo he risks his life tracking the vegetarian sauropod Mokele-mbembe. Naturally he heads to Loch Ness - but for this hunt he has his family in tow; he treks across the Khumbu Valley in Nepal looking for Yeti; and in the hills above Hiroshima in Japan he enlists the help of a local man to find the Hibagon, a terribly smelly 'caveman ape'. In typically hilarious and irreverent fashion, Dom explores the cultures that gave rise to these monster myths and ends up in some pretty hairy situations with people even stranger than the monsters they are hunting. Are the monsters all the product of fevered minds, or is there a sliver of truth somewhere in the madness? Either way, the search gives Dom an excuse to dive into six fascinating destinations on a gloriously nutty adventure.","torrent":{"xt":"urn:btih:348f79ba4888f4a44fa102408dbebd25cbf5cd88","amp;dn":"Scary+Monsters+and+Super+Creeps+-+Dom+Joly","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"348f79ba4888f4a44fa102408dbebd25cbf5cd88","infoHashBuffer":{"type":"Buffer","data":[52,143,121,186,72,136,244,164,79,161,2,64,141,190,189,37,203,245,205,136]},"announce":[],"urlList":[]}}