{"title":"The Rolling Stones - The Rolling Stones, Now! (1965) WMA320","uid":6301588,"size":88279169,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:353f226c63e614ffbc135366a434072a035dc624&amp;dn=The+Rolling+Stones+-+The+Rolling+Stones%2C+Now%21+%281965%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1302169789,"description":"With the release of the remastered super audio CDs (SACD) of the Stones ABCKO catalog (which includes all the early Decca/London material), there is now some confusion as they have released some of the early albums in both US and UK versions.\nThe Rolling Stones, Now! was released on Feb 12, 1965 only in the U.S. on London Records. It was never released in the U.K., so there is no UK version on CD. This album was to be the American substitute for the UK release of The Rolling Stones No. 2. As was common at the time, the American execs tampered with the original design of the album, substituting the new American hit Heart of Stone for Time Is On My Side and eliminating Grown Up Wrong, Under The Boardwalk, I Can't Be Satisfied, and Suzie-Q. The tracks Mona, Oh Baby, Little Red Rooster, and Surprise Surprise were not on the UK release of No. 2, although Little Red Rooster was released as a single and became one of their signature songs in the UK. \n\nMore than any other Stones release, Now! showcases the original blues band that Brian was always so proud of. The way I heard the story, Brain used to play tracks from this era to show how good the band was before Mick and Keith took over. These included Down The Road Apiece, Little Red Rooster, Everybody Needs Somebody To Love, Bright Lights Big City, Down In The Bottom, &amp; Road Runner (the 1st 3 of which are on Now!, the others were never released - except on bootlegs). Personally, I think Down The Road Apiece is the absolute best song they recorded during this period. The Band absolutely cooks on this one. It's what their early reputation was built on and it's what has sustained them for 40 years.....underneath all the hype, fame, and history, they are a really great band.\n\nTo understand the impact Mick had on the British scene, all you have to do is listen to Everybody Needs Somebody To Love. His command is impressive and this is really the first time you get to glimpse the superstar he was to become. Little Red Rooster deserves some commentary too....it became a big hit for them in the UK (where the blues were appreciated more than in America). They later did a better version with an old friend named Eric Clapton who used to alternate with Mick as singer in their early days in Richmond and Eel Pie Island (it's on the Flashpoint CD). You Can't Catch Me is a great tribute to Berry, personally I've always liked the song Bill Wyman got onto this album....Oh Baby (although many people, including the Stones themselves considered it a throwaway). Off The Hook is a decent early Mick &amp; Keith song (although not good enough for Mick to keep putting it on all those greatest hits albums to generate songwriting royalities). Down Home Girl has resonated through my thoughts for over 30 years now....it just won't leave me alone, but neither will Down The Road Apiece, so to me these two are the reason you keep a good copy of Now! in your collection.\n\nThis is the remastered super audio CDs (SACD) of the Stones ABCKO catalog (which includes all the early Decca/London material. ABCKO acquired the Stones' catalog after Allen Klein became their manager in 1965. The resulting legal battles produced releases that the Stones opposed (they took out full page adds asking fans not to buy them), including the controversial Metamorphosis releases (which are now available on CD for the 1st time ever). But the sad fact is that the Stones lost control of their great early material. With these remastered SACD releases, we at last have some idea of what they really sounded like in the studio. I guess if we had these 40 years ago they would have ended up Greatest Rock And Roll Band in the Universe instead of Greatest Rock And Roll Band in the World.\n\nThe tracks were recorded in 1964 as follows:\nJan 3, 1964 at Regent Sound, London\n.....Mona (I Need You Baby)\nJun 10-11, 1964 at Chess Studios, Chicago\n.....Down The Road Apiece\nJun 24-26, 1964 at Regent Sound, London\n.....Off The Hook\n.....You Can't Catch Me\nSep 28-29, 1964 at Regent Sound, London\n.....Surprise, Surprise\nOct 27 - Nov 2, 1964 at RCA, Hollywood\n.....Pain In My Heart\n.....Down Home Girl\n.....Heart of Stone\n.....Oh Baby (We Got A Good Thing Goin')\n.....Everybody Needs Somebody To Love (version 1, which is faster and 30 sec shorter than European release versions)\nNov 8, 1964 at Chess Studios, Chicago\n.....Little Red Rooster\n.....What A Shame\n\nThis information comes from &quot;It's Only Rock And Roll: The Ultimate Guide To The Rolling Stones&quot; by Karnbach and Bernson and from my own collection. \n\nby Richard R. Carlton\n\nTRACKLIST:\n\n01 - Everybody Needs Somebody To Love (Version 2).wma                 \n02 - Down Home Girl.wma                                               \n03 - You Can't Catch Me.wma                                           \n04 - Heart Of Stone.wma                                               \n05 - What A Shame (Stereo).wma                                        \n06 - Mona (I Need You Baby).wma                                       \n07 - Down The Road Apiece (Stereo).wma                                \n08 - Off The Hook.wma                                                 \n09 - Pain In My Heart.wma                                             \n10 - Oh Baby (We Got A Good Thing Goin').wma                          \n11 - Little Red Rooster.wma                                           \n12 - Surprise, Surprise.wma\n\nWMA 320Kbps 44100Hz STEREO\t\t\n\nFOLLOW ME ON FACEBOOK PAGES: MARCELODRGZTPB\n\nATTENTION: I will read comments on all the material shared only on my Facebook page (MARCELODRGZTPB). If you have thanks, if you want to report any torrent, if you want some special request or want to be part of the community, we ask you to please do it through Facebook (MARCELODRGZTPB). In this way I can answer a lot faster and have more interaction between us. See you on MARCELODRGZTPB! THANK SO MUCH!!!\t","torrent":{"xt":"urn:btih:353f226c63e614ffbc135366a434072a035dc624","amp;dn":"The+Rolling+Stones+-+The+Rolling+Stones%2C+Now%21+%281965%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"353f226c63e614ffbc135366a434072a035dc624","infoHashBuffer":{"type":"Buffer","data":[53,63,34,108,99,230,20,255,188,19,83,102,164,52,7,42,3,93,198,36]},"announce":[],"urlList":[]}}