{"title":"What Lies beneath(Multi subs 4)(2Lions-Team)","uid":5658732,"size":4681749289,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:358128e4818015435f3f20079258d489e09c8925&amp;dn=What+Lies+beneath%28Multi+subs+4%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"juutje","files":-1,"time":1277892816,"description":"What Lies Beneath (2000) \n\nVerenigde Staten\nHorror / Mystery\n130 minuten\n\ngeregisseerd door Robert Zemeckis\nmet Harrison Ford, Michelle Pfeiffer en Diana Scarwid\n\nDe briljante wetenschapper Norman Spencer maakt zich zorgen over zijn echtgenote Claire. Sinds hun enige dochter Caitlin op kamers is gegaan, hoort Claire stemmen en ziet ze voortdurend een gezicht van een jonge vrouw gereflecteerd in het water. Claire vermoedt dat de bizarre verschijnselen alles te maken hebben met de nieuwe buren. Ze verdenkt Warren Feur er zelfs van zijn echtgenote Mary te hebben vermoord. Haar geest zou nu in Claires huis ronddwalen. Voor Norman gaat dit te ver en hij stuurt zijn echtgenote naar een therapeut. Die raadt Claire aan om in contact te treden met de geest...\n\nEngels\n\nNorman Spencer, a university research scientist, is growing more and more concerned about his wife, Claire, a retired concert cellist who a year ago was involved in a serious auto accident, and who has just sent off her daughter Caitlin (Norman's stepdaughter) to college. Now, Claire reports hearing voices and witnessing eerie occurrences in and around their lakeside Vermont home, including seeing the face of a young woman reflected in water. An increasingly frightened Claire thinks the phenomena have something to do with the couple living next door, especially since the wife has disappeared without apparent explanation. At her husband's urging, Claire starts to see a therapist; she tells him she thinks the house is being haunted by a ghost. His advice? Try to make contact. Enlisting the help of her best friend, Jody, and a ouija board, Claire seeks to find out the truth of What Lies Beneath.\n\nWeblink http://www.imdb.com/title/tt0161081/\nWeblink http://www.moviemeter.nl/film/37\n\nVideo                 : Retail DVD Rip\nAudio                 : AC 3 5.1 ch English French\nSubs                  : English French Dutch Greek \nID                    : 224 (0xE0)\nFormat                : MPEG Video\nFormat version        : Version 2\nBit rate mode         : Variable\nWidth                 : 720 pixels\nHeight                : 576 pixels\nDisplay aspect ratio  : 16:9\nFrame rate            : 25.000 fps\nStandard              : PAL\nCover                 : Yes\n\t\n\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n","torrent":{"xt":"urn:btih:358128e4818015435f3f20079258d489e09c8925","amp;dn":"What+Lies+beneath%28Multi+subs+4%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"358128e4818015435f3f20079258d489e09c8925","infoHashBuffer":{"type":"Buffer","data":[53,129,40,228,129,128,21,67,95,63,32,7,146,88,212,137,224,156,137,37]},"announce":[],"urlList":[]}}