{"title":"The Reasoned Schemer - Daniel P. Friedman.epub","uid":8654205,"size":20878209,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35a7b57ae171fa1dc7d99e396f5df859afeb4eff&amp;dn=The+Reasoned+Schemer+-+Daniel+P.+Friedman.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"moebanzor","files":1,"time":1373175692,"description":"The Reasoned Schemer\nDaniel P Friedman\nWilliam E. Byrd\nOleg Kiselyov\nISBN: 0262562146\n\nThe goal of The Reasoned Schemer is to help the functional programmer think logically and the logic programmer think functionally. The authors of The Reasoned Schemer believe that logic programming is a natural extension of functional programming, and they demonstrate this by extending the functional language Scheme with logical constructs -- thereby combining the benefits of both styles. The extension encapsulates most of the ideas in the logic programming language Prolog.The pedagogical method of The Reasoned Schemer is a series of questions and answers, which proceed with the characteristic humor that marked The Little Schemer and The Seasoned Schmer. Familiarity with a functional language or with the first eight chapters of The Little Schemer is assumed. Adding logic capabilities required the introduction of new forms. The authors' goal is to show to what extent writing logic programs is the same as writing functional programs using these forms. In this way, the reader of The Reasoned Schemer will come to understand how simple logic programming is and how easy it is to define functions that behave like relations.","torrent":{"xt":"urn:btih:35a7b57ae171fa1dc7d99e396f5df859afeb4eff","amp;dn":"The+Reasoned+Schemer+-+Daniel+P.+Friedman.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35a7b57ae171fa1dc7d99e396f5df859afeb4eff","infoHashBuffer":{"type":"Buffer","data":[53,167,181,122,225,113,250,29,199,217,158,57,111,93,248,89,175,235,78,255]},"announce":[],"urlList":[]}}