{"title":"Tenting tonight - the soldiers life (Time-Life The Civil War Ser","uid":11628155,"size":35409754,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:35d22e826b173861deec0096f7c875db0e8f1417&amp;dn=Tenting+tonight+-+the+soldiers+life+%28Time-Life+The+Civil+War+Ser&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"STBGD","files":-1,"time":1417647125,"description":"Pdf / English / 1984 Time-Life / 176 pages / 33.7 MB / ISBN10 0809447363\n\nI've long had a fondness for the many series of heavily illustrated works of history published by Time-Life. I was the copyeditor and indexer for several years on one of the series, so I know what kind of research and fact-checking went into them. On top of that, Prof. Robertson of Virginia Tech is an award-winning and very highly regarded author of some two dozen volumes having to do with various aspects of the Civil War, so you know you can't go wrong. This is primarily a social, not a military, history that focuses on five broad topics: How the Northern and Southern armies were recruited, especially at the very beginning of the conflict, and what the results were of all those amateur soldiers and officers stumbling around and bumping into each other; what life was like in camp on both sides; the crushing effects of disease from lack of sanitation and the bleak future of those who suffered serious wounds; the plight of the P.O.W., especially of captured Confederates under the thumb of vengeful Northern officers (Andersonville gets the bad press but Elmira was at least as bad, and worse in the winter); and the role of religion and the chaplain in the life of the soldier. There are additional vignettes of pickets on opposite sides sharing their coffee and tobacco, the fate of condemned deserters, the popularity of baseball as an antidote to boredom, and the shock and aftershock on the men in battle. Throughout the book there are many quotes from letters and later memoirs, and -- of course -- many, many fascinating photos. Very highly recommended.\n\nAmazon","torrent":{"xt":"urn:btih:35d22e826b173861deec0096f7c875db0e8f1417","amp;dn":"Tenting+tonight+-+the+soldiers+life+%28Time-Life+The+Civil+War+Ser","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35d22e826b173861deec0096f7c875db0e8f1417","infoHashBuffer":{"type":"Buffer","data":[53,210,46,130,107,23,56,97,222,236,0,150,247,200,117,219,14,143,20,23]},"announce":[],"urlList":[]}}