{"title":"[SoM]Seven[DvdRip-Divx3-Ita-Mp3]","uid":4452735,"size":991070208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:36954457e4f432ffa2598ccaa7097cbe8df5e6db&amp;dn=%5BSoM%5DSeven%5BDvdRip-Divx3-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mitimex","files":1,"time":1224342560,"description":"Il detective William Somerset (Morgan Freeman) ÃƒÂ¨ un saggio e anziano poliziotto a cui manca una settimana per andare in pensione, in sua sostituzione viene chiamato il giovane detective David Mills (Brad Pitt), molto intelligente ma privo di una grande esperienza; per questo il capo del distretto chiede a Somerset di occuparsi di un caso in compagnia di Mills, facendogli da tutore. I due Detective sono profondamente diversi, Somerset ÃƒÂ¨ nero, anziano, saggio e riflessivo oltre che scapolo; mentre Mills ÃƒÂ¨ un bianco giovane e irrequieto, inoltre ÃƒÂ¨ sposato con la bella Tracy (Gwyneth Paltrow).\nIl film ÃƒÂ¨ basato sulle indagini di due detective, uno giovane e uno prossimo alla pensione, su una serie di omicidi seriali che ripercorrono i sette vizi capitali (gola, avarizia, accidia, lussuria, superbia, invidia e ira).\nIl killer misterioso (Kevin Spacey) non lascia traccia alcuna delle proprie malefatte se non pochi indizi volontariamente disseminati per guidare le forze dell&amp;#039;ordine tra un omicidio e l&amp;#039;altro.\nIn una cittÃƒÂ  senza amore o compassione e perennemente bagnata dalla pioggia (tranne nell&amp;#039;atto finale della vicenda, quando il sadico omicida cala il suo asso finale), i due protagonisti annaspano dietro i sermoni predicati nelle tracce e nelle vittime colpevoli dei vizi capitali, e cercano in ogni modo di impedire al pazzo di arrivare al settimo omicidio.\n","torrent":{"xt":"urn:btih:36954457e4f432ffa2598ccaa7097cbe8df5e6db","amp;dn":"%5BSoM%5DSeven%5BDvdRip-Divx3-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36954457e4f432ffa2598ccaa7097cbe8df5e6db","infoHashBuffer":{"type":"Buffer","data":[54,149,68,87,228,244,50,255,162,89,140,202,167,9,124,190,141,245,230,219]},"announce":[],"urlList":[]}}