{"title":"The World's Must-See Places:  A Look Inside More Than 100 Magni","uid":6879859,"size":115116349,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36a35c0b14aaeb6f9114b28fcf0def18b90d9273&amp;dn=The+World%5C%27s+Must-See+Places%3A++A+Look+Inside+More+Than+100+Magni&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"freaktorrent07","files":-1,"time":1323614780,"description":"\nThe World's Must-See Places: A Look Inside More Than 100 Magnificent Buildings and Monuments \nDK Travel | 2011 | ISBN: 0756683823 | 264 pages | PDF+EPUP | 109.0Mb\n\n\nThe World's Must-See Places takes you on a tour of more than 100 of the world's greatest sights. In true DK Eyewitness Travel Guide style, each page of the book will show you what other books only tell you, with unique 3-D cutaway artwork that lets you look inside each building as if you were there.\n\nAncient, classical, and modern sights from every continent are included. Each featured sight has been selected for its uniqueness, or its historical or architectural importance, and many are included on UNESCO's list of World Heritage Sites. The sights include iconic landmarks, such as Chartres Cathedral and Sydney Opera House, and lesser-known gems, including the Kairouan Mosque in Tunisia and the Toshu-gu Shrine in Japan.\n\nIn addition to engaging text that describes each sight, sidebars and text panels cover topics such as the architectural style of the building, the architect and his works, or historic events or people that shaped the building as we know it today.\n\nThis book not only inspires readers to visit featured sights, but will also dazzle armchair travelers who prefer to explore these cultural wonders from the comfort of their own homes.","torrent":{"xt":"urn:btih:36a35c0b14aaeb6f9114b28fcf0def18b90d9273","amp;dn":"The+World%5C%27s+Must-See+Places%3A++A+Look+Inside+More+Than+100+Magni","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36a35c0b14aaeb6f9114b28fcf0def18b90d9273","infoHashBuffer":{"type":"Buffer","data":[54,163,92,11,20,170,235,111,145,20,178,143,207,13,239,24,185,13,146,115]},"announce":[],"urlList":[]}}