{"title":"Mystic Wisdom (2 DVD's) ----Sadhguru Jaggi Vasudev","uid":5125220,"size":479503640,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3734f11246a62e634a8029f568feb9a691967aa6&amp;dn=Mystic+Wisdom+%282+DVD%5C%27s%29+----Sadhguru+Jaggi+Vasudev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"deepakgod","files":2,"time":1255574442,"description":"Mystic Wisdom ---Sadhguru Jaggi Vasudev and Cheryl Simone.\n\nHave you ever felt this burning curiosity to know what this life is all about, who we really are, where we are coming from, why we are here and where we are going when we die? And you are not ready to settle for anything less than knowing, exploring the core of existence yourself?\n\nIf you are longing to find someone who know, someone who guide you, Mystic Wisdom can be the answer. This video captures the rare opportunity of a modern-day encounter between a seeker and a living enlightened Master. Cheryl Simone, an Atlanta real estate developer and a spiritual seeker, meets Sadhguru, India's most sough-after mystic. Share in the life-transforming experience of Sadhguru's profound insights and presence as their conversation unfolds. Let his free-spirited humor charm you; let his authentic, accessible wisdom engulf you as he unveils the mysteries of life.\n\nMystic Wisdom is the counterpart to the book Midnights with the Mystic. Likewise presented in the form of conversation with the Master, this captivating book offers more of Sadhguru's fascinating insights that challenge us to embrace the possibility of a higher reality, a peak of consciousness.\n\nDiscover the possibility that is within you to access the source of creation. Journey from being a piece of creation to being the Creator. Above all, to know Bliss.","torrent":{"xt":"urn:btih:3734f11246a62e634a8029f568feb9a691967aa6","amp;dn":"Mystic+Wisdom+%282+DVD%5C%27s%29+----Sadhguru+Jaggi+Vasudev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3734f11246a62e634a8029f568feb9a691967aa6","infoHashBuffer":{"type":"Buffer","data":[55,52,241,18,70,166,46,99,74,128,41,245,104,254,185,166,145,150,122,166]},"announce":[],"urlList":[]}}