{"title":"The Smithereens - 11 - Early American Alternative Rock ","uid":9439907,"size":83931298,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3775ab30b33e936b79c57691245bf63109e477be&amp;dn=The+Smithereens+-+11+-+Early+American+Alternative+Rock+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big-Papi","files":-1,"time":1388988203,"description":"The Smithereens - 11 320cbr (Big Papi) 1989 Early American Alternative Rock \n\n\n01 Smithereens, The - A Girl Like You.mp3\t10.91 MB\n02 Smithereens, The - Blues Before and After.mp3\t7.59 MB\n03 Smithereens, The - Blue Period.mp3\t6.89 MB\n04 Smithereens, The - Baby Be Good.mp3\t7.77 MB\n05 Smithereens, The - Room Without a View.mp3\t9.62 MB\n06 Smithereens, The - Yesterday Girl.mp3\t8.02 MB\n07 Smithereens, The - Cut Flowers.mp3\t6.97 MB\n08 Smithereens, The - William Wilson.mp3\t8.27 MB\n09 Smithereens, The - Maria Elena.mp3\t6.54 MB\n10 Smithereens, The - Kiss Your Tears Away.mp3\t7.36 MB\n\n\n\nSource: 1989 CD\n\n\nBy J. Derek\n\nBy 1990, my musical tastes were finally evolving beyond light rock and euro-synth-pop. While I had shunned rock in the past, certain artists were gaining my interest with their awesome orchestrations and lyrics. One such group was The Smithereens. Songs from their 1989 release 11 were hitting MTV in late '89 and early '90, and I was immediately hooked. Growing tired of my first-year college angst, The Smithereens provided a dose of reality and attitude I was needing. Still today, these songs are powerful and full of positive energy and attitude that give me a cold splash of water in the face and make me take back control of my life.\nThe release starts off on a rockin' note with their first single from 11, &quot;A Girl Like You.&quot; The guitar and drum driven tune combined with awesome lyrics and harmonies make this a great rock attitude anthem. Another single, &quot;Blues Before and After&quot; is another awesome drum and guitar drivin' rock anthem. Slowing down to a simple strum on the guitar, &quot;Blue Period&quot; is a bit more solemn and reflective, though it does has a slight upbeat 60s feel to it. And, hey, there's Belinda Carlisle singing the harmony! Back to the rock theme, &quot;Baby Be Good&quot; begs one's lover to be good while one is away. The harmonies and minor harmonics in the orchestration are very cool, and the chorus vocal hooks are addictive. &quot;Room Without a View&quot; focuses on worthlessness of focussing and reflecting so intently on the past. Again, one of the big fun features is the vocal harmonies in the refrain that are great to sing along with. Kind of along the same beat as &quot;A Girl Like You&quot; but a tad more mellow with a swayin' 60s feel, &quot;Yesterday Girl&quot; is a fun romp, though the lyrics are more about standing still.\n\n\nOverall, I give 11 a strong 5 star rating and place it in my top 50 releases of all time. The attitude and rockin' feel (especially in the first 6 songs) really do my attitude some good any time I listen. This is one of those releases where the songs were so good and stuck with me and meant so much to me personally, I haven't been able to bring myself to purchase any other Smithereens releases. For me, this release is perfect, and I don't want to have anything else that might mar my love and appreciation for this release and artist.\n\nAs a recommendation, you really have to like well-produced guitar and drum driven pop tunes. The vocals are serious and reflective, however the tunes are definite fun and attitude driven. I'm not quite sure who to compare them to, since this style is a bit divergent in my average music listening style and taste. Let's just say that if you liked upbeat and positive late 80s and early 90s music, get 11 - it's a definite classic that will be sure to satisfy, especially for those who need a good old-fashioned attitude adjustment.\n\nAt one time I knew what the title 11 referred to, but I have long since forgotten. However, I will not soon forget the music and attitude the Smithereens introduced to me with this release. Most definitely, this &quot;Baby Be Good.&quot;","torrent":{"xt":"urn:btih:3775ab30b33e936b79c57691245bf63109e477be","amp;dn":"The+Smithereens+-+11+-+Early+American+Alternative+Rock+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3775ab30b33e936b79c57691245bf63109e477be","infoHashBuffer":{"type":"Buffer","data":[55,117,171,48,179,62,147,107,121,197,118,145,36,91,246,49,9,228,119,190]},"announce":[],"urlList":[]}}