{"title":"The Pacific (Complete 6DVD) (2010)(ENG)(NL SUBS) Vlinder TBS","uid":6115440,"size":27543516398,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:3858c43e4e41e47072054af10c428bca053f40eb&amp;dn=The+Pacific+%28Complete+6DVD%29+%282010%29%28ENG%29%28NL+SUBS%29+Vlinder+TBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Vlinder2","files":-1,"time":1295532348,"description":"The Pacific (Complete 6DVD) (2010)       \n \n \n  Het was te verwachten dat er na het grote succes van miniserie Band of Brothers vroeg of laat een vervolg zou komen. Met The Pacific slaan producenten Steven Spielberg en Tom Hanks wederom de handen ineen voor een indrukwekkende tiendelige serie over de Tweede Wereldoorlog. Maar The Pacific is gelukkig geen simpele herhalingsoefening. Door de andere setting, maar bovenal door een andere focus, laat The Pacific een heel ander en misschien wel indrukwekkender beeld van oorlog zien.\n\nGuadalcanal, Peleliu en Iwo Jima, door WOII nu bekende namen. De Amerikanse soldaten wisten voor hun uitzending vaak niet eens hoe de plaatsen uitgesproken werden. Het offensief tegen Japan begon als reactie tegen het bombardement op Pearl Harbor. Het waren snel opgezette represailles met weinig voorbereiding. Dit heeft ook zijn weerslag op de opbouw van de serie. The Pacific gunt ons geen uitgebreid trainingskamp om de soldaten goed te leren kennen voor de strijd. Al in de eerste aflevering zitten we midden in de veldslagen.\n\nThe Pacific kiest hier direct heel duidelijk voor de focus van de serie. De soldaten zijn ondergeschikt aan de oorlog. Er wordt nauwelijks ingezoomd op de band die ontstaat tussen de soldaten. Soldaten sterven bij bosjes, en regelmatig hebben wij geen idee wie zojuist viel in de strijd. We volgen maar drie individuen in de oorlog intensief. Robert Leckie (James Badge Dale), een jonge journalist die een stroeve relatie heeft met zijn vader. Eugene Sledge (Joseph Mazzello), die tot zijn teleurstelling wegens hartklachten eerst werd afgekeurd voor het leger, maar het later toch lukt zich in te schrijven. En John Basilone (Jon Seda), die al in een vroeg stadium van de strijd een Medal of Honor krijgt en tegen zijn zin in naar huis wordt gestuurd om obligaties te verkopen voor de financiÃƒÂ«ring van de oorlog. Drie individuen wiens paden ook maar zelden kruisen. Meestal gaan ze hun eigen weg. Of eigenlijk: de weg die de strijd voor hen uitstippelt.\n\nWant de weg die de soldaten afleggen is weinig consistent en verandert regelmatig drastisch van koers. Dit heeft tot resultaat dat de afleveringen heel erg op zichzelf komen te staan. Zo is er de aflevering dat de soldaten verlof hebben in Melbourne. De gehele aflevering wordt uitgetrokken voor de tijd dat de soldaten hier bijkomen, zich bedrinken en aanpappen met de lokale bevolking. De ogenschijnlijke willekeur van de ontwikkelingen toont treffend de identiteit van de oorlog. Waar zijn we, wat doen we hier en wat doen we morgen? De soldaten tasten constant in het duister, en met hen de kijker.\n\nTijdens de televisie-uitzendingen werd dit effect deels opgeheven door de introductie die Tom Hanks middels en voice-over aan elke aflevering gaf. Deze voice-over plaatst de gebeurtenissen van de afleveringen in een grotere context en licht de verschillende beslissingen toe. Het geeft de serie een meer documentaire-achtige uitstraling, maar ontneemt ons ook deels de krachtige ervaring van het meemaken van de oorlog zoals de soldaten in de serie dat doen. Deze toelichting is op de DVD en Blu-ray uitgave uit te zetten. Dit maakt de lijn in de serie soms moeilijk te volgen, maar dat maakt de ervaring des te intenser.\n\nAan diegene die juist meer historie rond de serie willen is ook gedacht. Alle tien de afleveringen kunnen bekeken worden met picture-in-picture commentaar van veteranen en nabestaanden van overleden soldaten. Ook de ?Field Guides? die bij elke aflevering zitten herbergen een schat aan informatie. Onder andere geanimeerde landkaarten, interviews met historici en veteranen, foto?s en historische achtergronden maken dit tot een extra waar je gerust uren in kunt verdwalen.\n\nOok de zes soldaten waarop The Pacific werd gebaseerd komen aan bod bij de extra?s. Enkele praten zelf voor de camera, van andere spreken we de familie. Het levert mooie, soms emotionele momenten op die de personages de diepgang en bagage geven die ze in de serie\n\n\n\n\nEnglish\n\nA 10-part mini-series from the creators of &quot;Band of Brothers&quot; telling the intertwined stories of three Marines during America's battle with the Japanese in the Pacific during World War II. \n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0374463/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0374463/&lt;/a&gt;\n\nSpotinformatie \nBeeld : 16:9\nFormaat : DVD5 \nBron : Retail pal\nAudio : English 2.0\nSubs : Dutch\nMenu : Yes\n\nThanks : Oceanlab\n \nGenre : Actie\nAvontuur\nDrama\nOorlog\n \nWeblink : http://www.hbo.com/the-pacific/index.html \n\nTBS\n\nBlack-sam\n","torrent":{"xt":"urn:btih:3858c43e4e41e47072054af10c428bca053f40eb","amp;dn":"The+Pacific+%28Complete+6DVD%29+%282010%29%28ENG%29%28NL+SUBS%29+Vlinder+TBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3858c43e4e41e47072054af10c428bca053f40eb","infoHashBuffer":{"type":"Buffer","data":[56,88,196,62,78,65,228,112,114,5,74,241,12,66,139,202,5,63,64,235]},"announce":[],"urlList":[]}}