{"title":"Victoria Alexander-Millworth Manor #1-4, #1.5 ~ Maraya21","uid":11654535,"size":18380536,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:38e7af42353160f1c1965240daf6cf1bb8c83d9d&amp;dn=Victoria+Alexander-Millworth+Manor+%231-4%2C+%231.5+%7E+Maraya21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Maraya2020","files":-1,"time":1417913785,"description":"Victoria Alexander - Millworth Manor Series #1-4, 1.5 ~ Maraya21\n &lt;a href=&quot;\nhttp://i.imgur.com/HPy4nFi.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i.imgur.com/HPy4nFi.jpg&lt;/a&gt;\n\nAuthors:  Victoria Alexander\nFormats:  EPUB, MOBI, PDF, AZW3, LIT\nTags:  Literature &amp; Fiction, Women's Fiction, Historical Romance, Victorian\nPublisher:  Zebra Books\nLanguage:  English\n\n\nOverview:\nBook #1 -- What Happens At Christmas\nYou are cordially invited to Christmas at Millworth Manor. . .\nCamille, Lady Lydingham, requests the pleasure of your company at a festive house party, as she endeavors to coax a marriage proposal from Prince Nikolai Pruzinsky of Greater Avalonia.\nThe hostess's relatives will be in attendance--in this case, a troupe of actors hired to impersonate a proper English family in order to fool the Prince.\nGate-crashing, distractingly handsome first loves like Grayson Elliott are most unwelcome.\nGames will be played.\nMotives will be revealed.\nMayhem may ensue.\nAnd hearts will be won--and lost--in the most romantic, magical season of all.\nPlease RSVP\n\nBook #1.5 -- Lord Stillwell's Excellent Engagements\nIn an enchanting novella from #1 New York Times bestselling author Victoria Alexander, eligible viscount Winfield Elliott searches for a bride and discovers that love may be lovelier the second--or even third--time around. . .\nAllow Me To Explain. . .\nSome say I do not take my engagements seriously. Nonsense. What man with no interest in marriage would find himself proposing not once, but three times? And each time, I've felt certain that this, at last, is the absolutely, positively, perfect woman.\nMiss Felicia Whitingdon, for instance, has youth, beauty, style, grace--and a handsome fortune. Lady Lucille Eustice is a widow of impeccable social standing, and a balm to my soul. Then there is Miss Caroline Hibbitt, sweet and charming in every way. Any one of these intoxicating treasures could make a man happy. Any one of them could be an ideal wife. But which--if any of them--will it be?\n\nBook #2 -- The Importance of Being Wicked\nFor Winfield Elliott, Viscount Stillwell, finding a prospective bride always seemed easy. Perhaps too easy. With three broken engagements to his name, Win is the subject of endless gossip. Yet his current mission is quite noble: to hire a company to repair his family's fire-damaged country house. Nothing disreputable in that--until the firm's representative turns out to be a very desirable widow.\nLady Miranda Garrett expected a man of Win's reputation to be flirtatious, even charming. But the awkward truth is that she finds him thoroughly irresistible. While Miranda resides at Millworth to oversee the work, Win occupies her days, her dreams. . .and soon, her bed. For the first time, the wicked Win has fallen in love. And what began as a scandalous proposition may yet become a very different proposal...\n\nBook #3 -- The Scandalous Adventures of the Sister of the Bride\nThe bride and groom cordially request the presence of. . .\nThe bride's sister, Delilah, the very proper widowed Lady Hargate, and Samuel Russell, the groom's friend, a very eligible, slightly improper bachelor, at their upcoming wedding.\nLady Hargate and Mr. Russell, previously acquainted during one unforgettable night in New York City when caution--and clothing--were thrown to the wind will choose to pretend they have never met before.\nThe lady plans to avoid love and its complications at all costs.The gentleman intends to change her mind.\nGuests are invited to enjoy the many diversions of Millworth Manor--delightful grounds, lavish drawing rooms, secluded corners--and the chance to discover that one night may have been only the beginning...\n\nBook #4 -- The Shocking Secret of a Guest at the Wedding\nThe bride and groom cordially request your presence for a wedding at Millworth Manor. . .\nGuests will include Jackson Quincy Graham Channing, New York City banker, and Lady Theodosia &quot;Teddy&quot; Winslow, wedding planner to the finest families in England.\nIntroductions shall be followed by light conversation, dancing, flirtation, arguing, reconciliation, and an impulsive kiss that both parties are quite certain they will never repeat. Until they do.\nA mutually beneficial fake engagement will be accompanied by all manner of very real complications, scandalous revelations, nefarious schemes, and one inescapable conclusion:\nThat true love--unlike the perfect wedding--is impossible to plan...\n\n\nPlease be aware that i want to seed 24h/d, however with a really old laptop, a connection of U:80.0 kB/s and multiple seeds \nsimultaneously my contribution will not be enough. Therefore, please seed what you leeched. Fair-Share\nEnjoy!                Maraya21","torrent":{"xt":"urn:btih:38e7af42353160f1c1965240daf6cf1bb8c83d9d","amp;dn":"Victoria+Alexander-Millworth+Manor+%231-4%2C+%231.5+%7E+Maraya21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"38e7af42353160f1c1965240daf6cf1bb8c83d9d","infoHashBuffer":{"type":"Buffer","data":[56,231,175,66,53,49,96,241,193,150,82,64,218,246,207,27,184,200,61,157]},"announce":[],"urlList":[]}}