{"title":"[2004] Greatest Hits (My Prerogative) - Britney Spears - 289mb @","uid":5244511,"size":319576601,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3a55cced9392343bd00a72e4a458b929a7cbad0a&amp;dn=%5B2004%5D+Greatest+Hits+%28My+Prerogative%29+-+Britney+Spears+-+289mb+%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"only1joe","files":-1,"time":1261934531,"description":"Greatest Hits (My Prerogative) - Britney Spears [2004] &lt;a href=&quot;\nhttp://img19.imageshack.us/img19/7158/greatesthitsmyprerogati.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img19.imageshack.us/img19/7158/greatesthitsmyprerogati.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://bayimg.com/KaJiKAaCd&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/KaJiKAaCd&lt;/a&gt;\n\nWikipedia - Greatest Hits: My Prerogative is the first greatest hits album by pop singer Britney Spears. The album was released on November 1, 2004 in Japan, on November 8, 2004 around the world and on November 9, 2004 in the United States and Canada. The set includes most of Spears' hit singles, from &quot;...Baby One More Time&quot; to &quot;Outrageous&quot;, and almost everything in between; &quot;From the Bottom of My Broken Heart&quot; is the only regularly-released single not included on any edition. Also included are three new songs; a cover of Bobby Brown's &quot;My Prerogative&quot; (which was featured as the lead single), and two previously unreleased songs entitled &quot;Do Somethin'&quot; (which was later released as a single) and &quot;I've Just Begun (Having My Fun)&quot;, the latter of which also appeared on the In the Zone video album. Limited edition featuring Remix Bonus Disc - The limited edition of the album was printed in a digipak, wherein its cover is the same as the standard edition, but the colors look darker because of the shining effect. There is a collage of all of Britney's albums and singles covers in the limited edition. It also contains a second disc with unreleased remixes and the Chris Cox Megamix.\n\nStephen Thomas Erlewine, All Music Guide - Greatest Hits: My Prerogative appeared at the tail end of a year where Britney Spears was married twice, canceled a tour, injured her knee, lost the movie role of Daisy Duke to rival teen pop diva Jessica Simpson, was a punch line in Fahrenheit 9/11, and had countless paparazzi shots of her drinking and making out in public. It was enough high-profile shenanigans for a career, and it was par for the course for Britney, who hadn't been out of the pop culture headlines since she released her debut album, ...Baby One More Time, in January 1999. In the nearly six years separating that debut album and the release of Greatest Hits in November 2004, Britney was omnipresent, representing both the entire teen pop phenomenon of the turn of the millennium, plus the teasing, Maxim-fueled sexuality of the time; it's not for nothing that Tom Wolfe name drops Britney Spears, not archrival Christina Aguilera, in his 2004 novel I Am Charlotte Simmons -- Britney alone captured the era, which in turn is captured on this 17-track hits collection. If Bob Dylan had a hard time being a voice of a generation (which he does acknowledge in his autobiography, Chronicles), imagine the weight put upon this simple Louisiana girl who just wanted to be famous and became a cultural icon instead! During those six years, she kept turning out product, selling herself with increasingly racy photographs, all the while being used as an example of everything that's wrong with pop culture, or even worse, as the subject of cultural theses explaining pop culture. No wonder that after six years of mind-boggling fame she wanted to abandon her career for motherhood -- it's exhausting being in the limelight, even for a shameless pop star! So, Greatest Hits arrived at a perfect time -- just as her star was fading, just as the teen pop era grew to a close, and just as she readied herself for retirement.  As a time capsule, Greatest Hits does its job well. It has all of her hits outside of &quot;From the Bottom of My Broken Heart,&quot; a largely forgotten ballad from her debut released just before her second album, Oops!...I Did It Again, and it contains two very good previously unreleased tunes, including the In the Zone outtake &quot;I've Just Begun (Having My Fun),&quot; an infectious spin on No Doubt's &quot;Hella Good&quot; that betters most of the songs that were featured on the album (it also has a useless remake of Bobby Brown's &quot;My Prerogative,&quot; which seems to exist solely for its video). Clearly, this is the album not just for the casual fan, but for any fan of Spears, because like most teen pop singers, her albums are notoriously spotty affairs, memorable largely for the singles themselves. What is surprising is that those singles -- all presented here in their hit forms, which means this has the &quot;Stop Remix&quot; of &quot;(You Drive Me) Crazy,&quot; not the album version -- are somewhat less than the sum of their parts when collected together. The similarities in Max Martin's clanking, insistent writing and production become blindingly evident, and Britney's thin, squeaky voice wears thin over the course of 17 songs. Also, the song selection and sequencing emphasize keeping the perfect beat over chronology, which not only makes it a little harder to listen to as an album, it puts the focus on the individual songs, which seem neither as hooky or catchy as they did when they were initially on the radio. There are exceptions to the rule, of course -- &quot;...Baby One More Time&quot; still retains its punch, &quot;Oops!...I Did It Again&quot; is so silly it's hard to resist, &quot;(You Drive Me) Crazy&quot; is fluffy dance-pop at its best, and &quot;Toxic&quot; is a delirious, intoxicating rush -- but they're all better as individual moments, even if when taken together, they do illustrate the cacophonous monotony of her music and, yes, her time quite well. So, even if it isn't a great listen as a cohesive album, Greatest Hits does perform the valuable function of offering all of Britney's hits in one place, and it does work as a portrait of the time when Britney Spears was the defining figure of American pop culture. But if you compare it to The Immaculate Collection, which captured the time when Madonna was the defining figure of American pop culture and does work as an album, it's clear that a cultural artifact isn't necessarily the same thing as great music. [Greatest Hits was released with a limited-edition bonus remix disc in its initial pressings. All the remixes are previously unreleased, but only two are noteworthy: there's a &quot;Chris Cox Megamix&quot; medley of all her big hits, plus a &quot;Hi-Bias Radio Remix&quot; of &quot;Everytime&quot; that proves that the song is better as a dance tune than a ballad.\n\n\nDisc 01\n\n[01] My Prerogative\n[02] Toxic\n[03] I'm A Slave 4 U\n[04] Oops!...I Did It Again\n[05] Me Against The Music\tFeaturing Madonna\n[06] Stronger\n[07] Everytime\n[08] Baby One More Time\n[09] (You Drive Me) Crazy\n[10] Boys\tFeaturing Pharrell Williams\n[11] Sometimes\n[12] Overprotected \t(The Darkchild Remix)\n[13] Lucky\n[14] Outrageous\n[15] Don't Let Me Be The Last To Know\n[16] Born To Make You Happy\n[17] I Love Rock 'n' Roll\n[18] I'm Not A Girl, Not Yet A Woman\n[19] I've Just Begun (Having My Fun)\n[20] Do Somethin'\n \nDisc 01 Play Time - 01h:11m:27s\n\nDisc 02\n\n[01] Toxic \t(Armand Van Helden Remix Edit)\n[02] Everytime \t(Hi-Bias Radio Remix)\n[03] Breathe On Me \t(Jacques Lu Cont Mix)\n[04] Outrageous\t(Junkie XL's Dancehall Mix)\n[05] Stronger\t(Miguel 'Migs' Vocal Mix)\n[06] I'm A Slave 4 U\t(Thunderpuss Club Mix)\n[07] Chris Cox Megamix\n\nDisc 02 Play Time - 00h:44m:16s\n\n\n\nTotal Play Time\t&gt; 01h:55m:43s\nTotal File Size\t&gt; 292mb (Including MP3s, Art Covers &amp; File)\nTotal Bit Size\t&gt; 320kbps\nMusic File Type\t&gt; I-Tunes v8.0.2.20 MP3 Format\nMusic Video Format\t&gt; N / A\nScanned Artwork\t&gt; Yes @ 300dpi\nOriginal CD Rip\t&gt; Yes - only1joe\nOriginal Uploader\t&gt; Yes - only1joe \nUpload Speed\t&gt; 33-35KB/s\nMusic Genre\t&gt; Pop\nRelease Date\t&gt; 08 November 2004\nRecord Company\t&gt; Zomba Records - Sony BMG\nArtists WebSite\t&gt;  &lt;a href=&quot;\nhttp://www.britney.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.britney.com&lt;/a&gt;\nhttp://www.britneyspears.comhttp://en.wikipedia.org/wiki/Britney_Spears &lt;a href=&quot;\nhttp://www.azlyrics.com/s/spears.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.azlyrics.com/s/spears.html&lt;/a&gt; &lt;a href=&quot;\nhttp://www.bebo.com/britneyspears&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bebo.com/britneyspears&lt;/a&gt; &lt;a href=&quot;\nhttp://www.muzu.tv/britneyspears&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.muzu.tv/britneyspears&lt;/a&gt; \n\n\n\n\n\n* * * Please Seed To A Ratio Of 1:1 Or Greater * * *\n* * * I Will Only Re-Seed If There Is More Than 10 Peers Waiting * * *\n* * * Any Problems - Leave Comments On My Most Recent Torrents * * *\n* * * This Is A Multi-Tracker Torrent Check Your Bit Torrent Client For A True Number Of Seeds * * *\n\n","torrent":{"xt":"urn:btih:3a55cced9392343bd00a72e4a458b929a7cbad0a","amp;dn":"%5B2004%5D+Greatest+Hits+%28My+Prerogative%29+-+Britney+Spears+-+289mb+%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a55cced9392343bd00a72e4a458b929a7cbad0a","infoHashBuffer":{"type":"Buffer","data":[58,85,204,237,147,146,52,59,208,10,114,228,164,88,185,41,167,203,173,10]},"announce":[],"urlList":[]}}