{"title":"Krotov - Aptitude Test Problems in Physics","uid":7969674,"size":3487524,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3a7079626e5c303ae28df9856146cd3cf486d46c&amp;dn=Krotov+-+Aptitude+Test+Problems+in+Physics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"damitr","files":1,"time":1356796505,"description":"Science for Everyone Series \n\nAptitude Test Problems in Physics \n\nedited by S. S. Krotov, \ncontributing authors A. I. Buzdin, V. A. Il'lin, I. V. Krivchenkov, N. A. Sveshnokov.\n\n\n\n    This book, which is a collection of physics aptitude test problems, draws on the experience of the physics olympiads conducted during the last fifteen years among the schoolchildren of Moscow. A Moscow physics olympiad includes three preliminary theoretical rounds at the regional, city, and qualifying levels, followed by a final practical round. After the final round, a team of Moscow schoolchildren is selected for participation in the all-Union olympiad. The complexity of the problems set for each round increases gradually, starting from the simplest problems at regional level, problems which can be solved simply by havinga thorough knowledge of the basic laws and concepts of physics. The problems at the qualifying stage are much more complicated. Some of the problems at this level involve a certain amount of research as a rule, the problems make participation in the olympiads even more challenging). This collection contains problems from the theoretical rounds only. The structure of the book reflects the emphasis given to it in different sections of the physics course at such competitions. The number of problems set at an olympiad and the fraction allotted to a particular topic in the book are determined by the number of years the topic is taught at school. A detailed classification of different topics is not given since some are represented by only one or two problems, while other topics have dozens of problems. Most of the problems are originally and a considerable proportion of them was composed by the authors. The most difficult problems are marked by asterisks being  the product of a close group of authors, the book reflects certain traditions and experience drawn from Moscow olympiads only. A feature of the book is that it presents the scientific views and working style of a group of like-minded scientists.\n\n    .\n\nThis is what the back cover of the book says:\n\n    This collection contains about 250 problems in\n    physics set for boys and girls from Moscow schools\n    participating in physics olympiads from 1968 to\n    1985. The most interesting and original problems\n    from these examinations have been included together\n    with their solutions.\n    Intended for schoolchildren and teachers of physics,\n    this book can also be used for preparation to entrance\n    examinations to the higher educational institutes\n    where an advanced knowledge of physics is required.\n\nThis book was translated from the Russian by Natalia Wadhwa and was first published by Mir in 1990. \n\n\nAll credits to the original uploader, though I had also made a copy, but this one is much better than mine, so posting the better one.\n\n\nPDF | Cover | Bookmarked | OCR | 3.3 MB | Pages 315 | \n\n======================================\n=++++++++++++++++++++++++++++++++++++=\n=+                                  +=\n=+ Released on TPB by mirtitles.org +=\n=+                                  +=\n=++++++++++++++++++++++++++++++++++++=\n======================================\t\n\n\n\nContents\n\nPreface 6\n1. Mechanics 9\n2. Heat and Molecular Physics 53\n3. Electricity and Magnetism. 73\n4. Optics 99\nSolutions  107","torrent":{"xt":"urn:btih:3a7079626e5c303ae28df9856146cd3cf486d46c","amp;dn":"Krotov+-+Aptitude+Test+Problems+in+Physics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3a7079626e5c303ae28df9856146cd3cf486d46c","infoHashBuffer":{"type":"Buffer","data":[58,112,121,98,110,92,48,58,226,141,249,133,97,70,205,60,244,134,212,108]},"announce":[],"urlList":[]}}