{"title":"McGraw-Hill Encyclopedia of Science &amp; Technology, 10th Edition.r","uid":4556423,"size":302859011,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3aa761350f24b0525d6968745ddc18d3a15dd53d&amp;dn=McGraw-Hill+Encyclopedia+of+Science+%26+Technology%2C+10th+Edition.r&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"sriramank","files":1,"time":1228501449,"description":"=================================================================================\n=                                                                               =\n=                thanks for downloading, plz keep seeding                       =\n=                                                                               =\n=================================================================================\n\n\n\nMcGraw-Hill Encyclopedia of Science &amp; Technology, 10th Edition\n\nHardcover: 15600 pages\nPublisher: McGraw-Hill Professional; 10 edition (June 11, 2007)\n\nFrom School Library Journal\nGrade 9 Up. Updating a 20-volume set for a 5-year revision of Science &amp;\nTechnology is a difficult task. When original articles are written by\nexperts in their fields, basic information may remain the same, but it\nis hoped that some &quot;recent developments&quot; would be added. Updated materials\nare evidenced in entries such as Asia, climate modeling, geologic thermometry,\nand global positioning systems. In some sections, such as compact disc,\ncomputer graphics, electric-power generation, gravitation, nuclear engineering,\nand production of human insulin, there are no changes to the text, but the\nbibliographies have been updated. Entries on acquired immunological tolerance,\naircraft design, fingerprinting, industrial trucks, and narcotics have not been\nupdated. There are new entries in this revision, such as climate history,\nclinical immunology, fullerene, global warming, geographic information systems,\nobject-oriented programming, and nuclear medicine. Some of the entries have\nbeen completely rewritten by new authors, such as those on acquired immune\ndeficiency syndrome, aircraft-collision avoidance system, breast disorders,\ngeological time scale, North America, nuclear magnetic resonance, and radiation\nchemistry. Topics from 1994-1997 yearbooks, such as hanta viruses, are not\nincluded in this revision. According to the publishers, 23% of 7100 entries\nare new or totally revised, 1750 of 13,000 illustrations are entirely new,\nand 6 color plates are new. This encyclopedia set is recommended for high schools\nthat do not have the 1992 edition. Note: be sure to keep the 1994-1997 yearbooks.?P.\nA. Dolan, Illinois State University, Normal\n\nCopyright 1997 Reed Business Information, Inc. --This text refers to the Hardcover edition.\n\nFrom Library Journal\nSince its initial appearance in 1960, this encyclopedia has been the preeminent work\nin its field. Countless reference searches for student, lay reader, and professiona\nhave started with this source. Each edition has improved upon the one preceding,\nand this new edition, the 6th, is no exception. The numbers alone are impressive:\nthe new edition's 20 volumes (up from 15) contain 7700 articles, 2000 of which are\neither new or totally revised. Nearly 4000 of the work's 15,000 illustrations are also\nnew or wholly redone. There are more subtle improvements as well: for example, in the\nnew edition much of the illustrative material has been enlarged, making it easier to\nwork with. Changes in topic coverage in the new edition reflect changes of emphasis in\nscience and technology over the past several years. For example, &quot;Neutron Optics&quot; was a\nrelatively short, largely definitional article in 1982, mirroring the embryonic state\nof the field at that time; in the 6th edition it has been accorded significantly longer\nand more comprehensive treatment. Conversely, the lengthy article on &quot;Nuclear Explosion&quot;\nhas been cut by more than one-third, with the relatively few recent developments in this\ntopic spun off into articles of their own. The bibliographies at the end of many articles\n] have been thoroughly revised, a welcome improvement: the 5th edition's shorter, often\noutdated bibliographies limited the encyclopedia as a teaching tool, both for students and\nfor librarians. Even in those cases where the article itself is relatively unchanged, there\nhas been an obvious effort not only to update the bibliographies but to expand them as\nwell. For example, &quot;Nuclear Chemistry&quot; is largely unaltered from the previous edition, but\nits bibliography is lengthened from 5 items to 12, only one of which was published since the\n5th edition. Conversely, in &quot;Optical Communications,&quot; a rapidly developing field, all but\none ofthe items in the bibliography have come out since the previous edition. Until now,\nMcGraw-Hill had to itself the field of multi-volume, general sci-tech encyclopedias. This\nsituation has changed, in part, with the appearance of the Encyclopedia of Physical Science and\nTechnology ( Academic Press, 1987. 15 vols.). I say &quot;in part&quot; because the newcomer is confined\nto the physical sciences and their application, with no attempt to cover the entire spectrum of\nthe sciences. The two also differ radically in format: rather than the traditional encyclopedic\narrangement of a great many articles of varying length, Academic offers a lesser number of\nstate-of-the-art, review essays of fairly uniform length. Combined with excellent bibliographies,\nthis makes it a valuable teaching tool, both for the student and for the more experienced professional\nventuring out of specialty. However, for meaningful, day-to-day scientific and technological reference\nwork, McGraw-Hill's comprehensive coverage and unparalleled indexing make it the essential first choice.\nDonald J. Marion, Univ. of Minnesota Inst. of Technology Libs., Minneapolis","torrent":{"xt":"urn:btih:3aa761350f24b0525d6968745ddc18d3a15dd53d","amp;dn":"McGraw-Hill+Encyclopedia+of+Science+%26+Technology%2C+10th+Edition.r","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3aa761350f24b0525d6968745ddc18d3a15dd53d","infoHashBuffer":{"type":"Buffer","data":[58,167,97,53,15,36,176,82,93,105,104,116,93,220,24,211,161,93,213,61]},"announce":[],"urlList":[]}}