{"title":"Pakistan-  A Personal History (gnv64)","uid":7109989,"size":14927514,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3b565540ca0c5eb3d50411255f39873e5fcb08da&amp;dn=Pakistan-++A+Personal+History+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1332001756,"description":"Pakistan- A Personal History\nBy Imran Khan\nBantam Press October 2011 | ISBN-10: 0593067746 | ePUB/MOBI/LIT/PDF | 14.2 mb &lt;a href=&quot;\nhttp://www.amazon.com/Pakistan-Personal-History-Imran-Khan/dp/0593067746&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Pakistan-Personal-History-Imran-Khan/dp/0593067746&lt;/a&gt;\nPDF conversion is mine.\n\nThe fascinating story of Pakistan, seen through the eyes of its most famous son, Imran Khan.\n\nBorn only five years after Pakistan was created in 1947, Imran Khan has lived his country's history. Undermined by a ruling elite hungry for money and power, Pakistan now stands alone as the only Islamic country with a nuclear bomb, yet unable to protect its people from the carnage of regular bombings at home. How did it reach this flashpoint of instability and injustice with such potentially catastrophic results for the whole world?\nRecounting his country's history through the prism of his own memories, Imran Khan starts from its foundation, ripped out of the dying British Raj. He guides us through and comments on subsequent historical developments which shook the Muslim world -- the wars with India in 1965 and 1971, the Iranian Revolution of 1979, the Societ invasion of Afghanistan, the 9/11 terrorist attacks -- to the current controversial and intractable war in Afghanistan. Throughout we see these events viewed not only through the eyes of Westerners, but through those of ordinary Pakistanis.\nDrawing on the experiences of his own family and his wide travels within his homeland, Pakistan: A Personal History provides a unique insider's view of a country unfamiliar to a western audience. Woven into this history we see how Imran Khan's personal life -- his happy childhood in Lahore, his Oxford education, his extraordinary cricketing career, his playboy years and marriage to Jemima Goldsmith, his mother's influence and that of his Islamic faith -- inform both the historical narrative and his current philanthropic and political activities. It is at once absorbing and insightful, casting fresh light upon a country whose culture he believes is largely misunderstood by the West.\n\nAbout the Author\nIMRAN KHAN was born in 1952 and grew up playing cricket in Lahore, Pakistan. He played his first international match for this country in 1971. He has recently established his own political party, the Tehrik-e-Insaf, aiming to bring good governance and social justice to the people of Pakistan.","torrent":{"xt":"urn:btih:3b565540ca0c5eb3d50411255f39873e5fcb08da","amp;dn":"Pakistan-++A+Personal+History+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b565540ca0c5eb3d50411255f39873e5fcb08da","infoHashBuffer":{"type":"Buffer","data":[59,86,85,64,202,12,94,179,213,4,17,37,95,57,135,62,95,203,8,218]},"announce":[],"urlList":[]}}