{"title":"Persona Non Grata.Krzysztof Zanussi.2005.DVDRip.XviD","uid":6292320,"size":1465073722,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3c3a5d233b7e886cfc5881f8fb56a9249aedd176&amp;dn=Persona+Non+Grata.Krzysztof+Zanussi.2005.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pamis2046","files":6,"time":1301864824,"description":"Persona non grata (2005) \n\nDirector: Krzysztof Zanussi\nWriter: Krzysztof Zanussi\nStars:Zbigniew Zapasiewicz, Nikita Mikhalkov and Jerzy Stuhr \n\n  Zbigniew Zapasiewicz  ...  Wiktor  \n  Nikita Mikhalkov  ...  Oleg  \n  Jerzy Stuhr  ...  Polish attachÃƒÂ© Radca  \n  Remo Girone  ...  Italian Consul  \n  Daniel Olbrychski    \n  Andrzej Chyra  ...  New Consul  \n\nCountry:Russia | Poland | Italy \nLanguage:Polish | Russian | English | Spanish \n\nTotal Streams: 2 \nRunning Time: 0:56:15 \nIndex Chunk: Yes \nInterleaved: Yes \nMax Bytes Per Sec: 0 \nAUDIO: 0 - AC3 (0x2000) \nAverage Bitrate Per Sec: 448 kb/s \nSamples Rate: 48000 Hz \nChannels: 6 \nBits Per Sample: 0 \nSuggestedBufferSize: 28000 \nSample Size: 1 \nVIDEO: XVID \nB-VOP: Yes \nS(GMC)-VOP: No \nQuarterPixel: No \nFrame Size: 640 x 352 \nFrames Rate: 25.000 \nColor Depth: 24 \nTotal Frames: 84376 \nSuggestedBufferSize: 104122 \nSize 1.37GB (1,466,122,219 bytes) \n\nDirector Krzyzstof Zanussi has made 75 distinguished films and is possibly the third best filmmaker from Poland--next only to Wajda and Kieslowski(the latter peaked towards the end of his career). I consider &quot;Persona non grata&quot; to be Zanussi's second best effort--the first being his German TV film &quot;Wege in der Nacht&quot; (&quot;Ways in the night&quot; or &quot;Nightwatch&quot;) made in 1979. Interestingly both films featured the brilliant music of Wojciech Kilar, the actor Zbigniew Zapasiewicz, and script of physicist turned philosophy student Krzyzstof Zanussi.\n\nAt the elementary level, the film is about diplomats and their lives. At a more complex level, Zanussi explores the relationship between Poland and post-Glasnost Russia and the denizens of both nations. At an even more complex level, Zanussi introduces the subtle differences between the orthodox Christians and Catholics--a facet that I suspect interested both Zanussi and the late Kieslowski, both close associates. There are more Catholics in Poland while Orthodox Christians dominate Russia. Zanussi differentiates the spirituality of the two in the rich verbal sparring that the film unfolds between a Polish and a Soviet diplomat. Finally, Zanussi teases the film viewer by leading the audience to suspend disbelief in the main character. For a long while, even an astute viewer is led astray. The viewer is reduced to the level of a &quot;persona non grata&quot; believing initially that the film is all about a diplomat about to lose his diplomatic powers at the embassy and become a &quot;persona non grata.&quot; This is superb cinema, supported by Kilar's &quot;music of the spheres.&quot; The film offers rich humor and at times a biblical sermon on a New Testament passage from 2 Corinthians 1:15 &quot;Do I say yes, when I mean no.&quot; But taking the context of diplomacy, around which the film revolves, the discussion takes on a different hue. But the clever Zanussi throws light and shadows on the subjects in the film (the opening credits plays with light and shadows, too).\n\nIt is a story of love, suspicion, and principles--that go beyond mere individuals. It is a story of reconciliation. It is a film that a filmmaker can make in the evening of his career. It reminds you works like Kurosawa's &quot;Dersu Uzala&quot; or Ermanno Olmi's &quot;Tree of Wooden Clogs.&quot; It is a work of maturity. Savor it like fine cognac!\n\nJust as it is major work of Zanussi, I believe this to be a milestone for the music composer Kilar. Poland should be proud of Zanussi and Kilar.\n\nThe film is a veritable feast for an intelligent viewer. Great performances from three great Polish actors--Zbigniew Zapasiewicz (Zanussi's favorite), Jerzy Stuhr (Kieslowski's favorite), and Daniel Olbryschsky (Wajda's favorite) adorn the film but the most striking is the acting performance of Russian actor-director Nikita Mikhalkov, who can do a great turn as a restrained comic (for example his performance in his half-brother Mikhalkov Konchalovsky's &quot;Siberiade&quot;).\n\nBut in this film a dog plays a major actor's role within a web of friendship and distrust. So does a torn photograph--Zanussi does not seem to believe that photographs can lie.\n\n&quot;Persona non grata&quot; could easily have been named &quot;Suspicion&quot;. The film is an ode to friendships--friends who remain loyal, friends who are not recognized as friends at best of times but are recognized as friends when tragedy strikes, and friends who dislike being insulted even by mistake. The film was screened during the on-going 11th International Film Festival of Kerala, India.\n\nWhat this film proves is that Polish cinema is alive and well! It also proves Zanussi is back at his best form.\n\n","torrent":{"xt":"urn:btih:3c3a5d233b7e886cfc5881f8fb56a9249aedd176","amp;dn":"Persona+Non+Grata.Krzysztof+Zanussi.2005.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c3a5d233b7e886cfc5881f8fb56a9249aedd176","infoHashBuffer":{"type":"Buffer","data":[60,58,93,35,59,126,136,108,252,88,129,248,251,86,169,36,154,237,209,118]},"announce":[],"urlList":[]}}