{"title":"Searching for and Maintaining Peace: Treatise on Peace of Heart","uid":15687564,"size":960955,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3c5b9f624bf9ada020d004a0b8c79572cce21452&amp;dn=Searching+for+and+Maintaining+Peace%3A+Treatise+on+Peace+of+Heart&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"catholicstuff","files":3,"time":1472359430,"description":"Jacques Philippe - Searching for and Maintaining Peace: A Small Treatise on Peace of the Heart (EPUB, MOBI, PDF)\r\n\r\nWe live in an age characterized by agitation and lack of peace. This tendency manifests itself in our spiritual as well as our secular life. In our search for God and holiness, in our service to our neighbor, a kind of restlessness and anxiety take the place of the confidence and peace which ought to be ours. What must we do to overcome the moments of fear and distress which assail us? How can we learn to place all our confidence in God and abandon ourselves into his loving care? This is what is taught in this simple, yet profound little treatise on peace of head. Taking concrete examples from our everyday life, the author invites us to respond in a Gospel fashion to the upsetting situations we must all confront. Since peace of heart is a pure gift of God, it is something we should seek, pursue and ask him for without cease. This book is here to help us in that pursuit.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:3c5b9f624bf9ada020d004a0b8c79572cce21452","amp;dn":"Searching+for+and+Maintaining+Peace%3A+Treatise+on+Peace+of+Heart","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c5b9f624bf9ada020d004a0b8c79572cce21452","infoHashBuffer":{"type":"Buffer","data":[60,91,159,98,75,249,173,160,32,208,4,160,184,199,149,114,204,226,20,82]},"announce":[],"urlList":[]}}