{"title":"Tad Williams - Otherland tetralogy -","uid":10854798,"size":1732721884,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3c93b86acc0a6bc2d79a6071073fae31f58a115b&amp;dn=Tad+Williams+-+Otherland+tetralogy+-+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Primon9","files":104,"time":1408832445,"description":"I don't normally upload files, and am content being an active seeder, because my internet speed is shit. I live in the sticks so I work with what I have. \n\nThat said, I uploaded this torrent because Otherland happens to be one of my favorite stories/book series and I could not find a complete collection in English anywhere. The audio book is in mp3 format, not very high quality (32kbps) and apparently dubbed from the original book on tape. There is nothing I can do about this, I'm lucky I found all 4 books, after hours of searching torrent sites. I even searched through IRC with no luck. All 4 were originally uploaded to audiobookbay and the second book happened to be uploaded incorrectly, so I had to keep searching for that one. \n\nWhile the quality is not on par with most music albums, it is an audio book and I hardly noticed. Therefor, I don't give a shit if you don't like the quality, I did what I could and here it is. If you want 320kbps audio books (overkill IMHO) you can take your ass to the library (assuming your local library has audio versions of the book, mine did not) and rip them yourself. Then upload them here and drop me a link while you're at it, I wouldn't mind dl them myself. \n\nAnyway, enjoy.","torrent":{"xt":"urn:btih:3c93b86acc0a6bc2d79a6071073fae31f58a115b","amp;dn":"Tad+Williams+-+Otherland+tetralogy+-+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c93b86acc0a6bc2d79a6071073fae31f58a115b","infoHashBuffer":{"type":"Buffer","data":[60,147,184,106,204,10,107,194,215,154,96,113,7,63,174,49,245,138,17,91]},"announce":[],"urlList":[]}}