{"title":"Scout Niblett - The Calcination Of Scout Niblett [2010][EAC,log,","uid":8317847,"size":277492728,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:3cc397702e1981d49b96181f292aa32dddc7b02a&amp;dn=Scout+Niblett+-+The+Calcination+Of+Scout+Niblett+%5B2010%5D%5BEAC%2Clog%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":15,"time":1364630211,"description":"Artist: Scout Niblett\nRelease: The Calcination Of Scout Niblett\nDiscogs: 2136619\nReleased: 2010-01-26\nLabel: Drag City\nCatalog#: DC424 / DC424CD\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nStyle: Rock, Alternative Rock\n\nTracklisting:\n\n01. Just Do It!\n02. The Calcination Of Scout Niblett\n03. I.B.D.\n04. Bargin\n05. Cherry Cheek Bomb\n06. Kings\n07. Lucy Lucifer\n08. Duke Of Anxiety\n09. Ripe With Life\n10. Strip Me Pluto\n11. Meet And Greet\n\n\n\nStraight outta Nottingham (but now residing in Portland, Oregon), singer/guitarist (and sometime drum pummeller) Scout Niblett was born Emma Louise, and this is her sixth album. First off, that's some wondrous title. Secondly, she's not displaying much in the way of stylistic evolution, but it's not exactly certain whether this is a negative factor. As ever, raging raw emotion shouts out of Niblett's gullet, whilst sludge-chords resound from her low-hung axe, following the Nirvana (and thence PJ Harvey) school of quiet-then-loud, loud-then-quiet, but nevertheless imposing her own unpredictabilities on this dynamic.\nIt's impossible not to trigger memories of witnessing Niblett's frightening live performance, and concluding that's it's a tough task to harness that intense quality on a recording. Nevertheless, the opening Just Do It! rears up with an overloaded, blooded guitar rush, then unsurprisingly quiets down for some understated strumming, as Niblett makes her inward voicings. It's particularly chilling, setting the mood for the entire album's run. She's a slowly pacing panther, seeking the next opportunity to swoop up her guitar into a menacing crunch-of-release, always searching for the best heightened doom-chord.\nNiblett makes sparing use of primitivist drum eruptions, battering home the down-stroke of each riff, as she makes her dissatisfied moans. The old dynamism techniques never fail. There's another hellish guitar opening to Cherry Cheek Bomb, followed by a brooding sensitivity that eventually explodes into her hardest, heaviest drum-guitar bombast. Even though this technique eventually becomes repetitive and inevitable, it still succeeds every time. Despite a retro-1990s aspect, nothing prevents the songs from crackling with over-spilling energy.\nPerhaps Lucy Lucifer heads too far towards a nursery rhyme cadence, but it's redeemed soon afterwards by the almost-flamenco introduction to Meet and Greet, a gathering storm that turns into a lumbering prog pustulation over the course of its epic nine minutes.","torrent":{"xt":"urn:btih:3cc397702e1981d49b96181f292aa32dddc7b02a","amp;dn":"Scout+Niblett+-+The+Calcination+Of+Scout+Niblett+%5B2010%5D%5BEAC%2Clog%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cc397702e1981d49b96181f292aa32dddc7b02a","infoHashBuffer":{"type":"Buffer","data":[60,195,151,112,46,25,129,212,155,150,24,31,41,42,163,45,221,199,176,42]},"announce":[],"urlList":[]}}