{"title":"AGI- Thompson SMG Armorer Course","uid":4781191,"size":729388485,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3d2fba44d82dda48df2d91e06dcddd1c9383e19f&amp;dn=AGI-+Thompson+SMG+Armorer+Course&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"x_DontTreadOnMe_x","files":-1,"time":1237391311,"description":"Full credit goes to Apex001 of Demonoid for providing this...I am simply moving it here to TPB.\n\n&quot;The Thompson SMG is the classic sub machine gun from which all others are judged. Often referred to as the &quot;Chicago Typewriter&quot; or &quot;the Gun that made the 20's Roar&quot; it was used by both gangsters and law enforcement officers. First developed in 1919 as the &quot;trench broom&quot; from WWI type fighting, only a handful of that model were built, but soon the Thompson evolved into the elegant model 1921 with the drum magazine. Then came the classic 1928 with the Cutts compensator on the muzzle. During WWII the Thompson was redesigned several times to greatly reduce the cost of manufacture. These models include the 1928A1, M1 and M1A1.\n\nIn this video course Master Armorer John D. Bush explains the history of the Thompson and will show you many rare manuals and prints. He then takes you inside each of the models of Thompson including the semi-auto 1927 A-1. You will see complete disassembly, parts identification and reassembly along with trouble shooting suggestions and repairs. You are show how the drum magazine is loaded and you will also be treated to a heart pumping live fire demo of each of the models.\n\nNote: This includes the three technical manuals/blueprints directly from the DVD!&quot;\n\n~~~\n\nI am always adding new things, so check this account often.\n\nVisit roguesci (dot) org (slash) theforum, and register, for the world's longest running largest explosives and weapons forum on the web!","torrent":{"xt":"urn:btih:3d2fba44d82dda48df2d91e06dcddd1c9383e19f","amp;dn":"AGI-+Thompson+SMG+Armorer+Course","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d2fba44d82dda48df2d91e06dcddd1c9383e19f","infoHashBuffer":{"type":"Buffer","data":[61,47,186,68,216,45,218,72,223,45,145,224,109,205,221,28,147,131,225,159]},"announce":[],"urlList":[]}}