{"title":"Kerbal Space Program 0.22 7ZIP (339MB)","uid":9077666,"size":347567215,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3d3513d18c919b8fccd9fd1bb2ca289fe0b2d177&amp;dn=Kerbal+Space+Program+0.22+7ZIP+%28339MB%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bashpr0mpt","files":1,"time":1382319715,"description":"KERBAL SPACE PROGRAM 0.22 LZMA2 SOLID STREAM 7ZIP (339 MB - REQUIRES 7ZIP)\n\n\nDownload 7ZIP here: http://www.7-zip.org/download.html\n\n\nSmallest possible 7ZIP you will get courtesy of a beefy ass computer system misappropriated from the IT labs. Turning 1.51 gigabytes to 339 megabytes for your enjoyment!\n\nAlso, special thanks to h264 for suggesting I post this on behalf of his team just to piss off certain wanker executives at Squad who secretly LOVE me, combining our links we are seeding at 4 megabit for you motherfuckers to enjoy. ;)\n\nAppreciate this? Add me on Twitter, @bashpr0mpt, I'll follow you back. If you like science, tech, and all shit geeky (and don't mind typical Australian profanity riddled tl;dr nerd rages about aspie accuracy levels within Gravity, and how Sandra Bullock's character would NEVER pass NASA/ESA psych evaluations, etc.) then we'll get along like hydrazine and liquid oxygen!\n\nEnjoy blowing shit up guys! And if you like this game, please consider supporting the MODDERS who's code was stolen to make it by seeding this torrent, and please do not buy a copy, Squad's current asking price for vaporware is ridiculous. \n\nSupport your local outlaws! (OFFO, woo!)\n\n\n================================= v0.22.0 ===================================\n\n\n* Career Mode:\n- Career Mode is now open! Although it doesn't do anything. But it's something to pad their change log with to sound like they're actually working for those dolts who actually bought the game.\n\n\n* Research and Development:\n- Added the Research &amp; Development Facility to the Space Center.\n- R&amp;D allows players to unlock parts (and later other stuff) by researching nodes on the Tech Tree (In Career Mode).\n\n* Science:\n- Researching requires Science, which must be earned by performing experiments during your missions.\n- You can now collect surface samples while on EVA, and process them to do Science.\n- Science experiments return results, which are different for each situation in which the experiment is performed. \n- Experiments can (as all proper experiments must) be repeated over many different situations across the whole Solar System. \n- Added a new dialog to show the results of experiments when reviewing the collected data.\n- Added a new dialog to show a breakdown of all scientific progress made after recovering a mission.\n\n* Parts: \n- Added new scientific parts, like the Materials Bay and the Mystery Gooâ„¢ Canister. Also added experiments to many existing parts.\n- The old science sensors now have a purpose. They all have their own experiments which enable them to log scientific data.\n- The antennas are now functional, and can be used to transmit science data back to Kerbin, if recovering the physical experiments is not an option.\n- Antennas consume massive amounts of power when transmitting. Make sure you have fresh batteries in.\n- Added a new deployable antenna, which is an intermediate model compared to the two original ones.\n- Completely remodelled the Communotron 88-88 Comms Dish. The new mesh uses the same placement rules so it won't break ships that have it.\n- Nose Cones now actually help with improving stability during atmospheric flight.\n- Revised a lot of part values and descriptions, in preparation for them actually meaning something in the near future.\n- Overhauled the landing legs and gears, they now have proper shock-absorbing suspensions.\n\n* Editor:\n- WE STOLE A SYSTEM that allows saving and loading of Sub-Assemblies.\n- Subassemblies are subsets of spacecraft, which can later be attached to other designs and re-used.\n\n* Space Center:\n- The KSC Facilities have all been revised, and feature new ground meshes and many other graphical improvements, BUT ARE STILL STOLEN FROM BUZZ ALDRIN'S SPACE RACE.\n- Added lighting FX to several facilities, ALSO STOLEN FROM BASR. The Runway (among many other things) is now properly lit at night.\n- Added a new backdrop and soundtrack for the Astronaut Complex Facility that just sounds like stolen music from The Sims!\n\n\n* Flight:\n- It is now possible to recover a flight after landing/splashdown on Kerbin without going through the Tracking Station. Look above the Altimeter.\n- The SAS system was again largely overhauled, based on all the feedback we've gotten from everyone. It's now stabler than ever. But your shit will still randomly explode for no reason, your HUD will go blank, and shit will break 3 flights out of 4 because we're lazy.\n\n* Solar System:\n- Celestial Bodies now support Biome Maps, which are used to create different conditions for experiments. But as usual, do nothing at all. We'll let modders do the hard work and come up with stuff then steal it later.\n- Biomes are currently implemented on Kerbin and on the Mun, more will be added on later updates by modders, then we'll just take it from them.\n\n* Launcher:\n- We've got a new launcher application for KSP, featuring a news bulletin, patcher management, and also allows you to tweak settings from outside the game and provides us a way to insert spyware onto your system to try and cut down on pirated copies, but it has been disabled in these pirates copies because h264 is a righteous dude.\n\n* Windows and OSX Installers:\n- The KSPStore version of the game can now also be downloaded as an installer wizard on Windows, and as a .dmg image on OSX. But the OSX version is half assed and will break your shit.\n\nBug Fixes and Tweaks:\nWe never fix bugs, we're too lazy.\n\n\n\n\nForeword and justification (or rather, to Squad, and why you are douche bags with more haters than fans, not to mention more users banned than active on your forums):\n\nWith love from BaSH PR0MPT, Squad and I have a bit of a history. When h264's crew started releasing KSP for us all to enjoy and asked me to write a foreword justifying why NOT to financially support these douche canoes they decided to take their websites down and tweet claiming I was 'attacking' them. Mind you, at that time I had no internet access and cited my social network conversations as evidence (and @telstra tickets / my ISP verifying it), but they wanted their fanboy sycophants to silence their critic.\n\nIt all started when I reviewed their game when it first came out, and when I asked them how they planned to deal with the fact that for several 'new build releases' they had basically taken the most popular mods out and incorporated them directly into the game as far as financially rewarding the programmers who did the work they're using, they said, and I quote, &quot;Let them sue us, we're in Mexico lol!&quot; This was the first red flag.\n\nAdmittedly, without the amazing work of talented modders out there, KSP is a pretty flawed horribly banal game. Which I said, in no uncertain terms. My fan base is primarily because I have the integrity to be realistic and honest, unlike some. They banned me for this review. I made another account to ask them wtf for (as at the time, and probably still, if you're banned the forum is installed improperly so you cannot follow the 'how to appeal a ban' method at all, in fact you can't even VIEW that information without ban evading) only to be banned for ban evading. They claimed the original ban was for 'profanity' then two weeks later added profanity to the rules when my supporters pointed out their lies.\n\nThey cite this, massive butt hurt because I got banned from a forum (I am assuming their poor grasp of the English language is why they seem so ... simple?) as to why I was 'attacking' them. So, I feel justified in releasing this torrent on behalf of h264 crew (thanks guys) under my TPB account as a big fuck you to the executives at Squad.\n\nThere are more executives than coders, and more 'community managers' and generic power tripping cock knockers who destroy them as a company. They're as professional as a dog turd, I mean, what company on the official corporate Twitter account tries to start a lynch mob to silence a critic over a bad review? Absurd.\n\nThere are a few decent people at Squad, and I feel for them. h264 has built a good relationship with their programmers, which is why we get a copy released usually a few days before it even goes to the beta testers. (Admittedly these are being released a few days late because where I live we have a 300 km wall of bushfire causing havoc and we're in a state of disaster atm, so I truly apologize for that!) These guys are being used, exploited, and abused by the execs who are just wannabe corporate drop kicks who watched too many 1980's entrepreneur / business hack type movies. Every day they hire more execs on with important sounding titles, and squander the money we, the players, give them.\n\nWhen I wrote my second article exposing their douchery I discovered that the $3,000,000 raised to that date had been squandered, on what? They claim on Kerbal Space Port, even though it's a one click Wordpress install. Three million dollars on one half assed website that's not even fully functional? A likely story. But in Mexico there is little consumer protection, and even fewer regulations on professional conduct of corporations.\n\nThankfully, in Australia, we have the Fair Trading Practices Act which binds any extra-national organisation we trade with to our jurisdiction making our right of jurisdiction inalienable (meaning even if you sign a contract waiving that right it is an invalid contract as it isn't legal) so they could be held accountable in the Australian courts, or Steam would be forced to cease trading with Australia which they would never allow to happen.\n\nSteam really ought to wake up about who they're doing business with. For two years pretty much NOTHING has changed with KSP, the few minor things that have, have again, been stolen code from modders who have been shafted. I've seen several dozen amazingly talented men and women get burned up by Squad and had their shit stolen, it's wrong, and if we as users don't stand up for these people they victimize we will be stuck with half assed shitty vaporware games like KSP-stock which will NEVER be near 'finished'. They even stole Buzz Aldrin's Space Race's design elements and look outright for their most recent overhaul, absolutely NOTHING of KSP isn't stolen that I can see, and it's saddening to see them then use and abuse the modding community.\n\nAlas, this has turned into a novella, but H wanted me state my reasoning for him on this torrent release. Hate on me if it makes you feel better, feel free to trollolol me on Twitter (@bashpr0mpt) and call me all kinds of colorful expletives. But PLEASE appreciate the elements I am addressing here. Consumer rights, and especially protecting the talented users amongst us who make the modded content that gives us hours, days, even years of entertainment deserve to be compensated for their work, and at least protected from abuse. Squad are douchebags and need chemotherapy to excise the cancer running rampant within them, especially with the more egotistical psychotic moderators on the forums who I have seen ban thousands of people simply for asking questions, reporting bugs, or speaking the truth. That kind of fascist bullshit might wash in Mexico, but in nations where we have democracy it won't be tolerated. \n\ntl:dr Being a corporate bully won't get you anywhere but fucked over by us nerds, users, and gamers.","torrent":{"xt":"urn:btih:3d3513d18c919b8fccd9fd1bb2ca289fe0b2d177","amp;dn":"Kerbal+Space+Program+0.22+7ZIP+%28339MB%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d3513d18c919b8fccd9fd1bb2ca289fe0b2d177","infoHashBuffer":{"type":"Buffer","data":[61,53,19,209,140,145,155,143,204,217,253,27,178,202,40,159,224,178,209,119]},"announce":[],"urlList":[]}}