{"title":"Yu-Gi-Oh Collection","uid":4486812,"size":1250080768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3d620703b07e5f4e04801d1d492afae2bee44883&amp;dn=Yu-Gi-Oh+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"vilikene","files":3,"time":1225809058,"description":"Yu-Gi-Oh! Power of Chaos - Yugi the Destiny, Konami&amp;#039;s latest title to bear the license of Kazuki Takahashi&amp;#039;s popular anime, is little more than a bare-bones digital version of the collectible card game upon which the franchise is founded. For Yu-Gi-Oh! fans, the meager options make it less attractive than one of Konami&amp;#039;s dozen or so other, more fully featured Yu-Gi-Oh! games, and to players who don&amp;#039;t already have an investment in the series, it has about as much to offer as a game of solitaire. \n\n\n\nPower of Chaos is a pretty dry translation of the Duel Monsters collectible card game.\n\nThe card game itself is virtually identical to the one seen in the Yu-Gi-Oh! cartoon and the real-world Yu-Gi-Oh! collectible card game, so fans should be instantly familiar with how to play. First-timers, of course, will have a slightly steeper learning curve to deal with, especially if they&amp;#039;re not already knowledgeable about the basics of collectible card games. Most of the basics are elementary enough that you&amp;#039;ll likely you&amp;#039;ll likely catch on with a bit of trial and error, though the game features a serviceable tutorial mode, and the manual that comes with the game is dense with specific information about the subtler nuances of the Duel Monsters game. \n","torrent":{"xt":"urn:btih:3d620703b07e5f4e04801d1d492afae2bee44883","amp;dn":"Yu-Gi-Oh+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d620703b07e5f4e04801d1d492afae2bee44883","infoHashBuffer":{"type":"Buffer","data":[61,98,7,3,176,126,95,78,4,128,29,29,73,42,250,226,190,228,72,131]},"announce":[],"urlList":[]}}