{"title":"Brian Tracy - Psychology of Achievement &amp; Success","uid":4018299,"size":234045794,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3e33e2811eaa9df02bf3347c7647bf68bbd1468e&amp;dn=Brian+Tracy+-+Psychology+of+Achievement+%26+Success&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"prince213","files":80,"time":1202505793,"description":"Audio Format : MP4\n\n\nThe Psychology of Achievement\n\nDiscover how to Achieve ALL of your Goals and live the life you've always dreamed of!\nHave you always wanted to know the secret to unlimited joy, health, money, relationships, love: everything you have ever wanted?\n\nWe've both seen people who have gotten everything they've ever wanted... whether it's driving expensive cars, traveling the world or having fantastic relationships with their family and friends... the question is... how did they get this lifestyle?\n\nIt's simple... these people have discovered the techniques that allow them to achieve ALL their goals.\n\nI have compiled these techniques into 1 easy-to-follow program that will teach you how to create your goals, program yourself for success, take action now and have everything you have ever wanted.\n\nBy applying these techniques now YOU can be the one driving the expensive car, traveling the world and enjoying phenomenal relationships. YOU can be the one to enjoy this lifestyle.\n\n&quot;This program turned my life around. I purchased The Psychology of Achievement when I was unemployed and looking for answers. This program more than delivered. Six months after listening to these CDs, I started my own printing business and I met the woman of my dreams. I'm living the life I have always dreamed of!&quot;\n-- Max Stern, Cincinnati, OH\n\nMillions of people just like you have reached their goals because of The Psychology of Achievement. My 6-CD audio program is a world-wide best-seller. It has sold over 1,000,000 copies and has been translated into 20 different languages.\n\nNow is the time to achieve your goals. Buy The Psychology of Achievement today and begin the life you?ve always wanted to live.\n\nImage\nThe Psychology of Success\n\nLearn how to think and act like the most successful and highest paid people in our society. A blueprint for peak performance and high achievement.\n\n(6 CDs, approximately 7 hours long)\nSession 1: The Psychology of Success\nBrian shares the two steps you must take to achieve greater success. You learn the importance of high self-esteem in creating your own success pattern. Then he reveals 15 thought patterns for success ? concepts that can take you to the very top in record time.\n\nSession 2: The Psychology of Failure\nBy helping you to thoroughly understand failure and its root causes, Brian helps you to avoid it. You learn the value of delaying gratification. He clearly demonstrates that through self-discipline, you can create a new &quot;comfort zone&quot; ? one that practically guarantees your ultimate success.\n\nSession 3: The Principle of Purpose\nIn this session, you make a most amazing discovery: how to activate your success mechanism at will and focus it on meaningful goals. And you learn to override your failure mechanism. You free yourself from the devastating gravitational pull of your E-Factor.\n\nSession 4: The Principle of Excellence\nTrue success comes only when you commit to excellence in whatever you do. All that is required is a slight edge over your competitors. And Brian Tracy shows you how to gain that edge. It's a simple formula you can immediately put into action.\n\nSession 5: The Principle of Responsibility\nAre you suffering from negative emotions, denial and stress? Brian gives you a tool to eliminate them all. And then shows you how to reuse the same tool to attain peak performance. You learn why high achievers welcome responsibility.\n\nSession 6: The Principle of Service\nIn this session, Brian Tracy tells you that by giving others more than they ask, you get much more than you expect in return. You hear and begin testing the validity of The Iron Law of Human Destiny and The Law of Service. You'll want to put them to work for you immediately.\n\nSession 7: The Principle of Concentration\nBy using your powers of concentration and analysis, you notice what needs doing and you do it. You find Brian's distinction between &quot;urgent&quot; work and &quot;important&quot; work quite insightful. You begin focusing on those areas in your life where excellent performance will make an extraordinary difference.\n\nSession 8: The Principle of Cooperation\nDiscover what most high achievers have found ? no one can become a great success without the aid of others. And on this extraordinary cassette side Brian shares with you the core ideas, tips and pointers that enable you quickly to gain the confidence and help of others.\n\nSession 9: The Principle of Creativity\nBecause creativity favors the prepared mind, Brian shows you how to ready your mind for an influx of great ideas. He shows you how to capitalize on your intuitive powers. You also gain new ways to stimulate creativity in yourself and others. You learn the seven-step method for problem solving.\n\nSession 10: The Principle of Self-Development\nDiscover the Law of Accumulation. Put it to work in your life. By devoting just an hour or two a day to your own self-development, you begin to attract not only opportunities, but the right people to help you capitalize on them. These people enter your life at just the right time.\n\nSession 11: The Principle of Integrity\nIn this session, Brian helps us to understand the many meanings of the word &quot;integrity.&quot; You come to understand The Universal Maxim and why you should never compromise your integrity for anyone or anything. Integrity is the keystone that guarantees self-esteem, self-confidence, inner peace and great success.\n\nSession 12: The Principle of Courage\nHear how to conquer your fears and develop your courage, making unshakable commitments to your career, your goals, your relationships and your success. How persistence works hand in hand with courage. And how it works in conjunction with all the principles on this CD program.\n\n\nVisit http://prince213.blogspot.com/ for more...","torrent":{"xt":"urn:btih:3e33e2811eaa9df02bf3347c7647bf68bbd1468e","amp;dn":"Brian+Tracy+-+Psychology+of+Achievement+%26+Success","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e33e2811eaa9df02bf3347c7647bf68bbd1468e","infoHashBuffer":{"type":"Buffer","data":[62,51,226,129,30,170,157,240,43,243,52,124,118,71,191,104,187,209,70,142]},"announce":[],"urlList":[]}}