{"title":"Java Concepts 5th Ed. E-Book","uid":4582249,"size":11328854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e3997fe2682e243ffc868836df95595764b3aa2&amp;dn=Java+Concepts+5th+Ed.+E-Book&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kc767","files":-1,"time":1229471347,"description":"JAVA CONCEPTS, 5TH EDITION E-BOOK\nISBN 978-0-470-10555-9\n\n-----------------------------------\n\n&quot;Let Cay Horstmann teach you to think like a programmer!\n\nIf you really want to master Java, it's not enough to know the code. You must begin to think like a programmer, and in this newest edition of his bestselling guide, Java Concepts, programming guru Cay Horstmann shows you how.\n\nUpdated to integrate Java 6, Java Concepts, Fifth Edition introduces you to fundamental programming techniques and design skills that are crucial to learning how to program. Drawing on his many years of experience as an expert programmer and teacher, Horstmann brings out the most important elements of computing, problem solving, and program design.\n\nThanks to Horstmann's proven formula, you'll complete this book with a thorough grounding in programming concepts and problem-solving and get quickly up to speed writing efficient and successful programs.\n\nFeatures of the new Fifth Edition:\n* The 'Objects Gradual' approach leads you into object-oriented thinking step-by-step, from using classes, implementing simple methods, all the way to designing your own object-oriented programs.\n* A strong emphasis on test-driven development encourages you to consider outcomes as you write programming code so you design better, more usable programs\n* Unique approach goes beyond language syntax to focus on computer science concepts and problem solving, encouraging you to think as a problem solver\n* New teaching and learning tools in WileyPLUS--including a unique assignment checker that enables you to test your programming problems online before you submit them for a grade\n* Helpful &quot;Testing Track&quot; introduces techniques and tools step by step, ensuring that you master one before moving on to the next\n* Graphics topics are developed gradually throughout the text, conveniently highlighted in separate color-coded sections\n* Updated coverage is fully compatible with Java 5 and includes a discussion of the latest Java 6 features&quot;\n\n-----------------------------------\n\nTHIS FILE IS CLEAN!","torrent":{"xt":"urn:btih:3e3997fe2682e243ffc868836df95595764b3aa2","amp;dn":"Java+Concepts+5th+Ed.+E-Book","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e3997fe2682e243ffc868836df95595764b3aa2","infoHashBuffer":{"type":"Buffer","data":[62,57,151,254,38,130,226,67,255,200,104,131,109,249,85,149,118,75,58,162]},"announce":[],"urlList":[]}}