{"title":"Venetica.Repack-R.G.Mechanics","uid":10235258,"size":2748016592,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3e45bd34dba8f7380db5c62e4089498db54e9d35&amp;dn=Venetica.Repack-R.G.Mechanics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Taker009","files":-1,"time":1401167841,"description":"Venetica.Repack-R.G.Mechanics\n\nYear: 2009\nGenre: RPG / 3D / 3rd Person\nDeveloper: Deck13 Interactive\nPublisher: dtp entertainment\nPublication Type: RePack\nGame Language: Eng | Rus\nVoice Language: Eng | Rus\nCrack: TRIVIUM\n\nSystem requirements:\n\nOperating System: Microsoft  Windows  XP (with Service Pack 2) or Windows Vista Â®\nProcessor: Intel  Pentium  2,4 GHz or equivalent Athlon  64\nMemory: 1 GB\nVideo: 3D-graphics adapter with 256 MB memory, compatible with DirectX  9.0c \n(ATI Â® Radeon / GeForce Â® 7600 GT or better, except for embedded \ngraphics and MX-series)\nSound Card: Sound device compatible with DirectX  9.0\nFree space on hard disk: 11 GB\n\nDescription:\n\n&quot;That death is like a dream, will bring joy to&quot; William Shakespeare. Hamlet. \n\nVenice. XVI century. Pretty girl named Scarlett of quiet and cozy village \nlives his happy life and no idea what tests will soon fall on her fragile \nshoulders. After her dad by profession, not a mechanic and carpenter, \nand not even climber, and the most that neither is a true death.\nContrary to popular perceptions to take such a &quot;vacant&quot; position can \nany mortal. Not on their own, of course: there is a special Council, \nwhich periodically starts carefully sort through candidates studying \ntheir biography, achievements, poring over resumes and eventually \nmake the appointment. Each appointed, that was not too hard, is \nendowed with a number of unique abilities.\nHowever, by the time the father Scarlett took office, the former \nVictoria's death with the help of black magic could achieve immortality \nand refused to give the post to someone else, and so as not to dispute \narises, a new candidate for the Board he had kidnapped. Here is where \nour story begins, full of battles, puzzles and exciting adventures ...\nYou will explore Venice, open world of beautiful Italian cities. Nothing \nprevents you buy gondola and swim the famous canals. Engage in \ndialogue with random passers-by, sidequests, quarrel, make friends, \nfall in love and hatred. Solve clever puzzles - or resort to brute force. \nSometimes have to work not only his head, but with a sledgehammer.\nParticular attention should be paid to the combat system of the game. \nSimple zaklikivanie enemy - is the last century. It is necessary to \nselect a variety of enemies your approach to use different combos \n(the set of which will depend on your performance and the weapons used) \nand regularly change the tactics of their actions, as the enemies in the \ngame scrutinize your fighting techniques and adjust to them. And do not \nforget about the magic! After all, you're not just anybody, \nbut the daughter of Death!\n\nFeatures:\n\nColorful graphics\nCharming protagonist\nThe unique setting and trivial plot\nA large variety of weapons and magic\nDynamic gameplay, combining quality action games and classic RPG\nHuge open world\nTwo of the world (the world of the living and the world of the dead) \nto move between which you can in an instant\nDynamic change of day and night, which affects the whole city life\nIntuitive control system\n\n\nFeatures repack\n\nVenetica\nVersion of the game - v1.2\nDo not cut / recoded\nAbility to select a combination of text and voice ","torrent":{"xt":"urn:btih:3e45bd34dba8f7380db5c62e4089498db54e9d35","amp;dn":"Venetica.Repack-R.G.Mechanics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e45bd34dba8f7380db5c62e4089498db54e9d35","infoHashBuffer":{"type":"Buffer","data":[62,69,189,52,219,168,247,56,13,181,198,46,64,137,73,141,181,78,157,53]},"announce":[],"urlList":[]}}