{"title":"Bipolar Disorder - A Guide for Patients and Families - 3rd Editi","uid":9836672,"size":3695634,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e5bd0801dce1e2b50c37345ec1f3c62b8645e8b&amp;dn=Bipolar+Disorder+-+A+Guide+for+Patients+and+Families+-+3rd+Editi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AtomTPB","files":1,"time":1395928768,"description":"Pages: 304 pages\nPublisher: Johns Hopkins University Press; 3rd Revised edition edition (21 March 2014)\nLanguage: English\nISBN-10: 1421412063\nISBN-13: 978-1421412061\nFormat: PDF\n\n\nCompassionate and comprehensive, Dr. Francis Mondimore's pathbreaking guide has helped thousands of people and their loved ones cope with bipolar disorder. Now in its third edition, Bipolar Disorder has been thoroughly updated with new information about the causes of the disorder, tools for diagnosis, and advances in treatment. Dr. Mondimore surveys new medications for treating bipolar disorder, including asenapine, iloperidone, paliperidone, lurasidone, and oxcarbazepine, exploring the benefits and potential side effects of each. He also reviews the scientific studies that back up claims for recommended nutritional supplements, such as omega-3s and NAC - and tells you which ones to leave on the shelf. Dr. Mondimore discusses recent changes in the Diagnostic and Statistical Manual of Mental Disorders (DSM-5) and reviews the exciting new findings of the largest multicenter evaluation of best-treatment practices for bipolar disorder ever carried out, the Systematic Treatment Enhancement Program for Bipolar Disorder (STEP-BD). He describes how these findings, gleaned from the treatment experiences of thousands of patients, will improve treatment decisions. With insight and sensitivity, Dr. Mondimore makes complex medical concepts easy to understand and describes what it is like for people to live with bipolar disorder. He recommends changes to daily routines and lifestyle that will improve the quality of life for patients and offers expert advice on planning for emergencies and identifying when and how to seek help. Throughout the book, Dr. Mondimore focuses on the importance of building a support system for everyone affected by this unpredictable illness.","torrent":{"xt":"urn:btih:3e5bd0801dce1e2b50c37345ec1f3c62b8645e8b","amp;dn":"Bipolar+Disorder+-+A+Guide+for+Patients+and+Families+-+3rd+Editi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e5bd0801dce1e2b50c37345ec1f3c62b8645e8b","infoHashBuffer":{"type":"Buffer","data":[62,91,208,128,29,206,30,43,80,195,115,69,236,31,60,98,184,100,94,139]},"announce":[],"urlList":[]}}