{"title":"Saussy-Rulers of Evil(Roman origins of USA)(1999)","uid":5092710,"size":13582558,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3e709d18d0d7379a6d7952f73853954b951f04ba&amp;dn=Saussy-Rulers+of+Evil%28Roman+origins+of+USA%29%281999%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1253281238,"description":"This is F. Tupper Saussy's mindblowing book Rulers of Evil - Useful Knowledge About Governing Bodies (1999) which shows step by step how the foundation of the United States of America was preconcived on the basis of the Roman pagan system. Saussy, a Grammy-nominated songwriter and author of bestseller Miracle on Main Street, makes a case here that will strike most readers as they are about to see how papacy really does run United States foreign policy and has always done so. To prove how the pope controls Washington, Saussy offers evidence such as the number of Catholic senators and other high government officials or that the land known today as the District of Columbia bore the name Rome in 1663 property records. How else could one explain the design of the capitol building, with the great pilars of the roman era and the overwhelming proof of the pagans in the &quot;dome of the capital&quot;, depicting the pagan rulers of America. Further, he argues that the Jesuits have imbued western culture with a purely Catholic political theory as seen in the American Revolution, which in turn was brought about by a Jesuit priest, Lorenzo Ricci (aka Laurence Richey), as part of a plan to make America safe for Roman Catholics. They were oppressed in colonial times but Catholic immigrants flooded into the U.S. from Europe in the decades following the Revolution. The author shows how corrupt American leaders are and what their evil intent is for the society. It's compelling information for those who &quot;need to know&quot; the truth, but cannot be viewed without a foundation in the history of the evil of financial insturments. The true intent of the bankers who control our destiny is very evident in the paper we use in our everyday lives, printed as an all knowing &quot;eye&quot; over the rulers who obey it's every comand without question and are rewarded with a top spot on the pryamid. They are then given the power to rule the world over the masses positioned underneath them for their undying loyalty to the unknown &quot;eye.&quot; The question is who is the ruling eye and how do you get in touch with it? Rulers of Evil is packed with history which has been hidden by the fascists who continue to try and run our lives and take over our governments. Although it is hard for the average person to accept the theories of this book in reference to the aide in the creation of the United States and other western events, the book lays out the 'other side' of history that many historians acknowledge but which never makes it into the history books. 350 pages, many pictures. A must read for everyone.\n","torrent":{"xt":"urn:btih:3e709d18d0d7379a6d7952f73853954b951f04ba","amp;dn":"Saussy-Rulers+of+Evil%28Roman+origins+of+USA%29%281999%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3e709d18d0d7379a6d7952f73853954b951f04ba","infoHashBuffer":{"type":"Buffer","data":[62,112,157,24,208,215,55,154,109,121,82,247,56,83,149,75,149,31,4,186]},"announce":[],"urlList":[]}}