{"title":"D600 Field Guide","uid":8306312,"size":84070959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ef898eef0c6b64e9a3f0375de2e6b837582421d&amp;dn=D600+Field+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Synergyc200","files":1,"time":1364383976,"description":"Everything you need to know to take amazing photos with your Nikon D600\nThis full-color, portable guide goes beyond the owner's manual to deliver clear, succinct descriptions of how the Nikon D600's features and functions work. Perfectly sized to fit in your camera bag, this portable guide offers professional advice on everything from composing a variety of shots to choosing lenses and downloading photos. Veteran author J. Dennis Thomas clearly explains how to get the exact shots you want, when you want them, and shares beautiful color photos from his own collection.\n\nFeatures step-by-step instructions and full-color images of each menu screen\nTeaches you how to adjust white balance, autofocus, exposure, and choose lenses, and when and why to use each of those settings\nCovers the essentials of lighting, composition, and exposure\nIncludes a bonus gray and color checker card that allows new DSLR owners to capture perfect color in any environment.\n\nPacked with amazing examples, Nikon D600 Digital Field Guide helps you master all the menus, modes and controls of this feature-filled dSLR, and presents you with a variety of tips and tricks to capturing portraits, candids, sports, travel, macro photography, and much more.","torrent":{"xt":"urn:btih:3ef898eef0c6b64e9a3f0375de2e6b837582421d","amp;dn":"D600+Field+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ef898eef0c6b64e9a3f0375de2e6b837582421d","infoHashBuffer":{"type":"Buffer","data":[62,248,152,238,240,198,182,78,154,63,3,117,222,46,107,131,117,130,66,29]},"announce":[],"urlList":[]}}