{"title":"With Liberty and Justice for Some (2011) by Glenn Greenwald","uid":10198398,"size":419010,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:3ff7b0bef939d6cf52e1fd890767f5393bd38e01&amp;dn=With+Liberty+and+Justice+for+Some+%282011%29+by+Glenn+Greenwald&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thezman007","files":-1,"time":1400727140,"description":"With Liberty and Justice for Some - How the Law Is Used to Destroy Equality and Protect the Powerful (2011) by Glenn Greenwald.epub\n\nFrom &quot;the most important voice to have entered the political discourse in years&quot; (Bill Moyers) and the journalist who broke the story on NSA spying programs comes a scathing critique of the two-tiered system of justice that has emerged in America\n\nFrom the nation's beginnings, the law was to be the great equalizer in American life, the guarantor of a common set of rules for all. But over the past four decades, the principle of equality before the law has been effectively abolished. Instead, a two-tiered system of justice ensures that the country's political and financial class is virtually immune from prosecution, licensed to act without restraint, while the politically powerless are imprisoned with greater ease and in greater numbers than in any other country in the world.\n\nStarting with Watergate, continuing on through the Iran-Contra scandal, and culminating with Obama's shielding of Bush-era officials from prosecution, Glenn Greenwald lays bare the mechanisms that have come to shield the elite from accountability. He shows how the media, both political parties, and the courts have abetted a process that has produced torture, war crimes, domestic spying by the NSA, and financial fraud.\n\nCogent, sharp, and urgent, this is a no-holds-barred indictment of a profoundly un-American system that sanctions immunity at the top and mercilessness for everyone else.\n\n304 pages\nPublisher: Metropolitan Books (October 25, 2011)\nLanguage: English\nISBN-10: 0805092056\nASIN: B00B9ZGAH2","torrent":{"xt":"urn:btih:3ff7b0bef939d6cf52e1fd890767f5393bd38e01","amp;dn":"With+Liberty+and+Justice+for+Some+%282011%29+by+Glenn+Greenwald","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3ff7b0bef939d6cf52e1fd890767f5393bd38e01","infoHashBuffer":{"type":"Buffer","data":[63,247,176,190,249,57,214,207,82,225,253,137,7,103,245,57,59,211,142,1]},"announce":[],"urlList":[]}}