{"title":"DV8 [BBN][h33t]","uid":4044409,"size":498513554,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4054c6a3213f3ead74f6a8e0e4a271b1512499ec&amp;dn=DV8+%5BBBN%5D%5Bh33t%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"seedYAbastid","files":42,"time":1203837865,"description":"\n[IMG]http://img295.imageshack.us/img295/5236/dv8132bx8.png[/IMG]\nDV8 00, 0.5 - 32\n\n[IMG]http://img245.imageshack.us/img245/1786/dv8annbm3.png[/IMG]\nDV8 Annuals\n\n[IMG]http://img337.imageshack.us/img337/1562/blackopib5.png[/IMG]\nDV8 vs. Blackops 1-3\n\n[quote]DV8 is a comic book published by Image/Wildstorm. The premise is similar to GenÂ¹Â³, also published by Wildstorm and most of the characters made their debut in GenÂ¹Â³. It revolves around the lives of a group of Gen-Active people (Called DV8, or referred to as &quot;The Deviants&quot;), initially living in New York under the supervision of Ivana Baiul, who sends them on life-threatening black ops assignments.\n\nRather than saving the world, they use their powers for other demoralizing reasons: to please themselves and indulge in any fancy that comes their way, uncaring about anybody else, just to forget that they are all just pawns to Ivana, expendable to her needs and desires. The members don&amp;#039;t like each other, but are soon banding together for survival. This is what stands this book apart from most other superhero teams: they aren&amp;#039;t heroes, they are not nice people, don&amp;#039;t even like each other and can&amp;#039;t even save themselves, let alone the world.\n\nLater on in the series, Baiul becomes director of International Operations and the team become agents of I.O. as well, at this point some of the members start to develop a conscience about their actions, especially Frostbite.\n\nUnlike GenÂ¹Â³, the overall nature of the comic was often very violent and extreme (even more so in the first few issues), with sexual themes, graphic violence, mild language and dialogue (especially between the team members), and general recklessness. Especially the character Sideways Bob brought a dark, over the top sense of humor to the series. The series lasted 32 issues, and was a best seller, until later issues in the second half lagged in sales. Because of this, Wildstorm cancelled DV8, but allowed the creative team to bring a proper end to the comic, instead of ending the comic and leaving many questions unanswered. The story of most DV8 members continued in the pages of Gen-Active, an anthology-series featuring various Wildstorm characters. Gen-Active lasted 6 issues.\n\nIn light of the Worldstorm relaunch, which preserved some aspects of original history while rewriting the others, often creating apparent contradictions, the status of DV8 in Wildstorm continuity is uncertain.[/quote]\n\n\n\nBIG THANKS to all the scanners involved.\n\nIF YOU LIKE THE BOOK, THEN BUY THE COMICS OR THE TRADES. SUPPORT YOUR LOCAL COMIC BOOK STORES AND THE INDEPENDENT PUBLISHERS!!!\n\nPlease keep seeding and enjoy! :D","torrent":{"xt":"urn:btih:4054c6a3213f3ead74f6a8e0e4a271b1512499ec","amp;dn":"DV8+%5BBBN%5D%5Bh33t%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4054c6a3213f3ead74f6a8e0e4a271b1512499ec","infoHashBuffer":{"type":"Buffer","data":[64,84,198,163,33,63,62,173,116,246,168,224,228,162,113,177,81,36,153,236]},"announce":[],"urlList":[]}}