{"title":"Hypnotic Writing","uid":8734313,"size":842669,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:413de43318e6a919420dad91d8db7e8f61f503cd&amp;dn=Hypnotic+Writing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"livhre","files":-1,"time":1374657080,"description":"Format: ePub\n\nDRM stripped in Calibre.\n\n\nDiscover the secrets of written persuasion!\n\n&quot;The principles of hypnosis, when applied to copywriting, add a new spin to selling. Joe Vitale has taken hypnotic words to set the perfect sales environment and then shows us how to use those words to motivate a prospect to take the action you want. This is truly a new and effective approach to copywriting, which I strongly recommend you learn. It's pure genius.&quot;\n-Joseph Sugarman, author of Triggers\n\n&quot;I've read countless book on persuasion, but none come close to this one in showing you exactly how to put your readers into a buying trance that makes whatever you are offering them irresistible.&quot;\n-David Garfinkel, author of Advertising Headlines That Make You Rich\n\n&quot;I am a huge fan of Vitale and his books, and Hypnotic Writing (first published more than twenty years ago), is my absolute favorite. Updated with additional text and fresh examples, especially from e-mail writing, Joe's specialty, Hypnotic Writing is the most important book on copywriting (yes, that's really what it is about) to be published in this century. Read it. It will make you a better copywriter, period.&quot;\n-Bob Bly, copywriter and author of The Copywriter's Handbook\n\n&quot;I couldn't put this book down. It's eye opening and filled with genuinely new stuff about writing and persuading better. And it communicates it brilliantly and teaches it brilliantly-exemplifying the techniques by the writing of the book itself as you go along.&quot;\n-David Deutsch, author of Think Inside the Box, www.thinkinginside.com\n\n&quot;Hypnotic Writing is packed with so much great information it's hard to know where to start. The insights, strategies, and tactics in the book are easy to apply yet deliver one heck of a punch. And in case there's any question how to apply them, the before-and-after case studies drive the points home like nothing else can. Hypnotic Writing is not just about hypnotic writing. It is hypnotic writing. On the count of three, you're going to love it. Just watch and see.&quot;\n-Blair Warren, author of The Forbidden Keys to Persuasion\n\n\nPlease seed and rate the torrents I upload. Go to kobobooks.com and choose books that you want uploaded and request them in the comments.\nNote: Comics on that site are in some weird ass format that only works on iOS and Android. To get those I have to go through the tired process of screen shots of each page, then create a word file, then convert to epub. Its a pain because even then the images may not show up right on some devices/apps.\n\nSupport Amas school of technology. The only school of its kind in an entire 3rd world country that doesn't force poor people to pay.","torrent":{"xt":"urn:btih:413de43318e6a919420dad91d8db7e8f61f503cd","amp;dn":"Hypnotic+Writing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"413de43318e6a919420dad91d8db7e8f61f503cd","infoHashBuffer":{"type":"Buffer","data":[65,61,228,51,24,230,169,25,66,13,173,145,216,219,126,143,97,245,3,205]},"announce":[],"urlList":[]}}