{"title":"Reimagining Global Health, An Introduction [PDF] [StormRG]","uid":10893181,"size":48720707,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41aed7bb7eedee39f55a1bb1584706cb020722ab&amp;dn=Reimagining+Global+Health%2C+An+Introduction+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":2,"time":1409145067,"description":"Author: Paul Farmer (Editor), Arthur Kleinman (Editor), Jim Yong Kim (Editor), Matthew Basilico (Editor)\nSeries: California Series in Public Anthropology (Book 26)\nPaperback: 504 pages\nPublisher: University of California Press; 1 edition (September 7, 2013)\nLanguage: English\nISBN-10: 0520271998\nISBN-13: 978-0520271999\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nBringing together the experience, perspective and expertise of Paul Farmer, Jim Yong Kim, and Arthur Kleinman, Reimagining Global Health provides an original, compelling introduction to the field of global health. Drawn from a Harvard course developed by their student Matthew Basilico, this work provides an accessible and engaging framework for the study of global health. Insisting on an approach that is historically deep and geographically broad, the authors underline the importance of a transdisciplinary approach, and offer a highly readable distillation of several historical and ethnographic perspectives of contemporary global health problems.\n\nThe case studies presented throughout Reimagining Global Health bring together ethnographic, theoretical, and historical perspectives into a wholly new and exciting investigation of global health. The interdisciplinary approach outlined in this text should prove useful not only in schools of public health, nursing, and medicine, but also in undergraduate and graduate classes in anthropology, sociology, political economy, and history, among others.\n","torrent":{"xt":"urn:btih:41aed7bb7eedee39f55a1bb1584706cb020722ab","amp;dn":"Reimagining+Global+Health%2C+An+Introduction+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41aed7bb7eedee39f55a1bb1584706cb020722ab","infoHashBuffer":{"type":"Buffer","data":[65,174,215,187,126,237,238,57,245,90,27,177,88,71,6,203,2,7,34,171]},"announce":[],"urlList":[]}}