{"title":"[Jann Wenner] The Rolling Stone Interviews(pdf){Zzzzz}","uid":11421791,"size":1994772,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:41c8d57b5b8c136984a0c7d97e3bb848b8868b9f&amp;dn=%5BJann+Wenner%5D+The+Rolling+Stone+Interviews%28pdf%29%7BZzzzz%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1415628734,"description":"The greatest interviews with the greatest rock stars, movie stars, and cultural icons--uncensored and unfiltered--are published together in one remarkable volume in celebration of &quot;Rolling Stones&quot; 40th anniversary.\n\nPublisher: Back Bay Books (1 Nov 2007)\nLanguage: English\nISBN-10: 0316005266\nISBN-13: 978-0316005265\n\nMost Helpful Customer Reviews\n\nA who's who of pop culture 4 Nov 2008\nBy M. Griffiths -\nWhat I love about this book is the ability to pick an interview up depending what your mood/interest might be. Want something vitriolic then the John Lennon interview is blistering. Or something raw and tragic then the interview (which immediately follows Kurt Cobain's) is the way to go.\n\nThere are so many fascinating subjects in this book from Jim Morrison, Brian Wilson, Tina Turner, Enimen and Bill Clinton. Many of the interviews are 'of the moment' interviews, meaning that i get the feeling they were done at the height of their celebrity so at times there is a lack of reflection. Nevertheless it's fascinating to hear many of them speak about their past and how this relates to where they are at that point in time.\n\nThe only wish I had was perhaps for more interviews with women, I think the Tina Turner and Joni Mitchell interview are the only ones with a female subject in a book of over 20 interviews. Additionally now that I write this I think it would be great if Rolling Stone actually compiled a book consisting of actual published articles on bands and musicians. And at times I found the question... answer format a little disjointing at times.\n\nNevertheless this is a great holiday book or where you want to have a quick read because the insight you get in 15 minutes is quite satisfying.\n\nA fine piece of history 26 July 2011\nBy Goncalo Martins -\nThis book is a collection of some of the best Rolling Stone interviews made between the end of the 60s (when Rolling Stone was founded) and the mid 00s. The book contains interviews with famous people from different areas (John Lennon, Oriana Fallaci, Francis Ford Coppola, Bill Clinton, the Dalai Lama, etc) and you feel like you are really there when the interview is taking place, you can easily picture yourself inside those four walls where the interview happened and see the interviewees confiding stuff they never had to the public in an incredible way. It's a page turner, and above all an educative and really fun book that will positively surprise most readers (it did in my case).\n\nEnjoyable 'verbal snapshots' of a wide range of interesting figures 27 Jun 2014\nBy joe s -\nFunny, revealing, and insightful interviews with celebrities from the music, literary, political and business circles. Context and editing are really well done. How can you not enjoy a compilation where Jerry Garcia comes across as Mr Everyman and Bill Clinton's temper gets front page treatment?\n\nI recommend this collection to anyone who enjoys great interviews (and interesting revelations) from public figures.\n\nA must-read! 8 May 2014\nBy sgordonmark -\nIf anything gives an idea of American society during the period of these interviews, it is this publication. Rolling Stone interviewed the key artists, writers, politicians, and other society movers of the time and they spoke freely","torrent":{"xt":"urn:btih:41c8d57b5b8c136984a0c7d97e3bb848b8868b9f","amp;dn":"%5BJann+Wenner%5D+The+Rolling+Stone+Interviews%28pdf%29%7BZzzzz%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41c8d57b5b8c136984a0c7d97e3bb848b8868b9f","infoHashBuffer":{"type":"Buffer","data":[65,200,213,123,91,140,19,105,132,160,199,217,126,59,184,72,184,134,139,159]},"announce":[],"urlList":[]}}