{"title":"The Illuminati (part 2)","uid":3652227,"size":727996292,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41f58db4c6818006351c8885900ea525aaced8ff&amp;dn=The+Illuminati+%28part+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"chinyvarupe","files":1,"time":1175419022,"description":"The Illuminati was a secret society in Bavaria in the late 18th century. They had a political agenda that included republicanism and abolition of monarchies, which they tried to institute by means of subterfuge, secrecy, and conspiracy, including the infiltration of other organizations. They fancied themselves to be &quot;enlightened&quot; but they had little success and were destroyed within fifteen years of their origin (Pipes 1997).\n\nParanoid conspiracy theorists (PCTs) believe the Illuminati cabal still exists, either in its original form or as a paradigm for later cabals. Many PCTs believe &quot;that large Jewish banking families have been orchestrating various political revolutions and machinations throughout Europe and America since the late eighteenth century, with the ultimate aim of bringing about a satanic New World Order.&quot;* What George Bush was talking about in his state of the union address in 1991 was no less than the establishment of a single world government with the anti-Christ (whom some say is Bill Clinton (or is he a decoy?), but could be Pat Robertson or George W. Bush) at its head.\n\n","torrent":{"xt":"urn:btih:41f58db4c6818006351c8885900ea525aaced8ff","amp;dn":"The+Illuminati+%28part+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41f58db4c6818006351c8885900ea525aaced8ff","infoHashBuffer":{"type":"Buffer","data":[65,245,141,180,198,129,128,6,53,28,136,133,144,14,165,37,170,206,216,255]},"announce":[],"urlList":[]}}