{"title":"Code 46 2003.DVDRip.H.263.DivX . NVEE","uid":8560523,"size":1139932412,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41fde669fccfa975faf1b6c54a8d1a3c5cbef3bc&amp;dn=Code+46+2003.DVDRip.H.263.DivX+.+NVEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":".NVEE","files":12,"time":1370871707,"description":"FULL_INFOs\n\n\n99.99% --- SYNCED GUARANTEED \n\nSource : DVD\n\nMy Media Player of Choice &quot;VLC Media Player&quot;\n\nSpoken Language : English Only\n\nAudio : 6 ~ Channels Only\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0345061/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0345061/&lt;/a&gt;\n\n\nSubs Info : MULTI_SUBS\n\n &lt;a href=&quot;\nhttp://www.subtitleseeker.com/0345061/Code+46/Subtitles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subtitleseeker.com/0345061/Code+46/Subtitles/&lt;/a&gt;\n\n190 Subtitles In 25 Languages Use Link Provided \n &lt;a href=&quot;\nhttp://www.subtitleseeker.com/0345061/Code+46/Subtitles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subtitleseeker.com/0345061/Code+46/Subtitles/&lt;/a&gt;\n\n190 Subtitles In 25 Languages Only @ SubtitleSeeker\n &lt;a href=&quot;\nhttp://www.subtitleseeker.com/0345061/Code+46/Subtitles/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.subtitleseeker.com/0345061/Code+46/Subtitles/&lt;/a&gt;\n\nAll .srt subs can be turned On/Off\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0345061/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0345061/&lt;/a&gt;\n\n\nGeneral\n\n\nComplete name : Code 46 2003.DVDRip.H.263.DivX . NVEE.divx\nFormat : AVI\nFormat/Info : Audio Video Interleave\nFile size : 1.06 GiB\nDuration : 1h 26mn\nOverall bit rate : 1 757 Kbps\n\n\nVideo\n\n\nID : 0\nFormat : MPEG-4 Visual\nFormat settings, BVOP : 1\nFormat settings, QPel : No\nFormat settings, GMC : No warppoints\nFormat settings, Matrix : Default (H.263)\nMuxing mode : Packed bitstream\nCodec ID : DX50\nCodec ID/Hint : DivX 5\nDuration : 1h 26mn\nBit rate : 1 300 Kbps\nWidth : 720 pixels\nHeight : 304 pixels\nDisplay aspect ratio : 2.35:1\nFrame rate : 25.000 fps\nColor space : YUV\nChroma subsampling : 4:2:0\nBit depth : 8 bits\nScan type : Progressive\nCompression mode : Lossy\nBits/(Pixel*Frame) : 0.237\nStream size : 804 MiB (74%)\nTitle : Video\nWriting library : DivX 6.8.2 (UTC 2008-05-17)\n\n\nAudio\n\n\nID : 1\nFormat : AC-3\nFormat/Info : Audio Coding 3\nMode extension : CM (complete main)\nFormat settings, Endianness : Big\nCodec ID : 2000\nDuration : 1h 26mn\nBit rate mode : Constant\nBit rate : 448 Kbps\nChannel(s) : 6 channels\nChannel positions : Front: L C R, Side: L R, LFE\nSampling rate : 48.0 KHz\nBit depth : 16 bits\nCompression mode : Lossy\nStream size : 277 MiB (25%)\nAlignment : Split accross interleaves\nInterleave, duration : 40 ms (1.00 video frame)\nInterleave, preload duration : 500 ms\nTitle : Audio\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0345061/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0345061/&lt;/a&gt;\n\n\nPlot\n\nIn the near future the world is divided between those who live &quot;inside&quot;, in high-density cities, while those who live &quot;outside&quot;, are a poor underclass. Access to the cities is highly restricted, and regulated through the use of health documents, known as &quot;papelles&quot; in the global pidgin language of the day (comprises of elements of English, Spanish, French, Arabic, Italian, Farsi and Mandarin).\nMost city residents only venture outside after dark since direct sunlight is now considered hazardous to their health. However, many residents still venture outdoors during the day. The government appears to be authoritarian and dystopian. Society is regulated by various &quot;codes&quot;. The code of the movie title prohibits &quot;genetically incestuous reproduction&quot;, which may occur as a result of the various medical technologies which have become commonplace, such as cloning.\nThe main character is William Geld (Tim Robbins), an insurance fraud investigator who is sent to Shanghai to interview employees at a company known as &quot;The Sphinx&quot;, which manufactures &quot;covers&quot;, ostensibly &quot;insurance cover documents&quot; but which in fact regulate the movements of people between cities and &quot;inside&quot; and &quot;outside&quot;. William's assignment is to identify employees who are suspected of forging &quot;covers&quot;. After interviewing numerous Sphinx employees, he identifies a young worker named Maria Gonzalez (Samantha Morton) as the forger. He is able to do this using a genetically engineered &quot;empathy virus&quot; which allows him to gain information from people if they voluntarily reveal something about themselves. Maria tells William that she has the same dream each birthday: she is traveling the subway to meet someone she cannot identify. Each birthday she is one station closer to her destination, where she expects to meet the person. William is captivated by her, and instead of turning her over to security, identifies another employee as the forger.\nWilliam then meets up with Maria and they begin an affair. Putting complete trust in a man who could have had her arrested, Maria reveals how she was able to smuggle papelles out of her workplace. In a nightclub they meet Damian (David Fahm), a naturalist who longs to travel to Delhi to study bats. He has applied for cover for eight consecutive years but has always been refused. Maria supplies Damian with a papelle. William is upset by this and indicates that he should turn Maria over to the authorities, but Maria knows he won't. William explains that there are legitimate reasons why Damian is unable to obtain the proper clearances legally. Maria believes that some risks are worth taking to fulfill one's dreams.\nBack at her apartment, Maria shows William her &quot;memory scrapbook&quot; (an electronic booklet that records video from the user's mind), which contains memories of her parents and friends. Other movies show her passing papelles to various people. She thinks they are beautiful and their eyes are full of desire and dreams, and that they have a different look from &quot;everyday&quot; people. As Maria sleeps, William finds a forged cover in her room and takes it.\nWilliam's travel cover will expire the next day so he returns home to his family. On the way to the airport, he gives the forged cover to a street vendor at the city's perimeter checkpoint, an act of humanity which could change the vendor's life. Later, he learns that Damian died in Delhi after exposure to a virus to which he had no immunity. William is reprimanded for not discovering the true Sphinx forger. He explains that he had trouble with his empathy virus and requests that someone else be sent, as there may have been an accomplice to the innocent man he fingered as the guilty party. However, he is ordered to deal with the problem and to return to Shanghai.\nUpon his return William discovers that Maria has gone. Her apartment is abandoned and the only clue is a medical clinic appointment.\nHuman DNA has 46 chromosomes (23 pairs). Critic Roger Ebert comments that the character of Maria Gonzalez &quot;suggests ethnic distinctions have been lost in generations of government-supervised DNA matchups&quot;.\n\nSee me torrents'n seed me torrents !\n             (Thank You)","torrent":{"xt":"urn:btih:41fde669fccfa975faf1b6c54a8d1a3c5cbef3bc","amp;dn":"Code+46+2003.DVDRip.H.263.DivX+.+NVEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41fde669fccfa975faf1b6c54a8d1a3c5cbef3bc","infoHashBuffer":{"type":"Buffer","data":[65,253,230,105,252,207,169,117,250,241,182,197,74,141,26,60,92,190,243,188]},"announce":[],"urlList":[]}}