{"title":"Need for Speed ProStreet v1.1 Full Rip","uid":3943579,"size":3323129088,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:42454a487ed6ec2e20513b7355b528ec718c6780&amp;dn=Need+for+Speed+ProStreet+v1.1+Full+Rip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ADHDerby","files":2,"time":1198317194,"description":"Need for Speed ProStreet v1.1 Full Rip\n\n\nCompete at the highest level of street racing with Need for SpeedÃƒÂ¢?Ã‚Â¢ ProStreet. It's no longer good enough to simply rule your local neighborhood; you need to dominate on a global stage. Build the ultimate battle machine, take it to multi-disciplinary showdowns, and pit your skills and reputation against the world's best street racers. Need for Speed ProStreet is the realization of the raw power, visceral aggression, and intense rivalry that embodies street racing culture.\n \n- Go for it with real, adrenaline-fueled racing: Experience the raw power of street racing with a brand new physics engine, and intuitively refined A.I.\n- Dominate different racing disciplines: Prove yourself in four distinct styles of racing, Drag, Drift, Grip, and the all-new Speed Challenge. \n- Ride the edge of disaster: One wrong move, and witness the consequences of your mistakes via truly advanced and comprehensive damage capturing technology.  \n- Performance drives results: Choose from hundreds of real-world, aftermarket parts and see the impact of visual Autosculpt technology on performance, all in real-time. \n- Join in competitive social play: Redefined online features amp up the spirit of competition for the ultimate showdown. \n- Share your tuning capabilities with the world: The all-new Blueprints feature allows you to upload your visual and performance customization settings online. You get credit each time your design is used to dominate a race. \n\n\n1.1 Retail Patch Notes: The patch contains the Energizer Lithium Extender Pack.\nThe extender pack features two brand new tracks (the Porsche Test Track in Leipzig and Japan's Tokyo Expressway) and additional cars (Plymouth Road Runner &amp; SEAT Leon Cupra)! You'll also have the ability to purchase new high-end dream cars such as the McLaren F1, Aston Martin DBR9, and the Bugatti Veyron 16.4, which is making its video game debut in Need for Speed ProStreet.\n\nThe patch also introduces multiplayer game play in a standalone LAN environment.\nUp to 32 games of 2-8 players per game are supported. The patch has two components:\n- Updated ProStreet game client\n- New ProStreet LAN Server\n\nIMPORTANT:\n- ProStreet PC LAN Game Server is a separate application that must be started before attempting to use LAN Play.\n- Run one server only per LAN. Only one ProStreet PC LAN Game Server is required per LAN. Each server can host up to 32 games.\n\n\nRipped: Nothing\n\nInstall: Unpack (www.7-zip.org - free) to any location &amp; run RegSetup.exe\nRegSetup adds the needed info to the registry and creates shortcuts on the Desktop &amp; in the Start Menu (All Programs\\Electronic Arts\\Need for SpeedÃƒÂ¢?Ã‚Â¢ ProStreet).\n\nUninstall: Merge RemoveReg.reg &amp; delete the game directory.\n\n\nADHDerby","torrent":{"xt":"urn:btih:42454a487ed6ec2e20513b7355b528ec718c6780","amp;dn":"Need+for+Speed+ProStreet+v1.1+Full+Rip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42454a487ed6ec2e20513b7355b528ec718c6780","infoHashBuffer":{"type":"Buffer","data":[66,69,74,72,126,214,236,46,32,81,59,115,85,181,40,236,113,140,103,128]},"announce":[],"urlList":[]}}