{"title":"Gun Machine by Warren Ellis (ePub Retail)","uid":8977523,"size":503102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4294fd2582ddd94e43b69446005736cc5dbce9cb&amp;dn=Gun+Machine+by+Warren+Ellis+%28ePub+Retail%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TxJag","files":3,"time":1380480742,"description":"Warren Ellis reimagines New York City as a puzzle with the most dangerous pieces of all: GUNS.\n\nAfter a shootout claims the life of his partner in a condemned tenement building on Pearl Street, Detective John Tallow unwittingly stumbles across an apartment stacked high with guns. When examined, each weapon leads to a different, previously unsolved murder. Someone has been killing people for twenty years or more and storing the weapons together for some inexplicable purpose.\n\nConfronted with the sudden emergence of hundreds of unsolved homicides, Tallow soon discovers that he's walked into a veritable deal with the devil. An unholy bargain that has made possible the rise of some of Manhattan's most prominent captains of industry. A hunter who performs his deadly acts as a sacrifice to the old gods of Manhattan, who may, quite simply, be the most prolific murderer in New York City's history.\n\nFull Retail. ePub and Calibre Reader ready. Metadata is complete and up to date.","torrent":{"xt":"urn:btih:4294fd2582ddd94e43b69446005736cc5dbce9cb","amp;dn":"Gun+Machine+by+Warren+Ellis+%28ePub+Retail%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4294fd2582ddd94e43b69446005736cc5dbce9cb","infoHashBuffer":{"type":"Buffer","data":[66,148,253,37,130,221,217,78,67,182,148,70,0,87,54,204,93,188,233,203]},"announce":[],"urlList":[]}}