{"title":"UDEMY PRODUCT MANAGEMENT FUNDAMENTALS TUTORIAL","uid":12741747,"size":681649295,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:430c861f61712084ab556fd409b8b32e13cf72db&amp;dn=UDEMY+PRODUCT+MANAGEMENT+FUNDAMENTALS+TUTORIAL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"BarCraft","files":30,"time":1447244425,"description":"Product Management is an incredibly popular career, but in the past, it has |\r\n| been broad and ill-defined. This course is the first of its kind and a |\r\n| MUST for anyone who is new to technology product management. I take you |\r\n| step by step through the Product Manager role, and walk you through all of |\r\n| responsibilities of product managers and business analysts. With this |\r\n| knowledge, you can confidently interview and land the job, and immediately |\r\n| excel in your role. |\r\n| |\r\n| This course is an insider s perspective, taught by a technology product |\r\n| executive (former VP of Product, SVP, and CEO) who has hired hundreds of |\r\n| product professionals. In addition to leading large product teams, I ve |\r\n| taught numerous classes on product and strategy at companies such as |\r\n| Amazon, and universities including the prestigious Berkeley product |\r\n| management certificate program. |\r\n| |\r\n| With a fraction of the time and investment of in-person product management |\r\n| training, you ll learn how to immediately exceed expectations as a PM |\r\n| and position yourself for promotion: |\r\n| |\r\n| * Apply the most popular product management tools including roadmaps, |\r\n| prototypes, competitive analysis, portfolio management, and personas. |\r\n| * Succeed as an Agile Product Owner by understanding prioritization |\r\n| frameworks, how to apply user stories, and focus the team on work that |\r\n| aligns with the vision and goals. |\r\n| * Develop solid relationships with your extended team by understanding |\r\n| their expectations for product managers, and how you can earn their trust. |\r\n| * Mentor and manage junior product managers |\r\n| |\r\n| Your time is valuable, so we ve condensed the material to just over 2 |\r\n| hours to fast-track your career as a product manager. Download class |\r\n| videos to watch offline at any time using the Udemy mobile app. |\r\n| |\r\n| In addition to the course videos, you will get downloadable templates and |\r\n| exercises including how to successfully lead executive updates. Plus, you |\r\n| get a full 30-day Money-Back Guarantee. |\r\n| |\r\n| Most employers will reimburse you the cost of this class as part of your |\r\n| professional development. Check with your manager: you could get this |\r\n| course for free! |\r\n| |\r\n| Taking this course will change the trajectory of your career as a product |\r\n| manager. |\r\n| |\r\n| Enroll now and take your product management career to the next step! |","torrent":{"xt":"urn:btih:430c861f61712084ab556fd409b8b32e13cf72db","amp;dn":"UDEMY+PRODUCT+MANAGEMENT+FUNDAMENTALS+TUTORIAL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"430c861f61712084ab556fd409b8b32e13cf72db","infoHashBuffer":{"type":"Buffer","data":[67,12,134,31,97,113,32,132,171,85,111,212,9,184,179,46,19,207,114,219]},"announce":[],"urlList":[]}}