{"title":"Sandakan - The Untold Story Of The Death Marches - Paul Ham.epub","uid":11083674,"size":1132728,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:43ef540a1530d41a277706e54900ef260e930262&amp;dn=Sandakan+-+The+Untold+Story+Of+The+Death+Marches+-+Paul+Ham.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PusInBoots","files":1,"time":1411434704,"description":"EPUB. The untold story of the Sandakan Death Marches of World War II. This is the story of the three-year ordeal of the Sandakan prisoners of war, a barely known episode of unimaginable horror. After the fall of Singapore in February 1942, the Japanese conquerors transferred 2500 British and Australian prisoners to a jungle camp some eight miles inland of Sandakan, on the east coast of North Borneo. For decades after the Second World War, the Australian and British governments would refuse to divulge the truth of what happened there, for fear of traumatising the families of the victims and enraging the people. The prisoners were broken, beaten, worked to death, thrown into bamboo cages on the slightest pretext, starved and subjected to tortures so ingenious and hideous that none survived the onslaught with their minds intact, and only an incredibly resilient few managed to withstand the pain without yielding to the hated Kempei-tai, the Japanese military police. But this was only the beginning of the nightmare. In late 1944, Allied aircraft were attacking the coastal towns of Sandakan and Jesselton. To escape the bombardment, the Japanese resolved to abandon the Sandakan Prison Camp and move 250 miles inland to Ranau, taking the prisoners with them as slave labour, carriers and draught horses. Their journey became known as the Sandakan Death Marches. Of the 1000-plus prisoners sent on the Death Marches, only six, all of them Australians, survived. This important and harrowing book narrates the full story of Sandakan, as told through the experiences of many of the participants. Paul Ham has interviewed the families of survivors and the deceased, in Australia, Britain and Borneo, and consulted thousands of court documents in an effort to piece together exactly what happened to the people who suffered and died in British North Borneo, and who was responsible.\nThere are no References, Bibliography or Index.","torrent":{"xt":"urn:btih:43ef540a1530d41a277706e54900ef260e930262","amp;dn":"Sandakan+-+The+Untold+Story+Of+The+Death+Marches+-+Paul+Ham.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43ef540a1530d41a277706e54900ef260e930262","infoHashBuffer":{"type":"Buffer","data":[67,239,84,10,21,48,212,26,39,119,6,229,73,0,239,38,14,147,2,98]},"announce":[],"urlList":[]}}