{"title":"Fighting for Christendom - Holy War and the Crusades - Christoph","uid":10495640,"size":1275238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4432497d7e3d88b39e9b76205eb4d8d240c3e466&amp;dn=Fighting+for+Christendom+-+Holy+War+and+the+Crusades+-+Christoph&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PusInBoots","files":1,"time":1404615505,"description":"The image of the Crusaders--chain-mailed knights on horseback, bearing crosses on banners, fighting for their faith under an alien sun--occupies a familiar niche in modern western culture. Yet despite their powerful hold on our imaginations, the Crusades remain obscured and distorted by time.\nIn Fighting for Christendom, Christopher Tyerman picks his way through many myths and misconceptions to present a vivid portrait of the Crusades, both the historical events themselves and their posthumous role in Western and Middle Eastern thought. Were the Crusaders motivated by spiritual rewards, or by greed for power and wealth? Was the papacy imposing order and uniformity on Christendom, or defending itself from the infidel enemy? Were the Crusades an experiment in European colonialism, or a manifestation of religious persecution or ethnic cleansing? To answer these questions, Tyerman examines the many military operations between 1095 and 1500 that fall under the heading of Wars of the Cross. Beginning with Pope Urban II's dramatic appeal in 1095, Tyerman ranges from the First Crusade--a campaign unrivalled in impact--to the massive expedition lead by Frederick Barbarossa (which ended suddenly when he drowned crossing a river), to the crusade that pitted King Richard I of England against Saladin. Tyerman also discusses lesser expeditions, including the Peasants', Children's, and Shepherds' Crusades. Throughout the book, he clarifies issues of colonialism, cultural exchange, economic exploitation, and the relationship between past and present.\nThe Crusades are among the most dramatic mass movements in world history. Fighting for Christendom illuminates these remarkable events with uncommon flair and originality.","torrent":{"xt":"urn:btih:4432497d7e3d88b39e9b76205eb4d8d240c3e466","amp;dn":"Fighting+for+Christendom+-+Holy+War+and+the+Crusades+-+Christoph","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4432497d7e3d88b39e9b76205eb4d8d240c3e466","infoHashBuffer":{"type":"Buffer","data":[68,50,73,125,126,61,136,179,158,155,118,32,94,180,216,210,64,195,228,102]},"announce":[],"urlList":[]}}