{"title":"Stephen King - Four Past Midnight (Four Past Midnight #1-4)","uid":13135235,"size":650325803,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:447570ae2a947cf40275da87dec636c8fe2d1405&amp;dn=Stephen+King+-+Four+Past+Midnight+%28Four+Past+Midnight+%231-4%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":58,"time":1451895580,"description":"You are strapped in an airline seat on a flight beyond hell. You are forced into a hunt for the most horrifying secret a small town ever hid. You are trapped in the demonic depths of a writer's worst nightmare. You are focusing in on a beast bent on shredding your sanity.\r\n\r\nYou are in the hands of Stephen King at his mind-blowing best with an extraordinary quartet of full-length novellas guaranteed to set your heart-stopwatch at- FOUR PAST MIDNIGHT.\r\n\r\nFour chiller novellas set to keep listeners awake long after bedtime, with an introduction and prefatory notes to each from King.\r\n\r\n\r\nOne Past Midnight: &quot;The Langoliers&quot; takes a red-eye flight from LA to Boston into a most unfriendly sky. Only 11 passengers survive, but landing in an eerily empty world makes them wish they hadn't. Something's waiting for them, you see.\r\n\r\nTwo Past Midnight: &quot;Secret Window, Secret Garden&quot; enters the suddenly strange life of writer Mort Rainey, recently divorced, depressed, and alone on the shore of Tashmore Lake. Alone, that is, until a figure named John Shooter arrives, pointing an accusing finger.\r\n\r\nThree Past Midnight: &quot;The Library Policeman&quot; is set in Junction City, Iowa, an unlikely place for evil to be hiding. But for small businessman Sam Peebles, who thinks he may be losing his mind, another enemy is hiding there as well - the truth. If he can find it in time, he might stand a chance.\r\n\r\nFour Past Midnight: &quot;The Sun Dog&quot;, a menacing black dog, appears in every Polaroid picture that 15-year-old Kevin Delevan takes with his new birthday gift - with each following photograph beckoning him to the supernatural. Old Pop Merrill, Castle Rock's sharpest trader, wants to crash the party for profit, but the Sun Dog, a creature that shouldn't exist at all, is a very dangerous investment.\r\n\r\n\r\n\r\nRead by James Woods, Tim Sample, Willem Dafoe, Ken Howard\r\nFormat: MP3\r\nBitrate: 48 Kbps\r\nLength: 29 hrs and 39 mins\r\nUnabridged Audiobook\r\nRelease Date:01-01-16\r\nPublisher: Simon &amp; Schuster Audio","torrent":{"xt":"urn:btih:447570ae2a947cf40275da87dec636c8fe2d1405","amp;dn":"Stephen+King+-+Four+Past+Midnight+%28Four+Past+Midnight+%231-4%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"447570ae2a947cf40275da87dec636c8fe2d1405","infoHashBuffer":{"type":"Buffer","data":[68,117,112,174,42,148,124,244,2,117,218,135,222,198,54,200,254,45,20,5]},"announce":[],"urlList":[]}}