{"title":"Black [Ntsc], Ps2","uid":5493626,"size":1092541503,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:450fc3284cb9361d9289fa5d8bedb8b42c28eba5&amp;dn=Black+%5BNtsc%5D%2C+Ps2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Big_dude","files":-1,"time":1271144929,"description":"Black for the Ps2                                                  Rel. 02/28/2006\n\n\nFormat:        DVD5 NTSC-USA\nLang.:         English\nDiscs:         1\nImage:         ISO\nGenre.:        Action\nRating:        M (Mature)\nRequirements:  Modded/Chipped Ps2 or Swap Magic Disc Method. \n\n\nCompressed with 7Zip, Game was tested and works.\n\n\nNote: No Ps2 backup disc/game or copy will work unless your Ps2 Console is Modded \n      (allows playing of backups), or if you use Swap Magic.\n\n\nYou could try the homebrew exploit to (Free Mc Boot - Also known as soft modding for ps2), if your ps2 system isn't hard modded with a chip or if Swap Magic isn't working as a last resort. There are ps2 emulators but its not 100% &amp; the quality isn't as good as playing your game on your ps2 console. If your using swap magic and don't have a flip top, you'll need to first remove the front cover of the disc tray for use of the slide card.\n\nHere's a link for how to remove the front cover...\n          &lt;a href=&quot;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.modchipstore.com/support/index.php?_m=knowledgebase&amp;_a=viewarticle&amp;kbarticleid=49&amp;nav=0,2&lt;/a&gt;\n\nAnd here's some links on using the slide tool to open the tray to swap in your ps2 copy or backup game.\n          &lt;a href=&quot;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.swapmagic3.com/slide-tool/Instructions.htm&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/340944&lt;/a&gt;\n         &lt;a href=&quot;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forums.afterdawn.com/thread_view.cfm/15105&lt;/a&gt;\n\nThose that don't have a modded Ps2 Here's a few links for Free MC Boot &amp; how to use it to soft mod your ps2 so you can be able to play burned games. Free Mc Boot won't work on newer models of ps2 you'll have to use an older version the tutorial explains this.\n\n-- &lt;a href=&quot; http://bootleg.sksapps.com/tutorials/fmcb/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bootleg.sksapps.com/tutorials/fmcb/&lt;/a&gt;\n\nThen you will also need to patch the iso (the PS2 game) with ESR disc patcher GUI v0.24a if your using free mc boot with ESR Elf to boot your p2 copies or backups (No-swapping required for esr method).\n\nAfter patching burn the iso with Imgburn or Dvd Decrypter to respectable media\nthen use the ESR through fmcb after you installed everything to boot your game.\n\nYou will still need to use the proper media for the game to run or load properly regardless if your using fmcb, a modded ps2, or swap magic. Verbatim or Taiyo Yuden is preferred.\n\nNote: If fmcb isn't working and your Ps2 isn't Modded, Swap Magic should do the\ntrick.\n\n\nGame Description:\n\nSgt. J. Keller is a Black Op and he has just failed his operation - badly. He has been incarcerated and is interrogated to reveal his mission and to find out what went wrong. The player goes through Keller's failed operation in eight areas, wasting enemy soldiers and trying to stay alive. There are primary and secondary objectives, such as reaching a rendezvous point and gathering intel.\n\nBlack is a classic first-person shooter with variety of weapons and interactive scenery - interactive meaning destructible in this case. Enemy soldiers can be killed by destroying a nearby fuel tank for example, and weak shelter, like a wooden fence, can be shot to pieces in order to expose the enemy.\n\nThe game can be played in four difficulty levels: easy, normal, hard, and black ops. In easy mode, only the primary objective is required. In normal and hard modes, some of the secondary objectives are required. In black ops mode - unlocked after completing the game on hard - all objectives must be reached. New weapons are also unlocked after finishing a level.\n\n\nFeatures:\n\n* Covert Action- BLACK operatives do not hide in shadows or sneak behind walls \n  waiting for the right time to engage their foe- they destroy the wall, enemy and \n  anything else that gets in their way.\n\n* The Guns Are the Stars- An explosive arsenal of bleeding-edge weaponry lets you\n  experience the awe-inspiring power of the world's most exotic lethal firepower.\n\n* If You Can See It, You Can Shoot It- Reduce cities to rubble in a world where \n  virtually nothing is impervious to your bullets.\n\n* Get Your Blood Pumping- Adrenaline is your friend. Visceral, destructive action \n  sucks you deep into the gameplay as you blaze and blast your own path through \n  open-ended environments.\n\n* BLACK-Style Kills- Use destructible worlds and explosive objects to take out \n  enemies in cover, frag multiple enemies at once or just wreak massive \n  destruction for its own sake.\n\n\nGame Pics Included.\n\n\nBurn with DVD Decrypter, (Included in download).  \n\nBurn at 8x or 4x Speed.\n\nUse Verbatim or Taiyo Yuden DVD Media for best quality, or if other media isn't \nworking.\n\n\nIf Using DVD+R booktype to DVD-ROM.\n(If your Mod-Chip or Ps2 doesn't support DVD+R)\n\n\nAny Problems or questions please post a comment.\n\n\nIf this is working fine for you let us know write a comment.\n\n\nPlease Seed this when your done.\n\n(I can't seed 24/7, do your part and seed to keep the torrent healthy).\n\n\n\nEnjoy!\t\t\t","torrent":{"xt":"urn:btih:450fc3284cb9361d9289fa5d8bedb8b42c28eba5","amp;dn":"Black+%5BNtsc%5D%2C+Ps2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"450fc3284cb9361d9289fa5d8bedb8b42c28eba5","infoHashBuffer":{"type":"Buffer","data":[69,15,195,40,76,185,54,29,146,137,250,93,139,237,184,180,44,40,235,165]},"announce":[],"urlList":[]}}