{"title":"Cosmic Duality (Time-Life Mysteries of the Unknown).pdf","uid":11777912,"size":19542842,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:45642a446ac63a34c11d9bd70b4846eac778adbd&amp;dn=Cosmic+Duality+%28Time-Life+Mysteries+of+the+Unknown%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":1,"time":1427406332,"description":"pdf / English / 1991 Time-Life / 144 pages / ISBN 10 0809465167 / 18.6 MB\n\nCosmic Duality, a layman's metaphysical study by Time Life, is about the opposing forces in the Cosmos, their root in religious traditions, and what they mean for humanity and man's spiritual quest. In the universe there are many dualities: God and Satan, light and darkness, male and female, good and evil, innocence and experience, life and death. The most openly dualistic religion of all time is that of the Persian prophet Zoroaster (Zarathustra), with the good God in eternal conflict with the god of destruction. Zoroaster preached an anti-ascetic creed, as the things of this world are the creation of the good deity. Other religions looked at matter, considering it evil, such as the later Gnostics, Manicheans, Bogomils and Cathars, who were heretics as they considered the material presence of Christ and the Cross as wicked and to be ashamed of. Alchemists tried to integrate their souls into a fusion with eternity, along with their well-known attempts to transform base metal into gold. The philosophies of Descartes and Marx are also discussed as coming from earlier dualistic methods of thought. The treatment of the duality between men and women is not very informative, as this book is published by the Establishment, and the difference between the sexes is looked at as socially constructed although the sociobiological standpoint is briefly mentioned. A great many bizarre subjects are touched upon including exorcism, apparitions of the Virgin Mary, Satanism, the dark side of fairy tales, angelic hierarchies, voodoo, witchcraft, pagan fertility rite, Tantric sex-magic, hermaphrodites, the Seven Deadly Sins, stigmata, Yin-yang, odd religious cults and a host of other things","torrent":{"xt":"urn:btih:45642a446ac63a34c11d9bd70b4846eac778adbd","amp;dn":"Cosmic+Duality+%28Time-Life+Mysteries+of+the+Unknown%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45642a446ac63a34c11d9bd70b4846eac778adbd","infoHashBuffer":{"type":"Buffer","data":[69,100,42,68,106,198,58,52,193,29,155,215,11,72,70,234,199,120,173,189]},"announce":[],"urlList":[]}}