{"title":"Hawkeye v4 01-16 + Ann (2012- |2048px HD|theRev+Pro-Novus)","uid":9744282,"size":525004530,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4633003b2c509dd0843d811daf7cd05ea607e74e&amp;dn=Hawkeye+v4+01-16+%2B+Ann+%282012-+%7C2048px+HD%7CtheRev%2BPro-Novus%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1394559765,"description":"With issue 15 (the latest release) ending on a massive cliffhanger, and issue 17 due tomorrow, now is the perfect time to catch up with the great Hawkeye series (especially since it is back on track as well, numerically speaking). Matt Fraction and David Aja's multiple Eisner Award-winning work is masterful storytelling that is among the best the medium can produce. Clint Barton is a screw-up, a man with a good heart that follows it into trouble, often without thinking - and he just happens to be an Avenger. Fraction steps back and shows us the man at leisure and - much more often - under duress stemming from his interpersonal relationships and a desire for justice. He aids the renters of his apartment complex from a gang of &quot;tracksuit mafia&quot;, adopts a somewhat abused dog, strikes up a working duo with Kate Bishop (the other Hawkeye, from the Young Avengers) and generally hangs out like a real person. His friends happen to be Iron Man, Spider-Man, Wolverine and the like - whom we see in brief cameos in one issue - but largely this is all about Clint and Kate. Mostly they are together in the early pages of the comic, and later they split apart as Kate heads to L.A. while Barton remains in the New York. Fraction's writing is credible and flows with wit and wonder; he casually turns &quot;bro&quot; into a hilarious catchphrase, writes amazingly thoughtful dialogue for a dog (an entire issue's worth!!!) and keep things mostly light - but because you care for the characters so much, it takes a heavy toll when they get emotional. In one issue, Kate exclaims to Clint, &quot;this is everything about you that sucks&quot;, and you just feel the pit drop in your stomach. Along the way, we also get re-introduced to Clint's brother and his old flames, as well as new femme fatales and deadly enemies modern and classic. AJa's artwork and layouts are exquisite and inspired, and there are times where the sheer creativity on display but both men is awesome to behold. All in all, this is a can't miss series that everyone can enjoy and it deserves it's consistent high praise.\n\nThese issues are all the 2048px HD (noads) scans by Novus, including the Annual. The first ten are by theRevolutionaries-NVS and the remaining + Ann are by theProletariat-NVS. I have chosen them over the Digital-Empire versions because they are higher resolution (I believe those editions are 1920px) and they just look better to me, where you can truly appreciate Aja's use of space and color. Massive credit must be given to blackcanary for originally uploading each individual issue; I have just assembled them together for convenience. Thanks to the Novus scanners for their hard work - please seed and enjoy Hawkguy! ;-)","torrent":{"xt":"urn:btih:4633003b2c509dd0843d811daf7cd05ea607e74e","amp;dn":"Hawkeye+v4+01-16+%2B+Ann+%282012-+%7C2048px+HD%7CtheRev%2BPro-Novus%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4633003b2c509dd0843d811daf7cd05ea607e74e","infoHashBuffer":{"type":"Buffer","data":[70,51,0,59,44,80,157,208,132,61,129,29,175,124,208,94,166,7,231,78]},"announce":[],"urlList":[]}}