{"title":"Robert Bresson - A man escaped - 1956 [FRENCH. ENG subs]","uid":3652455,"size":1423269399,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4672adcf0864bffb5565812148fb91a64480ca90&amp;dn=Robert+Bresson+-+A+man+escaped+-+1956+%5BFRENCH.+ENG+subs%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Sealand Pres. the 1st","files":4,"time":1175449856,"description":"imdb chosen review\nimdb 8/10\n\nOne of the Few Films Which I Can Confidently Call \\&quot;Perfect\\&quot;, 30 August 2005\n10/10\nAuthor: xx from United States\n\nPages and pages of film criticism could be, and most likely have been, written about this film, so I will just include my simple wholehearted recommendation, in the hopes that whoever is reading this will seek out \\&quot;A Man Escaped\\&quot; immediately. I can think of few films with a simpler premise and plot line than this - it really is only about an anonymous man in prison attempting to escape. That\\&amp;#039;s it. Yet, director Robert Bresson, more than any other director I can think of (with the exception of Yasujiro Ozu), can imbue the drab everyday details of life with life-and-death importance. This director could make a movie about a guy tying his shoes into a riveting cinematic experience. His style of film-making is completely unobtrusive and restrained, because he has figured out a simple truth that about 95% of all film directors never realize: the less a director tries to \\&quot;push\\&quot; his ideas through a film, ironically, the greater the range of ideas he is able to elicit in his audience. You bring to this movie whatever life experience and ideas you carry with you; an older child as well as an aging philosophy professor can enjoy this film equally, and for very different reasons. In addition, I believe this is also the most realistic film that I have ever seen. It takes the skill of a master to make reality into great cinema, and this film is one of Bresson\\&amp;#039;s greatest. It could even be his greatest, because though his other films \\&quot;Au Hasard Balthazar\\&quot; and \\&quot;Pickpocket\\&quot; are great masterpieces, they can never have the same kind of accessibility to virtually any living person in the world as this has.","torrent":{"xt":"urn:btih:4672adcf0864bffb5565812148fb91a64480ca90","amp;dn":"Robert+Bresson+-+A+man+escaped+-+1956+%5BFRENCH.+ENG+subs%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4672adcf0864bffb5565812148fb91a64480ca90","infoHashBuffer":{"type":"Buffer","data":[70,114,173,207,8,100,191,251,85,101,129,33,72,251,145,166,68,128,202,144]},"announce":[],"urlList":[]}}