{"title":"The Trillion-Dollar Conspiracy: How the New World Order, Man-Mad","uid":8592756,"size":771304,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:469c95462623fe1ae347563d1a93225e250b769d&amp;dn=The+Trillion-Dollar+Conspiracy%3A+How+the+New+World+Order%2C+Man-Mad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"candymancan","files":1,"time":1371682437,"description":"According to Marrs, America has become a zombie nation, going &quot;through the motions in commerce, politics, health and education, but without a spark of life, verve, or enthusiasm.&quot; For this he posits an enormous &quot;money cult&quot; conspiracy involving New World Order culprits like the Trilateral Commission, John D. Rockefeller, the Illuminati, Bertelsmann, and the TSA. He levels accusations at our current &quot;Marxist socialist,&quot; &quot;possibly&quot; fascist government, and quotes from countless sources, both mainstream and not. In Marrs's view, the economic collapse was an orchestrated effort to heap debt upon Americans and keep them in a zombie-like state. Believing that Orwell's &quot;1984 vision of psychological and electronic tyranny is almost upon us,&quot; Marrs proposes remedies such as reciting the Pledge of Allegiance in schools and Congress, reviewing NAFTA and the WTO for Constitutional violations, rescinding hate crime laws, and legalizing marijuana. Returning often to the founding fathers, and dipping into a deep history that includes 11th-century China and the time of Christ, Marrs's vast accumulation is equal parts alternate history and boilerplate conspiracy polemic. END --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:469c95462623fe1ae347563d1a93225e250b769d","amp;dn":"The+Trillion-Dollar+Conspiracy%3A+How+the+New+World+Order%2C+Man-Mad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"469c95462623fe1ae347563d1a93225e250b769d","infoHashBuffer":{"type":"Buffer","data":[70,156,149,70,38,35,254,26,227,71,86,61,26,147,34,94,37,11,118,157]},"announce":[],"urlList":[]}}