{"title":"Los Brincos.(Discografia).","uid":4565374,"size":802574647,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46a64a66dafb7ba14cefe3a7fcfd2a9eff81a49d&amp;dn=Los+Brincos.%28Discografia%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"cholo24","files":237,"time":1228850786,"description":"Los Brincos\n\nEl grupo se creÃƒÂ³ en 1964. Sus componentes fueron Fernando Arbex, Manuel GonzÃƒÂ¡lez, Juan Pardo y el filipino Antonio Morales, Junior. Fueron conocidos como Ã‚Â«Los Beatles espaÃƒÂ±olesÃ‚Â», de ahÃƒÂ­ que el nombre del grupo se parezca fonÃƒÂ©ticamente al de la banda inglesa. En un principio se pensÃƒÂ³ en bautizar al grupo Las Ovejas Negras. Todos los discos de su primera etapa fueron nÃƒÂºmero uno en las listas espaÃƒÂ±olas.\n\nLos Brincos nacieron a instancias de la discogrÃƒÂ¡fica espaÃƒÂ±ola Zafiro, que tratÃƒÂ³ de repetir en EspaÃƒÂ±a el ÃƒÂ©xito de las bandas del beat britÃƒÂ¡nico, formando un conjunto que aunara las caracterÃƒÂ­sticas del beat britÃƒÂ¡nico con la personalidad espaÃƒÂ±ola. Luis Sartorius fue el encargado de reclutar a los miembros del grupo, procedentes de bandas pioneras del pop espaÃƒÂ±ol, como Los Estudiantes y Los Pekenikes. Sartorius muriÃƒÂ³ poco antes del lanzamiento, pero ya habÃƒÂ­a sentado las bases de un proyecto que tuvo su plasmaciÃƒÂ³n en el estudio gracias a la producciÃƒÂ³n de MarinÃƒÂ­ Callejo, que habÃƒÂ­a formado parte de Los Brujos y con el tiempo serÃƒÂ­a considerada como una de las grandes productoras del pop melÃƒÂ³dico espaÃƒÂ±ol de los 60 y 70.\n\nDe acuerdo con JesÃƒÂºs OrdovÃƒÂ¡s, Los Brincos no tocaban realmente en sus propias grabaciones, sino que eran sustituidos por mÃƒÂºsicos de estudio. Sin embargo, este punto no estÃƒÂ¡ totalmente confirmado, ya que sus actuaciones en directo eran perfectamente comparables con sus grabaciones en estudio.\n\nJuan Pardo y Antonio Morales se separaron dos aÃƒÂ±os mÃƒÂ¡s tarde para formar el dÃƒÂºo Juan y Junior.\n\nLos nuevos Brincos se recompusieron con las entradas de Ricky Morales y Vicente JesÃƒÂºs MartÃƒÂ­nez, procedentes ambos del grupo Shakers.\n\nMÃƒÂ¡s tarde Vicente MartÃƒÂ­nez tambiÃƒÂ©n abandonÃƒÂ³ la formaciÃƒÂ³n y lo sustituyÃƒÂ³ Miguel Morales, hermano de Junior y de Ricky. La ÃƒÂºltima formaciÃƒÂ³n, a instancias de Arbex, decidiÃƒÂ³ decantarse por el pop psicodÃƒÂ©lico, que en aquellos aÃƒÂ±os estaba desbancando de las preferencias juveniles al beat, grabaron el disco conceptual Mundo, demonio, carne, tambiÃƒÂ©n editado en inglÃƒÂ©s como World, Devil, Body. Su discreta recepciÃƒÂ³n les decidiÃƒÂ³ a disolver el grupo. Arbex formarÃƒÂ­a pronto AlacrÃƒÂ¡n y posteriormente BarrabÃƒÂ¡s.\n\nEn los aÃƒÂ±os 2000 volvieron a aparecer Los Brincos, esta vez de la mano de Fernando Arbex y Miguel Morales. Se dedican a tocar sus grandes ÃƒÂ©xitos en diferentes galas y festivales.\n\nEn 2003 falleciÃƒÂ³, a la edad de 61 aÃƒÂ±os, Fernando Arbex.\n","torrent":{"xt":"urn:btih:46a64a66dafb7ba14cefe3a7fcfd2a9eff81a49d","amp;dn":"Los+Brincos.%28Discografia%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46a64a66dafb7ba14cefe3a7fcfd2a9eff81a49d","infoHashBuffer":{"type":"Buffer","data":[70,166,74,102,218,251,123,161,76,239,227,167,252,253,42,158,255,129,164,157]},"announce":[],"urlList":[]}}