{"title":"THE NEW ATLANTIS - History of USA Part 1 [2006] - DivX","uid":5060188,"size":1665454450,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46bb68e5c28e1f2f6e77366fa3c8f3fa92e8511c&amp;dn=THE+NEW+ATLANTIS+-+History+of+USA+Part+1+%5B2006%5D+-+DivX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"verifire","files":-1,"time":1250678375,"description":"Hi there..\n\nThen it finally happened. TPB's trackers are down. But I've been anticipating something like this for a while. So for those who'll want to download torrents I've made and will make in the future, I'm moving nearly all of them to another torrent-site, maybe two. I guess it'll be at least: &lt;a href=&quot;\nhttp://www.torrentbox.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.torrentbox.com&lt;/a&gt;\n\nJust browse for the torrents on that site, and all uploads will come up, just give me some days.. :-)\n\nAnd you can still start your download from this site!! Just add these trackers to the torrent, and we'll find each other again.\n &lt;a href=&quot;\nhttp://tracker.publicbt.com:80/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.publicbt.com:80/announce&lt;/a&gt;\n &lt;a href=&quot;\nhttp://tracker.torrentbox.com:2710/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://tracker.torrentbox.com:2710/announce&lt;/a&gt;\n \nNow don't click on the &quot;links&quot; above, that won't work. Copy and paste them to add them to your trackers in the torrent-file.\n\nAnd be sure to enable DHT. It tracks too..\n  \nAnyway, they should also all be available by search on my alias, verifire, on for instance: &lt;a href=&quot;\nhttp://www.isoHunt.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.isoHunt.com&lt;/a&gt;\n \n- because they search the contents and comments on the upload for tags as well as the title of the torrent.. Just give me some time..\n\nSee you later, when things are settled and (maybe) there's a working tracker on the site again, and I'll miss it terribly, but I hope for, and guess this isn't the last word on the matter. I'll upload stuff here anyway, as well as on the other sites...\n\nTPB WILL ALWAYS RULE!! THANK YOU, GUYS. YOU'VE BEEN A PLEASURE TO BE SHIPWRECKED WITH. IT'S AN HONOUR...\n\nVerifire.\n____________________________________________________________________________\n\n\nPlease; bear with me when I beg of you to leave this stuff seeding on your machine for the benefit of others, who just like you, would like to watch this stuff. My machine is being hindered by &quot;someone&quot; closing ports for me, so I have to monitor and change ports constantly, just so that YOU will get a copy.. Please help me. Thank you.\n\nFrancis Bacon (1561-1626) was an English lawyer, statesman, philosopher, and writer..\n\nBacon's Utopian book, 'The New Atlantis' was not published until after his death in 1627. He tells of the discovery of 'the New Atlantis', a Utopian island set beyond both the Old World and New. The work is unfinished, but there's enough there to reveal the ideas of this man, who in this movie and on a stamp is, quote: 'The Spirit Behind The American Revolution'.\n\nThe book is public domain, so just search for it if you want, but don't expect to be astonished by the 'facts' he describes in the book. He's a great storyteller though, and first and most; a master mind behind many things concerning the 'government and rules of commonwealth'..\n\nAnd this is what this movie is about. The beginnings, and pre-arrangements of creating 'the New Atlantis', aka; USA.\nThe things that are revealed in this movie is quite a mouthful, but is very good for educating us on what are the real driving forces behind this world's masters and lords.\nIt's important to be educated and prepared. That is wisdom, if you act according to the knowledge..\n\nI more than suspect that these movies are approved and made for public viewing by the higher councils of Freemasonry, because these days, they're blowing the lid off many of their former secrets, preparing us for the fact that we live in a hidden fascist state within the state.. well, maybe not so hidden anymore (or ever), but nevertheless. One person who is appearing in the series is a Co-Masonic historian, and He states: &quot;Fifteen years ago I would have been killed for revealing this material..&quot; But not only does he live on, he is allowed to reveal certain things to the world now. So don't be astonished..\n\nThis is part one of (so far) three, but this one alone lasts 2 hours 45 minutes.\nThe follow up: 'Riddles in Stone' deal with the somewhat hidden and secret architecture of USA's Capitol, Washington DC, and then some. I'll upload that one too. Then there's the third one, &quot;Eye of the Phoenix&quot;, who deals with the Dollar bill. I haven't finished ripping it with good quality yet, but will do so a.s.a.p..\n\nPart two can be downloaded from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5060200&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5060200&lt;/a&gt;\n \nAnd part three from here:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/5067438/EYE_OF_THE_PHOENIX_-_History_of_USA_Part_3_[2009]_-_DivX&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/5067438/EYE_OF_THE_PHOENIX_-_History_of_USA_Part_3_[2009]_-_DivX&lt;/a&gt;\n\nBut first; digest this one. It will take most of you a while..\n\nBut do not let these men and their schemes make you scared or discouraged. That's what they want you to be!! If you are a true, Bible believing Christian, this material should only add to your knowledge of the plans and thoughts of the evil one, and Paul says that we are not unknowing of his thoughts, so that's good. And furthermore: It should awake the Spirit that dwells in you to fight even harder to stay alive and help people who have no direction, or the wrong one, to see the glorious light from our Lord, Jesus Christ of Nazareth. He'll be back soon to gather unto Himself in the sky those who 'await His coming eagerly'. But first: Brace yourselves, because there are hard times both now and ahead before that happens.. Trust in Him and His exact Words, and nothing else.. :-)\n\nJohn 14:23) Jesus answered and said to him, &quot;If anyone loves Me, he will keep My word; and My Father will love him, and We will come to him and make Our home with him. \n24) &quot;He who does not love Me does not keep My words; and the word which you hear is not Mine but the Father's who sent Me. \n25) &quot; These things I have spoken to you while being present with you. \n26) &quot;But the Helper, the Holy Spirit, whom the Father will send in My name, He will teach you all things, and bring to your remembrance all things that I said to you. \n27) &quot;Peace I leave with you, My peace I give to you; not as the world gives do I give to you. Let not your heart be troubled, neither let it be afraid.&quot; \n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;443221362d222d362129252d28042329252d286a272b29&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;","torrent":{"xt":"urn:btih:46bb68e5c28e1f2f6e77366fa3c8f3fa92e8511c","amp;dn":"THE+NEW+ATLANTIS+-+History+of+USA+Part+1+%5B2006%5D+-+DivX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46bb68e5c28e1f2f6e77366fa3c8f3fa92e8511c","infoHashBuffer":{"type":"Buffer","data":[70,187,104,229,194,142,31,47,110,119,54,111,163,200,243,250,146,232,81,28]},"announce":[],"urlList":[]}}