{"title":"Cookie A - Knit. Sock. Love.","uid":9253533,"size":47649613,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47100a7c46661d3722d909f56623fa9e76135bf6&amp;dn=Cookie+A+-+Knit.+Sock.+Love.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385507467,"description":"Sock designer extraordinaire Cookie A chronicles her love affair with sock knitting and explores different methods to pattern socks by examining their underlying structure. Nineteen patterns ranging from simply chic to astonishingly intricate are arranged into three sections: Columns, Tessellations and Diagonals. Among the projects are Pointelle, a pattern which features diagonal lace lines over an arrowhead lace background, and Wedge, an ingenious use of garter stitch short rows and stockinette bands that will have you marveling at its simplicity. These rich and seemingly complex patterns are broken down step by step into bite-size components that are easy to digest. Illustrations, diagrams and charts accompany each project, offering an invaluable guide for visual knitters. Breathtaking photographs by Laura Kicey and styling by Sarah Beaver showcase the socks in dramatic locations, leading you off the beaten path just like the socks in this collection. This revolutionary compilation is sure to elevate sock knitting to new levels of sophistication.","torrent":{"xt":"urn:btih:47100a7c46661d3722d909f56623fa9e76135bf6","amp;dn":"Cookie+A+-+Knit.+Sock.+Love.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47100a7c46661d3722d909f56623fa9e76135bf6","infoHashBuffer":{"type":"Buffer","data":[71,16,10,124,70,102,29,55,34,217,9,245,102,35,250,158,118,19,91,246]},"announce":[],"urlList":[]}}