{"title":"Beginning Algorithms (Wrox Beginning Guides)","uid":4728170,"size":9670637,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:47c038fcfb2b9bb74c25a4e584249a0a60125460&amp;dn=Beginning+Algorithms+%28Wrox+Beginning+Guides%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VasiaZozulia","files":1,"time":1234861523,"description":"A good understanding of algorithms, and the knowledge of when to apply them, is crucial to producing software that not only works correctly, but also performs efficiently. This is the only book to impart all this essential information-from the basics of algorithms, data structures, and performance characteristics to the specific algorithms used in development and programming tasks.\n\nPacked with detailed explanations and instructive examples, the book begins by offering you some fundamental data structures and then goes on to explain various sorting algorithms. You'll then learn efficient practices for storing and searching by way of hashing, trees, sets, and maps. The authors also share tips on optimization techniques and ways to avoid common performance pitfalls. In the end, you'll be prepared to build the algorithms and data structures most commonly encountered in day-to-day software development.\n\nWhat you will learn from this book\n\n* The basics of algorithms, such as iteration and recursion\n* Elementary data structures such as lists, stacks, and queues\n* Basic and advanced sorting algorithms including insertion sort, quicksort, and shell sort\n* Advanced data structures such as binary trees, ternary trees, and heaps\n* Algorithms for string searching, string matching, hashing, and computational geometry\n* How to use test-driven development techniques to ensure your code works as intended\n* How to dramatically improve the performance of your code with hands-on techniques for profiling and optimization\n\nWho this book is for\n\nThis book is for anyone who develops applications, or is just beginning to do so, and is looking to understand algorithms and data structures. An understanding of computer programming is beneficial.\n\nWrox Beginning guides are crafted to make learning programming languages and technologies easier than you think, providing a structured, tutorial format that will guide you through all the techniques involved.\n\n","torrent":{"xt":"urn:btih:47c038fcfb2b9bb74c25a4e584249a0a60125460","amp;dn":"Beginning+Algorithms+%28Wrox+Beginning+Guides%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c038fcfb2b9bb74c25a4e584249a0a60125460","infoHashBuffer":{"type":"Buffer","data":[71,192,56,252,251,43,155,183,76,37,164,229,132,36,154,10,96,18,84,96]},"announce":[],"urlList":[]}}