{"title":"Inked Angels 2 (Kevin Moore, Evil Angel / 2013)","uid":9061013,"size":1832081653,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:47c5264216596fb74f9030baf6dad937bf6bc4bc&amp;dn=Inked+Angels+2+%28Kevin+Moore%2C+Evil+Angel+%2F+2013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":6,"uploader":"SplashPt","files":1,"time":1382041260,"description":"Inked Angels 2 (Kevin Moore, Evil Angel / 2013)\n\nSkin Diamond Dishes It Out As Good As She Gets It In This Anal Romp!\nRadio Beauty Queen Britney Shannon...Turned Slut!\nIt's An Alt Lover Paradise With Jessie Lee And Asphyxia!\nIntroducing Alby Rydes...A Tattooed Superstar In The Making!\nThe modern, liberated slut likes to flaunt her sexual freedom with certain cultural signals. One of these is the tattoo, the universal symbol of the uninhibited, exhibitionistic 'bad girl' - and a sexual niche kinky director Kevin Moore explores in his new gonzo production, 'Inked Angels #2.' Whether they sport a simple tramp stamp, an elaborate collar or fully sleeved peacockery, Kevin gets off on showcasing the ballsy bimbos that decorate their fine skin in sexy art. 'I think women with tattoos are better in bed,' Kevin declares, and he sets out to prove his thesis through four hot scenes of decorative debauchery. Gorgeous, caramel-colored punkette Skin Diamond gets off on total submission. Latin stud Toni Ribas dominates her, shoving his cock down her throat before brutally reaming her tender asshole!\nGlamorous, big-bottomed Alby Rydes, an exotic alt-beauty that loves showing off her tats, bares her huge, round boobs and services Kevin s dick before taking a messy load of hot jism on her bouncy butt. Pale, raven-haired beauty Asphyxia Noir and her voluptuous blonde/pink pal Jessie Lee are the latex-clad sweethearts enjoying a hard-core three-way with young stud Danny Wylde. Busty biker bitch Britney Shannon is elaborately tattooed. The sexy blonde smokes a cigarette, gets well fucked and gets further decorated by a messy, gooey cum facial. With 32 minutes of extra sex and behind-the-scenes interviews, this filthy inkfest is all pleasure and no pain. 'Inked Angels #2' is a wild adventure on the outskirts of polite society!\n\nSkin Diamond, Toni Ribas, Danny Wylde, Jessy Jones, Kevin Moore, Asphyxia Noir, Jessie Lee, Alby Rydes, Britney Shannon\n\nAnal, Tattoo, Alt Porn, POV, Gonzo, Hardcore, All Sex\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=atgetm20oju1.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=atgetm20oju1.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=1ouku3d1lgqy.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=1ouku3d1lgqy.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:47c5264216596fb74f9030baf6dad937bf6bc4bc","amp;dn":"Inked+Angels+2+%28Kevin+Moore%2C+Evil+Angel+%2F+2013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47c5264216596fb74f9030baf6dad937bf6bc4bc","infoHashBuffer":{"type":"Buffer","data":[71,197,38,66,22,89,111,183,79,144,48,186,246,218,217,55,191,107,196,188]},"announce":[],"urlList":[]}}