{"title":"Ironclad Tactics Deluxe Edition (GOG)","uid":12104082,"size":1370810580,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:47cc6e42b9250bfaae18cb52263450b2d8ff84b2&amp;dn=Ironclad+Tactics+Deluxe+Edition+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mercs215","files":8,"time":1436419540,"description":"Includes the full game along with all the GOG.com game goodies.\n\nDLC Included:\nThe Rise of Dmitry\n\nInstall instructions:\n1. Run &quot;setup_ironclad_tactics_2.0.0.2&quot;\n2. Play\nIf you like this game, support the developers and BUY IT!\n\nTitle: IRONCLAD TACTICS DELUXE EDITION\nGenre: Strategy - Turn-based - Tactical\nWorks on: Windows (XP, Vista, 7, 8)\nLanguages: Text only: English\nModes: Single-player\nReleased: September 18, 2013\nSize: 417 MB\nCompany: Zachtronics Industries / Zachtronics Industries\nRating: ESRB Rating: Teen (with Blood, Suggestive Themes, Use of Alcohol and Tobacco, Violence)\nStore page: https://www.gog.com/game/ironclad_tactics_deluxe_edition\n\nAbout:\nIronclad Tactics is a fast-paced, card-based tactics game set in an alternate history Civil War - with steam-powered military robots!\nThe Deluxe Edition includes:\n- The Rise of Dmitry, the first add-on campaign for Ironclad Tactics. Explore the backstory of Dmitry, and unlock his fearsome army by completing new missions against new foes. Also included is the &quot;Fort Phantom Ridge&quot; gauntlet mission, a six-stage battle set in Dmitry's greatest factory-fort.\n- Blood and Ironclads, the add-on campaign for Ironclad Tactics about the Franco-Prussian war... with ironclads! \n- A high-quality digital artbook with concept art, designs, and commentary from the Zachtronics team. \n- A printable papercraft model of an ironclad that you can print out and assemble. \n- The Ironclad Tactics OST, with music by Evan Le Ny and Farewell to the Woods. \n- A giftable GOG code for SpaceChem and SpaceChem: 63 Corvi DLC. (Your code can be found under My Account in the Serial Keys section). PLEASE NOTE that this gift code is available for a limited time only, until the end of the launch discount on the 30th of June at 9.59am GMT.\nMultiplayer notice: The DRM free version of Ironclad Tactics Deluxe Edition is single-player only.\nExperience unique gameplay, with rapid, simultaneous turns that blend the precision of tactics and card games with the spontaneity of fast-paced strategy games.\nFollow the campaign story through a fully-illustrated, character-driven interactive graphic novel.\nCollect cards as you play through the campaign and build your own decks to crush your foes.\n\nMinimum system requirements - Windows: Windows XP / Vista / 7 / 8, Processor: 2.0 GHz, Memory: 2 GB RAM, Graphics: Support for OpenGL 2.0 or greater, Hard Drive: 850 MB available space","torrent":{"xt":"urn:btih:47cc6e42b9250bfaae18cb52263450b2d8ff84b2","amp;dn":"Ironclad+Tactics+Deluxe+Edition+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47cc6e42b9250bfaae18cb52263450b2d8ff84b2","infoHashBuffer":{"type":"Buffer","data":[71,204,110,66,185,37,11,250,174,24,203,82,38,52,80,178,216,255,132,178]},"announce":[],"urlList":[]}}