{"title":"Fablehaven - The Complete Series - Brandon Mull","uid":10190688,"size":4171174,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4918726ef643334ac599147b05b2ed0d560a9f1e&amp;dn=Fablehaven+-+The+Complete+Series+-+Brandon+Mull&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1400628943,"description":"1. Fablehaven\n\n\nFor centuries mystical creatures of all description were gathered into a hidden refuge called Fablehaven to prevent their extinction. The sanctuary survives today as one of the last strongholds of true magic. Enchanting? Absolutely. Exciting? You bet. Safe? Well, actually, quite the opposite. \nKendra and her brother, Seth, have no idea that their grandfather is the current caretaker of Fablehaven. Inside the gated woods, ancient laws keep relative order among greedy trolls, mischievous satyrs, plotting witches, spiteful imps, and jealous fairies. However, when the rules get broken -- Seth is a bit too curious and reckless for his own good -- powerful forces of evil are unleashed, and Kendra and her brother face the greatest challenge of their lives. To save their family, Fablehaven, and perhaps even the world, Kendra and Seth must find the courage to do what they fear most.\n\n2. Rise of The Evening Star\n\n\nAt the end of the school year, Kendra and her brother Seth find themselves racing back to Fablehaven, a refuge for mythical and magical creatures. Grandpa Sorenson, the caretaker, invites three specialists -- a potion master, a magical relics collector, and a mystical creature trapper -- to help protect the property from the Society of the Evening Star, an ancient organization determined to infiltrate the preserve and steal a hidden artifact of great power. Time is running out. The Evening Star is storming the gates. If the artifact falls into the wrong hands, it could mean the downfall of other preserves and possibly the world. Will Kendra learn to use her fairy gifts in time? Will Seth stay out of trouble?\n\n3. Grip Of The Shadow Plague\n\n\nDanger lurks everywhere at Fablehaven, where someone has released a plague that transforms beings of light into creatures of darkness. In dire need of help, the Sorensons question where to turn, now that long trusted allies have been revealed as potential foes. Kendra embarks on a special mission that only she can attempt because of her new abilities as fairykind, while Seth stays behind and discovers an incredible new talent of his own. The siblings are put to the test as the threat grows both abroad and home at the Fablehaven preserve, and Brandon Mull spins his richest and most thrilling fantasy tale yet in this third title of the popular fantasy series.\n\n4. Secrets of The Dragon Sanctuary\n\n\nBrace yourself for a shocking secret. Two hidden artifacts have been found. Three more remain unrecovered. More preserves face destruction as the Society of the Evening Star relentlessly pursues new talismans. Reading in Patton s Journal of Secrets, Kendra learns the location of the key to a vault housing one of the artifacts. In order to retrieve it, the Knights of the Dawn must enter a death trap a dragon sanctuary called Wyrmroost. The mission cannot proceed without stealing a sacred object zealously guarded by the centaurs. Anybody seen Seth? The race is on to acquire all five of the artifact keys to the great demon prison. Will the Knights of the Dawn conquer Wyrmroost? Who can stop the Sphinx? Can Vanessa be trusted to help? What artifact will be found next? Find out in Fablehaven: Secrets of the Dragon Sanctuary.\n\n5. Keys to The Demon Prison\n\n\nSince ancient times, the great demon prison Zzyzx has protected the world from the most dangerous servants of darkness, including Gorgrog, the Demon King. After centuries of plotting, the Sphinx is on the verge of recovering the five artifacts necessary to open the legendary prison. Facing the potential of a world-ending calamity, all friends of light must unite in a final effort to thwart the Sphinx s designs and find a safe home for the five artifacts. To this end, Kendra, Seth, and the Knights of the Dawn will venture far beyond the walls of Fablehaven to strange and exotic magical preserves across the globe, where the end of every quest becomes the beginning of another. In this explosive series finale, allegiances will be confirmed and secrets revealed as the forces of light and darkness collide in a desperate struggle to control the keys to the demon prison.","torrent":{"xt":"urn:btih:4918726ef643334ac599147b05b2ed0d560a9f1e","amp;dn":"Fablehaven+-+The+Complete+Series+-+Brandon+Mull","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4918726ef643334ac599147b05b2ed0d560a9f1e","infoHashBuffer":{"type":"Buffer","data":[73,24,114,110,246,67,51,74,197,153,20,123,5,178,237,13,86,10,159,30]},"announce":[],"urlList":[]}}