{"title":"Shadowslaves.com---Shadow Slaves Siterip 64gb","uid":9005702,"size":69026157538,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:4ac3d742bf939abe9f3201865130618308208b0f&amp;dn=Shadowslaves.com---Shadow+Slaves+Siterip+64gb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":15,"uploader":"merzedes","files":-1,"time":1381025886,"description":"\nShadowSlaves.com Siterip 64.2 gb\n\nThis is NOT a complete siterip, but contains videos from 2003-2012.\n\n138 files total divided up as follows:\n\n15x .RM 360x260\n20x WMV 240p\n28x WMV 480p\n46x WMV 576p\n29x WMV 720p\n\nShadow Slaves prides ourselves in presenting the hardest and most creative S&amp;M videos of genuine sadists and masochists at play. Our exclusively S/M films feature real amateur slave girls enduring harsh punishments and well known models taking up the challenge of living as a slavegirl for the day. Hardcore bondage and unique fetish films filled with extreme BDSM action awaits you from the Shadow Slaves dungeons. We feature every aspect of BDSM and domination. Fresh Sado maso films are added continously with new slave girls entering the dungeons for harsh punishments and painsluts returning for further discipline, training and punishment. This way there is a constant influx of fresh submissive faces in pain and suffering, whilst you can follow the development of more seasoned slaves as they venture further into the realms of bdsm, pleasure and pain\n\nCruel and severe punishments of real slavegirls in pain and tears. The Shadow Slaves submissives need dedication, courage and a passion for pain. They are tied up, humiliated and tormented in the harshest imaginable ways by masters and mistresses. See the full length bondage movies and bdsm films inside from the suffering of our slave girls. We introduce new slave girls and submissives to our dungeon ongoingly, but equally you can follow the developments of seasoned slavesluts as they are recalled for further bdsm training, discipline and punishment. Some of our slavesluts love the pain they endure and take sexual pleasure in their punishments, others accept their torments due to obedient affection for our masters and mistresses, whilst others again enter with fear of the horrible pain they are about to endure for the sake of the unbelievable challenge it is to leave yourself at the mercy of a sadist. We feature masochists, female subs, lifestyle S&amp;M lovers and fetish models. They are all welcome if they dare. You get the first row seat to their suffering in the dungeon.\n\nScreens &lt;a href=&quot;\nhttp://image.bayimg.com/ebf49183f69eda43efb453d184af47fa392aaccc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/ebf49183f69eda43efb453d184af47fa392aaccc.jpg&lt;/a&gt;\n\n12 000 uploads and counting, 13k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)  \n  \nCheers  :-)  \n\n","torrent":{"xt":"urn:btih:4ac3d742bf939abe9f3201865130618308208b0f","amp;dn":"Shadowslaves.com---Shadow+Slaves+Siterip+64gb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ac3d742bf939abe9f3201865130618308208b0f","infoHashBuffer":{"type":"Buffer","data":[74,195,215,66,191,147,154,190,159,50,1,134,81,48,97,131,8,32,139,15]},"announce":[],"urlList":[]}}