{"title":"Tarzan Classics (267 Delen)  CBR NL NLtoppers","uid":11029406,"size":7118749575,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4b832b700ea2a575294ab5e5de9b42fa7d377e3a&amp;dn=Tarzan+Classics+%28267+Delen%29++CBR+NL+NLtoppers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GusGuzz","files":-1,"time":1410702533,"description":"Tarzan Classics (267 Delen)  CBR NL NLtoppers\n\n\n\nTarzan is een fictieve held, die bedacht werd door Edgar Rice Burroughs. Hij verscheen voor het eerst in Tarzan of the Apes in 1912. Dat afgeronde verhaal was een groot succes, met het gevolg dat de schrijver nog 23 avonturen met Tarzan ging schrijven.\nPersonage\nTarzan is de verweesde zoon van aristocratische Engelse ouders, John en Alice Clayton, ofwel Lord en Lady Greystoke, die eind 19e eeuw stranden aan de westkust van Afrika na een muiterij aan boord van het schip dat hen naar Afrika brengt. Ze proberen te overleven in het oerwoud aan de kust. Wanneer zijn ouders overlijden wordt de mensenbaby door de apin Kala, die net haar eigen jong verloren heeft, geadopteerd en opgevoed. Tarzans echte naam is John Clayton, Lord Greystoke. De naam Tarzan ('blanke huid') krijgt hij van Kala. De enige mensen met wie Tarzan gedurende de eerste 18 jaren van zijn leven in contact komt, zijn de leden van een kannibalenstam. Een van hen, Kulonga, vermoordt Tarzans voedster-pleegmoeder Kala, waarna Tarzan bloedig wraak neemt.\n\nJaren later vindt Tarzan in het hutje van zijn echte ouders een aantal kinderboekjes, die zijn ouders met vooruitziende blik mee hadden genomen. Met behulp van de plaatjes en letters leert hij zichzelf lezen en schrijven, maar een menselijke taal leert hij pas veel later - wanneer hij door blanken wordt ontdekt. De eerste mensen die hij leert kennen zijn de jonge Amerikaanse Jane Porter, haar vader en de Franse luitenant-ter-zee Paul D'Arnot. Van die laatste leert hij de eerste menselijke taal spreken, en wel het Frans, en later ook Engels. D'Arnot zal voor de rest van zijn leven ook Tarzans beste vriend blijven, en neemt hem mee naar de beschaafde wereld.\n\nDe Porters zijn samen met nog een groep andere mensen achtergelaten in Afrika door muiters. Tarzan en Jane ontmoeten elkaar en worden op slag verliefd. Wanneer Jane terugkeert naar Amerika, gaat Tarzan haar uiteindelijk achterna. In latere boeken zijn de twee getrouwd en hebben ze een zoon genaamd Jack, wiens naam in de apentaal Korak ('de doder') luidt.\n\nLijst van de strips :\n &lt;a href=&quot;\nhttp://txt.do/otr3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://txt.do/otr3&lt;/a&gt;\n\nFormaat : CBR\nTaal - Language ; Nederlands - Dutch\n\nComicrack is meegepost (CBR READER)\n\nHeeft u deze strips  gelezen en wilt u ergens een recensie achterlaten?\nga dan eens naar http://www.pheunix.nl\n\n","torrent":{"xt":"urn:btih:4b832b700ea2a575294ab5e5de9b42fa7d377e3a","amp;dn":"Tarzan+Classics+%28267+Delen%29++CBR+NL+NLtoppers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b832b700ea2a575294ab5e5de9b42fa7d377e3a","infoHashBuffer":{"type":"Buffer","data":[75,131,43,112,14,162,165,117,41,74,181,229,222,155,66,250,125,55,126,58]},"announce":[],"urlList":[]}}