{"title":"The Language of Mixed-Media Sculpture (Art Ebook).epub","uid":11222623,"size":23851601,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4bca761e289d827b1973125d651f7757f27013ea&amp;dn=The+Language+of+Mixed-Media+Sculpture+%28Art+Ebook%29.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"STBGD","files":-1,"time":1413405169,"description":"The Language of Mixed-Media Sculpture by Jac Scott\nEnglish | 2014 | ISBN: 1847977219 | 224 pages | EPUB | 22,7 MB\n\nA sumptuously illustrated volume that will inspire those intrigued by and interested in contemporary sculpture.\n\nBoth a survey and a lavish celebration of contemporary approaches to sculptures that are formed from more than one material, this book profiles the discipline in all its expanded forms, and recognizes sculpture in the 21st century not as something solid and static, but rather as a fluid interface in material, time, and space. \n\nIt reveals the inspirations, influences, and creative journeys of more than 30 contemporary artists, and explains the practical processes and raw materials they use. An introductory chapter contextualizes textile perspectives in mixed-media sculpture and discusses elements that concern the sculptor in the 21st century. Illuminating texts explore the creative journeys of contemporary artists, insightfully profiling more than 30 prodigious sculptors specializing in mixed-media sculpture. Informative technical information is also provided on creating sculpture from plastic, rubber, plaster, metal, and paper","torrent":{"xt":"urn:btih:4bca761e289d827b1973125d651f7757f27013ea","amp;dn":"The+Language+of+Mixed-Media+Sculpture+%28Art+Ebook%29.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4bca761e289d827b1973125d651f7757f27013ea","infoHashBuffer":{"type":"Buffer","data":[75,202,118,30,40,157,130,123,25,115,18,93,101,31,119,87,242,112,19,234]},"announce":[],"urlList":[]}}