{"title":"2 Sherlock Holmes Novles by Nicholas Meyer","uid":8686476,"size":1035860,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4c5b6e28ffd825aba8b2fc5049bd65c697d39a81&amp;dn=2+Sherlock+Holmes+Novles+by+Nicholas+Meyer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"maxdesolate","files":8,"time":1373816765,"description":"2 SHERLOCK HOLMES NOVLES.\n\nCONTENTS -\n1 - The Seven Per-Cent Solution\n2 - The West End Horror\n\nThe Seven Per-Cent Solution - First discovered and then painstakingly edited and annotated by Nicholas Meyer, The Seven-Per-Cent Solution related the astounding and previously unknown collaboration of Sigmund Freud with Sherlock Holmes, as recorded by Holmes's friend and chronicler, Dr. John H. Watson. In addition to its breathtaking account of their collaboration on a case of diabolic conspiracy in which the lives of millions hang in the balance, it reveals such matters as the real identity of the heinous professor Moriarty, the dark secret shared by Sherlock and his brother Mycroft Holmes, and the detective's true whereabouts during the Great Hiatus, when the world believed him to be dead.\n\nThe West End Horror - March 1895. London. A month of strange happenings in the West End. First there is the bizarre murder of theater critic Jonathan McCarthy. Then the lawsuit against the Marquess of Queensberry for libel; the public is scandalized. Next, the ingenue at the Savoy is discovered with her throat slashed. And a police surgeon disappears, taking two corpses with him.\n\nSome of the theater district's most fashionable and creative luminaries have been involved: a penniless stage critic and writer named Bernard Shaw; Ellen Terry, the gifted and beautiful actress; a suspicious box office clerk named Bram Stoker; an aging matinee idol, Henry Irving; an unscrupulous publisher calling himself Frank Harris; and a controversial wit by the name of Oscar Wilde.\n\nScotland Yard is mystified by what appear to be unrelated cases, but to Sherlock Holmes the matter is elementary: a maniac is on the loose. His name is Jack.\n\nEPUB AND MOBI.\nTHANKS TO UPLOADER PIXIES FOR UPLOADING THIS ONE ANOTHER SITE. ","torrent":{"xt":"urn:btih:4c5b6e28ffd825aba8b2fc5049bd65c697d39a81","amp;dn":"2+Sherlock+Holmes+Novles+by+Nicholas+Meyer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c5b6e28ffd825aba8b2fc5049bd65c697d39a81","infoHashBuffer":{"type":"Buffer","data":[76,91,110,40,255,216,37,171,168,178,252,80,73,189,101,198,151,211,154,129]},"announce":[],"urlList":[]}}