{"title":"Cryostasis GOG","uid":8015493,"size":3022213867,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4c788f14335a24f71585ea0f76c5def3c697fd99&amp;dn=Cryostasis+GOG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AN0NYMOUS142857","files":-1,"time":1358094760,"description":"genre: action / fpp / horror \nrelease date: April 28, 2009 \ncompatible with: Windows XP, Windows Vista, Windows 7 (32 &amp; 64 bit) \nlanguages: English \ndeveloper / publisher: Action Forms / 1C Publishing \ngame modes: single-player \n\nBonus content included for FREE with purchase: \nmanual \n3 wallpapers \nmain theme \n4 avatars \n8 artworks \n\nWhat's cool about it: \n\n  The whole game! It takes place near the North Pole. \n  Spooky atmosphere that gives you chills with a synergy of sound, story, and visuals. \n  Award-winning story that can easily be compared to some of the best horror books out there. \n  Evocative setting - you can almost feel the freezing cold while exploring the icy tomb of the ship. \n\nOverview: \n\nYou are Alexander Nesterov - a meteorologist on his way back home from station post  Pole 51 . He was supposed to travel on board the nuclear ice-breaker  North Wind , but upon his arrival he discovers that something terrible has happened to the ship and its entire crew. Forced to find shelter form the ice storm, he enters the wreck and is suddenly struck by strange visions of what has happened within the confines of of this cursed vessel. He has no choice but to explore deeper into the derelict in search of something to fight off the more immediate life-threatening danger: the bone-freezing cold. \n\nCryostasis emphasizes the setting; the horror, the cold, and the grinding fight to survive the relentless chill pervade the game. Winner of Gamespot's &quot;Best Story&quot; award for 2009, although this title has some detractors, the tightly-wound suspense and the engrossing story are definitely something that every gamer should experience for him or herself. \n\nAge requirements: ESRB Rating: TEEN with Violence. PEGI Rating: 16+ with Violence. \n\nMinimum system requirements: Windows XP / Windows Vista / Windows 7, 2.4 GHz Processor, 1 GB RAM (2GB recomended), 3D graphics card compatible with DirectX 9.0 and 256MB (NVIDIA GeForce 7800 or ATI Radeon X1800 or better), 6GB HDD, Mouse, Keyboard. \n\nInstallation \n\n1. Double click the .exe \n2. Click next, accept the EULA, select which path you want the game installed to, ect. \n3. Play\n","torrent":{"xt":"urn:btih:4c788f14335a24f71585ea0f76c5def3c697fd99","amp;dn":"Cryostasis+GOG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c788f14335a24f71585ea0f76c5def3c697fd99","infoHashBuffer":{"type":"Buffer","data":[76,120,143,20,51,90,36,247,21,133,234,15,118,197,222,243,198,151,253,153]},"announce":[],"urlList":[]}}