{"title":"[AsianStreetMeat] Tang (Tang Anal / 2012)","uid":10553722,"size":722247474,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4cb4f2041d3d3deb668a2369a0ee04e3abdb349a&amp;dn=%5BAsianStreetMeat%5D+Tang+%28Tang+Anal+%2F+2012%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"2.No.2","files":1,"time":1405367665,"description":"[AsianStreetMeat] Tang (Tang Anal / 2012)\n\nTang arrived in the big city looking for a job. She tried many shops and offices, but due to her lack of education and up-country accent, she was refused employment. Finally, she secured a job as a house maid. Her employers gave her a uniform, which unfortunately was much too small. Tang did not understand this, as she was quite slim already, but the uniform did allow a great view of her small round ass. The old owner of the house noticed this often. On one occasion when she was bending over the sofa to retrieve fluff, he came up behind her and stated quite plainly that he wanted to fuck her up her ass. Tang did not want to lose her job and have to go back up country. As well as being embarrassed by the situation, she was also embarrassed by her own thoughts that she wanted to try. There was no choice, but to serve the old man. Still with her uniform on, and her knickers drawn aside, he bum fucked her there and then, delivering an ample lashing of sperm deep in her smelly bowels. She spent the rest of the day floor cleaning, as his load, slightly discolored, oozed out of her twitching pucker. So the old man fucked her every day, and she grew increasingly to prefer being his bum bitch over mopping the floors. This went on for many weeks, until the old man's wife, Tang's employer, caught them at it. Being a practical woman, she did not fire Tang immediately, but waited till she could get commission for introducing Tang to a nearby brothel. This is where I found Tang, ready and willing shine and polish my cock, and more eager to fulfill her true vocation as botty hole provider. Wipe the stench off the video, as Tang can be your maid and perfect wife.\n\nAnal, Asian, Thai, Oral, All sex, Cumshot, Blowjob, Facial\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=mpnj2120wspc.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=mpnj2120wspc.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=4ydjt563k3v6.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=4ydjt563k3v6.jpg&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4cb4f2041d3d3deb668a2369a0ee04e3abdb349a","amp;dn":"%5BAsianStreetMeat%5D+Tang+%28Tang+Anal+%2F+2012%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cb4f2041d3d3deb668a2369a0ee04e3abdb349a","infoHashBuffer":{"type":"Buffer","data":[76,180,242,4,29,61,61,235,102,138,35,105,160,238,4,227,171,219,52,154]},"announce":[],"urlList":[]}}