{"title":"Elemental Magic - Volume II (gnv64)","uid":7189340,"size":31339105,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4cfbb6fb25d7e43f8407f50220e49dc415a94866&amp;dn=Elemental+Magic+-+Volume+II+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":-1,"time":1334568127,"description":"Elemental Magic Volume II : The Technique of Special Effects Animation (Animation Masters Title)\nby Joseph Gilland\nFocal Press | October 2011 | 360 Pages | ISBN: 0240814797 | PDF | 29.8 mb &lt;a href=&quot;\nhttp://www.amazon.com/Elemental-Magic-Volume-Technique-Animation/dp/0240814797&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Elemental-Magic-Volume-Technique-Animation/dp/0240814797&lt;/a&gt;\n\nDesign beautiful, professional-level animated effects with these detailed step-by-step tutorials from former Disney animator and animated effects expert Joseph Gilland. Filled with beautiful, full-color artwork, Elemental Magic, Volume II, breaks down the animated effect process from beginning to end-including booming explosions, gusting winds, magical incantations, and raging fires. He also breaks down the process of effects &quot;clean-up,&quot; as well as timing and frame rates. The companion website includes real-time footage of the author lecturing as he animates the drawings from the book. In these videos, he elucidates the entire process from blank page to final animation. See it all come to life like never before. Throughout the book, Joseph refers to and includes examples from his own professional work from feature films such as Lilo &amp; Stitch and Tarzan.\n\n* A companion website with video of the author drawing in real time-showing the entire process from blank page to finished animation-as well as bonus chapters with even more instruction, and sample animations\n* Detailed step-by-step tutorials on how to create fantastic, out-of-this-world effects, such as waves, flames, explosions, and magical effects with references and examples from the author's own work\n* Master instruction from animated effects guru and former Disney animator Joseph Gilland, who has worked on films such as Tarzan, Mulan, and Lilo &amp; Stitch","torrent":{"xt":"urn:btih:4cfbb6fb25d7e43f8407f50220e49dc415a94866","amp;dn":"Elemental+Magic+-+Volume+II+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cfbb6fb25d7e43f8407f50220e49dc415a94866","infoHashBuffer":{"type":"Buffer","data":[76,251,182,251,37,215,228,63,132,7,245,2,32,228,157,196,21,169,72,102]},"announce":[],"urlList":[]}}