{"title":"The Mathematics that Every Secondary School Math Teacher Needs t","uid":6172542,"size":4620370,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4d6de77796ebe293b04ec2b724d60c47daa9e11d&amp;dn=The+Mathematics+that+Every+Secondary+School+Math+Teacher+Needs+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1297639891,"description":"The Mathematics that Every Secondary School Math Teacher Needs to Know \n\nWhat knowledge of mathematics do secondary school math teachers need to facilitate understanding, competency, and interest in mathematics for all of their students? This unique text and resource bridges the gap between the mathematics learned in college and the mathematics taught in secondary schools. Written in an informal, clear, and interactive learner-centered style, it is designed to help pre-service and in-service teachers gain the deep mathematical insight they need to engage their students in learning mathematics in a multifaceted way that is interesting, developmental, connected, deep, understandable, and often, surprising and entertaining. \n\n\nFeatures include Launch questions at the beginning of each section, Student Learning Opportunities, Questions from the Classroom, and highlighted themes throughout to aid readers in becoming teachers who have great &quot;MATH-N-SIGHT&quot;:\n\n\nM Multiple Approaches/Representations \n\nA Applications to Real Life \n\nT Technology \n\nH History \n\nN Nature of Mathematics: Reasoning and Proof \n\nS Solving Problems \n\nI Interlinking Concepts: Connections \n\nG Grade Levels \n\nH Honing of Mathematical Skills \n\nT Typical Errors \n\n\nThis text is aligned with the recently released Common Core State Standards, and is ideally suited for a capstone mathematics course in a secondary mathematics certification program. It is also appropriate for any methods or mathematics course for pre- or in-service secondary mathematics teachers, and is a valuable resource for classroom teachers.\n\nPaperback: 740 pages \nPublisher: Routledge; 1 edition (July 28, 2010) \nLanguage: English \n \n","torrent":{"xt":"urn:btih:4d6de77796ebe293b04ec2b724d60c47daa9e11d","amp;dn":"The+Mathematics+that+Every+Secondary+School+Math+Teacher+Needs+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d6de77796ebe293b04ec2b724d60c47daa9e11d","infoHashBuffer":{"type":"Buffer","data":[77,109,231,119,150,235,226,147,176,78,194,183,36,214,12,71,218,169,225,29]},"announce":[],"urlList":[]}}