{"title":"[SoM]Par condicio[DvdRip-DivX-Ita-Mp3]","uid":4661626,"size":806750208,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4e244cf9e71ffb9793d8278c5d9879ca768ee3dd&amp;dn=%5BSoM%5DPar+condicio%5BDvdRip-DivX-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"mitimex","files":1,"time":1232412508,"description":"Le famiglie mafiose dei Sinagra e dei Musarra, che un tempo si sono combattute a colpi di lupara il predominio sul territorio di Vigata, hanno ripreso a sparare. Il primo a cadere ÃƒÂ¨ Angelo Bonpensiero, braccio destro del capofamiglia Lillino Musarra in quanto marito della figlia di lui, Mariuccia. In ossequio alla par condicio, i Musarra si vendicano uccidendo Michele Zummo, nipote del vecchio don Balduccio Sinagra. \n\nAl commissario Montalbano non quadrano molte cose: innanzi tutto perchÃƒÂ© dopo quindici anni di &quot;pax mafiosa&quot;, le due famiglie hanno ripreso ad ammazzarsi? Inoltre alcuni particolari della morte di Angelo Bompensiero non lo convincono: se il fatto che gli hanno sparato in faccia con la lupara farebbe pensare a un regolamento di conti di stampo mafioso, il fatto che Pasquano abbia stabilito che Bonpensiero abbia ricevuto una botta alla nuca prima di essere ucciso suona strano.\n\nI suoi dubbi gli attirano le ire del giudice Tommaseo, la cui unica preoccupazione ÃƒÂ¨ di finire subito la guerra tra famiglie. CosÃƒÂ¬ Tommaseo sottrae l'indagine a Montalbano, il quale si concentra su un altro caso: da qualche giorno ÃƒÂ¨ scomparsa una ragazza ucraina, Eva Ljubin. Grazie ad alcune brillanti intuizioni di Catarella, Montalbano riesce a capire che la ragazza ÃƒÂ¨ stata rapita, proprio la notte in cui ÃƒÂ¨ morto Angelo Bonpensiero. Seguendo le tracce della ragazza, Montalbano capisce che Eva ÃƒÂ¨ finita nella casupola in campagna di Biagio Cocuzza., un quarantenne non del tutto sano di mente, con precedenti legati a violenze sessuali.\n\nIntanto, Montalbano viene raggiunto da Livia: il nuovo taglio di capelli sfoggiato dalla sua fidanzata, che la fa somigliare molto alla ragazza scomparsa, spinge il commissario ad usarla per far confessare Biagio. E' forse il metodo piÃƒÂ¹ anticonvenzionale usato da Montalbano nella sua carriera; ma la vicenda del bambino nordafricano morto nell'indagine precedente ha cambiato molto il nostro commissario, che ha giurato a se stesso di non tralasciare alcun tentativo per salvare una vita umana. \n\nBiagio scambia Livia per Eva, e fa capire a Montalbano che la ragazza ÃƒÂ¨ stata rapita da un pastore che porta le pecore al pascolo dalle parti della casupola di Biagio. Parte la caccia all'uomo, con tutti gli uomini del commissariato tesi alla cattura di questo pastore che potrebbe essere il responsabile di una serie di sparizioni di ragazze avvenute nei dintorni negli ultimi anni. \n\nCon un blitz i nostri fanno irruzione nella casupola di Alvaro Sella, lo catturano dopo un conflitto a fuoco e salvano Eva, proprio prima che il pastore la uccidesse. Ma interrogando la ragazza, ancora in stato di shock, Montalbano capisce che la notte in cui fu rapita stava fuggendo da qualcuno che voleva ucciderla. E questo qualcuno era la stessa persona che ha eliminato Angelo Bonpensiero, il quale non ÃƒÂ¨ stato ucciso dai Sinagra, ma da un killer agli ordini di Mariuccia Musarra.","torrent":{"xt":"urn:btih:4e244cf9e71ffb9793d8278c5d9879ca768ee3dd","amp;dn":"%5BSoM%5DPar+condicio%5BDvdRip-DivX-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e244cf9e71ffb9793d8278c5d9879ca768ee3dd","infoHashBuffer":{"type":"Buffer","data":[78,36,76,249,231,31,251,151,147,216,39,140,93,152,121,202,118,142,227,221]},"announce":[],"urlList":[]}}