{"title":"Avengers vs. X-Men","uid":7845493,"size":1958495148,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4e2b8a1d5f48d58daebfaf2ebee190282c43072c&amp;dn=Avengers+vs.+X-Men&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SplhcbPrime","files":-1,"time":1353460574,"description":"Avengers vs. X-Men (abbreviated AvX) is a limited series comic book crossover event published by Marvel Comics, that involves the return of the Phoenix Force and the subsequent war between The Avengers and The X-Men. The 12 issue bimonthly event, first published in April, 2012, features a storyline by Jason Aaron, Brian Michael Bendis, Ed Brubaker, Jonathan Hickman and Matt Fraction and a rotating team of artists including John Romita, Jr., Olivier Coipel and Adam Kubert.\n\nThe event was preceded by the four-issue limited series, Avengers:  X-Sanction, by Jeph Loeb and Ed McGuinness, and Avengers vs. X-Men #0. Avengers vs. X-Men also ties into the limited series; AvX:  Versus, described as, the fight book, which expands upon many of the one-on-one battles featured in:  the main series; the digital series; Avengers vs. X-Men:  Infinite; The Avengers; Avengers Academy; New Avengers; Secret Avengers; Uncanny X-Men; Wolverine and the X-Men; and X-Men:  Legacy. The event was succeeded by the limited series, AvX:  Consequences.\n\nAvengers vs. X-Men brings together the most powerful forces in comics for a super hero war like you've never seen before and will never see again. We all want to see the best of the best go against each other:  Lakers &amp; Celtics; Ali &amp; Frazier; Yankees &amp; Red Sox; and in comics it's the Avengers fighting the X-Men.  The biggest writers, artists and characters were brought together for the biggest story Marvel ever told. This is the kind of high-octane action-packed story that fans demand while also having a profound effect on every character involved, and even reshaping the Marvel Universe in its wake.\n\nThe series focuses on the return of the Phoenix Force, the cosmic entity of death and rebirth, as it looks for its new host, believed to be the teenage mutant Hope Summers. Cyclops and the other X-Men want to protect her and prepare her as if she's to be the mutant savior, while Captain America and The Avengers want her handed over to them so they can figure out what to do with her and keep the world safe from a potentially deadly fate. \n\nAvengers: X-Sanction, a four-issue miniseries published in December, 2011 by writer Jeph Loeb with artist Ed McGuinness lead directly into Avengers vs. X-Men. In the series, Cable learns something's going to happen to his daughter, Hope Summers, and he has been tipped off that the Avengers are responsible. So he targets them one by one starting with their leader, Captain America.\n\nFor your downloading and perusing pleasures, this torrent contains the complete storyline, and even includes optional, background reading material.\n\nNOTE:  These are not my scans.  All praise and glory to the original scanners (and authors/artists/publishers,) please.\n\nEnjoy, and please seed.\n\n","torrent":{"xt":"urn:btih:4e2b8a1d5f48d58daebfaf2ebee190282c43072c","amp;dn":"Avengers+vs.+X-Men","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e2b8a1d5f48d58daebfaf2ebee190282c43072c","infoHashBuffer":{"type":"Buffer","data":[78,43,138,29,95,72,213,141,174,191,175,46,190,225,144,40,44,67,7,44]},"announce":[],"urlList":[]}}