{"title":"Redwall The Graphic Novel","uid":11851137,"size":68084359,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:4e5c3cb437ceb2c6d8248611d3bc6198da18cacf&amp;dn=Redwall+The+Graphic+Novel&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"LeonardTSpock","files":1,"time":1430094468,"description":"Redwall The Graphic Novel\n\nPhilomel Books, 2007, 147 pages\n\nWritten by Brian Jacques (based on his original novel)\n\nAdapted by Stuart Moore\n\nIllustrated by Bret Blevins\n\nIt was meant to be: The classic fantasy adventure that began the Redwall phenomenon is finally available in a cool graphic format. Illustrated by renowned comics artist Bret Blevins, Redwall: The Graphic Novel brings to life all the battles, all the heroes, and all the villains in a fun new format perfect for reluctant readers, those just entering the Redwall world, or the countless existing fans of the series.\n\nWhen Redwall Abbey is attacked by Cluny the rat's army, Matthias the mouse follows the example of Martin the Warrior and becomes a hero. Fans of the novel will want to see if villains like Cluny the Scourge and Asmodeus Poisonteeth live up to their imaginations, while new readers will enjoy visiting Redwall for the first time. The adaptation of the novel is excellent; even this condensed form captures the spirit and the language of the original. The graphic-novel format makes the action accessible to younger readers, who will be able to join the ranks of fans who love Matthias the mouse, Constance the badger, and the rest of the Redwall supporters. The story is a page-turner, and the detailed black-and-white drawings capture both the passion and the pathos. Characters on both sides are injured and killed; the violence is realistic but not graphic. By the end of the book, readers will be cheering for Matthias as he uses both his brawn and his brains to defeat his enemies and become the champion of Redwall","torrent":{"xt":"urn:btih:4e5c3cb437ceb2c6d8248611d3bc6198da18cacf","amp;dn":"Redwall+The+Graphic+Novel","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e5c3cb437ceb2c6d8248611d3bc6198da18cacf","infoHashBuffer":{"type":"Buffer","data":[78,92,60,180,55,206,178,198,216,36,134,17,211,188,97,152,218,24,202,207]},"announce":[],"urlList":[]}}