{"title":"Dagmara Dominczyk - The Lullaby of Polish Girls- A Novel [Epub &amp;","uid":11108740,"size":1992711,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4e6b180ec6a52864d450b7d14cb0be25c64bb135&amp;dn=Dagmara+Dominczyk+-+The+Lullaby+of+Polish+Girls-+A+Novel+%5BEpub+%26&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"krystine","files":-1,"time":1411766563,"description":"The Lullaby of Polish Girls by Dagmara Dominczyk\n\n\n\nA vibrant, engaging debut novel that follows the friendship of three women, from their coming of age in a small town in Poland in the 1980s to their complicated adult lives, by the stunning and talented actress Dagmara Dominczyk.\n\nAnna's family emigrate to the U.S. in the 1980s when she is just a girl. They are granted political asylum because of her father's role in the Solidarity movement that brings an end to the Communist regime. Anna never quite feels like she belongs until the summer she is 12, when she returns to Kielce, Poland, to visit her grandmother. She develops an intense friendship with two local girls-brash and beautiful Justyna and desperate, awkward Bronka. Despite the very different paths their lives take, they maintain their connection. Over a decade later, a scandalous murder leads them back to the place where their unlikely friendship began. Dominczyk's assured narrative flashes from the wild teenage summers of their past to the years of self-discovery in New York, and Europe. The Lullaby of Polish Girls captures the passion and drama of youthful friendship, the immigrant's yearning to fit in, and the exquisite and wistful transformation of young women coming of age.\n\n\n\nGenre: Literary Fiction | European Literature\n","torrent":{"xt":"urn:btih:4e6b180ec6a52864d450b7d14cb0be25c64bb135","amp;dn":"Dagmara+Dominczyk+-+The+Lullaby+of+Polish+Girls-+A+Novel+%5BEpub+%26","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e6b180ec6a52864d450b7d14cb0be25c64bb135","infoHashBuffer":{"type":"Buffer","data":[78,107,24,14,198,165,40,100,212,80,183,209,76,176,190,37,198,75,177,53]},"announce":[],"urlList":[]}}