{"title":"Endless Space - Disharmony v1.1.0 (2-click run)","uid":8629340,"size":1828378991,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4fbd8fc42a40f6a2a1a68baef8a7971662fc05db&amp;dn=Endless+Space+-+Disharmony+v1.1.0+%282-click+run%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"The_Duck1","files":-1,"time":1372597943,"description":"No need for serials and cracks to get the full version, (already done it for you).\nNo unnecessary registry changes. \nNo boring installation of tool-bars in your browser or other unwanted things.\nYou can even run this torrent from an USB-Stick.\nEasy Uninstall with the Windows control panel.\nChoose where you want to put the files on your PC. \nThese are a few things that makes a '2-click run' version a better version.\n\nIf everybody seeds, you will get higher downloading speeds.\n\nVersion 1.1.0\n\nDescription:\nThe Endless Space: Disharmony expansion will bring many enhancements\nand additions for Endless Space players. A tenth faction, known as &quot;The\nHarmony&quot;, basically consisting of living rock, will make its\nappearance, along with its unique play style and objectives. Space\nbattles have never been more intense, with the addition of fighters and\nbombers, battle formations, a new targeting system, a redesigned weapon\nsystem and enhanced planet invasion mechanics. Revamped AI opponents\nwill now offer vastly more unpredictable and cunning behaviour to make\nthe Endless Space even more dangerous.\n\nFeatures:\n\nA brand new Faction called &quot;the Harmony&quot; with a single objective in\nmind, annihilate Dust\n\nNew fighters and bombers unit that will completely change the shape of\ncombat.\n\nIntroduction of new Battle Formation and Targeting systems for more\nbattle control.\n\nA complete rework of the Ship Design Interface for an improved Weapon\nSystem that includes family types for modules (short, medium and long\nrange).\n\nNew Invasion mechanics: Prepare your population for bombardments,\nsieges and land invasions\n\nExpect to face a real challenge when playing against AI opponents with\nthe &quot;New Adaptive Multi-Agent Artificial Intelligence System&quot; (AMAS)\n\nNew Rally Points feature for newly built ships, to reduce\nmicromanagement.\n\nFour new Heroes and the option to Disable Exchange of Technologies, as\nper the community requests.\n\nInstallation instructions:\n1. Execute the Endless Space - Disharmony v1.1.0 (2-click run).exe file.\n2. Click next.\n3. Enjoy the program.","torrent":{"xt":"urn:btih:4fbd8fc42a40f6a2a1a68baef8a7971662fc05db","amp;dn":"Endless+Space+-+Disharmony+v1.1.0+%282-click+run%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fbd8fc42a40f6a2a1a68baef8a7971662fc05db","infoHashBuffer":{"type":"Buffer","data":[79,189,143,196,42,64,246,162,161,166,139,174,248,167,151,22,98,252,5,219]},"announce":[],"urlList":[]}}