{"title":"Konica Minolta SimWin Utility (virtual panel)","uid":4527994,"size":27632256,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:4fc413dd1182bbc749d15a3aeb61c23f22511e42&amp;dn=Konica+Minolta+SimWin+Utility+%28virtual+panel%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"morgan3004","files":1,"time":1227437522,"description":"Utilities for Konica Minolta C250, C252, C350, C352, C450 printers. Allows you to work with full vertual panel and enter in service mode. Needs spec jig - cable, to connect printer to your PC. (virtual panel, panel utility, simwin, konica minolta utility programm) \n For those who forgot how to enter menu: after you've connected wire to PC, push ENTER/Menu button on the printer and hold it. While yor're doing it turn on the printer and hold button until on the display will appear Trouble Machine or Status. OK, can take away your fingers off. Double click on  SimWin_XXX.exe file, and than there would be a window where you must select your working Com port. OK, now if You've all done right, there will appear menu screen (like on C350 Copymachine), at the center for a few secs will be picture with Earth and bubbles, than must appear working screen like on Konica's full version. If not, check your cable and Com port (See your working comport in Windows Prefences, if it works of course). Than push Utility key and  Details button on the screen. After it push following buttons: Stop , 0 , 0 , Stop , 0 , 1 \nHere we are! in the service menu \nHope it helps","torrent":{"xt":"urn:btih:4fc413dd1182bbc749d15a3aeb61c23f22511e42","amp;dn":"Konica+Minolta+SimWin+Utility+%28virtual+panel%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fc413dd1182bbc749d15a3aeb61c23f22511e42","infoHashBuffer":{"type":"Buffer","data":[79,196,19,221,17,130,187,199,73,209,90,58,235,97,194,63,34,81,30,66]},"announce":[],"urlList":[]}}