{"title":"The Usual Suspects DVDRip TSV","uid":6956192,"size":741559717,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4fcc9771840f6625f6edf56eb958a5b1df16b229&amp;dn=The+Usual+Suspects+DVDRip+TSV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TSV","files":-1,"time":1326585190,"description":"The Usual Suspects is a 1995 American neo-noir film written by Christopher McQuarrie and directed by Bryan Singer. It stars Stephen Baldwin, Gabriel Byrne, Benicio del Toro, Chazz Palminteri, Kevin Pollak, Kevin Spacey and Pete Postlethwaite.\n\nThe film follows the interrogation of Roger &quot;Verbal&quot; Kint, a small-time con man who is one of only two survivors of a massacre and fire on a ship docked at the Port of Los Angeles. He tells an interrogator a convoluted story about events that led him and four other criminals to the boat, and of a mysterious mob boss known as Keyser SÃƒÂ¶ze who commissioned their work. Using flashback and narration, Kint's story becomes increasingly complex.\n\nThe film, shot on a $6 million budget, began as a title taken from a column in Spy magazine called &quot;The Usual Suspects,&quot; after one of Claude Rains' most memorable lines in the classic film Casablanca. Singer thought it would make a good title for a film, the poster for which he and McQuarrie had developed as the first visual idea.\n\nThe Usual Suspects was shown out of competition at the 1995 Cannes Film Festival,[1] and then initially released in a few theaters. It received favorable reviews, and was eventually given a wider release. McQuarrie won an Academy Award for the screenplay and Spacey won the Academy Award for Best Supporting Actor for his performance.\n\n\n\n\nThere was a gang of Hungarians that wanted their own mob. They realized that to be in power, you didn't need guns or money or even numbers. You just needed the will to do what the other guy wouldn't. After a while, they come into power and then they come after Soze. He was small-time then, just running downloads, they say.\n\nThey come to his home in the afternoon, looking for his downloads. They find his wife and kids in the house and decide to wait for Soze. He comes home to find his wife raped and children screaming. The Hungarians knew Soze was tough, not to be trifled with, so they let him know they meant business. They tell him they want his hard drive, all his downloads. Soze looks over the faces of his family. Then he showed these men of will what will really was. He seeded for a month.","torrent":{"xt":"urn:btih:4fcc9771840f6625f6edf56eb958a5b1df16b229","amp;dn":"The+Usual+Suspects+DVDRip+TSV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fcc9771840f6625f6edf56eb958a5b1df16b229","infoHashBuffer":{"type":"Buffer","data":[79,204,151,113,132,15,102,37,246,237,245,110,185,88,165,177,223,22,178,41]},"announce":[],"urlList":[]}}