{"title":"Miles Davis - A Tribute To Jack Johnson 1971 (remaster) 320kb/s","uid":3779694,"size":125942801,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4fd297eb6cb52eb6876996d008146a98873f73d1&amp;dn=Miles+Davis+-+A+Tribute+To+Jack+Johnson+1971+%28remaster%29+320kb%2Fs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"NeverTheSame","files":2,"time":1187660051,"description":"Ripped at 320kb/s in TRUE STEREO. Please stop using Joint Stereo people! It&amp;#039;s in your iTunes ripping options, and it&amp;#039;s turned on by default. \n\nMiles Davis\nA Tribute to Jack Johnson\nColumbia/Legacy\nReleased 1971, Reissued 2005\n\nWell, here it is, finally: the Miles Davis album A Tribute to Jack Johnson , newly remastered.\n\nI&amp;#039;ve looked for this album on torrent for ages, and finally I gave in and bought it. It was worth every penny. Hope you&amp;#039;ll agree.\n\nFor the uninitiated, let us state that the real substance of Jack Johnson was recorded on April 7th, 1970 by what was, compared to the lineups that made Bitches Brew, a skeleton crew of a band. There are two songs, each originally one side of a vinyl record: &quot;Right Off&quot; and &quot;Yesternow&quot;, each about twenty-five minutes long. The music was recorded for the soundtrack of a documentary about boxer Jack Johnson, a black celebrity many years ahead of his time in terms of fearlessness and ostentation; obviously, someone Miles could relate to. The album, unlike Bitches Brew , sold poorly upon its initial release, lost in a flurry of new electric Miles Davis albums and for the first time, competing fusion releases, often by former Miles sidemen.\n\nJack Johnson is a tremendous album, and in its particular concentration of biting, staccato rock (if this is rock/jazz fusion, rock is winning), it&amp;#039;s unique in Miles&amp;#039; body of work. If it was meant to break through to rock audiences, it failed, and of course it did: while this is loud, amplified, improvisational music, it&amp;#039;s too harsh and perhaps too black-sounding for fans of the Grateful Dead or the Charles Lloyd Quartet. And to me, Jack Johnson sounds best divorced from the various sections of recorded sessions that produced it. Wading through the hours of studio time that fill The Complete Jack Johnson Sessions or The Complete Bitches Brew Sessions, or The Complete In a Silent Way Sessions is fascinating, but to these ears, just blunts the impact of the actual albums. It compromises their mystery, like seeing the sawdust, discarded costumes and bored Teamsters backstage at a play.\n\n\n\nPersonnel: Miles Davis: trumpet; Steve Grossman: soprano saxophone; Herbie Hancock: organ; John McLaughlin: electric guitar; Michael Henderson: electric bass; Billy Cobham: drums; Sonny Sharrock (uncredited, #2 only): electric guitar\n\nTrack Listing: \n1. Right Off \n2. Yesternow","torrent":{"xt":"urn:btih:4fd297eb6cb52eb6876996d008146a98873f73d1","amp;dn":"Miles+Davis+-+A+Tribute+To+Jack+Johnson+1971+%28remaster%29+320kb%2Fs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fd297eb6cb52eb6876996d008146a98873f73d1","infoHashBuffer":{"type":"Buffer","data":[79,210,151,235,108,181,46,182,135,105,150,208,8,20,106,152,135,63,115,209]},"announce":[],"urlList":[]}}