{"title":"Electronics-Makers-Modern_Electronic_Circuits_Reference_Manual-J","uid":9204840,"size":67739014,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4fe0a941cf6654811de51ca5835d384b8de9514b&amp;dn=Electronics-Makers-Modern_Electronic_Circuits_Reference_Manual-J&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"das_wookie","files":-1,"time":1384671769,"description":"Book Description\nLists more than 3,600 practical modern electronic circuits, each with type numbers or values of all significant components, an identifying title, a concise description, performance data, and suggestions for other applications. Following each description, there is a citation giving the title of the original article or book in which the circuit appears, its authors, and the exact location of the circuit in the original source. Circuits presented in this massive collection range from those for amplifiers to those for voltage reference purposes. In between are audio, battery charging, burglar-alarm, memory, microprocessor, music, noise optoelectronic, phonograph, power control, receiver, remote-control, servo, siren, squelch, stereo, sweep, telephone, teleprinter, television, timer and voltage-reference circuits.\n\n\nPublication Date: January 1980\nISBN-10: 0070404461\nISBN-13: 978-0070404465\n\nProbably the most complete book of circuits I've ever seen. While some of the components may now be obsolete, you can generally find suitable replacements. The collection is well layed out, and worth adding to the library if you like experimenting with electronics. \n\nNot only can you read it, you could also crush lesser mortals with this thing. Still, for those times when you're stuck looking for ideas, this is a fine place to start. Besides, the best advice I came across in my writing days was that if you want to write, you should also read. This book facilitates that same process for circuit design. Nevertheless, I fear that someday a movie will be made about my brave attempts to free myself after being pinned under the book for 8 days.\n\nPerfect book for Makers and those who love to tinker with electronics.","torrent":{"xt":"urn:btih:4fe0a941cf6654811de51ca5835d384b8de9514b","amp;dn":"Electronics-Makers-Modern_Electronic_Circuits_Reference_Manual-J","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fe0a941cf6654811de51ca5835d384b8de9514b","infoHashBuffer":{"type":"Buffer","data":[79,224,169,65,207,102,84,129,29,229,28,165,131,93,56,75,141,233,81,75]},"announce":[],"urlList":[]}}