{"title":"Feminist Fantasies by Phyllis Schlafly.lit","uid":7284861,"size":325249,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:515c5ff695fd22a08a1bc62cf6cfcd85d6fb7848&amp;dn=Feminist+Fantasies+by+Phyllis+Schlafly.lit&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Vikingman1111","files":-1,"time":1337549745,"description":"No assault has been more ferocious than feminism's forty-year war against women. And no battlefield leader has been more courageous than Phyllis Schlafly. In a new book of dispatches from the front, feminism's most potent foe exposes the delusions and hypocrisy behind a movement that has cheated millions of women out of their happiness, health, and security.\nPhyllis Schlafly was one of the first to recognize that feminism-like other destructive ideologies-is at odds with human nature. So as the rest of the intellectual elite fell compliantly into line, she took up the fight for the right to be a woman. Feminist Fantasies is the inspiring story of that fight.\n\nLike communism, feminism has been a catastrophe for the people it was meant to help. Mrs. Schlafly opens with a demonstration of its failure in every aspect of women's lives. She then examines the media, feminism's trusty handmaiden, zealous to cover the shortcomings of its mistress. Next, she dissects the feminist agenda policy by policy, from &quot;comparable worth&quot; to the attack on reason. Mrs. Schlafly devotes an entire chapter to the feminist assault on the military-an area where crackpot ideas have dire consequences. Finally, she returns to the heart of most women's lives-marriage and motherhood-where feminism has inflicted the deepest pain.\n\nAnn Coulter, author of the best-seller Slander, is unabashed in her admiration: &quot;Schlafly is brilliant, beautiful, principled, articulate, tireless, and most important, absolutely fearless. And, as this book demonstrates, she is always right. She has always been right. She will always be right.&quot;","torrent":{"xt":"urn:btih:515c5ff695fd22a08a1bc62cf6cfcd85d6fb7848","amp;dn":"Feminist+Fantasies+by+Phyllis+Schlafly.lit","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"515c5ff695fd22a08a1bc62cf6cfcd85d6fb7848","infoHashBuffer":{"type":"Buffer","data":[81,92,95,246,149,253,34,160,138,27,198,44,246,207,205,133,214,251,120,72]},"announce":[],"urlList":[]}}