{"title":"CB8512 - Chartbuster Country Hits 1979-1985 - (200 Hits) - Karao","uid":11563914,"size":740389273,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:519bfd85264ae63b4fde8dca55992a49dbb3a816&amp;dn=CB8512+-+Chartbuster+Country+Hits+1979-1985+-+%28200+Hits%29+-+Karao&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KaraokeRG","files":-1,"time":1416928948,"description":"\nKaraokeRG is a new Release Group dedicated to new,clean karaoke uploads.            \nAll our uploaders have been Trusted &amp; Verified for some years.\nBeware of Fake uploaders,check our username first.\nDo not ask to be an uploader,YOU will be asked.\nPlease comment if you enjoy our uploads &amp; please seed back.\n\nWE HAVE MANY MEMBERS, SO RESEEDING WILL NOT BE POSSIBLE\n\n\n\nCB8512 - Chartbuster Country Hits 1979-1985 - (200 Hits)\n\nRelease Unknown\nPublisher:Chartbuster Karaoke \nUploaded By:KaraokeRG\nFile Size:706 Mb\nFormat:MP3/CD+G\nBit Rate:128.kbps\nContains:210 Files\nPassword Protection:None\n\n\n\n\nTrack List\n\n\nCB8512-01-01 - Rogers, Kenny &amp; Dottie West - Every Time Two Fools Collide\nCB8512-01-02 - Rogers, Kenny - Gambler, The\nCB8512-01-03 - Tillis, Mel - I Believe In You\nCB8512-01-04 - Oak Ridge Boys, The - I'll Be True To You\nCB8512-01-05 - Parton, Dolly - It's All Wrong, But It's All Right\nCB8512-01-06 - Jennings, Waylon - I've Always Been Crazy\nCB8512-01-07 - Milsap, Ronnie - Let's Take The Long Way Around The World\nCB8512-01-08 - Jennings, Waylon - Mama's Don't Let Your Babies Grow Up To Be Cowboy's\nCB8512-01-09 - Gayle, Crystal - Ready For The Times To Get Better\nCB8512-01-10 - Duncan, Johnny - She Can Put Her Shoes (Under My Bed Anytime)\nCB8512-01-11 - Mandrell, Barbara - Sleeping Single In A Double Bed\nCB8512-01-12 - Paycheck, Johnny - Take This Job &amp; Shove It\nCB8512-01-13 - Gayle, Crystal - Talking In Your Sleep\nCB8512-01-14 - Harris, Emmylou - Two More Bottles Of Wine\nCB8512-01-15 - Milsap, Ronnie - What A Difference You've Made In My Life\n\n\n\nCB8512-02-01 - Nelson, Willie - Whiskey River\nCB8512-02-02 - Bandy, Moe &amp; Joe Stampley - Just Good Ol' Boys\nCB8512-02-03 - Gatlin Brothers, The - All The Gold In California\nCB8512-02-04 - Murray, Anne - Shadows In The Moonlight\nCB8512-02-05 - Twitty, Conway - Don't Take It Away\nCB8512-02-06 - Watson, Gene - Farewell Party\nCB8512-02-07 - Twitty, Conway - Happy Birthday Darlin\nCB8512-02-08 - Murray, Anne - I Just Fall In Love Again\nCB8512-02-09 - Williams, Don - It Must Be Love\nCB8512-02-10 - Bandy, Moe - It's A Cheating Situation\nCB8512-02-11 - Bellamy Brothers, The - If I Said You Had A Beautiful Body\nCB8512-02-12 - Mandrell, Barbara - If Loving You Is Wrong (I Don't Want To Be Right)\nCB8512-02-13 - Rogers, Kenny &amp; Dottie West - All I Ever Need Is You\nCB8512-02-14 - Tillis, Mel - Coca Cola Cowboy\nCB8512-02-15 - Twitty, Conway - I May Never Get To Heaven\n\n\n\nCB8512-03-01 - Charlie Daniels Band, The - Devil Went Down To Georgia, The\nCB8512-03-02 - Williams, Don - Tulsa Time\nCB8512-03-03 - Milsap, Ronnie - Back On My Mind Again\nCB8512-03-04 - Gayle, Crystal - Why Have You Left The One You Left Me For\nCB8512-03-05 - Rabbitt, Eddie - Every Which Way But Loose\nCB8512-03-06 - Conlee, John - Backside Of Thirty\nCB8512-03-07 - Williams, Hank Jr. - Family Tradition\nCB8512-03-08 - Gayle, Crystal - Half The Way\nCB8512-03-09 - Rabbitt, Eddie - Suspicions\nCB8512-03-10 - Conlee, John - Lady Lay Down\nCB8512-03-11 - Parton, Dolly - I Really Got The Feeling\nCB8512-03-12 - Milsap, Ronnie - Nobody Likes Sad Songs\nCB8512-03-13 - Rogers, Kenny - She Believes In Me\nCB8512-03-14 - Parton, Dolly - You're The Only One\nCB8512-03-15 - Rogers, Kenny - You Decorated My Life\n\n\nCB8512-04-01 - Lee, Johnny - Lookin' For Love\nCB8512-04-02 - Conlee, John - Friday Night Blues\nCB8512-04-03 - Sheppard, T.G. - Do You Wanna Go To Heaven\nCB8512-04-04 - Murray, Anne - Could I Have This Dance\nCB8512-04-05 - Rogers, Kenny - Lady\nCB8512-04-06 - Lee, Johnny - One In A Million\nCB8512-04-07 - Nelson, Willie - On The Road Again\nCB8512-04-08 - Gayle, Crystal - If You Ever Change Your Mind\nCB8512-04-09 - Milsap, Ronnie - Smoky Mountain Rain\nCB8512-04-10 - Alabama - Why Lady Why\nCB8512-04-11 - Mandrell, Barbara - Crackers\nCB8512-04-12 - Rogers, Kenny - Coward Of The County\nCB8512-04-13 - West, Dottie - Lesson In Leavin'\nCB8512-04-14 - Jones, George - He Stopped Loving Her Today\nCB8512-04-15 - Twitty, Conway - I'd Love To Lay You Down\n\n\nCB8512-05-01 - Sheppard, T.G. - Party Time\nCB8512-05-02 - Bellamy Brothers, The - Do You Love As Good As You Look\nCB8512-05-03 - Mandrell, Barbara - I Was Country When Country Wasn't Cool\nCB8512-05-04 - Williams, Hank Jr. - All My Rowdy Friends\nCB8512-05-05 - Gilley, Mickey - Headache Tomorrow (Or A Heartache Tonight), A\nCB8512-05-06 - Conley, Earl Thomas - Fire &amp; Smoke\nCB8512-05-07 - Parton, Dolly - 9 To 5\nCB8512-05-08 - McDowell, Ronnie - Older Women\nCB8512-05-09 - Jones, George - Still Doin' Time\nCB8512-05-10 - Cash, Rosanne - My Baby Thinks He's A Train\nCB8512-05-11 - Twitty, Conway - Tight Fittin' Jeans\nCB8512-05-12 - Haggard , Merle - I Think I'll Just Stay Here And Drink\nCB8512-05-13 - Parton, Dolly - But You Know I Love You\nCB8512-05-14 - Milsap, Ronnie - There's No Gettin' Over Me\nCB8512-05-15 - Gilley, Mickey - You Don't Know Me\n\n\nCB8512-06-01 - Oak Ridge Boys - Elvira\nCB8512-06-02 - Rabbitt, Eddie - I Love A Rainy Night\nCB8512-06-03 - West, Dottie &amp; Kenny Rogers - What Are We Doin' In Love\nCB8512-06-04 - Cash, Rosanne - Seven Year Ache\nCB8512-06-05 - Oak Ridge Boys, The - Fancy Free\nCB8512-06-06 - Nelson, Willie - Angel Flying Too Close To The Ground\nCB8512-06-07 - Alabama - Love In The First Degree\nCB8512-06-08 - McClain, Charly - Who's Cheatin' Who\nCB8512-06-09 - Alabama - Old Flame\nCB8512-06-10 - Sheppard, T.G. - I Loved 'em Every One\nCB8512-06-11 - West, Shelly &amp; David Frizzell - You're The Reason God Made Oklahoma\nCB8512-06-12 - Bailey, Razzy - Friends\nCB8512-06-13 - Rabbitt, Eddie - Step By Step\nCB8512-06-14 - Sheppard, T.G. - Only One You\nCB8512-06-15 - Gayle, Crystal - Too Many Lovers\n\n\n\nCB8512-07-01 - Oak Ridge Boys, The - Bobbie Sue\nCB8512-07-02 - Watson, Gene - Fourteen Carat Mind\nCB8512-07-03 - Milsap, Ronnie - I Wouldn't Have Missed It For The World\nCB8512-07-04 - Twitty, Conway - Red Neckin' Love Makin' Night\nCB8512-07-05 - Newton, Juice - Sweetest Thing (I've Ever Known), The\nCB8512-07-06 - Gilley, Mickey - Lonely Nights\nCB8512-07-07 - Rabbitt, Eddie - Someone Could Lose A Heart Tonight\nCB8512-07-08 - Alabama - Take Me Down\nCB8512-07-09 - Williams, Don - Lord, I Hope This Day Is Good\nCB8512-07-10 - Pride, Charley - Mountain Of Love\nCB8512-07-11 - Bailey, Razzy - She Left Love All Over Me\nCB8512-07-12 - Haggard, Merle - Big City\nCB8512-07-13 - Twitty, Conway - Clown, The\nCB8512-07-14 - Skaggs, Ricky - Crying My Heart Out Over You\nCB8512-07-15 - Alabama - Mountain Music\n\n\n\nCB8512-08-01 - Nelson, Willie - Always On My Mind\nCB8512-08-02 - Twitty, Conway - Slow Hand\nCB8512-08-03 - Milsap, Ronnie - Any Day Now\nCB8512-08-04 - Fricke, Janie - Don't Worry 'Bout Me\nCB8512-08-05 - Alabama - Take Me Down\nCB8512-08-06 - Skaggs, Ricky - I Don't Care\nCB8512-08-07 - Frizzell, David - I'm Gonna Hire A Wino\nCB8512-08-08 - Sylvia - Nobody\nCB8512-08-09 - Strait, George - Fool Hearted Memory\nCB8512-08-10 - Reed, Jerry - She Got The Goldmine (I Got The Shaft)\nCB8512-08-11 - Skaggs, Ricky - Heartbroke\nCB8512-08-12 - Alabama - Close Enough To Perfect\nCB8512-08-13 - Fricke, Janie - It Ain't Easy Bein' Easy\nCB8512-08-14 - Pride, Charley - You're So Good When You're Bad\nCB8512-08-15 - Rabbitt, Eddie &amp; Crystal Gayle - You &amp; I\n\n\n\nCB8512-09-01 - Oak Ridge Boys, The - American Made\nCB8512-09-02 - Anderson, John - Swingin'\nCB8512-09-03 - McEntire, Reba - Can't Even Get The Blues\nCB8512-09-04 - Gilley, Mickey - Talk To Me\nCB8512-09-05 - Pride, Charley - Why Baby Why\nCB8512-09-06 - Alabama - Dixieland Delight\nCB8512-09-07 - Harris, Emmylou - Lost His Love On Our First Date\nCB8512-09-08 - Conlee, John - Common Man\nCB8512-09-09 - Jennings, Waylon - Lucille (You Won't Do Your Daddy's Will)\nCB8512-09-10 - McEntire, Reba - You're The First Time I Thought About Leaving\nCB8512-09-11 - Gilley, Mickey - Fool For Your Love\nCB8512-09-12 - Williams, Don - Love Is On A Roll\nCB8512-09-13 - West, Shelly - Jose Cuervo\nCB8512-09-14 - Alabama - Closer You Get, The\nCB8512-09-15 - Haggard, Merle &amp; Willie Nelson - Pancho &amp; Lefty\n\n\n\nCB8512-10-01 - Rogers, Kenny &amp; Dolly Parton - Islands In The Stream\nCB8512-10-02 - Gatlin Brothers, The - Houston (Means I'm One Day Closer To You)\nCB8512-10-03 - Jones, George - I Always Get Lucky With You\nCB8512-10-04 - Fricke, Janie - He's A Heartache (Looking For A Place To Happen)\nCB8512-10-05 - Conley, Earl Thomas - Your Love's On The Line\nCB8512-10-06 - Strait, George - Fire I Can't Put Out, A\nCB8512-10-07 - Gayle, Crystal - Baby What About You\nCB8512-10-08 - Conlee, John - I'm Only In It For The Love\nCB8512-10-09 - Pride, Charley - Night Games\nCB8512-10-10 - Mandrell, Barbara - One Of A Kind Pair Of Fools\nCB8512-10-11 - Alabama - Lady Down On Love\nCB8512-10-12 - Greenwood, Lee - Somebody's Gonna Love You\nCB8512-10-13 - Murray, Anne - Little Good News, A\nCB8512-10-14 - Conley, Earl Thomas - Holding Her &amp; Loving You\nCB8512-10-15 - Fricke, Janie - Tell Me A Lie\n\n\nCB8512-11-01 - Exile - Woke Up In Love\nCB8512-11-02 - Strait, George - You Look So Good In Love\nCB8512-11-03 - Alabama - Roll On Eighteen Wheeler\nCB8512-11-04 - Haggard, Merle - That's The Way Love Goes\nCB8512-11-05 - Fricke, Janie - Let's Stop Talking About It\nCB8512-11-06 - Sheppard, T.G. - Slow Burn\nCB8512-11-07 - Statler Brothers - Elizabeth\nCB8512-11-08 - Conlee, John - In My Eyes\nCB8512-11-09 - Williams, Don - Stay Young\nCB8512-11-10 - Strait, George - Right Or Wrong\nCB8512-11-11 - Murray, Anne - Just Another Woman In Love\nCB8512-11-12 - Iglesias, Julio &amp; Willie Nelson - To All The Girl's I've Loved Before\nCB8512-11-13 - Conlee, John - As Long As I'm Rockin' With You\nCB8512-11-14 - Alabama - When We Make Love\nCB8512-11-15 - Gosdin, Vern - I Can Tell By The Way You Dance\n\n\nCB8512-12-01 - Alabama - If You're Gonna Play In Texas\nCB8512-12-02 - Twitty, Conway - I Don't Know A Thing About Love\nCB8512-12-03 - Skaggs, Ricky - Honey (Open That Door)\nCB8512-12-04 - Judds, The - Why Not Me\nCB8512-12-05 - Haggard, Merle - Let's Chase Each Other Around The Room\nCB8512-12-06 - Nelson, Willie - City Of New Orleans\nCB8512-12-07 - Exile - Give Me One More Chance\nCB8512-12-08 - Judds, The - Mama He's Crazy\nCB8512-12-09 - Exile - I Don't Want To Be A Memory\nCB8512-12-10 - Conley, Earl Thomas - Angel In Disguise\nCB8512-12-11 - Murray, Anne &amp; Dave Loggins - Nobody Loves Me Like You Do\nCB8512-12-12 - Haggard, Merle - Someday When Things Are Good\nCB8512-12-13 - Twitty, Conway - Somebody's Needin' Somebody\nCB8512-12-14 - Conley, Earl Thomas - Chance Of Lovin' You\nCB8512-12-15 - Oak Ridge Boys, The - Everyday\n\n\nCB8512-13-01 - McDaniel, Mel - Baby's Got Her Blue Jeans On\nCB8512-13-02 - Strait, George - Does Ft. Worth Ever Cross Your Mind\nCB8512-13-03 - McEntire, Reba - How Blue\nCB8512-13-04 - Alabama - Fire In The Night\nCB8512-13-05 - Statler Brothers, The - My Only Love\nCB8512-13-06 - Judds, The - Girl's Night Out\nCB8512-13-07 - Rogers, Kenny - Crazy\nCB8512-13-08 - Conley, Earl Thomas - Honor Bound\nCB8512-13-09 - McEntire, Reba - Somebody Should Leave\nCB8512-13-10 - Bellamy Brothers, The - I Need More Of You\nCB8512-13-11 - Alabama - There's No Way\nCB8512-13-12 - McClain, Charly - Radio Heart\nCB8512-13-13 - Haggard, Merle - Natural High\nCB8512-13-14 - Skaggs, Ricky - Country Boy\nCB8512-13-15 - Milsap, Ronnie - She Keeps The Home Fires Burning\n\n\nCB8512-14-01 - Alabama - Forty Hour Week\nCB8512-14-02 - Exile - She's A Miracle\nCB8512-14-03 - Conley, Earl Thomas - Love Don't Care (Whose Heart It Breaks)\nCB8512-14-04 - Judds, The - Love Is Alive\nCB8512-14-05 - Milsap, Ronnie - Lost In The Fifties\nCB8512-14-06 - Osmond, Marie &amp; Dan Seals - Meet Me In Montana\nCB8512-14-07 - Alabama - Can't Keep A Good Man Down\nCB8512-14-08 - Newton, Juice - You Make Me Want To Make You Mine\nCB8512-14-09 - Strait, George - Chair, The\nCB8512-14-10 - Fricke, Janie - She's Single Again\nCB8512-14-11 - Jones, George - Who's Gonna Fill Their Shoes\nCB8512-14-12 - Judds, The - Have Mercy\nCB8512-14-13 - Conlee, John - Working Man\nCB8512-14-14 - Bellamy Brothers, The - Lie To You For Your Love\nCB8512-14-15 - Cash, Rosanne - I Don't Know Why You Don't Want Me","torrent":{"xt":"urn:btih:519bfd85264ae63b4fde8dca55992a49dbb3a816","amp;dn":"CB8512+-+Chartbuster+Country+Hits+1979-1985+-+%28200+Hits%29+-+Karao","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"519bfd85264ae63b4fde8dca55992a49dbb3a816","infoHashBuffer":{"type":"Buffer","data":[81,155,253,133,38,74,230,59,79,222,141,202,85,153,42,73,219,179,168,22]},"announce":[],"urlList":[]}}