{"title":"Engineering Materials:Research, Applications and Advances[MyeBoo","uid":11402088,"size":12608421,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:51f6ae19f13c39ca98b11f9bb530f31f8775a044&amp;dn=Engineering+Materials%3AResearch%2C+Applications+and+Advances%5BMyeBoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"MyeBookShelf","files":-1,"time":1415422138,"description":"Engineering Materials Research, Applications and Advances[MyeBookShelf]\n2014 | ISBN: 1482257971 | English | 636 pages | PDF | 12 MB\n\nIntroduces Emerging Engineering Materials\n\nMechanical, materials, and production engineering students can greatly benefit from Engineering Materials: Research, Applications and Advances. This text focuses heavily on research, and fills a need for current information on the science, processes, and applications in the field. Beginning with a brief overview, the book provides a historical and modern perspective on material science, and describes various types of engineering materials. It examines the industrial process for emerging materials, determines practical use under a wide range of conditions, and establishes what is needed to produce a new generation of materials.\n\nCovers Basic Concepts and Practical Applications\n\nThe book consists of 18 chapters and covers a variety of topics that include functionally graded materials, auxetic materials, whiskers, metallic glasses, biocomposite materials, nanomaterials, superalloys, superhard materials, shape-memory alloys, and smart materials. The author outlines the latest advancements, including futuristic plastics, sandwich composites, and biodegradable composites, and highlights special kinds of composites, including fire-resistant composites, marine composites, and biomimetics. He also factors in current examples, future prospects, and the latest research underway in materials technology.\n\nContains approximately 160 diagrams and 85 tables\nIncorporates examples, illustrations, and applications used in a variety of engineering disciplines\nIncludes solved numerical examples and objective questions with answers\nEngineering Materials: Research, Applications and Advances serves as a textbook and reference for advanced/graduate students in mechanical engineering, materials engineering, production engineering, physics, and chemistry, and relevant researchers and practicing professionals in the field of materials science","torrent":{"xt":"urn:btih:51f6ae19f13c39ca98b11f9bb530f31f8775a044","amp;dn":"Engineering+Materials%3AResearch%2C+Applications+and+Advances%5BMyeBoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"51f6ae19f13c39ca98b11f9bb530f31f8775a044","infoHashBuffer":{"type":"Buffer","data":[81,246,174,25,241,60,57,202,152,177,31,155,181,48,243,31,135,117,160,68]},"announce":[],"urlList":[]}}