{"title":"Black-IBM&amp;Holocaust-Strategic Alliance Between Nazi Germany &amp; Am","uid":4535177,"size":3804880,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5228c732ce4599cd393396e88c2e4ed0ecd9528a&amp;dn=Black-IBM%26Holocaust-Strategic+Alliance+Between+Nazi+Germany+%26+Am&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"red_gonzo","files":1,"time":1227712443,"description":"This is Edwin Black&amp;#039;s explosive book IBM and the Holocaust - The Strategic Alliance Between Nazi Germany and America&amp;#039;s Most Powerful Corporation (2001) which exposes for the first time a thoroughly researched and meticulously documented history of the relationship of a corporate giant and the advanced technology it sold to the Third Reich, its war effort and its plan to exterminate the Jews. Was IBM, &quot;The Solutions Company,&quot; partly responsible for the Final Solution? That&amp;#039;s the question raised by author of this book, the most controversial on the subject since Goldhagen&amp;#039;s Hitler&amp;#039;s Willing Executioners. Black, a son of Holocaust survivors, argues that IBM founder Thomas Watson well deserved the Merit Cross (Germany&amp;#039;s second-highest honor) awarded him by Hitler, his second-biggest customer on earth. &quot;IBM, primarily through its German subsidiary, made Hitler&amp;#039;s program of Jewish destruction a technologic mission the company pursued with chilling success,&quot; writes Black. &quot;IBM had almost single-handedly brought modern warfare into the information age [and] virtually put the &amp;#039;blitz&amp;#039; in the krieg.&quot; The crucial technology was a precursor to the computer, the IBM Hollerith punch card machine, which Black glimpsed on exhibit at the U.S. Holocaust Museum, inspiring his five-year, top-secret book project. The Hollerith was used to tabulate and alphabetize census data. As he says the Hollerith and its punch card data (&quot;hole 3 signified homosexual ... hole 8 designated a Jew&quot;) was indispensable in rounding up prisoners, keeping the trains fully packed and on time, tallying the deaths and organizing the entire war effort. IBM and the Holocaust provides a chilling investigation into corporate complicity and the atrocities witnessed raise startling questions that throw IBM&amp;#039;s wartime ethics into serious doubt. Edwin Black&amp;#039;s monumental research exposes in shocking detail how IBM and its subsidiaries helped create enabling technologies for the Nazis, step-by-step, from the identification and cataloging programs of the 1930s to the selections of the 1940s. Hitler&amp;#039;s regime was fantastically, suicidally chaotic but could IBM have been the cause of its sole competence - mass-murdering civilians? With impeccable documentation the author proves just that and much more as he has created a must-read work of history and definetly a book IBM just doesn&amp;#039;t want you to read. 535 pages. A must read for everyone.\n","torrent":{"xt":"urn:btih:5228c732ce4599cd393396e88c2e4ed0ecd9528a","amp;dn":"Black-IBM%26Holocaust-Strategic+Alliance+Between+Nazi+Germany+%26+Am","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5228c732ce4599cd393396e88c2e4ed0ecd9528a","infoHashBuffer":{"type":"Buffer","data":[82,40,199,50,206,69,153,205,57,51,150,232,140,46,78,208,236,217,82,138]},"announce":[],"urlList":[]}}