{"title":"Black Velvet Art (art ebook).pdf","uid":11157603,"size":49780298,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:529abf9d6238855e7cb1d1661265194b9d0e863f&amp;dn=Black+Velvet+Art+%28art+ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1412464287,"description":"Eric A. Eliason, Scott Squire (Photographer), &quot;Black Velvet Art&quot; \nEnglish | ISBN: 1604737948 | 2011 | PDF | 144 pages | 48 MB\n\nJesus, matadors, panthers, bandits, Indians, movie stars, waifs, and, of course, Elvis are recognized icons of the oft-despised, uber-kitsch art form of black velvet painting. In Black Velvet Art author Eric A. Eliason and photographer Scott Squire present a comprehensive overview of this covertly-loved and overtly-reviled tradition.\n\nIn cooperation with a network of artists, collectors, importers, and gallery owners in Tijuana, Los Angeles, Seattle, and Calgary, this book draws from the largest survey of velvet painting ever undertaken. The book traces velvet's historical development as a folk art shaped by both indigenous traditions as well as Western consumer expectations in such markets as the South Pacific, Southeast Asia, and particularly the U.S./Mexico border and the black velvet capital of Tijuana. In black velvet, class and taste challenge art as a consumer phenomenon, democratic spirit faces down elitism, reproduction questions originality, and sexuality seduces and provokes religiosity.\n\nWhat is most significant about black velvet art to many Americans is its signaling of the nadir of bad taste. Black velvet is the &quot;anti-art&quot; in many ways. Eliason seeks to explore how and why black velvet serves this function and to examine ways it deserves a glowing redemption.","torrent":{"xt":"urn:btih:529abf9d6238855e7cb1d1661265194b9d0e863f","amp;dn":"Black+Velvet+Art+%28art+ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"529abf9d6238855e7cb1d1661265194b9d0e863f","infoHashBuffer":{"type":"Buffer","data":[82,154,191,157,98,56,133,94,124,177,209,102,18,101,25,75,157,14,134,63]},"announce":[],"urlList":[]}}