{"title":"Lyla Foy - Mirrors the Sky (2014) [FLAC]","uid":9779062,"size":196941723,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:53887d484ea4afa55e4b4af296bdf2debb2c3792&amp;dn=Lyla+Foy+-+Mirrors+the+Sky+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1395077254,"description":"\n  Lyla Foy - Mirrors the Sky (2014) [FLAC]\n\n  Genre: Pop/Rock \n  Styles: Indie Pop, Singer/Songwriter\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 KHz\n\n  01 Honeymoon\n  02 I Only\n  03 Impossible\n  04 Rumour\n  05 Easy\n  06 No Secrets\n  07 Only Human\n  08 Feather Tongue\n  09 Someday\n  10 Warning\n\n  London-based singer/songwriter Lyla Foy first emerged in late 2012 working under the alias WALL. The project came about on a lark, with the inspired Foy calling off plans with friends to instead work on music by herself at home. She came up with the first of what would be several incredibly well-received tracks that would be spread around the Internet over many months, ultimately culminating in her dropping the WALL moniker in favor of her given name, and signing to the Sub Pop label for debut album Mirrors the Sky. Foy's intimate, dark vocals glide easily oven ten songs' worth of spare instrumentation, ranging from the snappy indie electro of &quot;I Only&quot; to more organic, nearly country themes on &quot;Rumour.&quot; Foy's songs feel incredibly focused and close, as if she's singing in the same room with the listener even when the album lifts into soaring harmonies or booming electronic beats. Many of Foy's contemporaries can be heard in her songs, such as the moody Bat for Lashes rhythms and Kate Bush reappropriations of &quot;Easy&quot; and the numb loneliness in her voice that she shares with Lana Del Rey. &quot;No Secrets,&quot; the first track Foy recorded as WALL on that fateful night in 2012, resurfaces here, but ironically it's one of the weaker songs on the album. She finds her voice more surefootedly and satisfyingly on the slinky electro groove of &quot;Feather Tongue&quot; and Fleetwood Mac-recalling whispery pop of &quot;Impossible&quot; than on her more traditionally minded tunes. This strong debut points to even stronger, more focused work from Foy down the line.","torrent":{"xt":"urn:btih:53887d484ea4afa55e4b4af296bdf2debb2c3792","amp;dn":"Lyla+Foy+-+Mirrors+the+Sky+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53887d484ea4afa55e4b4af296bdf2debb2c3792","infoHashBuffer":{"type":"Buffer","data":[83,136,125,72,78,164,175,165,94,75,74,242,150,189,242,222,187,44,55,146]},"announce":[],"urlList":[]}}