{"title":"The Sarah Jane Adventures - Season 03 (2009) - 12 Episodes - 1 S","uid":10815624,"size":2841727609,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:54104b0cdff8e4a65f9b73d70e35751a915b4f82&amp;dn=The+Sarah+Jane+Adventures+-+Season+03+%282009%29+-+12+Episodes+-+1+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"bnaron","files":-1,"time":1408460446,"description":"The Sarah Jane Adventures - Season 03 (2009) - 12 Episodes - 1 Special\n\n\nSeries Description Courtesy Of:\n\nWikipedia, the free encyclopedia\nen.wikipedia.org/wiki/The_Sarah_Jane_Adventures\n\n\nNOTE: Episode Spoilers Below.  Do not read the synopses if it might ruin your viewing experience. You HAVE been warned!\n\n\nThe Sarah Jane Adventures is a British science fiction television program, produced by BBC Cymru Wales for CBBC, created by Russell T Davies and starred Elisabeth Sladen. The program is a spin-off of the long-running BBC science fiction program Doctor Who and focuses on the adventures of Sarah Jane Smith, a middle-aged investigative journalist who, in her youth, had numerous adventures across time and space. The series debuted on BBC One with a 60-minute special, &quot;Invasion of the Bane&quot;, on 1 January 2007, and broadcast through to 2011. It was nominated for a British Academy Children's Award in 2008 in the Drama category, and for a BAFTA Cymru in 2009 in the Children's Drama category. The program won a Royal Television Society 2010 award for Best Children's Drama\n\nSeason Four was the first to be broadcast in HD (Unfortunately the episodes in this torrent are not in HD). David Tennant guest starred as The Tenth Doctor in The Wedding of Sarah Jane Smith which was also the final story he filmed during his time as the Doctor. Also, K9 became a regular character at the end of The Mad Woman in the Attic due to an agreement being reached with Bob Baker who owned the rights to the character.\n\n\nEpisode Synopses Courtesy Of:\n\nInternet Movie Database (IMDB) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0862620/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0862620/&lt;/a&gt;\n\n\n2009-10-15 - Prisoner of the Judoon (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nWhen a space pod crashes near to her house Sarah Jane and her gang investigate. A Judoon officer Captain Tybo is pursuing a renegade Vail called Androvax, who is bent on destroying all the planets in the galaxy. He takes over and possesses Sarah Jane who, acting out of character because of the possession, orders Mr. Smith to auto-destruct. A countdown of one minute begins. \n\n\n2009-10-16 - Prisoner of the Judoon (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nLuke dissuades Mr. Smith from destroying himself but the possessed Sarah Jane is gathering the means to construct a spaceship which will allow Androvax to escape. He is bent on destroying all the planets as a revenge following the death of the Sun on his own planet. However, as Judoon reinforcements arrive, Rani and Clyde help Captain Tybo to arrest Androvax, breaking the hold on Sarah Jane, as Androvax is taken away to be executed. Rani's parents, Gita and Haresh, have also been caught up in events and are amazed to discover the secret life of their daughter and her friends.\n\n\n2009-10-22 - The Mad Woman in the Attic (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nIn 2059 a boy named Adam discovers an elderly woman in the attic of Sarah Jane's old house. It is Rani, who recalls an incident fifty years earlier when she answered an email from her orphaned friend Sam to investigate strange goings on at a funfair at Danemouth. Central to the mystery is a red-faced girl named Eve, who was sent to Earth to escape a war on her home planet and is being cared for by Harry, a caretaker at the funfair. People have been disappearing and she tells Rani that they are lonely people whom she has taken so that they might have fun. She also shows Rani a vision of herself in fifty years time - as the madwoman in the attic discovered by Adam. \n\n\n2009-10-23 - The Mad Woman in the Attic (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nShip, the talking computerised space ship which brought Eve to the Earth is all set to take her back to her home planet along with Sam and Harry. By this time Sarah Jane and the boys have arrived at the funfair. Rani declines to accompany the space travellers but a comment she makes, wishing that Sarah Jane, Luke and Clyde would leave her alone, is taken too literally by the spaceship, which makes them all disappear, paving the way for the projection of Rani's future as the sad madwoman in the attack. In 2059 Adam reveals that he is the son of Eve and Sam and grants Rani a wish. Her wish is to turn back time to be with her friends again. \n\n\n2009-10-29 - The Wedding of Sarah Jane Smith (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nSarah Jane is to marry the charming Peter Dalton and is unsure how to break the news of her life-style to him. She is annoyed when Rani and the boys discuss their suspicions of Peter because they have been to his house and found it empty. An engagement ring that he has given her also has a tendency to glow and Mr. Smith tells her that it detects the presence of an anomaly. The wedding nonetheless goes ahead but the Doctor bursts in and disrupts the proceedings, telling Sarah Jane not to marry Peter. The Trickster then appears and vanishes again with Sarah Jane and Peter. \n\n\n2009-10-30 - The Wedding of Sarah Jane Smith (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\n Sarah Jane and Peter end up in a white room, a void where Peter tells her that he nearly died but the Trickster saved him and struck up a deal if he married Sarah Jane. He had no idea that any harm would be done to her or her friends. The Trickster explains his plan - to give Sarah Jane a new life so that she would forget her old one as a guardian of the Earth and make it vulnerable to the likes of him. The Doctor, K9, Rani and the boys have been trapped in a similar void but eventually make contact with Sarah Jane. Sadly, the only way for the Trickster to be defeated is for Peter to end the deal and to sacrifice himself. He was only living a half-life but marriage to Sarah Jane would have made it whole. Strengthened by his love for Sarah Jane,he agrees to his death in the knowledge that it will make the world more secure. Sarah Jane is understandably heart-broken but Doctor Who consoles her, telling her that she still has a wonderful life ahead of her and asking her never to forget him. \n\n\n2009-11-05 - The Eternity Trap (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\n Sarah Jane, Rani and Clyde meet up with Professor Celeste Rivers and her young assistant Toby at the supposedly haunted Ashenhill Manor where, in 1665, the two children of its owner, Lord Marchwood, were allegedly made to disappear by a sinister alchemist called Erasmus Darkening. Indeed Professor Rivers also vanishes from the manor's nursery, where the toys come to life and the message 'Get Out' appears. Rani and Clyde discover a secret passage which leads to Darkening's laboratory, whilst Sarah Jane is saved from a marauding creature by the shade of Lord Marchwood himself. \n\n\n2009-11-06 - The Eternity Trap (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\n Joined by his children Lord Marchwood takes Sarah Jane to the lab to meet up with Rani, Clyde and Toby. They find a machine which Sarah Jane believes is a time machine, through which the beast that attacked her entered, and that it also gives Darkening and the people that he has caused to vanish in the past immortality.She believes that Darkening will use the machine to escape to another galaxy. The beast is killed by Lord Marchwood who then, on Sarah Jane's instructions, gets Darkening to stand on a certain spot, where Sarah Jane turns him into electricity. Celeste Rivers reappears but, for all the evidence of the Marchwoods, Sarah Jane claims to still remain dubious about the existence of the spirit world. \n\n\n2009-11-12 - Mona Lisa's Revenge (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\n Clyde has won a prize for his painting, to see the Mona Lisa on its first exhibition in a British gallery. However, the Mona Lisa comes to life, steps out of the frame and replaces herself with somebody else, a quality she seems to be able to duplicate, bringing some paintings to life and putting people and objects into others. Realising a Sontaran blaster gun from Clyde's artwork, she forces the gallery director, Lionel Harding, to help her find her 'brother'. Sarah Jane arrives to stop her but ends up well and truly framed. \n\n\n2009-11-13 - Mona Lisa's Revenge (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\n The Mona Lisa's 'brother' is a beast in a vault and Mr. Harding is not happy for the Mona Lisa to unleash it so he destroys the key to the vault. Clyde, however, draws another key in order to release the beast, and then he draws K9, who comes to life and blasts the beast. This sets off a chain reaction, releasing Sarah Jane and others who have been imprisoned inside paintings and returning the subjects of the paintings - including the Mona Lisa - back to their canvas. \n\n\n2009-11-19 - The Gift (1) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nLeaf and Tree, two seemingly harmless members of the Blathereen race, give Sarah Jane a gift, a plant known as the rakweed. Mr. Smith's analysis deems it harmless but whilst Luke sleeps he inhales its spoors, which send him into a coma. \n\n\n2009-11-20 - The Gift (2) (Video:H.264, 624x352, 1000kbps, 25fps - Audio:AAC, 44.1kHz, 128kbps)\n\nRani and Clyde discover rakweed in the school science laboratory. However,they see that the sound of the school bell destroys it so Sarah Jane gets Mr. Smith to re-programme all the electrical equipment around the city to the same frequency. This not only restores Luke but kills any rakweed in the area. Unfortunately some of it has been eaten by Leaf and Tree, who, when they come to Sarah Jane's attic, explode as a result. \n\n\n2009 Specials\n\n2009-03-13 - Special - (Comic Relief 2009) - From Raxacoricofallapatorius with Love (Video:H.264, 480x266, 295kbps, 25fps - Audio:AAC, 44.1kHz, 102kbps)\n\nA short, 5-minute special was made for the 2009 Comic Relief appeal and featured Ronnie Corbett and K-9. The gang are talking to Mr Smith when suddenly there is a breach in the attic. Mr Smith identifies the disturbance as a teleport and a diplomat named Ranius (or Rani) (played by Ronnie Corbett) appears. He states that he represents the Galactic Alliance and gives them all gifts for defending the Earth so valiantly. He then pulls up a chair to talk to them and experiences apparent flatulence. Sarah Jane, Clyde, Rani and Luke all notice the similarity of the constant flatulence with that of a Slitheen wearing a skin suit, which Rani denies quite strongly. K-9 materialises and confirms Smith's identification, but Rani states all dogs should be put on a lead and clamps K-9.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:54104b0cdff8e4a65f9b73d70e35751a915b4f82","amp;dn":"The+Sarah+Jane+Adventures+-+Season+03+%282009%29+-+12+Episodes+-+1+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54104b0cdff8e4a65f9b73d70e35751a915b4f82","infoHashBuffer":{"type":"Buffer","data":[84,16,75,12,223,248,228,166,95,155,115,215,14,53,117,26,145,91,79,130]},"announce":[],"urlList":[]}}