{"title":"Opera Web Browser 10.00 Build 1750 Final","uid":5075571,"size":6875510,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:54adb71fe94df012b3e7748198013ba1025d4b26&amp;dn=Opera+Web+Browser+10.00+Build+1750+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"marcco","files":-1,"time":1251764682,"description":"One of the fastest, smallest and smartest full-featured web browser\n\nThe most full-featured Internet power tool on the market, Opera includes tabbed browsing, pop-up blocking, integrated searches and advanced functions like Opera's groundbreaking e-mail program, RSS Newsfeeds and IRC chat. And because we know that our users have different needs, you can customize the look and content of your Opera browser with a few clicks of the mouse.\n\nThe Opera Web browser offers several new features for functionality, security, usability, customization, searching, saving, taking shortcuts and accessing Web content.\n\nWhether you're going to work, working from home, developing Web sites, or just looking for a quick, solid browser that can help you quickly access the Internet, Opera delivers a superior Web experience for every aspect of your online life, with lots of tech tools for power users.\n\nHere are some key features of &quot;Opera for Windows without Java&quot;:\n\nSpeed Dial.\nNow you have a new way to access your favorite Web sites. Just open a new tab to get your Speed Dial. It's easy to populate and addictive to use.\nFind out what other people are putting on their Speed Dial.\n\nBitTorrent.\nYou don't need a separate BitTorrent application to download large files. Simply click a torrent link and start the download.\n\nSite preferences.\nWant to view a site in a different way or deny certain cookies? Want to block pop-ups on certain sites only? Right click and select &quot;Edit site preferences&quot;.\n\nThumbnail preview.\nIt is easy to have many tabs open at once in Opera. But exactly which tab had that video you wanted? Hover your mouse on any tab to see a thumbnail preview.\n\nFraud protection.\nOpera's advanced fraud protection protects you against web sites that try to steal your personal information.\n\nAdd your favorite search engines.\nRight-click on the site's search field and select &quot;Create search&quot; from the menu.\n\nWidgets.\nSmall Web applications (multimedia, newsfeeds, games and more) that make your desktop experience more fun. Use the Widgets menu to discover new widgets and access your favorites.\n\nTransfer manager.\nView download progress and access all your downloads from one simple transfer manager window.\n\nPassword manager.\nThe password manager remembers your usernames and passwords so you will not have to.\n\nMouse gestures.\nOpera supports mouse gestures, allowing you to perform certain movements with the mouse to access commonly used features.\n\nNotes.\nNotes can be kept in conjunction with a Web site you want to refer to later, or remind you of any particular information you may like to review again.\n\nKeyboard Shortcuts.\nKeyboard shortcuts - like mouse gestures - make your browsing faster and more efficient. Read more about all the keyboard shortcuts in Opera.\n\nTabbed browsing.\nSurf the Web easier and faster by opening multiple Web pages within the same application window\n\nIntegrated search.\nSearch Google, eBay, Amazon and more with our integrated search field. You can also search directly in the address field using keywords\n\nFast Forward.\nFast Forward will detect the most likely &quot;next page&quot; link and greatly simplify navigation in multi-page documents such as search results and image galleries.\n\nVoice.\nThe voice feature allows you to control Opera's interface by talking and to have documents read aloud. Voice is currently offered in English\n\nFull-screen mode.\nThe F11 key toggles Opera's projection mode, using the whole screen for browsing and, if a projection style sheet is present, displays 'slides' suitable for presentation.\n\nKiosk mode.\nOpera supports kiosk mode - a lock-down mode in which the browser can be used for unattended computers in public places.\n\nOpera mail.\nOur built-in POP/IMAP E-mail client is a combined e-mail program, news reader, mailing list organizer and RSS/Atom newsfeed reader.\n\nStandards support.\nWe take pride in supporting all major Web standards currently in use, including CSS 2.1, XHTML 1.1, HTML 4.01, WML 2.0, ECMAScript, DOM 2 and SVG 1.1 basic.\n\nRequirements:\n\nÃ‚Â· 20 MB of free disk space.\ntested with kaspersky 100% clean.\n\nJust install exe file.","torrent":{"xt":"urn:btih:54adb71fe94df012b3e7748198013ba1025d4b26","amp;dn":"Opera+Web+Browser+10.00+Build+1750+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"54adb71fe94df012b3e7748198013ba1025d4b26","infoHashBuffer":{"type":"Buffer","data":[84,173,183,31,233,77,240,18,179,231,116,129,152,1,59,161,2,93,75,38]},"announce":[],"urlList":[]}}