{"title":"Detectives, Inc. (Eclipse)","uid":8882334,"size":98693627,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5535eb15b3635b1e346a28e9e64aa976f2424ab7&amp;dn=Detectives%2C+Inc.+%28Eclipse%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ichthypod_Crane","files":6,"time":1378362543,"description":"The Eclipse Comics Upload Project chugs ahead with 'Detectives, Inc.'! \n\nWiki warbles:\n\nDetectives Inc. is a series of two original graphic novels written by Don McGregor and published by Eclipse Enterprises in 1980 and 1985.\n\nThe first, Detectives Inc.: A Remembrance of Threatening Green, featured black-and-white art by penciler-inker Marshall Rogers. The second, Detectives Inc.: A Terror Of Dying Dreams, was drawn by Gene Colan, and printed directly from his detailed pencils; a later comic-book reprinting added a sepia-tone wash in place of inking.\n\nThese two early graphic novels were not superhero or science fiction/fantasy stories, and A Remembrance of Threatening Green (1980) was the first naturalistic graphic novel to follow Will Eisner's influential A Contract with God. The Gay League's &quot;LBGT Comics Timeline&quot; cites the book as &quot;featuring the first lesbian characters in mass-market comics&quot;.\n\nThe books' genesis, McGregor recalled, had gone back several years. &quot;I had created Detectives Inc. as early as 1969, as roles for Alex Simmons and myself to play in Super8 millimeter movies I was making&quot;. In the early 1970s, the two produced a crude Detectives Inc. comic book, self-published via photocopier. Eclipse Comics later reprinted the two graphic novels as color comic-book miniseries, dividing the former into two issues (1985) and the latter into three (June, Sept., Dec. 1987), with new Colan covers inked by Steve Leialoha. \n\nThis torrent contains both series. Thank you creative teams and thank you scanners! Seed, baby, seed!","torrent":{"xt":"urn:btih:5535eb15b3635b1e346a28e9e64aa976f2424ab7","amp;dn":"Detectives%2C+Inc.+%28Eclipse%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5535eb15b3635b1e346a28e9e64aa976f2424ab7","infoHashBuffer":{"type":"Buffer","data":[85,53,235,21,179,99,91,30,52,106,40,233,230,74,169,118,242,66,74,183]},"announce":[],"urlList":[]}}