{"title":"Antenna Toolkit, 2nd Edition - (Malestrom)","uid":4702614,"size":4957785,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:556253b7589f95567c8c9d19fe47ff8177cd9a5c&amp;dn=Antenna+Toolkit%2C+2nd+Edition+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"malestrom_HH","files":1,"time":1233766551,"description":" &lt;a href=&quot;http://www.image-upload.net/images/tpbh1ae6f6dvze1ir2z4.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/tpbh1ae6f6dvze1ir2z4.jpg&lt;/a&gt;\n\nAntenna Toolkit, 2nd Edition  Author: Joseph Carr, US Defense Department Paperback, 288 pages, publication date: SEP-2001 ISBN-13: 978-0-7506-4947-6 ISBN-10: 0-7506-4947-X Imprint: NEWNES Description: Joe Carr has provided radio amateurs and short-wave listeners with the definitive design guide for sending and receiving radio signals with Antenna Toolkit 2nd edition. Together with the powerful suite of CD software, the reader will have a complete solution for constructing or using an antenna - bar the actual hardware! The software provides a simple Windows-based aid to carrying out the design calculations at the heart of successful antenna design. All the user needs to do is select the antenna type and set the frequency - a much more fun and less error prone method than using a conventional calculator to solve formulae. The new edition has been revised to include further cases of propagation, additional antennas and also two new chapters - Small Loop Antennas (a topic of considerable interest, which has been the subject of much recent debate in the amateur radio press); and Yagi Beam Antennas (widely used at HF and VHF). The CD software has also been updated. Joe Carr's expertise in the area of antenna design is legendary. Antenna designers, whether hobbyist or technician, can be assured they need look no further than Antenna Toolkit for the complete guide to understanding the practicalities of using and designing antennas today. \n\nAudience: Technicians and enthusiasts (short wave listening, ham radio and electronics). \n\nContents: Preface; Radio signals on the move; Antenna basics; Wire, connection, grounds; Marconi and other unbalanced antennas; Doublets, dipoles and other Hertzian antennas; Limited space antennas; Large loop antennas; Wire array antennas; Small loop antennas; Yagi beam antennas; Impedance matching; Simple antenna instrumentation and measurements; Getting a 'good ground';","torrent":{"xt":"urn:btih:556253b7589f95567c8c9d19fe47ff8177cd9a5c","amp;dn":"Antenna+Toolkit%2C+2nd+Edition+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"556253b7589f95567c8c9d19fe47ff8177cd9a5c","infoHashBuffer":{"type":"Buffer","data":[85,98,83,183,88,159,149,86,124,140,157,25,254,71,255,129,119,205,154,92]},"announce":[],"urlList":[]}}