{"title":"FSX Alphasim MV-22 Osprey with Corrected Flight Dynamics","uid":4837981,"size":28176896,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5601e34a4a499f5082fa2afae934dc4191793190&amp;dn=FSX+Alphasim+MV-22+Osprey+with+Corrected+Flight+Dynamics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bfifteenv","files":3,"time":1239392121,"description":"This torrent contains the following:\n\n**Alphasim's nice looking, but formerly almost unflyable MV-22 Osprey for FSX with flight dynamics patches already applied.\n\n**The flight dynamics patch files in a separate .zip file for those who already have the basic aircraft.\n\n**FSUIPC 4.30 with serial - required to make the patched flight dynamics work.\n\n\n\nIf like me, you were excited to see the AlphaSim Osprey, then pleased by it's appearance, then frustrated to no end when it wouldn't perform as expected with regards to vertical take off, landing, or stability during transitions, then this file is for you!\n\nThe plane takes off and lands vertically, all the gauges work, the rear ramp opens and closes (shift+e+2) just like on the original AlphaSim release, but it also flies right too, which is a big improvement.\n\nThe plane will stay level and controllable during transition from vertical, through all the various other positions, all the way to regular conventional orientation. You do need to get up to 80knots or more before transitioning that last step to horizontal or you will lose significant altitude, but that's probably pretty realistic for the Osprey, not a bug.\n\nIt took Bell 15 years to perfect the Osprey in real life - it only took the FSX community a couple of years to get the digital version right. I guess teething problems are to be expected with such unconventional aircraft.\n\n\nSince this is an add-on aircraft that was originally designed for use FSX, not a reworked FS2004 aircraft, it looks a little nicer than the not-so-polished patched F-35 and Harrier I uploaded previously.\n\nAlso I believe this version of the AlphaSim Osprey has upgraded textures for the propellers and maybe a few other goodies - they were already in the Osprey torrent when I donwloaded it from TPB.\n\n\nIf you do not have the Osprey, or wish ease of installation, you can just download the FixedOsprey.rar file (and FSUIPC 4.30.rar if you don't have that). The patch is just there for those that want it separately. \n\nYou do not have to patch the aircraft file provided here, it is already patched and 100% working.\n\n\nThere is also a .zip of some extra paint schemes in the aircraft folder. There is only one paint scheme as it is installed. I left them there because someone more competent in modifying the aircraft.cfg file may be able to make them work. \n\n\n---------------------\nThanks to supaturtle for uploading the original FSX OSprey torrent that I used to apply the patch and to fs4hobby for uploading the original FSUIPC torrent without which this would not work.\n\n---------------------\n\nThe patches are not my original work either, all I did was hunt them down, patch the aircraft, and put them all together here for your one stop shopping convenience. \n\n---------------------\n\nAlso, thanks to everyone that has uploaded FSX add-ons to TPB. Thanks for making my broke-ass FSX experience more exciting!","torrent":{"xt":"urn:btih:5601e34a4a499f5082fa2afae934dc4191793190","amp;dn":"FSX+Alphasim+MV-22+Osprey+with+Corrected+Flight+Dynamics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5601e34a4a499f5082fa2afae934dc4191793190","infoHashBuffer":{"type":"Buffer","data":[86,1,227,74,74,73,159,80,130,250,42,250,233,52,220,65,145,121,49,144]},"announce":[],"urlList":[]}}