{"title":"Oscar Peterson - 2006 - Supreme Jazz (SACD 24 88.2) FLAC","uid":9140352,"size":1065438834,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:56223f48ba34a1837653e48fff7209273158a0e8&amp;dn=Oscar+Peterson+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1383501683,"description":"Oscar Peterson - 2006 - Supreme Jazz\nSACD 24 bits, 88.2 KHz\n\nOscar Peterson was one of the greatest piano players of all time. A pianist with phenomenal technique on the level of his idol, Art Tatum, Peterson's speed, dexterity, and ability to swing at any tempo were amazing. Very effective in small groups, jam sessions, and in accompanying singers, O.P. was at his absolute best when performing unaccompanied solos. His original style did not fall into any specific idiom. Like Erroll Garner and George Shearing, Peterson's distinctive playing formed during the mid- to late '40s and fell somewhere between swing and bop. Peterson was criticized through the years because he used so many notes, didn't evolve much since the 1950s, and recorded a remarkable number of albums. Perhaps it is because critics ran out of favorable adjectives to use early in his career; certainly it can be said that Peterson played 100 notes when other pianists might have used ten, but all 100 usually fit, and there is nothing wrong with showing off technique when it serves the music. As with Johnny Hodges and Thelonious Monk, to name two, Peterson spent his career growing within his style rather than making any major changes once his approach was set, certainly an acceptable way to handle one's career. Because he was Norman Granz's favorite pianist (along with Tatum) and the producer tended to record some of his artists excessively, Peterson made an incredible number of albums. Not all are essential, and a few are routine, but the great majority are quite excellent, and there are dozens of classics.\nPeterson started classical piano lessons when he was six and developed quickly. After winning a talent show at 14, he began starring on a weekly radio show in Montreal. Peterson picked up early experience as a teenager playing with Johnny Holmes' Orchestra. From 1945-1949, he recorded 32 selections for Victor in Montreal. Those trio performances find Peterson displaying a love for boogie-woogie, which he would soon discard, and the swing style of Teddy Wilson and Nat King Cole. His technique was quite brilliant even at that early stage, and although he had not yet been touched by the influence of bop, he was already a very impressive player. Granz discovered Peterson in 1949 and soon presented him as a surprise guest at a Jazz at the Philharmonic concert. Peterson was recorded in 1950 on a series of duets with either Ray Brown or Major Holley on bass; his version of &quot;Tenderly&quot; became a hit. Peterson's talents were quite obvious, and he became a household name in 1952 when he formed a trio with guitarist Barney Kessel and Brown. Kessel tired of the road and was replaced by Herb Ellis the following year. The Peterson-Ellis-Brown trio, which often toured with JATP, was one of jazz's great combos from 1953-1958. Their complex yet swinging arrangements were competitive -- Ellis and Brown were always trying to outwit and push the pianist -- and consistently exciting. In 1958, when Ellis left the band, it was decided that no other guitarist could fill in so well, and he was replaced (after a brief stint by Gene Gammage) by drummer Ed Thigpen. In contrast to the earlier group, the Peterson-Brown-Thigpen trio (which lasted until 1965) found the pianist easily the dominant soloist. Later versions of the group featured drummers Louis Hayes (1965-1966), Bobby Durham (1967-1970), Ray Price (1970), and bassists Sam Jones (1966-1970) and George Mraz (1970).\nIn 1960, Peterson established the Advanced School of Contemporary Music in Toronto, which lasted for three years. He made his first recorded set of unaccompanied piano solos in 1968 (strange that Granz had not thought of it) during his highly rated series of MPS recordings. With the formation of the Pablo label by Granz in 1972, Peterson was often teamed with guitarist Joe Pass and bassist Niels Pedersen. He appeared on dozens of all-star records, made five duet albums with top trumpeters (Dizzy Gillespie, Roy Eldridge, Harry &quot;Sweets&quot; Edison, Clark Terry, and Jon Faddis), and teamed up with Count Basie on several two-piano dates. An underrated composer, Peterson wrote and recorded the impressive &quot;Canadiana Suite&quot; in 1964 and has occasionally performed originals in the years since. Although always thought of as a masterful acoustic pianist, Peterson has also recorded on electric piano (particularly some of his own works), organ on rare occasions, and even clavichord for an odd duet date with Joe Pass. One of his rare vocal sessions in 1965, With Respect to Nat, reveals that Peterson's singing voice was nearly identical to Nat King Cole's. A two-day reunion with Herb Ellis and Ray Brown in 1990 (which also included Bobby Durham) resulted in four CDs. Peterson was felled by a serious stroke in 1993 that knocked him out of action for two years. He gradually returned to the scene, however, although with a weakened left hand. Even when he wasn't 100 percent, Peterson was a classic improviser, one of the finest musicians that jazz has ever produced. The pianist appeared on an enormous number of records through the years. As a leader, he has recorded for Victor, Granz's Clef and Verve labels (1950-1964), MPS, Mercury, Limelight, Pablo, and Telarc. (AllMusic)\n\nTrack list:\n01. 'S Wonderful\n02. Oh! Lady Be Good\n03. I Got Rhythm\n04. Ad Lib Blues\nLos Angeles, between November 01 and December 04. 1952, Oscar Peterson (p), Barney Kessel (g), Ray Brown (b)\n05. Cheek To Cheek\nLos Angeles. December 1952, Oscar Peterson (p), Barney Kessel (g), Ray Brown (b)\n06. Bounce Blues\nNew York. Mav 21. 1953, Ben Webster (ts), Oscar Peterson (p), Barney Kessel (g), Ray Brown (b), J.C. Heard (p)\n07. Blue Moon\nHollywood. December 1953, Oscar Peterson (p), Herb Ellis (g), Ray Brown (b)\n08. I Only Have Eyes For You\n09. I Gotta Right To Sing The Blues\n10. You Must Have Been A Beautiful Baby\n11. Come Rain Or Come Shine\nHollywood. November 15. 1954, Oscar Peterson (p), Herb Ellis (g), Ray Brown (b)\n12. I Can't Give You Anything But Love\nHollywood. November 16. 1954, Oscar Peterson (p), Herb Ellis (g), Ray Brown (b)\n13. Frenesi\nLos Angeles. November 12. 1954, Benny Carter (ts), Oscar Peterson (p), Herb Ellis (g), Ray Brown (b), Bobby White (d)\n14. I Let A Song Go Out Of You\nHollywood. December 1953 and New York City. May 1954, Dizzy Gillespie, Stan Getz, Hank Mobley (ts), Wade Legge, Oscar Peterson, Herb Ellis (g), Lou Hackney, Ray Brown (b), Louie Belson (d)\n\nEnjoy and share!","torrent":{"xt":"urn:btih:56223f48ba34a1837653e48fff7209273158a0e8","amp;dn":"Oscar+Peterson+-+2006+-+Supreme+Jazz+%28SACD+24+88.2%29+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56223f48ba34a1837653e48fff7209273158a0e8","infoHashBuffer":{"type":"Buffer","data":[86,34,63,72,186,52,161,131,118,83,228,143,255,114,9,39,49,88,160,232]},"announce":[],"urlList":[]}}