{"title":"Dragon.Throne.Battle.Of.The.Red.Cliffs","uid":4453253,"size":350916608,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:567ee234689d34fb6f3f592adc5d6a5ddaea59eb&amp;dn=Dragon.Throne.Battle.Of.The.Red.Cliffs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"circlensess","files":1,"time":1224359643,"description":"Dragon Throne - Battle of Red Cliffs\n\nIntroduction:\nWelcome to the Dragon Throne - Battle of Red Cliffs\n\nThis readme provides additional gameplay and technical support information.\n\nSystem Requirements:\n\n* Windows 95/98/ME/2000\n* DirextX 8.0  installed\n* 240 MB of Hard Drive Space\n* PII-266 or greater processor\n* 64MB RAM\n* 8MB SVGA card completely DirextX 8.0 compatible\n\nReccomended System:\n* 300 MB of Hard Drive Space\n* PIII-800 or greater processor\n* 128MB RAM\n* 32MB SVGA card completely DirextX 8.0 compatible\n\n\nSetup and Installation\n\nTo best prepare your system to run the game, please follow this procedure:\n\n1.\tRun SCANDISK (Programs/Accessories) on your hard drive\n2.\tRun DEFRAG (Programs/Accessories) on your hard drive\n3.\tRun a quality virus scanner on your hard drive\n4.\tMake sure that you have at least 240MB free on the hard drive that will contain the game files (the extra 75 MB is for your Windows swap file).\n\nTo install Dragon Throne - Battle of Red Cliffs to your hard drive:\n1. Place the Dragon Throne - Battle of Red Cliffs CD in your CD-ROM drive. \n2. After a few seconds, the Autorun Menu will come on screen.  Select the Install option.  If this menu does not appear, click the Start button, select Run and type D:Autorun.EXE (where D is the letter of  CD-ROM drive), and then click OK.\n3. The program will ask you whether you need to install DirextX 8.0 which allow Dragon Throne - Battle of Red Cliffs to run properly under all configurations.  Your current drivers may need to be updated as necessary. If you are unsure if you need to install DirextX 8.0 then install it as it will not install anything if your current drivers are up to date.\n4. Dragon Throne - Battle of Red Cliffs installation routine will then install the game files to your hard drive.  At the end of the installation, you may be prompted to Restart your computer.\n5. Click the Play button on the Autorun Menu or select the Dragon Throne - Battle of Red Cliffs shortcut in the Object Software Battle of Red Cliffs  folder in the Start Menu to begin the game.\n\n\nUninstalling Dragon Throne - Battle of Red Cliffs\n\nYou should use the Dragon Throne - Battle of Red Cliffs uninstall program, which can be found in the Start Menu&gt;Object Software&gt; Battle of Red Cliffs. \n Select the Start Menu, Program Files, Object software and Battle of Red Cliffs This makes sure that all Windows associated fields are removed.","torrent":{"xt":"urn:btih:567ee234689d34fb6f3f592adc5d6a5ddaea59eb","amp;dn":"Dragon.Throne.Battle.Of.The.Red.Cliffs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"567ee234689d34fb6f3f592adc5d6a5ddaea59eb","infoHashBuffer":{"type":"Buffer","data":[86,126,226,52,104,157,52,251,111,63,89,42,220,93,106,93,218,234,89,235]},"announce":[],"urlList":[]}}