{"title":"Celebrity, Inc. (Unabridged).mp3","uid":8627065,"size":49789631,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:56bb5b5ea4af158c1491c89c2e88afcd8cd049e5&amp;dn=Celebrity%2C+Inc.+%28Unabridged%29.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Navydrunk","files":1,"time":1372535140,"description":"Celebrity, Inc.: How Famous People Make Money\n\tUNABRIDGED\n\tby Jo Piazza\n\tNarrated by Jean Barrett\n\nFrom $10,000 tweets to making money in the afterlife, a recovering gossip columnist explores the business lessons that power the Hollywood Industrial Complex.\nWhy do celebrities get paid so much more than regular people to do a job that seems to afford them the same amount of leisure time as most retirees? What do Bush-era economics have to do with the rise of Kim Kardashian? How do the laws of supply and demand explain why the stars of Teen Mom are on the cover of Us Weekly? And how was the sale of Brad Pitt and Angelina Jolie's baby pictures a little like a street drug deal?\nAfter a decade spent toiling as an entertainment journalist and gossip columnist, Jo Piazza asks the hard questions about the business behind celebrity. Make no mistake: celebrity is an industry. Never in the course of human history has the market for celebrities been as saturated as it is today. Nearly every day most Americans will consume something a celebrity is selling - a fragrance, a sneaker, a song, a movie, a show, a tweet, or a photo in a magazine.\nWith the benefits of Piazza's unique access to the celebrity market, Celebrity, Inc. explains in detail what generates cash for the industry and what drains value faster than a starlet downs champagne in 12 fascinating case studies that tackle celebrities the way industry analysts would dissect any consumer brand.\nÂ©2011 Jo Piazza (P)2011 Audible, Inc.\n","torrent":{"xt":"urn:btih:56bb5b5ea4af158c1491c89c2e88afcd8cd049e5","amp;dn":"Celebrity%2C+Inc.+%28Unabridged%29.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"56bb5b5ea4af158c1491c89c2e88afcd8cd049e5","infoHashBuffer":{"type":"Buffer","data":[86,187,91,94,164,175,21,140,20,145,200,156,46,136,175,205,140,208,73,229]},"announce":[],"urlList":[]}}