{"title":"Indie Classic!: My Bloody Valentine - Isn't Anything [1988]","uid":3532704,"size":53596795,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:57056818fbf92b48fd61051bfb2f11f2e250fd86&amp;dn=Indie+Classic%21%3A+My+Bloody+Valentine+-+Isn%5C%27t+Anything+%5B1988%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tigerduck","files":12,"time":1159816226,"description":"&quot;Though it&amp;#039;s often seen as just a precursor to their magnum opus Loveless, in its own way My Bloody Valentine&amp;#039;s Isn&amp;#039;t Anything is nearly as groundbreaking as their 1991 masterpiece. Not only was it the most lucid, expansive articulation yet of the group&amp;#039;s sound, it virtually created the shoegazing scene and spawned legions of followers. The album&amp;#039;s tightly structured songs still bore traces of My Bloody Valentine&amp;#039;s previous incarnation as jangly indie popsters, but Kevin Shields and company crafted wide-ranging experiments within those confines. &quot;Feed Me With Your Kiss&quot;&amp;#039;s mix of bruising guitars, drums, and sensual boy-girl vocals define My Bloody Valentine&amp;#039;s signature sound, while &quot;All I Need&quot;&amp;#039;s weightless guitars and vocal melodies melt into a heady haze. Shields&amp;#039; unique tunings, tremolo, and miking techniques stand out on &quot;You Never Should&quot; and &quot;Nothing Much to Lose,&quot; but Deb Googe&amp;#039;s surprisingly funky bassline on &quot;Soft as Snow (But Warm Inside)&quot; reaffirms that all of the Valentines contributed to their innovative sound. Indeed, many of Isn&amp;#039;t Anything&amp;#039;s disturbingly beautiful highlights come from Bilinda Butcher. On the wrenching &quot;No More Sorry,&quot; she sings abstractly pained lyrics like &quot;Your septic heart and deadly hand/Loved me black and blue,&quot; barely audible over a swarm of fragile yet menacing guitars, while on &quot;Several Girls Galore&quot; she&amp;#039;s sexy, yet dazed and distant; it sounds like she&amp;#039;s whispering in your ear outside of a blaring nightclub. The Valentines&amp;#039; dark side is especially prominent on the album, particularly on &quot;Sueisfine,&quot; where the chorus slyly morphs from &quot;Sue is fine&quot; to &quot;Suicide.&quot; Isn&amp;#039;t Anything captures My Bloody Valentine&amp;#039;s revolutionary style in its infancy and points the way to Loveless, but it&amp;#039;s far more than just a dress rehearsal for the band&amp;#039;s moment of greatness.&quot; -AMG\n\nTracklist\nSoft As Snow (But Warm Inside)\nLose My Breath\nCupid Come\n(When You Wake) You&amp;#039;re Still In A Dream\nNo More Sorry\nAll I Need\nFeed Me With Your Kiss\t\nSueisfineSeveral Girls Galore\nYou Never Should\nNothing Much To Lose\nI Can See It (But I Can&amp;#039;t Feel It)\n\n196 KBPS MP3 AUDIO\n","torrent":{"xt":"urn:btih:57056818fbf92b48fd61051bfb2f11f2e250fd86","amp;dn":"Indie+Classic%21%3A+My+Bloody+Valentine+-+Isn%5C%27t+Anything+%5B1988%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57056818fbf92b48fd61051bfb2f11f2e250fd86","infoHashBuffer":{"type":"Buffer","data":[87,5,104,24,251,249,43,72,253,97,5,27,251,47,17,242,226,80,253,134]},"announce":[],"urlList":[]}}