{"title":"MySQL Enterprise Monitor","uid":6366302,"size":173310399,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:578c1f943dbf0bd5015cd131b24e964ecf99ad25&amp;dn=MySQL+Enterprise+Monitor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"adzcqe","files":5,"time":1304521702,"description":"MySQL Enterprise Monitor\n----------------------------------------------------------------------\nVersion 2.3.3                                               2011-02-28\n----------------------------------------------------------------------\n\nWelcome to the MySQL Enterprise Monitor.  This README file contains\nthe following sections:\n\n    GETTING STARTED\n    CHANGES SINCE LAST RELEASE\n    UPGRADE NOTES\n    KNOWN ISSUES\n    REPORTING ISSUES &amp; FEEDBACK\n\nIMPORTANT: For late-breaking news, check the README file on the MySQL\nEnterprise Monitor website download page.\n\nFor more information about the MySQL Enterprise Monitor, refer to &lt;a href=&quot;\nhttp://www.mysql.com/products/enterprise/monitor.html.&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mysql.com/products/enterprise/monitor.html.&lt;/a&gt;\n\nWe really want to hear your feedback!  Please see the section at the\nend on how to report bugs and other feedback.\n---\n\nGETTING STARTED\n\nPlease take special note of the following:\n\n1) For more information on installation and setup, see the online\n   help: http://dev.mysql.com/doc/mysql-monitor/2.3/en/index.html.\n   In a nutshell:\n\n   o Download and install a Service Manager\n   o Open the Enterprise Dashboard in your browser and go through the\n     first-time setup screen that appears\n   o Download and install an Agent on each machine to be monitored\n   o To use the new MySQL Query Analyzer:\n     - Download, install, and configure a Connector plugin; or\n     - Point your application at the Agent/Proxy (port 6446 by default\n       unless you change it in the Agent installer) instead of\n       directly at your MySQL server\n\n2) Our installers configure Tomcat and MySQL in a standard way across\n   all platforms.  Consult the various Configuration sections of the\n   online documentation for tips on how to configure these components\n   for optimal performance based on the specific attributes of your\n   system (CPU, RAM, disk, and operating system).  Customizing these\n   settings for your system and load can make a dramatic difference to\n   the Monitor's performance.\n\n3) Consult the Troubleshooting sections of the online documentation if\n   any of these occur:\n   \n   a) you have trouble starting your agent;\n   b) the agent starts but doesn't show up in the MySQL Enterprise\n      Dashboard;\n   c) you're using the Query Analyzer but no results are shown on the\n      Query Analyzer tab and you've already waited 5 minutes or more\n      for the query data to populate.\n\nContact Support at https://support.oracle.com/ if you continue to have\nproblems.\n\nIf you are upgrading from a previous version, see the UPGRADE NOTES\nbelow.\n\nNote that the source code for the LGPL components used in the Service\nManager can be found in the licenses/lpgl directory.\n---\n\nCHANGES SINCE LAST RELEASE\n\nNew features in this release include:\n\n  o Oracle branding:\n    - Removed &quot;time bomb&quot; (no more license keys or subscription\n      expiration)\n    - Query Analyzer, Replication monitoring and all rules and graphs\n      now available to all users\n    - Integration with My Oracle Support (see your open Oracle Service\n      Requests for MySQL issues)\n  o New Advisors and Graphs:\n    - MySQL Cluster\n    - InnoDB Plugin\n    - Network and Disk IO, disk space\n  o New Aggregator accepts Query Analyzer data from any source\n  o A new option (forceRestart) has been added to the Service Manager\n    upgrade installer (unattended mode) so the user can force the\n\trestart of the MySQL server even if changes are detected between\n\tthe old my.cnf/my.ini file (which will be used after upgrade\n\tbecause it may contain customer-specific changes) and the newly\n\trecommended default my.cnf/my.ini file.\n\nWe hope you'll try it out and give us your feedback.  However, in\norder to take advantage of some of these features you must route your\nqueries through the Agent's proxy port (6446 by default) instead of\ndirectly to your MySQL server, or use one of the new Connector\nPlugins.  See the &quot;Query Analyzer&quot; chapter in the documentation for\nmore information.\n\nPlease see the &quot;MySQL Enterprise Monitor Change History&quot; appendix\nin the documentation or online help for a complete list of changes,\nincluding functionality added or changed as well as bugs fixed.\n---\n\nUPGRADE NOTES\n\nIf you have previously installed the MySQL Enterprise Monitor on your\nsystem, you may use one of our upgrade installers. Please note:\n\no The MySQL Proxy, which enables the Query Analyzer, now has an\n  officially registered port number: 6446 (see\n &lt;a href=&quot; http://www.iana.org/assignments/port-numbers&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.iana.org/assignments/port-numbers&lt;/a&gt; for details). The Agent\n  installers now default to Port 6446 instead of 4040.\n\n  If you are installing the Query Analyzer for the first time, this\n  port change is completely transparent and will have no impact on\n  you.\n\n  However, if you have previously deployed the Query Analyzer and use\n  our upgrade installer to upgrade your Agents, they will preserve the\n  old value (i.e. either the old default of 4040 or whatever you\n  specified during the original installation).  If you subsequently\n  install new agents, in addition to upgrading existing ones, you may\n  get in a situation where some agents use port 4040 for the Query\n  Analyzer (the upgraded ones) and some use port 6446 (the newly\n  installed ones, unless you change the default recommended during\n  installation).  You can easily correct the situation by editing the\n  proxy-address parameter in the agent configuration file: &lt;install-\n  dir&gt; /etc/mysql-monitor-agent.ini.  In this case, you must restart\n  the agent for the change to take effect.\n\no If you are upgrading from our previous 1.3 release, the new 2.3\n  Service Manager requires the new Agent; make sure to upgrade all\n  your Agents as well (upgrade installers are provided).\n\no If you are upgrading from our previous 1.3.x release, note that the\n  Agent upgrade installer will delete the old items-mysql-network.xml\n  file.  If you have manually edited this file to customize any of its\n  data collection definitions, you should backup the file before\n  running the Agent upgrade installer so you can restore those\n  customizations after the upgrade installation is done.\n\no If you are upgrading from a previous 2.x release, the new 2.3\n  Service Manager does not require the new Agent.  However, we\n  strongly recommend that you upgrade all your Agents to the latest\n  version in order to get the most recent features, bug, and\n  performance fixes.\n\no WARNING: Only use the upgrade installers to upgrade a previous\n  1.3.x or 2.x release.  Do NOT use the upgrade installers to upgrade\n  from any release before 1.3.  To upgrade from an earlier release,\n  you must first upgrade to release 1.3.\n\no Please note the following with respect to migrating Monitor data\n  from our previous 1.3 releases (these notes do not apply to\n  upgrading from a 2.x release because 2.3 uses the same database\n  as those to store its data, so no migration is needed):\n\n  - After installation the Service Manager will migrate all your basic\n    administrative data (e.g. users, notification groups, etc).\n\n  - When an agent connects to the Service Manager to register the\n    MySQL server it's monitoring, the Service Manager will\n    automatically migrate existing schedules &amp; events for that server.\n\n  - Migration of historic data (e.g. CPU usage data, MySQL status\n    counter data, and so forth) does not happen automatically for data\n    previously stored in a 1.3.x repository; it must be manually\n    enabled on the Manager Servers page.\n\no The Service Manager upgrade installer optionally creates a backup of\n  your previous installation binaries and monitoring data.  WARNING:\n  the repository can be *very* large; if you have an efficient backup\n  tool, you may prefer to use it instead and then answer &quot;no&quot; when\n  the upgrade installer asks you whether to backup the data\n  repository.\n\no Note that the format and location of the file used to define custom\n  data collection definitions has changed.  As of our 2.0, release see\n  the new version in &lt;install-dir&gt;/share/mysql-proxy/items/items-\n  mysql-monitor.xml for the new location and format.  As of our 2.1\n  release we have added an extra file, &lt;install-dir&gt;/share/mysql-\n  proxy/items/custom.xml, where you can put any custom definitions you\n  create in addition to the ones we deliver with the Agent.  This file\n  will be preserved as-is on upgrade, whereas items-mysql-monitor.xml\n  will be overwritten.  If you have any questions about how to\n  recreate your customized data collection definitions, contact MySQL\n  Support.\n---\n\nKNOWN ISSUES\n\nIn order for replication topologies to be properly discovered, each\nagent must be running on the same machine as the MySQL server it is\nmonitoring (i.e. it cannot be monitoring the server remotely).\n\nSeveral replication *groups* installed on the same physical machine\nthat use &quot;localhost&quot; to identify the master host will confuse\nreplication topology discovery and result in incorrect groupings.\nQuestion: Is this a common or uncommon setup?\n\nWe are still working on the translation of various text into Japanese,\nso users selecting that as their language/locale may see some text in\nEnglish, or with simple &quot;TODO&quot; reminders.\n\nNOTE: For Connector/NET Users:\n\n      In the &quot;Using the MySQL Enterprise Plugin for Connector/NET&quot;\n\t  section of the documentation, and in the README that is included\n\t  with Connector/NET, the following is included in the example for\n\t  the System.Diagnostics section of your app.config file:\n\n        &lt;system.data&gt;\n          &lt;DbProviderFactories&gt;\n            &lt;add name=&quot;MySQL Data Provider&quot; invariant=&quot;MySql.Data.MySqlClient&quot; description=&quot;.Net Framework Data Provider for MySQL&quot; type=&quot;MySql.Data.MySqlClient.MySqlClientFactory, MySql.Data, Version=6.2.1.0, Culture=neutral, PublicKeyToken=c5687fc88969c44d&quot; /&gt;\n          &lt;/DbProviderFactories&gt;\n        &lt;/system.data&gt;\n\n     Please note that the system.data section is only needed if you\n\t have not installed Connector/NET itself.\n---\n\nREPORTING ISSUES &amp; FEEDBACK\n\nTo report a problem or get help with an issue, please login to &lt;a href=&quot;\nhttps://support.oracle.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://support.oracle.com/&lt;/a&gt; and create an issue with a &quot;Main problem\narea&quot; set to &quot;MySQL Enterprise Tools&quot;.  Generally, it's better to\ncreate a separate issue for each problem you're reporting.\n\nWe are very interested in any comments or suggestions you can provide.\nWe are especially interested in any suggestions for new Advisor Rules\nor Graphs (or proposed modifications for fine-tuning the ones we\nprovide).  Feel free to combine a bulleted list or summary of your\nevaluation experience into a single issue (see above). We suggest \nyou make the Summary field &quot;Feedback.&quot;\n---\n\nThanks and Happy Monitoring!\n\n  - The MySQL Enterprise Tools Development Team\n\nCopyright Ã‚Â© 2010, 2011, Oracle and/or its affiliates. All rights reserved.\n\nThis software and related documentation are provided under a license\nagreement containing restrictions on use and disclosure and are\nprotected by intellectual property laws. Except as expressly permitted\nin your license agreement or allowed by law, you may not use, copy,\nreproduce, translate, broadcast, modify, license, transmit,\ndistribute, exhibit, perform, publish, or display any part, in any\nform, or by any means. Reverse engineering, disassembly, or\ndecompilation of this software, unless required by law for\ninteroperability, is prohibited.\n\nIf this software or related documentation is delivered to the U.S.\nGovernment or anyone licensing it on behalf of the U.S. Government,\nthe following notice is applicable:\n\nU.S. GOVERNMENT RIGHTS Programs, software, databases, and related\ndocumentation and technical data delivered to U.S. Government\ncustomers are &quot;commercial computer software&quot; or &quot;commercial technical\ndata&quot; pursuant to the applicable Federal Acquisition Regulation and\nagency-specific supplemental regulations. As such, the use,\nduplication, disclosure, modification, and adaptation shall be subject\nto the restrictions and license terms set forth in the applicable\nGovernment contract, and, to the extent applicable by the terms of the\nGovernment contract, the additional rights set forth in FAR 52.227-19,\nCommercial Computer Software License (December 2007). Oracle USA,\nInc., 500 Oracle Parkway, Redwood City, CA 94065.\n\nThis software is developed for general use in a variety of information\nmanagement applications. It is not developed or intended for use in\nany inherently dangerous applications, including applications which\nmay create a risk of personal injury. If you use this software in\ndangerous applications, then you shall be responsible to take all\nappropriate fail-safe, backup, redundancy, and other measures to\nensure the safe use of this software. Oracle Corporation and its\naffiliates disclaim any liability for any damages caused by use of\nthis software in dangerous applications.\n\nOracle is a registered trademark of Oracle Corporation and/or its\naffiliates. Other names may be trademarks of their respective owners.\n\nThis software and documentation may provide access to or information\non content, products, and services from third parties. Oracle\nCorporation and its affiliates are not responsible for and expressly\ndisclaim all warranties of any kind with respect to third-party\ncontent, products, and services. Oracle Corporation and its affiliates\nwill not be responsible for any loss, costs, or damages incurred due\nto your access to or use of third-party content, products, or\nservices.\n","torrent":{"xt":"urn:btih:578c1f943dbf0bd5015cd131b24e964ecf99ad25","amp;dn":"MySQL+Enterprise+Monitor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"578c1f943dbf0bd5015cd131b24e964ecf99ad25","infoHashBuffer":{"type":"Buffer","data":[87,140,31,148,61,191,11,213,1,92,209,49,178,78,150,78,207,153,173,37]},"announce":[],"urlList":[]}}