{"title":"sTORI TELLING - Tori Spelling [Epub]","uid":8507492,"size":1142805,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:578defe66e8f3b023ef7366faca4dcfe0b3da16f&amp;dn=sTORI+TELLING+-+Tori+Spelling+%5BEpub%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"James_WB","files":3,"time":1369465371,"description":"\nShe was television's most famous virgin -- and, as Aaron Spelling's daughter, arguably its most famous case of nepotism. Portraying Donna Martin on Beverly Hills, 90210, Tori Spelling became one of the most recognizable young actresses of her generation, with a not-so-private personal life every bit as fascinating as her character's exploits. Yet years later the name Tori Spelling too often closed -- and sometimes slammed -- the same doors it had opened.\n\nsTORI telling is Tori's chance to finally tell her side of the tabloid-worthy life she's led, and she talks about it all: her decadent childhood birthday parties, her nose job, her fairy-tale wedding to the wrong man, her so-called feud with her mother. Tori has already revealed her flair for brilliant, self-effacing satire on her VH1 show So NoTORIous and Oxygen's Tori &amp; Dean: Inn Love, but her memoir goes deeper, into the real life behind the rumors: her complicated relationship with her parents; her struggles as an actress after 90210; her accident-prone love life; and, ultimately, her quest to define herself on her own terms.\n\nFrom her over-the-top first wedding to finding new love to her much-publicized -- and misunderstood -- &quot;disinheritance,&quot; sTORI telling is a juicy, eye-opening, enthralling look at what it really means to be Tori Spelling. ","torrent":{"xt":"urn:btih:578defe66e8f3b023ef7366faca4dcfe0b3da16f","amp;dn":"sTORI+TELLING+-+Tori+Spelling+%5BEpub%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"578defe66e8f3b023ef7366faca4dcfe0b3da16f","infoHashBuffer":{"type":"Buffer","data":[87,141,239,230,110,143,59,2,62,247,54,111,172,164,220,254,11,61,161,111]},"announce":[],"urlList":[]}}