{"title":"Split Enz - Discography (320kbps)","uid":6621276,"size":1207197339,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:586863d9d9fc9a54edd441c7f60e21fcf8c64c74&amp;dn=Split+Enz+-+Discography+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"piratetorrent1989","files":127,"time":1314006647,"description":"Split Enz were a New Zealand band of the 1970s and early 1980s featuring Phil Judd and brothers Tim Finn and Neil Finn. They achieved chart success in New Zealand, Australia and Canada during the early 1980s, most notably with the single &quot;I Got You&quot;, and built a cult following elsewhere. Their musical style was eclectic and original, incorporating influences from art rock, vaudeville, swing, punk, rock, New Wave and pop.\nThe group formed in 1971 at the University of Auckland with the original lineup of Phil Judd, Tim Finn, Mike Chunn, Robert Gillies and Noel Crombie. From 1972 the band became a full-time occupation for the friends, and they called the band Split Ends. The spelling was later changed to Split Enz shortly before their first trip to Australia, to signify their New Zealand roots (NZ is a common abbreviation for New Zealand). The group was widely known for their unique visual presentation. Their costumes and hair were wild, colourful and inventive.\nThe group's career falls into two phases. The first was rooted in folk and the progressive rock scene of the early 1970s. From 1977 onwards, with the departure of Judd and the enlisting of Neil Finn, the group's sound began to change from a progressive rock sound to New Wave and pop. The early 1980s proved the group's most commercially successful period, with a string of popular albums in the bourgeoning New Wave style. The group further established a legacy that is still recognised as a distinct musical style after over twenty years from their departure. Since then, the group has reunited as Split Enz several times, though its members have gone on to create other successful musical groups with one another since the breakup in 1984, such as Crowded House, Schnell Fenster, Citizen Band and the Finn Brothers.","torrent":{"xt":"urn:btih:586863d9d9fc9a54edd441c7f60e21fcf8c64c74","amp;dn":"Split+Enz+-+Discography+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"586863d9d9fc9a54edd441c7f60e21fcf8c64c74","infoHashBuffer":{"type":"Buffer","data":[88,104,99,217,217,252,154,84,237,212,65,199,246,14,33,252,248,198,76,116]},"announce":[],"urlList":[]}}