{"title":"The Landmarks of New York - An Illustrated Record of the City's ","uid":8601462,"size":51118850,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58a054cba4125c3a427c3d74a2480e6d619b24c4&amp;dn=The+Landmarks+of+New+York+-+An+Illustrated+Record+of+the+City%27s+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"STBGD","files":-1,"time":1371898257,"description":"The Landmarks of New York: An Illustrated Record of the City's Historic Buildings By Barbaralee Diamonstein-Spielvogel\nPublisher: Sta..te Uni..ver..sity of New York Press; 5 edition 2011 | 750 Pages | ISBN: 1438437692 | PDF | 49 MB\n\nAs the definitive resource on the architectural history of New York City, The Landmarks of New York, Fifth Edition documents and illustrates the 1,276 individual landmarks and 102 historic districts that have been accorded landmark status by the New York City Landmarks Preservation Commission since its establishment in 1965. Arranged chronologically, by date of construction, the book offers a sequential overview of the city's architectural history and richness, presenting a broad range of styles and building types: colonial farmhouses, Gilded Age mansions, churches, schools, libraries, museums, and the great twentieth-century skyscrapers that are recognized throughout the world.\n\nThat so many of these structures have endured is due, in large measure, to the efforts of the New York City Landmarks Preservation Commission. Since the establishment of the commission, New York City has become the leader of the preservation movement in the United States, with more buildings and districts designated and protected than in any other city.\n\nIncluded here are such iconic structures as Grand Central Station, the Chrysler Building, the Metropolitan Museum of Art, and Carnegie Hall, as well as those that may be less well known but are of significant historical and architectural value: the Pieter Claesen Wyckoff House in Brooklyn, the oldest structure in New York City; the Bowne House in Queens, the birthplace of American religious freedom; the Watchtower in Marcus Garvey Park in Harlem; the New York Botanical Garden in The Bronx; and Sailors Snug Harbor on Staten Island. In addition to completely updated maps and descriptions of each landmark and historic district included in the previous editions, the fifth edition adds 183 new individual landmarks and 39 new historic district maps.","torrent":{"xt":"urn:btih:58a054cba4125c3a427c3d74a2480e6d619b24c4","amp;dn":"The+Landmarks+of+New+York+-+An+Illustrated+Record+of+the+City%27s+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58a054cba4125c3a427c3d74a2480e6d619b24c4","infoHashBuffer":{"type":"Buffer","data":[88,160,84,203,164,18,92,58,66,124,61,116,162,72,14,109,97,155,36,196]},"announce":[],"urlList":[]}}