{"title":"Sarah Toulalan - Imagining Sex. Pornography and Bodies in Sevent","uid":10286947,"size":7189526,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:58e7d33123d8ef72a0dbb3bb4044ab6be4e6c568&amp;dn=Sarah+Toulalan+-+Imagining+Sex.+Pornography+and+Bodies+in+Sevent&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1401754662,"description":"Description\nProduct Details\nBook Title: Imagining Sex: Pornography and Bodies in Seventeenth-Century England\t\nBook Author: Sarah Toulalan\nHardcover: 300 pages\nPublisher: Oxford University Press (October 25, 2007)\nLanguage: English\nISBN-10: 0199209146\nISBN-13: 978-0199209149\n\n===================================================================================\nBook Description\nPublication Date: October 25, 2007 | ISBN-10: 0199209146 | ISBN-13: 978-0199209149\nImagining Sex is a study of pornographic writing in seventeenth-century England. It explores a wide variety of written material from the period to argue that, unlike today, pornography was not a discrete genre, nor was it one that was usually subject at this time to suppression. Pornographic writing was a widespread feature of a range of texts, including both popular literature (ballads, news-sheets, court reports, small books, and pamphlets) as well as poetry, drama and more specialised medical books. The book analyses representations of sex, sexuality and eroticism in historical context to explore contemporary thinking about these issues, but also about broader cultural concerns and shifts in attitudes. It questions both modern feminist and psychoanalytical interpretations of pornography, arguing that these approaches are neither appropriate nor helpful to an understanding of seventeenth-century material.\nThrough discussions of sex and reproduction, homosexuality, flagellation, voyeurism, and humour, the book explores the nature of early modern sexual desire and arousal and explores their relationship to contemporary understandings about how the body worked. Imagining Sex presents a radically new interpretation of pornography in this period, arguing that concerns about fertility were at the heart of representations of bodies and sex, so that images of pleasure were entwined with ideas about conception and reproduction. It also shows that these texts legitimized the (sexual) pleasure of the reader by highlighting the pleasure of looking and the incitement to sexual action that it provided.\n\n===================================================================================\nReviews\n&quot;Well-researched.&quot; --Scriblerian\n\n&quot;There is much to admire in this book.... Toulalan's presentation of texts and their illustrations is a major contribution to current scholarship.&quot;--Jeremy Webster, H-Net Reviews\n\n&quot;Toulalan has produced a readable, fascinating discussion of early modern attitudes toward sex.&quot; --Renaissance Quarterly\n\n===================================================================================\nAbout the Author\nSarah Toulalan is a Wellcome Lecturer in Medical History, University of Exeter.\n===================================================================================","torrent":{"xt":"urn:btih:58e7d33123d8ef72a0dbb3bb4044ab6be4e6c568","amp;dn":"Sarah+Toulalan+-+Imagining+Sex.+Pornography+and+Bodies+in+Sevent","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58e7d33123d8ef72a0dbb3bb4044ab6be4e6c568","infoHashBuffer":{"type":"Buffer","data":[88,231,211,49,35,216,239,114,160,219,179,187,64,68,171,107,228,230,197,104]},"announce":[],"urlList":[]}}