{"title":"HTML5 Game Development For Dummies","uid":8667745,"size":33287159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:592e8e5fd7e86e8b817811a844f0dd685b2141c6&amp;dn=HTML5+Game+Development+For+Dummies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sigor10","files":-1,"time":1373435686,"description":"HTML5 Game Development For Dummies By Andy Harris\n\n2013 | 384 Pages | ISBN: 1118074769\n\nCreate games with graphics that pop for the web and mobile devices!\nHTML5 is the tool game developers and designers have been eagerly awaiting. It simplifies the job of creating graphically rich, interactive games for the Internet and mobile devices, and this easy-to-use guide simplifies the learning curve. Illustrated in full color, the book takes you step by step through the basics of HTML5 and how to use it to build interactive games with 2D graphics, video, database capability, and plenty of action.\n\n    Learn to create sports and adventure games, pong games, board games, and more, for both mobile devices and the standard web.\n    Learn to use the new HTML5 technology that makes it easier to create games with lots of action, colorful 2D graphics, and interactivity--for both the web and mobile devices\n    Test and debug your games before deploying them\n    Take advantage of how HTML5 allows for SQL-like data storage, which is especially valuable if you're not well versed in database management\n\nExplore creating games suitable for community activity and powerful, profitable games that require large amounts of data\nWhether you want to build games as a fun hobby or hope to launch a new career, this full-color guide covers everything you need to know to make the most of HTML5 for game design.","torrent":{"xt":"urn:btih:592e8e5fd7e86e8b817811a844f0dd685b2141c6","amp;dn":"HTML5+Game+Development+For+Dummies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"592e8e5fd7e86e8b817811a844f0dd685b2141c6","infoHashBuffer":{"type":"Buffer","data":[89,46,142,95,215,232,110,139,129,120,17,168,68,240,221,104,91,33,65,198]},"announce":[],"urlList":[]}}