{"title":"Interfacial Transport Phenomena 2nd ed","uid":12116894,"size":33385016,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:596259412f10e0ace4f1a3fb1e3013f19827e0e1&amp;dn=Interfacial+Transport+Phenomena+2nd+ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"clouderone","files":1,"time":1436741514,"description":"Interfacial Transport Phenomena 2nd ed - John C. Slattery, Leonard Sagis, Eun-Suok Oh (Springer, 2007).pdf\n\nISBN 0-387-38438-3 \ne-ISBN 0-387-38442-1\nISBN 9780387384382\n\nTransport phenomena is used here to describe momentuin, energy, mass, and entropy transfer [1, 2]. It includes thermodynamics, a special case of which is thermosiaiics. Interfacial transport phenomena refers to momentum, energy, mass, and entropy transfer within the immediate neighborhood of a phase interface, including the thermodynamics of the interface. In terms of qualitative physical observations, this is a very old field. Pliny the Elder (Gains Plinius Secundus, 23-79 A. D.; Pliny [3]) described divers who released small quantities of oil from their mouths, in order to damp capillary ripples on the ocean surface and in this way provide more uniform lighting for their work. Similar stories were retold by Benjamin Franklin, who conducted experiments of his own in England [4]. In terms of analysis, this is a generally young field. Surface thermostat ics developed relatively early, starting with Gibbs [5] and continuing with important contributions by many others (see Chap. 4). Derjaguin and Lan dau [6] and Verwey and Overbeek [7] indicated how London-van der Waals and electrostatic double-layer forces were to be incorporated in continuum mechanics, now often referred to as DLVO theory. But prior to 1960, there were relatively few notable papers concerned with the analysis of dynamic systems. Two stand out in my mind. Boussinesq [8] recognized the surface stress tensor and proposed the constitutive equation that we now refer to as the Boussinesq surface fluid model (Sect. 4. 9. 5).&quot;","torrent":{"xt":"urn:btih:596259412f10e0ace4f1a3fb1e3013f19827e0e1","amp;dn":"Interfacial+Transport+Phenomena+2nd+ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"596259412f10e0ace4f1a3fb1e3013f19827e0e1","infoHashBuffer":{"type":"Buffer","data":[89,98,89,65,47,16,224,172,228,241,163,251,30,48,19,241,152,39,224,225]},"announce":[],"urlList":[]}}