{"title":"Gay - CMNM - 59 - Murray","uid":7148403,"size":657944688,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:59f2f4897b30fc7b2169ed16657d1891fc2ed568&amp;dn=Gay+-+CMNM+-+59+-+Murray&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"mGlottalstop","files":-1,"time":1333214964,"description":"Murray\n19 years old\n6ft (1.82m)\n\nSweet-faced young Murray is looking to get into business and wants the guidance of some older suited gentlemen. Naive and shy he grudgingly allows himself to be manhandled and cross-questioned by his superiors. Up until this point he's spent his summers carefree riding around the park on his bicycle checking out women. Now he learns what it means to knuckle down and work to impress the men who can secure his employment. The dumbstruck boy is shocked by the intensity of the encounter experiencing many new sensations for the first time.\n\n~~\n\nPART ONE - STRIPPED\n\nMurray is surprised at how aggressively the experienced businessmen grope him. They take him in hand and eagerly strip him down becoming very familiar with every part of his youthful fit body. Friendly and accommodating at first, he becomes very shy and quiet as he accidentally grows an erection at being so confidently stimulated by the men stroking his body and jerking his cock.\n\n309MB, 17 minutes 31 seconds.\n\n~~\n\nPART TWO - VIOLATED\n\nMurray has it too easy. We're not going to let him bend over and passively take whatever we give him. He needs to learn to properly respect and worship businessmen while naked on his hands and knees. His sweet innocent face nestles into the men's crotches while his arse is up in the air beautifully on display. Murray's face seizes up in surprise as he feels the shocking sensation of his arsehole being penetrated for the first time.\n\n181MB, 9 minutes 52 seconds.\n\n~~\n\nPART THREE - WANKED\n\nHe's come a long way from the suited carefully presented professional young man who first walked into our office. Now that we've stripped him and got our hands all over him Murray is looking much more used with his big hair all tousled. Dave skilfully manipulates his cock till he grows a big stonking boner and shoots a creamy load.\n\n135MB, 5 minutes 6 seconds.\n\n~~\n\nEnjoy!\nJoey x","torrent":{"xt":"urn:btih:59f2f4897b30fc7b2169ed16657d1891fc2ed568","amp;dn":"Gay+-+CMNM+-+59+-+Murray","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"59f2f4897b30fc7b2169ed16657d1891fc2ed568","infoHashBuffer":{"type":"Buffer","data":[89,242,244,137,123,48,252,123,33,105,237,22,101,125,24,145,252,46,213,104]},"announce":[],"urlList":[]}}