{"title":"Neil Young Led Zeppelin 1995-01-12 RnR Hall Pro DVD","uid":11450779,"size":2729322637,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5a08825c1152faa91505500a9acff4a91f688d81&amp;dn=Neil+Young+Led+Zeppelin+1995-01-12+RnR+Hall+Pro+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GRNS3","files":-1,"time":1415885765,"description":"\nAnother gem from the bootleg archive.\n\nPlease enjoy, share with friends and seed :)\n\n\n\nNeil Young and Led Zeppelin\nRock and Roll Hall Of Fame Ceremony\nWaldorf-Astoria, New York, NY\n1995-01-12\n\nI am shocked I have not seen this Vid circulating.  This is from my master VHS but it is not perfect by any means.  There are a few rough transitions after the commercial breaks. I left off everything that came before Neil Youngs introduction.  Please if you have an upgrade, I would love to check it.\n\n*********************************************************************\n\n- Audio Codec:  AC3\n- Audio Bitrate: 0xbd[0x80]:48000Hz  256 kb/s tot , stereo (2/0) \n- Video System: NTSC 29.97 \n- Video Bitrate: 6135 kbps \n- 55min. 45 sec. long\nSorry, no menu \nRecording source: VHS Master\nTransfer: VHS &gt; SA DVD/VHS combo (Samsung DVD-VR375)  &gt; DVD Master &gt; DVDFAB&gt; DVD5 \nTaper:   Dubwise \n\n*********************************************************************\n\nNeil Young\n \nNeil Yound Induction\nAct Of Love, \nFuckin' Up*, \nWhen The Levee breaks (incl. For what it s worth) With Led Zepplin \n\nComment\nNeil Young, * = w/Crazy Horse &amp; Pearl Jam, ** = w/Led Zeppelin\n\nLed Zeppelin \n\nInduction Speech\nBring it on Home\nLong distance call Blues\nBaby Please Don't Go\nWhen the Levee Breaks \nFor What it's Worth  \n\nComment\nRock and Roll Hall Of Fame Ceremony\nJoe Perry And Steven Tyler As Guests Artists on &quot;Bring it on home&quot;, &quot;long distance&quot; &amp; &quot;please don t go&quot;\nNeil Young and Michael Lee as guests on &quot;Levee&quot; &amp; &quot;what it s worth&quot;\n\nLZ = Page, Plant, JP Jones, Jason Bonham\n\n\nText from Chris:\n\nOn 12 January 1995, Led Zeppelin were inducted into the United States Rock and Roll Hall of Fame. They were inducted by Aerosmith's vocalist, Steven Tyler and guitarist Joe Perry. Jason and Zoe Bonham also attended, representing their late father. At the induction ceremony, the band's inner rift became apparent when Jones joked upon accepting his award, &quot;Thank you, my friends, for finally remembering my phone number&quot;, causing consternation and awkward looks from Page and Plant.[64] Afterwards, they played a brief set with Tyler and Perry (featuring Jason Bonham on drums), and with Neil Young and Michael Lee replacing Bonham.\n\nBesides Led Zeppelin, it's a great show.  Neil Young is also inducted and his acceptance speech is hilarious. In fact, it's really Neil Young that steals the show.\n\nBut, of course the main historical moment of the evening is when Led Zeppelin are inducted and it's John Paul Jones' turn at the mic.\n\nThe now infamous comment, &quot;Thank you, my friends, for finally remembering my phone number,&quot; (by John Paul Jones referring to his old partners reunion) is now a part of Zeppelin lore. (Plant rolls his eyes as he &quot;checks his pockets&quot; as Page stands there smiling sheepishly, teehee.)  And yes, another historical moment as Robert Plant picks up the guitar and jams, as Pagey looks on with a comedic smile on his face.  They are having fun, and it shows.\n\n\nLet's face it, Holly. There is no excuse for the 'Hall OF Fame' awards shows to have not been released officially. (The music business has all but forgotten about the fans these days.  It's not the artist's fault. It's dollars and cents! - Hence the terrible state of the music industry today.)  \n\nThe 1995 Hall Of Fame show has many memorable moments. Neil Young, Led Zeppelin, and an incredible solo performance by Melissa Etheridge; performing Piece Of My Heart by Janis Joplin, who was also inducted that year.  Frank Zappa was also inducted.  A great show all around.\n\nAnother Classic Liberation From The Dubwise Garage Collection\n\nShare and keep it lossless","torrent":{"xt":"urn:btih:5a08825c1152faa91505500a9acff4a91f688d81","amp;dn":"Neil+Young+Led+Zeppelin+1995-01-12+RnR+Hall+Pro+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a08825c1152faa91505500a9acff4a91f688d81","infoHashBuffer":{"type":"Buffer","data":[90,8,130,92,17,82,250,169,21,5,80,10,154,207,244,169,31,104,141,129]},"announce":[],"urlList":[]}}