{"title":"Travis Barker-Give The Drummer Some(Deluxe Edition) VBR mp3 ak","uid":10721953,"size":90877832,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5a13a8b4b681454cd28928c42a6866d454cfcde4&amp;dn=Travis+Barker-Give+The+Drummer+Some%28Deluxe+Edition%29+VBR+mp3+ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"analogkid6103","files":17,"time":1407496003,"description":"Travis Barker-Give The Drummer Some(Deluxe Edition) VBR mp3 ak What we got Something else....Give the Drummer Some is the first solo record by blink-182 drummer Travis Barker. Barker had earlier announced that the album would be slated for a September 2010 release, but was later pushed back, with the album being released on March 15, 2011. The album, released under Interscope Records, was produced by the drummer himself, alongside The Neptunes, RZA, Kool Kojak, Chuck Inglish, Transplants, Kid Cudi, EDIT, Corey Taylor and Steve Aoki. The album debuted at number nine on the US Billboard 200 chart, with first-week sales of 28,000 copies in the United States.Background\n\nThe album title itself is a reference to a track by the Ultramagnetic MC's of the same name, which in turn derives from James Brown's &quot;Funky Drummer.&quot; It was first announced by Barker himself that the album would be of &quot;no one genre,&quot; indicating that the album wouldn't be based on hip hop or punk rock, unlike his previous remixes and collaborations. However, most of the tracks are hip-hop and R'n'B influenced, though for instance 'Misfits' has a techno/dance sound and 'On My Own' has a Metal groove to it. Guests that collaborated and are featured are: Slaughterhouse,[6] The Cool Kids, RZA, Ludacris, Lil Wayne, Rick Ross, Game, Raekwon, Tom Morello, Slash, Steve Aoki, Busta Rhymes, Lil Jon, Pharrell, Cypress Hill, Twista, Jay Rock, Kobe, Paul Wall, Clipse, Kid Cudi, Yelawolf, Snoop Dogg, Lupe Fiasco, Swizz Beatz, Bun B and Tech N9ne. Barker confirmed in an interview that there will not be any collaborations with Mark Hoppus and Tom Delonge from Blink-182 as he thought it would be wrong to have the first new Blink-182 song on his album, and that the song will be released separately as a single before the album is released in June/July 2011. The tracklisting was revealed on February 25, 2011.Track listing\n\nConfirmed by\nNo. \tTitle \tLyrics \tMusic \tProducer(s) \tLength \t\n1. \t&quot;Can a Drummer Get Some&quot; (featuring Lil Wayne, Rick Ross, Swizz Beatz &amp; Game) \tDwayne Carter, Jr., William Roberts II, Kasseem Dean, Jayceon Taylor \tTravis Barker \tTravis Barker \t3:21\n2. \t&quot;If You Want To&quot; (featuring Pharrell &amp; Lupe Fiasco) \tPharrell Williams, Wasalu Jaco \tTravis Barker \tThe Neptunes \t3:53\n3. \t&quot;Carry It&quot; (featuring RZA, Raekwon &amp; Tom Morello) \tRobert Diggs, Corey Woods \tTravis Barker, Robert Diggs, Tom Morello \tTravis Barker, RZA \t3:57\n4. \t&quot;Knockin'&quot; (featuring Snoop Dogg, Ludacris, E-40 &amp; Dev) \tCalvin Broadus, Christopher Bridges, Earl Stevens, Devin Tailes \tTravis Barker \tTravis Barker, Kool Kojak \t4:01\n5. \t&quot;Jump Down&quot; (featuring The Cool Kids) \tAntoine Reed, Evan Ingersoll \tTravis Barker \tChuck Inglish, Travis Barker \t3:07\n6. \t&quot;Devil's Got a Hold&quot; (featuring Slaughterhouse) \tJoseph Budden II, Dominick Wickliffe, Joell Ortiz, Ryan Montgomery \tTravis Barker, Kevin Bivona \tTravis Barker \t5:53\n7. \t&quot;Let's Go&quot; (featuring Yelawolf, Twista, Busta Rhymes &amp; Lil Jon) \tMichael Atha, Carl Mitchell, Trevor Smith, Jr., Jonathan Smith \tTravis Barker, Kevin Bivona \tTravis Barker \t3:13\n8. \t&quot;Saturday Night&quot; (Performed by the Transplants &amp; Slash) \tRob Aston, Tim Armstrong \tTravis Barker, Tim Armstrong, Slash \tTravis Barker, Skinhead Rob, Tim Armstrong \t3:24\n9. \t&quot;Cool Head&quot; (featuring Kid Cudi) \tScott Mescudi \tTravis Barker, Scott Mescudi \tTravis Barker, Kid Cudi, EDIT \t4:40\n10. \t&quot;Raw Fuckin Shit*&quot; (featuring Tech N9ne &amp; Bun B) \tAaron Yates, Bernard Freeman \tTravis Barker \tTravis Barker, Kool Kojak \t3:19\n11. \t&quot;Just Chill&quot; (featuring Beanie Sigel, Bun B &amp; Kobe) \tDwight Grant, Bernard Freeman, Brian &quot;Kobe&quot; Honeycutt \tTravis Barker, Kevin Bivona \tTravis Barker \t3:29\n12. \t&quot;Beat Goes On&quot; (featuring Cypress Hill) \tLouis Freese, Senen Reyes \tTravis Barker, Kevin Bivona \tTravis Barker \t4:20\n[show]Deluxe edition bonus tracks \t\n\n*The actual length of the track is 4:03 + 4-minute silence + hidden track &quot;I Play The Drums&quot;. The standard version has the hidden track included after &quot;Beat Goes On&quot;.\n\n    On the clean version &quot;Raw Shit&quot; is labeled &quot;Raw ****&quot;...................    ... On MY version &quot;Raw Shit&quot; is labeled &quot;Raw Fuckin Shit&quot;  This one up as\n\n      a favor for a friend.......seed.....seed......seed......or it dies....favor or not......Its heavy everywhere..........seed........seed......s....e....e...d....\n","torrent":{"xt":"urn:btih:5a13a8b4b681454cd28928c42a6866d454cfcde4","amp;dn":"Travis+Barker-Give+The+Drummer+Some%28Deluxe+Edition%29+VBR+mp3+ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a13a8b4b681454cd28928c42a6866d454cfcde4","infoHashBuffer":{"type":"Buffer","data":[90,19,168,180,182,129,69,76,210,137,40,196,42,104,102,212,84,207,205,228]},"announce":[],"urlList":[]}}