{"title":"(2013) David Bowie - The Next Day [FLAC+.cue] {100.XY}","uid":8299926,"size":433237613,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5a15013e110a70cd993ed14987338cb4b20b3642&amp;dn=%282013%29+David+Bowie+-+The+Next+Day+%5BFLAC%2B.cue%5D+%7B100.XY%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"100.XY","files":-1,"time":1364244075,"description":"he Next Day is the twenty-fourth studio album by English musician David Bowie, released on 8 March 2013 on Bowie's Iso Records label, under exclusive license with Columbia Records. The album was announced on Bowie's sixty-sixth birthday.[1] Bowie's website was updated with the video for the lead single, &quot;Where Are We Now?&quot;. The single was immediately on sale on iTunes, and the album was put on pre-sale. It will be Bowie's first album of new material in ten years since 2003's Reality. After having already shocked fans with the news of a new album on his birthday, he then again surprised them with a free streaming of the album via iTunes days before its official release.[2] Following its release on 8 March the album went straight to number one in eleven of the twelve countries it was released on iTunes.\n\n Editorial Review:\nDeluxe digipak edition includes three bonus tracks. 2013 album from the legendary Rock chameleon, his first studio album in ten years and his 30th studio recording. The album was produced by long-term collaborator Tony Visconti and was recorded in New York. In recent years, radio silence has been broken only by endless speculation, rumor and wishful thinking. A new record: who would have ever thought it? After all, David is the kind of artist who writes and performs what he wants when he wants: when he has something to say as opposed to something to sell. Today, he definitely has something to say. Throwing shadows and avoiding the industry treadmill is very David Bowie despite his extraordinary track record that includes album sales in excess of 130 million; not to mention his massive contributions in the area of art, fashion, style, sexual exploration, and social commentary. It goes without saying that he has sold out stadiums and broken ticket records throughout the world during this most influential of careers.\nAmazon\n\nCountry: UK\nGenre: Rock\nQuality: FLAC\nTracklist:\n\n(2013) David Bowie - The Next Day\n01 - David Bowie - The Next Day.flac\n02 - David Bowie - Dirty Boys.flac\n03 - David Bowie - The Stars (Are Out Tonight).flac\n04 - David Bowie - Love Is Lost.flac\n05 - David Bowie - Where Are We Now.flac\n06 - David Bowie - Valentine's Day.flac\n07 - David Bowie - If You Can See Me.flac\n08 - David Bowie - I'd Rather Be High.flac\n09 - David Bowie - Boss Of Me.flac\n10 - David Bowie - Dancing Out In Space.flac\n11 - David Bowie - How Does The Grass Grow.flac\n12 - David Bowie - (You Will) Set The World On Fire.flac\n13 - David Bowie - You Feel So Lonely You Could Di.flac\n14 - David Bowie - Heat.flac\n15 - David Bowie - So She.flac\n16 - David Bowie - Plan.flac\n17 - David Bowie - I'll Take You There.flac\nThe Next Day.cue","torrent":{"xt":"urn:btih:5a15013e110a70cd993ed14987338cb4b20b3642","amp;dn":"%282013%29+David+Bowie+-+The+Next+Day+%5BFLAC%2B.cue%5D+%7B100.XY%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a15013e110a70cd993ed14987338cb4b20b3642","infoHashBuffer":{"type":"Buffer","data":[90,21,1,62,17,10,112,205,153,62,209,73,135,51,140,180,178,11,54,66]},"announce":[],"urlList":[]}}