{"title":"Just A Minute (BBC-Radio)","uid":3647595,"size":4725119006,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:5a3002a697375425931d786b174cf8144c42b1eb&amp;dn=Just+A+Minute+%28BBC-Radio%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"InnerRevolution7","files":405,"time":1174864999,"description":"BBC-Radio&amp;#039;s most devious panel game. Contenders battle it out to talk on a subject \nfor sixty seconds without hesitating, deviating, or repeating themselves. The rules may sound impossibly simple, but the game often is simply impossible, with \nhilarious consequences.\n\nWhile celebrity contestants compete for points, the points actually take a back seat to the humor, fun, arguing, and creative chaios.\n\nThe show&amp;#039;s creater, Ian Messiter, developed the concept as he remembered a school teacher who once had punished him with the difficult task of speaking for sixty seconds without hesitation or deviation. To this, Messiter added a rule disallowing players from repeating words, as well as adding a scoring system, and a panel of competing celebrities who may buzz-in and challenge the current speaker. If the challenge is deemed correct, the challenger steals the topic for however many seconds may remain.\n\nThe show began on BBC-Radio in late 1967 and continues today. It is vastly popular and has become embedded into the culture.\n\nThe good-natured host of Just a Minute is Nicholas Parsons. He has held this position since the show&amp;#039;s debut. Regulars on the show include Paul Merton, Clement Freud, Graham Norton, Julian Clary, Sue Perkins, Stephen Frost, Steven Fry, Ross Noble, Tony Hawks, and many others. Regulars from earlier years who have now sadly passed away are Derek Nimmo, Peter Jones, and the comically tantrum-prone Kenneth Williams.\n\nIf you are a newcomer to Just A Minute, you may want to listen to the most recent few years first. Earlier years mostly tend to be of interest to collectors, die-hard Just A Minute fans, or fans of specific guests.","torrent":{"xt":"urn:btih:5a3002a697375425931d786b174cf8144c42b1eb","amp;dn":"Just+A+Minute+%28BBC-Radio%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a3002a697375425931d786b174cf8144c42b1eb","infoHashBuffer":{"type":"Buffer","data":[90,48,2,166,151,55,84,37,147,29,120,107,23,76,248,20,76,66,177,235]},"announce":[],"urlList":[]}}