{"title":"Ric Shreves - Drupal 7 Themes","uid":6488927,"size":10828623,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5a665e9e1a7faa094b5a7d05d5633c9bebc84c98&amp;dn=Ric+Shreves+-+Drupal+7+Themes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheBookie","files":-1,"time":1308814025,"description":"Drupal 7 Themes By Ric Shreves\n\nCreate new themes for your Drupal 7 site with a clean layout and powerful CSS styling\nLearn to create new Drupal 7 themes\nNo experience of Drupal theming required\nDiscover techniques and tools for creating and modifying themes\nThe first book to guide you through the new elements and themes available in Drupal 7\n\nDrupal is an award winning open source Content Management System (CMS). Based on PHP and MySQL, its power and flexibility combined with its exceptional design mean it is one of the most popular choices for creating a CMS website..\nDrupal employs a specialized templating system and supports themes, which allow you to change the look and feel of your system's front and back-end interfaces..\nDrupal 7 Themes is an ideal introduction to theming with Drupal 7. If you want to create a striking new look for your Drupal 7 website, this book is for you. This book is a revised, updated and expanded edition of Drupal 6 Themes, rewritten specifically for Drupal 7.\nThis book will show you techniques and tools to help you improve the look and feel of any Drupal 7-powered website. Starting from the basics of theme setup and configuration, you will learn about the Drupal theming architecture and the PHPTemplate engine, and then move on to modifying existing themes and building new themes from scratch. You will find out about tools to make your theme development easier.\nA practical guide showing you how to create themes for your Drupal 7 site\n\nWhat you will learn from this book\n\nLearn about the Drupal 7 Theming Architecture\nFind and install new themes\nGet the most from Drupal's theme configuration system\nCreate a new theme from scratch\nMaster PHPTemplate\nModify the default templates and styles\nOverride the default templates with your own\nCreate dynamic styling that responds to the content or the user\nDiscover tools that make theming easier and more efficient\n\n","torrent":{"xt":"urn:btih:5a665e9e1a7faa094b5a7d05d5633c9bebc84c98","amp;dn":"Ric+Shreves+-+Drupal+7+Themes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5a665e9e1a7faa094b5a7d05d5633c9bebc84c98","infoHashBuffer":{"type":"Buffer","data":[90,102,94,158,26,127,170,9,75,90,125,5,213,99,60,155,235,200,76,152]},"announce":[],"urlList":[]}}