{"title":"Agatha Christie 75 (E-Books)NLT-Release","uid":6564258,"size":14004442,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ac4d8af75be3c4f61499a0aa48769757e8b0262&amp;dn=Agatha+Christie+75+%28E-Books%29NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"linday1","files":-1,"time":1311609700,"description":"\nWereldwijd wordt vandaag stilgestaan bij de 120e geboortedag van de Britse detectiveschrijfster Agatha Christie (1890- 1976). \n\nDe wereldberoemde schrijfster van detectiveromans werd op 15 september 1890 geboren onder de naam Agatha Mary Clarisse Miller. Omdat ze in 1914 trouwde met Archibald Christie ging ze zich voortaan Aghatha Christie. Hoewel ze in 1928 scheidde en twee jaar later hertrouwde met de Londense archeoloog Max Edgar Lucien Mallowan, bleef ze de naam Christie gebruiken. Vaak scheef zij toen onder de naam Agatha Christie Mallowan, maar soms ook gebruikte ze het pseudoniem Mary Westmacott. \n\n\nAgatha Christie schreef meer dan negentig boeken. Geschat wordt dat er zeker vier biljoen keer een boek van Christie over de toonbank is gegaan. Ze is wereldwijd nog altijd een van de best verkopende auteurs aller tijden. Alleen de bijbel en William Shakesperare moet ze in die ranglijst voor zich dulden\nBij de 120e geboortedag van de geestelijk moeder van bekende figuren als de Belgische detective Hercule Poirot en de Engelse speurster Miss Marple, wordt op verschillende manieren stilgestaan. Zoekmachine-gigant Google heeft bijvoorbeeld een zogenaamde 'Google Doodle' gemaakt. Het traditionele logo op de startpagina van Google is vervangen voor een speciale tekening waarin elke letter van het woord Google een van de beroemde Christie-personages uitbeeldt. Zo beeldt de letter 'G' bijvoorbeeld de Belgische detective Hercule Poirot uit. \n\n\nVoor de nieuwste films en muziek ga je naar:\n &lt;a href=&quot;\nhttp://www.movierecensies.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.movierecensies.nl&lt;/a&gt;\n\n\n\nVeel leesplezier en dank aan de originele poster.\n\n\nBy Linday\n\nBy Linday ;) \n","torrent":{"xt":"urn:btih:5ac4d8af75be3c4f61499a0aa48769757e8b0262","amp;dn":"Agatha+Christie+75+%28E-Books%29NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ac4d8af75be3c4f61499a0aa48769757e8b0262","infoHashBuffer":{"type":"Buffer","data":[90,196,216,175,117,190,60,79,97,73,154,10,164,135,105,117,126,139,2,98]},"announce":[],"urlList":[]}}