{"title":"Walter Brueggemann - Bible Makes Sense, Praying Psalms (pdf)","uid":8683410,"size":2882024,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5b0519cf3413ad115a6e25bc8b43fb4a6e12bf25&amp;dn=Walter+Brueggemann+-+Bible+Makes+Sense%2C+Praying+Psalms+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":7,"time":1373744807,"description":"Two books by Walter Brueggemann:\n\n\n\nPraying the Psalms: Engaging Scripture and the Life of the Spirit (Cascade Books, 2007). 97 pages.\n\nIn this thoroughly revised edition of a classic in spirituality, Walter Brueggemann guides the reader into a thoughtful and moving encounter with the Psalms. This new edition includes a revised text, new notes, and new bibliography.\n\n&quot;'The Psalms just don't speak to me.' Anyone who has ever felt this way should read Brueggemann's book. . . . He shows how these ancient prayers can lead us from the disorientation of our chaotic lives into a reorientation of transformation. His treatment of both the post-Holocaust Christian use of these very Jewish prayers and the troublesome call for vengeance is most timely. This book shows how the Psalms can indeed speak to us.&quot;\n-- Dianne Bergant, CSA\nauthor of 'Preaching the New Lectionary'\n\n\n\nThe Bible Makes Sense (St. Anthony Messenger, 2003). 125 pages.\n\nThis revised edition of The Bible Makes Sense is a unique how-to book about the Bible. Brueggemann proposes that Christians should approach the Bible not as a collection of ancient documents, but as our partner in an ongoing dialog about our life here and now. This book explains how to enter into this dialog, how to listen, and how to respond. More than simply introducing readers to major themes, the author reveals an engaging biblical understanding of the world that leads to a life of joy, wholeness, and peace. Suggestions for reflection, discussion, and meditation on particular passages provide outlines for group study and for the individual reader's own prayerful Bible reading.\n\n\n\n\nBoth books are new scans. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nabout the author:\n\nWalter Brueggemann is William Marcellus McPheeters Professor of Old Testament Emeritus at Columbia Theological Seminary, Decatur, Georgia. He is the author of numerous works including 'Theology of the Old Testament,' 'Inscribing the Text,' 'Prophetic Imagination,' and 'David's Truth.'","torrent":{"xt":"urn:btih:5b0519cf3413ad115a6e25bc8b43fb4a6e12bf25","amp;dn":"Walter+Brueggemann+-+Bible+Makes+Sense%2C+Praying+Psalms+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b0519cf3413ad115a6e25bc8b43fb4a6e12bf25","infoHashBuffer":{"type":"Buffer","data":[91,5,25,207,52,19,173,17,90,110,37,188,139,67,251,74,110,18,191,37]},"announce":[],"urlList":[]}}