{"title":"Catastrophe 1914: Europe Goes to War  (Unabridged)","uid":11847032,"size":732662761,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5b11395afc585ee1c20cb7dfc35176fde3472c18&amp;dn=Catastrophe+1914%3A+Europe+Goes+to+War++%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"davieboy1966","files":32,"time":1429967015,"description":"Audio Books : History : MP3/128Kbps : English\n\n\n\nTitle: Catastrophe 1914: Europe Goes to War\nAuthor: Max Hastings\nPublished: September 2013\nNarrator: Simon Vance\nLength: 29 Discs\n\n\nAmazon rating is 4.5/5.0 stars based on 258 customer reviews\n\nEditorial Reviews:\n\nBooklist:\n\nAfter writing almost exclusively about WWII, eminent historian Hastings (Inferno) turns his attention to the outbreak of WWI. Chronicling both the prelude to the war and its initial battles, he concentrates on events occurring between June 28, 1914, when Archduke Franz Ferdinand was assassinated in Sarajevo, and December 31, 1914, when soldiers on both sides of the conflict languished in trenches. Drawing on accounts generated from rarified diplomatic circles, seasoned military leaders, and ordinary citizens helplessly caught up in the international catastrophe, he examines the origins and the onset of the Great War in minute and vivid detail. Hastings, unlike many contemporary historians, refuses to indulge in any retrospective hand-wringing, concluding rather firmly that Germany and Austria must accept principal blame for the war and that it is an analytical and an ethical mistake to believe that it did not matter which side won. This compelling reexamination of the commencement of the conflict represents an important contribution to the scholarship of the war to end all wars.? --Margaret Flanagan\n\nReviews:\n\nThe political and chattering classes are right to be worried: if any region today could cause a crisis comparable to that of 1914, it is the Middle East. They need a new book on the outbreak of World War I, and now they have it in Catastrophe 1914: Europe Goes to War. [Hastings is] an outstanding historian . . . a victorious foray . . . Tuchman has been supplanted.??Hew Strachan, The New York Times\n\nHastings over the past two decades has become the contemporary premier historian of 20th-century war . . . The real strength of this story is how Mr. Hastings portrays the principal characters, not as stereotyped tyrants, greedy empire builders or mindless militarists, but rather as very real human beings with as many flaws as virtues . . .Will the past be prologue? Get this book.??James Srodes, Washington Time\n\nWhat makes this book really stand out is Mr. Hastings deliberate efforts to puncture what he labels the many myths and legends of the events of 1914 . . . excellent . . . His deep research, insightful analysis, and wonderful prose make this an excellent addition to his long library of titles. This volume is a highly readable account of a war Europe completely misjudged in terms of bloodshed and cost?a war that destroyed three dynasties, remade the map of Europe and set the state for mankinds bloodiest century.Jerry Lenaburg, New York Journal of Books\n\nHastings argues persuasively that the war's opening phase had a unique character that merits closer study . . . Hastings ends his deft narrative and analysis by observing that the price of German victory would have been European democracy itself. Those who died to prevent that victory?despite the catastrophic decisions of 1914?did not die in vain.??William Anthony Hay, The Wall Street Journal\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:5b11395afc585ee1c20cb7dfc35176fde3472c18","amp;dn":"Catastrophe+1914%3A+Europe+Goes+to+War++%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b11395afc585ee1c20cb7dfc35176fde3472c18","infoHashBuffer":{"type":"Buffer","data":[91,17,57,90,252,88,94,225,194,12,183,223,195,81,118,253,227,71,44,24]},"announce":[],"urlList":[]}}