{"title":"Michael Bolton - Greatest Hits 1985-1995 (1995) [LOSSLESS FLAC][","uid":5299820,"size":554558104,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5b9a5488a3c0c8a96da0c41b24aa29d20437b9bf&amp;dn=Michael+Bolton+-+Greatest+Hits+1985-1995+%281995%29+%5BLOSSLESS+FLAC%5D%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RDaneel20","files":22,"time":1264182936,"description":"Michael Bolton - Greatest Hits 1985-1995 (1995) [LOSSLESS FLAC][Tntvillage.Scambioetico]\n\n\n\nMichael Bolton - Greatest Hits 1985-1995\n\n\nby RDaneel\n\n\n\n\n\n\n\n\n[::Album Information::]\n\nTitle: Greatest Hits 1985-1995\nYears: 1995\nGenre: Soul - Pop\nProduction: Columbia\n\n\n\n[::Tracklist::]\n\n1. Soul Provider - 4:27\n2. (Sittin' On) The Dock Of The Bay - 3:53\n3. How Am I Supposed To Live Without You - 4:15\n4. How Can We Be Lovers - 3:56\n5. When I'm Back On My Feet Again - 3:49\n6. Georgia On My Mind - 4:57\n7. Time, Love And Tenderness - 4:18\n8. When A Man Loves A Woman - 3:52\n9. Missing You Now - 4:25\n10. Steel Bars - 3:30\n11. Said I Loved You... But I Lied - 5:01\n12. Lean On Me - 4:21\n13. Can I Touch You... There - 5:18\n14. I Promise You - 5:21\n15. I Found Someone - 3:53\n16. A Love So Beautiful - 4:07\n17. This River - 5:16\n\n\n\n\n[::Review::]\n\nMichael Bolton (born February 26, 1953) is an American singer-songwriter and a former hard rock singer. He is best known for his soft rock ballads and tenor vocals.\nHis achievements include selling many albums, eight top ten albums, two number one singles on the Billboard charts, and awards from both the American Music Awards and Grammy Awards.\nBolton's hard rock band, Blackjack, once toured with heavy metal singer Ozzy Osbourne. He began recording as Michael Bolotin in 1975, after gaining his first major hit as a songwriter, co-writing &quot;How Am I Supposed to Live Without You&quot; for Laura Branigan, previously best-known for singing the disco-pop classic &quot;Gloria&quot;. Narrowly missing the Top 10 on the U.S. pop chart, Branigan took the song to number one on the Adult Contemporary chart for three weeks. The two sought to work with each other again, and their next collaboration was when Bolton co-wrote &quot;I Found Someone&quot; for Branigan in 1985. Her version was only a minor hit, but two years later, Cher resurrected the song, and with it her own singing career. Bolton co-wrote several other songs for both singers.\nBolton would achieve his greatest success in the late eighties and early nineties as a singer in the adult contemporary/easy listening genre. One of his first major hits was his 1987 interpretation of the Otis Redding classic, &quot;(Sittin' On) the Dock of the Bay.&quot; Always interested in soul and Motown classics, Bolton's success with that song encouraged him to tackle the standard &quot;Georgia On My Mind,&quot; with which he had another hit. In 1991, Bolton released the album &quot;Time, Love &amp; Tenderness&quot;, which featured his Grammy award winning cover of &quot;When a Man Loves a Woman&quot;.\nMost of Bolton's recordings are original material;, however, he has also written songs for such artists as Conway Twitty,Barbra Streisand, Kiss, Kenny Rogers, Kenny G, Peabo Bryson and Patti LaBelle. Bolton's early songwriting collaborators included Doug James and Mark Mangold, and as his fame grew he began to cowrite with higher-profile writers such as BabyFace, Diane Warren, and Bob Dylan. As a singer, he has performed with PlÃƒÂ¡cido Domingo, Luciano Pavarotti, JosÃƒÂ© Carreras, Tony Cetinski, Lucia Aliberti, RenÃƒÂ©e Fleming, Zucchero, Patti LaBelle, CÃƒÂ©line Dion, Ray Charles, Percy Sledge, Wynonna Judd, and BB King.\nBolton's last Top 40 single in the US was the 1997 hit &quot;Go the Distance&quot; (featured in the Walt Disney motion picture Hercules), which peaked at #1 on the U.S. adult contemporary chart.\nBolton also hired conductor Larry Baird (orchestral musical director/conductor/arranger for The Moody Blues, Kansas, Three Dog Night, Al Jarreau, Alan Parsons) for his 2001 tour.\nIn March 2007, Bolton toured South Africa for the first time. He was the headline act at Jacaranda 94.2 FM's two day concert.\nBolton recorded the song &quot;New York, New York&quot; (also on his Bolton Swings Sinatra album), for an album which was recorded in five days, Over the Rainbow. This was for an episode of the TV series, Challenge Anneka. The proceeds from the album went to children's hospices across the UK. Bolton performed a duet entitled &quot;Il Mio Amico&quot; with the Italian singer Anna Tatangelo at the Sanremo Music Festival 2008. The song was originally sung by Tatangelo alone, but the duet version contained English lyrics as well. It is a song about the difficulties of being a homosexual in Italy, written by Tatangelo's partner, Gigi D'Alessio.\nBolton's album Only A Woman Like You was released in 2002. The title song was co-written by Shania Twain and with background vocals by Skyler Jett.\nBolton released an album in the UK on September 21, 2009 entitled One World One Love. The first single entitled 'Just One Love', was released on September 14. 2009. This new album is a collaboration with other artists such as Ne-Yo and Lady GaGa.\nIn 1993, he established the Michael Bolton Foundation (now the Michael Bolton Charities) to assist women and children at risk from the effects of poverty, emotional, physical, and sexual abuse. The foundation has provided over $3.7 million in funding to local and national charities.\nBolton also serves as the honorary chairman of Prevent Child Abuse America, the national chairman for This Close for Cancer Research, and a board member for the National Mentoring Partnership and the Joe DiMaggio Children's Hospital.\nIn March 2003, Bolton joined with Lifetime Television, Verizon Wireless, and many others to lobby on behalf of the National Coalition Against Domestic Violence, urging legislation to provide more assistance for victims of domestic violence, such as affordable housing options.\nBolton has received the Lewis Hine Award from the National Child Labor Committee, the Martin Luther King Award from the Congress of Racial Equality, and the Ellis Island Medal of Honor from the National Ethnic Coalition of Organizations. The Hollywood Chamber of Commerce also recognized Bolton with a star on the &quot;Hollywood Walk of Fame&quot; for his musical and charitable contributions.","torrent":{"xt":"urn:btih:5b9a5488a3c0c8a96da0c41b24aa29d20437b9bf","amp;dn":"Michael+Bolton+-+Greatest+Hits+1985-1995+%281995%29+%5BLOSSLESS+FLAC%5D%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b9a5488a3c0c8a96da0c41b24aa29d20437b9bf","infoHashBuffer":{"type":"Buffer","data":[91,154,84,136,163,192,200,169,109,160,196,27,36,170,41,210,4,55,185,191]},"announce":[],"urlList":[]}}