{"title":"War God series by David Weber (01-02)","uid":9666401,"size":3574006,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bec3a0320ed07f70253bc69d37964a93226880b&amp;dn=War+God+series+by+David+Weber+%2801-02%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"PirateBook","files":4,"time":1393381265,"description":"\nOath of Swords (War God #1)\n\nWhom the gods would recruit, they first tick off...\n\nOur Hero: The unlikely Paladin, Bahzell Bahnakson of the Horse Stealer Hradani. He's no knight in shining armor. He's a hradani, a race known for their uncontrollable rages, bloodthirsty tendencies, and inability to maintain civilized conduct. \n\nNone of the other Five Races of man like the hradani. Besides his ethnic burden, Bahzell has problems of his own to deal with: a violated hostage bond, a vengeful prince, a price on his head. He doesn't want to mess with anybody else's problems, let alone a god's. Let alone the War God's! \n\nSo how does he end up a thousand leagues from home, neck-deep in political intrigue, assassins, demons, psionicists, evil sorcery, white sorcery, dark gods, good gods, bad poets, greedy landlords, and most of Bortalik Bay? Well, it's all the War God's fault\n\n\nThe War God's Own (War God #2)\n\n&quot;THE ROAD HOME&quot;\nBahzell Bahnakson of the Horse Stealer hradani never wanted to be a champion of the War God. Unfortunately, Tomandk had insisted. Even more unfortunately, Bahzell's own sense of responsibility hadn't let him say, &quot;&quot;No.&quot;&quot; Which was how he found himself in the Empire of the Axe, where even people who didn't actively hate hradani regarded them with suspicion and fear. \n\nOf course, that was only the start of his problems. Next, there was the Order of Tomanak, many of whom were horrified by the notion that their deity had chosen a hradani as a champion . . . and intended to do something about it. And assuming he survived that, he had to go home-across three hundred leagues of bitter winter snow-to face a Dark God who threatened to destroy all hradani.\n\nThrow in the odd demon and brigand ambush, and add a powerful neighboring kingdom with no intention of letting Bahzell (or anyone else) save his people, and you have the makings of a really bad day. But one thing Bahzell has learned: a champion of Tomanak does what needs doing. And the people in his way had better move.\n\nGenre: Fantasy","torrent":{"xt":"urn:btih:5bec3a0320ed07f70253bc69d37964a93226880b","amp;dn":"War+God+series+by+David+Weber+%2801-02%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bec3a0320ed07f70253bc69d37964a93226880b","infoHashBuffer":{"type":"Buffer","data":[91,236,58,3,32,237,7,247,2,83,188,105,211,121,100,169,50,38,136,11]},"announce":[],"urlList":[]}}