{"title":"Bioactive Compounds from Natural Sources - Natural Products as L","uid":16021877,"size":170504425,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5bf6c86f5bce4284371b4bb7f997ab8bdf59fc43&amp;dn=Bioactive+Compounds+from+Natural+Sources+-+Natural+Products+as+L&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":6,"uploader":"clouderone","files":1,"time":1476346914,"description":"Bioactive Compounds from Natural Sources - Natural Products as Lead Compounds in Drug Discovery 2nd ed - C. Tringali (CRC, 2012).pdf\r\n\r\nThe first edition of Bioactive Compounds from Natural Sources was published in a period of renewed attention to biologically active compounds of natural origin. This trend has continued and intensified—natural products are again under the spotlight, in particular for their possible pharmacological applications. Largely focusing on natural products as lead compounds in drug discovery, Bioactive Compounds from Natural Sources, Second Edition: Natural Products as Lead Compounds in Drug Discovery is actually a completely new volume containing surveys of selected recent advances in an interdisciplinary area covering chemistry of natural products, medicinal chemistry, biochemistry, and other related topics.\r\n\r\nWritten by some of the most reputed scientists in the field, this second edition includes new chapters from authors who contributed to the first edition as well as many chapters compiled by new authors. Introducing the reader to strategies and methods in the search for bioactive natural products, this book covers topics including:\r\n\r\nNatural sources of bioactive compounds such as aquatic cyanobacteria, filamentous fungi, and tropical plants,\r\nThe tremendous potentiality of metabolic engineering of natural products biosynthesis\r\nThe contribution of emerging or developing technologies to the study of bioactive natural compounds, namely computational methods and circular dichroism\r\nThe potential of natural or natural-derived compounds for specific therapeutic applications: treatment of viral diseases, regulation of hypoxia-inducible factor, antimalarials, modulation of angiogenesis, and antitumor and wound-healing activity\r\nSelected examples of natural product families and related synthetic analogues, namely polyphenols and campthotecins\r\nCompiled for researchers and Ph.D. students working in interdisciplinary fields, this book will also be appreciated by readers without a background in chemistry interested in bioactive natural products, their biological and pharmacological properties, and their possible use as chemopreventive or chemotherapeutic agents. Conversely, the biological and pharmacological data and methods are accessible by chemists","torrent":{"xt":"urn:btih:5bf6c86f5bce4284371b4bb7f997ab8bdf59fc43","amp;dn":"Bioactive+Compounds+from+Natural+Sources+-+Natural+Products+as+L","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5bf6c86f5bce4284371b4bb7f997ab8bdf59fc43","infoHashBuffer":{"type":"Buffer","data":[91,246,200,111,91,206,66,132,55,27,75,183,249,151,171,139,223,89,252,67]},"announce":[],"urlList":[]}}