{"title":"Saturday Night Fever - Various Artists SiLvErDuSt-SeCtIoN8 320 k","uid":4844940,"size":183850256,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:5c6a5b4f739a9b231f8a794f7404d0d51f61f61b&amp;dn=Saturday+Night+Fever+-+Various+Artists+SiLvErDuSt-SeCtIoN8+320+k&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dodgerblue","files":20,"time":1239644817,"description":"Saturday Night Fever - Various Artists SiLvErDuSt-SeCtIoN8 320 kbps\nAlong with the success of the movie, the soundtrack, composed and performed primarily by The Bee Gees, became the number one best-selling soundtrack of all time. The cultural impact of Saturday Night Fever in the United States was tremendous. The Bee Gees had originally written and recorded the five original songs for the film, &quot;Stayin' Alive&quot;, &quot;Night Fever&quot; and &quot;How Deep Is Your Love&quot; (all performed by the Bee Gees), &quot;More Than A Woman&quot; (performed in the film in two different versions--one version by Tavares, and another by the Bee Gees), and &quot;If I Can't Have You&quot; (performed in the movie by Yvonne Elliman) as part of a regular album (they had no idea at the time they would be making a soundtrack). Two previously released Bee Gee songs, &quot;Jive Talkin'&quot; and &quot;You Should Be Dancing&quot;, are also included on the soundtrack. Other previously released songs from the disco era round out the music in the movie.\n\nIn addition to the Bee Gees' score, additional incidental music was composed and adapted by David Shire. Three of Shire's cues, &quot;Manhattan Skyline&quot;, &quot;Night on Disco Mountain&quot; (based on the classical piece &quot;Night on Bald Mountain&quot;), and &quot;Salsation&quot;, are included on the soundtrack album. Five additional cues, &quot;Tony and Stephanie&quot;, &quot;Near The Verrazano Bridge&quot; (both adapted from the Bee Gees' song &quot;How Deep Is Your Love&quot;), &quot;Barracuda Hangout&quot;, &quot;Death On The Bridge&quot;, and &quot;All Night Train&quot;, while heard in the film, remain unreleased on CD.\n\nThe soundtrack won a Grammy for Album of the Year.\n\nThe album was recently re-released on Reprise Records, as part of the Bee Gees' regaining control of their master tapes.\n\nIn 2003, the album was ranked number 131 on Rolling Stone magazine's list of the 500 greatest albums of all time.\n\nThe soundtrack hit the #1 spot on Billboard Music Chart's Pop Album and Soul Album charts. In 2003 the TV network VH1 named it the 57th greatest album of all time.\n\nSaturday Night Fever - The Original Movie Soundtrack was ranked 80th in a 2005 survey held by British television's Channel 4 to determine the 100 greatest albums of all time.\n\nThe album was the best-selling in history until 1984, when Michael Jackson's Thriller replaced it.\nTrack list\n1. Stayin' Alive - Bee Gees\n2. How Deep Is Your Love - Bee Gees\n3. Night Fever - Bee Gees\n4. More Than a Woman - Bee Gees\n5. If I Can't Have You - Yvonne Elliman\n6. Fifth of Beethoven - Walter Murphy\n7. More Than a Woman - Tavares\n8. Manhattan Skyline - David Shire\n9. Calypso Breakdown - Ralph MacDonald\n10. Night on Disco Mountain - David Shire\n11. Open Sesame - Kool &amp; the Gang\n12. Jive Talkin' - Bee Gees\n13. You Should Be Dancing - Bee Gees\n14. Boogie Shoes - KC &amp; the Sunshine Band\n15. Salsation - David Shire\n16. K-Jee - MFSB\n17. Disco Inferno - The Trammps \n","torrent":{"xt":"urn:btih:5c6a5b4f739a9b231f8a794f7404d0d51f61f61b","amp;dn":"Saturday+Night+Fever+-+Various+Artists+SiLvErDuSt-SeCtIoN8+320+k","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c6a5b4f739a9b231f8a794f7404d0d51f61f61b","infoHashBuffer":{"type":"Buffer","data":[92,106,91,79,115,154,155,35,31,138,121,79,116,4,208,213,31,97,246,27]},"announce":[],"urlList":[]}}