{"title":"The Gale Encyclopedia Of Mental Disorders[BBS]","uid":6611067,"size":15830694,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ce2fdbfb97f4ca1ac6477b5423b55671f25af89&amp;dn=The+Gale+Encyclopedia+Of+Mental+Disorders%5BBBS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1313594628,"description":"Mental illness is a major cause of disability in the U.S. Thirty million people visit physicians and two million spend time in hospitals every year because of mental disorders. The Gale Encyclopedia of Mental Disor ders provides a good overview of mental illness, psychotherapy, and other treatments. It includes both traditional and alternative therapies. Medical writers, pharmacists, and mental health professionals wrote and edited the 400 signed, alphabetical entries in the set.\n\nThe entries cover disorders (Anorexia nervosa, Schizophrenia); diagnostic procedures and techniques (Kaufman Short Neurological Assessment Procedure, Magnetic resonance imaging); therapies (Behavior modification, Electroconvulsive therapy); medicines and herbs (Paroxetine, St. John's Wort ); and related topics (Advance directives, Neurotransmitters ). Entries for disorders include a definition, description, causes and symptoms, demographics, diagnosis, treatments, prognosis, and prevention. Those for medications contain the definition, purpose, description, recommended dosage, precautions, side effects, and interactions. Entries for herbs and supplements have a leaf icon next to the heading. All entries have a resource list of print and electronic sources and organizations to contact. One hundred black-and-white photographs and charts illustrate the text. A color photo gallery repeated in both volumes has enhanced versions of some of the photographs. There are ample cross-references, making it easy to locate drugs, which are entered by generic name. Boxes with definitions of key terms help readers understand the material. A full glossary is at the end of volume 2. Users will find a symptom list here also. This list demonstrates patterns that are linked to various disorders.\n\n\n\n# Hardcover: 1000 pages\n# Publisher: Thomson Gale; 1 edition (December 2002)\n# Language: English\n# ISBN-10: 0787657689\n# ISBN-13: 978-0787657680","torrent":{"xt":"urn:btih:5ce2fdbfb97f4ca1ac6477b5423b55671f25af89","amp;dn":"The+Gale+Encyclopedia+Of+Mental+Disorders%5BBBS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ce2fdbfb97f4ca1ac6477b5423b55671f25af89","infoHashBuffer":{"type":"Buffer","data":[92,226,253,191,185,127,76,161,172,100,119,181,66,59,85,103,31,37,175,137]},"announce":[],"urlList":[]}}