{"title":"BBC Crusades (1995) DVDrip documentary","uid":4515225,"size":2901335184,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5cf43999e6fdf3d312c127c04e8f557179024e84&amp;dn=BBC+Crusades+%281995%29+DVDrip+documentary&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"K1L0GR4m","files":-1,"time":1226946236,"description":"Of all the wars waged in the name of God, none has ever matched the arrogance and conceit of the Christian Crusades. For nearly two centuries (1095-1291), this medieval &quot;holy war&quot; variously raged, sometimes so spiritually misshapen by rapaciousness, murder, and political greed that to think it all had to do with Christian faith is absurd. And really, there is no one better to dramatize such a theater of holy war than Wales-born Terry Jones, host of The Discovery Channel&amp;#039;s Ancient Inventions and an accomplished medievalist. Best known for his absurdist contributions to all things Monty Python--he was a founding member of Monty Python&amp;#039;s Flying Circus and cowriter of Monty Python and the Holy Grail, Life of Brian, and Monty Python&amp;#039;s The Meaning of Life, among others--Jones wields an uncanny ability to explain the methodologies and madness of the Crusades while not failing us his sense of humor.\n\nJones wrote the scripts for each 50-minute presentation in the four volumes of The Crusades, which originally aired on The History Channel. His narration is not without an occasional sardonic air, almost of the roll-your-eyes type, which not only lends a skeptical perspective to a frequently misunderstood era in Western Europe, but also quite frequently editorializes the events that occurred between Pope Urban II&amp;#039;s call for liberation of Jerusalem from the &quot;infidels&quot; of Islam and the embarrassing moment when officers of the fourth Crusade are conned out of its divine calling by the Venetians. While Jones&amp;#039;s reconnaissance is sometimes oversimplified by casually not mentioning several Crusade sorties after the fourth (there were several, but by the 13th century they had become redolent of ennui and misguided commercial adventure), the technical ingenuity of the production and Jones&amp;#039;s use of anecdote backed by academicians and preserved eyewitness accounts cinches a viewer&amp;#039;s interest. Medieval &quot;siege machines&quot; are re-created to test their mettle against legends of famous battles, Jones dons real 11th- and 12th-century armor to demonstrate the outlandish appearance of Crusaders in the lands of Mohammed, mosaics come to life with body-painted characters of medieval fable, and computer graphics are deployed to re-create the interior of the great cathedral at Cluny.\n\nAll these elements are contrasted with intermezzos of contemporary European and Middle Eastern society and a moving original soundtrack to make The Crusades a thoroughly engaging documentary of the bloodletting of medieval Christian conquests and the ultimate result of Islamic fanaticism born from its crimson tide. In Jones&amp;#039;s own words at the end of Volume IV: &quot;It took 200 years for the Crusaders to create [this] Muslim fanaticism. It was the exact imitation of Christian intolerance.&quot; To understand the effects of the Crusades is to understand much of today&amp;#039;s religious geography, and Mr. Jones and company can fairly lay claim to having helped set the record straight. --Jamie Friddle ","torrent":{"xt":"urn:btih:5cf43999e6fdf3d312c127c04e8f557179024e84","amp;dn":"BBC+Crusades+%281995%29+DVDrip+documentary","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5cf43999e6fdf3d312c127c04e8f557179024e84","infoHashBuffer":{"type":"Buffer","data":[92,244,57,153,230,253,243,211,18,193,39,192,78,143,85,113,121,2,78,132]},"announce":[],"urlList":[]}}