{"title":"Bernard Williams - In the Beginning Was the Deed. Realism and Mo","uid":10426501,"size":1049531,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5d20a2163b305505827c770613f4b801fc887dec&amp;dn=Bernard+Williams+-+In+the+Beginning+Was+the+Deed.+Realism+and+Mo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Anette14","files":-1,"time":1403711453,"description":"Description\nProduct Details\nBook Title: In the Beginning Was the Deed: Realism and Moralism in Political Argument\t\nBook Author: Bernard Williams (Author), Geoffrey Hawthorn (Editor)\nHardcover: 200 pages\nPublisher: Princeton University Press (August 22, 2005)\nLanguage: English\nISBN-10: 0691124302\nISBN-13: 978-0691124308\n\n===================================================================================\nBook Description\nPublication Date: August 22, 2005\nBernard Williams is remembered as one of the most brilliant and original philosophers of the past fifty years. Widely respected as a moral philosopher, Williams began to write about politics in a sustained way in the early 1980s. There followed a stream of articles, lectures, and other major contributions to issues of public concern--all complemented by his many works on ethics, which have important implications for political theory.\nThis new collection of essays, most of them previously unpublished, addresses many of the core subjects of political philosophy: justice, liberty, and equality; the nature and meaning of liberalism; toleration; power and the fear of power; democracy; and the nature of political philosophy itself. A central theme throughout is that political philosophers need to engage more directly with the realities of political life, not simply with the theories of other philosophers. Williams makes this argument in part through a searching examination of where political thinking should originate, to whom it might be addressed, and what it should deliver.\nWilliams had intended to weave these essays into a connected narrative on political philosophy with reflections on his own experience of postwar politics. Sadly he did not live to complete it, but this book brings together many of its components. Geoffrey Hawthorn has arranged the material to resemble as closely as possible Williams's original design and vision. He has provided both an introduction to Williams's political philosophy and a bibliography of his formal and informal writings on politics.\nThose who know the work of Bernard Williams will find here the familiar hallmarks of his writing--originality, clarity, erudition, and wit. Those who are unfamiliar with, or unconvinced by, a philosophical approach to politics, will find this an engaging introduction. Both will encounter a thoroughly original voice in modern political theory and a searching approach to the shape and direction of liberal political thought in the past thirty-five years.\n\n===================================================================================\nReviews\n&quot;A splendid expression of Williamss distinctive outlook, which joined a conviction that moral argument is important in politics with an insistence that we keep our eyes firmly fixed on the real political world. . . . Sharp, funny and incisive.&quot;--Thomas Nagel, Times Literary Supplement\n\n&quot;In this collection, as in all of his other works, Bernard Williams shows how much more interesting our philosophic reflections on the problems of human life can be when they begin with life's most mundane and unavoidable experiences.&quot;--Bernard Yack, Ethics\n\n&quot;Characteristically, all of the essays are closely argued, elegantly written, and strongly engaging. The book is a welcome addition to the literatures on the many issues it addresses.&quot;--Richard E. Flathman, Perspectives on Politics\n\n&quot;This collection of essays is well-written, challenging and highly enjoyable. It has the searching, inquisitive and witty style typical of its author, with scores of ideas and insights briefly alluded to without further development, making for engaging reading.&quot;--Chris Nathan, Oxonian Review\n\n===================================================================================\nFrom the Back Cover\n&quot;Williams was one of the most important philosophers of the late twentieth century. He managed to combine an extraordinary sense for a real philosophical problem with an equally impressive gift for keeping in touch with the deepest issues of human life. Each of the essays here identifies a topic on which one longs to hear Williams's views, articulated with his characteristic combination of humane learning and intellectual rigor.&quot;--Kwame Anthony Appiah, Princeton University\n\n&quot;Bernard Williams saw the moral dimensions of politics more deeply and more clearly than any thinker of his generation. His seminal essay The Idea of Equality, included here, exemplifies this gift. It exploded the conventional wisdom that equality of opportunity is a less demanding political ideal than is substantive equality. This opened the way for John Rawls and his successors to try to establish what genuine equality of opportunity in a just society could mean. In this, as in so many of the subjects treated in this sparkling and captivating volume, the long shadow of his influence will be with us for many years to come. Bernard Williams set the questions.''--Ian Shapiro, Yale University, author of The Flight from Reality in the Human Sciences\n\n&quot;All of Bernard Williams's characteristic brilliance and range is on display in these essays, which together form a volume of permanent value for anyone with an interest in contemporary philosophy and its engagement with the social and political world.&quot;--Richard Moran, Harvard University\n\n&quot;Bernard Williams saw the moral dimensions of politics more deeply and more clearly than any thinker of his generation. In so many of the subjects treated in this sparkling and captivating volume, the long shadow of his influence will be with us for many years to come.&quot;--Ian Shapiro, Yale University\n\n===================================================================================\nAbout the Author\nBernard Williams's books include &quot;Truth and Truthfulness&quot; (Princeton); &quot;Making Sense of Humanity&quot;; &quot;Morality&quot;; and &quot;Ethics and the Limits of Philosophy&quot;. At the time of his death in 2003, he was Fellow of All Souls College, University of Oxford. Geoffrey Hawthorn is Professor of International Politics at the University of Cambridge.\n===================================================================================","torrent":{"xt":"urn:btih:5d20a2163b305505827c770613f4b801fc887dec","amp;dn":"Bernard+Williams+-+In+the+Beginning+Was+the+Deed.+Realism+and+Mo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d20a2163b305505827c770613f4b801fc887dec","infoHashBuffer":{"type":"Buffer","data":[93,32,162,22,59,48,85,5,130,124,119,6,19,244,184,1,252,136,125,236]},"announce":[],"urlList":[]}}