{"title":"Remigiusz Mroz - Chor Zapomnianych Glosow","uid":14860939,"size":637193355,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5d9dfd3a48cae36295d2a4fca3cf9c2f32babbca&amp;dn=Remigiusz+Mroz+-+Chor+Zapomnianych+Glosow&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"everdarksoul","files":82,"time":1465513425,"description":"Audiobook PL - 80 części /   \r\nrozmiar: 607 MB / czas: 14:40:54\r\nczyta: Wojciech Masiak\r\n\r\nRok 2014 w polskiej fantastyce był dość owocny - na dodatek wtedy też właśnie dwóch z czołówki polskich pisarzy powieści sensacyjnych i kryminalnych postanowiło &quot;nawiązać romans&quot; z fantastyką! Wydana w lutym jako (e-book) &quot;Królowa Głodu&quot; Wojciecha Chmielarza zdobyła bardzo wysokie noty wśród miłośników gatunku oraz krytyków - czy wydany w grudniu &quot;Chór Zapomnianych Głosów&quot; Remigiusza Mroza równie mocno przypadnie Wam do gustu?\r\nPowieść (po raz pierwszy jako lektor profesjonalny) czyta Wojtek Masiak - lektor, który zdobył już sobie rzeszę wielbicieli m.in. za podcast'y powieści ze światów &quot;WarHammer&quot; czy &quot;S.T.A.L.K.E.R&quot; - a którego amatorskie nagrania sygnowane były dotąd nickiem &quot;majselbaum&quot;.\r\n\r\nOkręt badawczy &quot;Accipiter&quot; przemierza bezkres kosmicznej próżni, a jego załoga pogrążona jest w głębokiej kriostazie. I tylko nieliczni świadomi są dramatu, który rozgrywa się na pokładzie...\r\nAstrochemik Håkon Lindberg budzi się przedwcześnie z kriogenicznego snu i widzi, jak ginie jeden z ostatnich załogantów. Prócz niego, rzeź przetrwał tylko nawigator, Dija Udin Alhassan.\r\nCzy to on jest odpowiedzialny za fiasko misji. A może stoi za tym jakaś niewypowiedziana siła..? Obca cywilizacja..? Nieokreślony byt..?\r\nLudzkość podróżuje między gwiazdami, odkrywa miriady światów - ale nigdy nie napotkała żadnych oznak życia...\r\n\r\n&quot;Chór Zapomnianych Głosów&quot; to SF z tempem właściwym powieściom sensacyjnym, intrygą iście kryminalną i klimatem rodem z horrorów! Zakończenie powinno zaskoczyć nawet najbardziej przewidującego czytelnika...\r\nPowieść jest pierwszą z zapowiadanego cyklu - pod tym samym tytułem","torrent":{"xt":"urn:btih:5d9dfd3a48cae36295d2a4fca3cf9c2f32babbca","amp;dn":"Remigiusz+Mroz+-+Chor+Zapomnianych+Glosow","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d9dfd3a48cae36295d2a4fca3cf9c2f32babbca","infoHashBuffer":{"type":"Buffer","data":[93,157,253,58,72,202,227,98,149,210,164,252,163,207,156,47,50,186,187,202]},"announce":[],"urlList":[]}}