{"title":"Moon Knight Complete","uid":4259433,"size":1469625033,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5db16c45b1c097da2d9b8e90961562d788072a0c&amp;dn=Moon+Knight+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Rishab","files":138,"time":1214355523,"description":"Moon Knight (Marc Spector) is a fictional character appearing in comic books published by Marvel Comics. The character exists in Marvel\\&amp;#039;s main shared universe, known as the Marvel Universe. Created by Doug Moench and Don Perlin, he first appeared in Werewolf by Night #32 (August 1975).\n\nThe character debuted in the title Werewolf by Night #32 (August 1975), written by Doug Moench with art by Don Perlin, as an enemy of the title character in a two part story continuing in issue #33. The character proved popular with readers, and was granted a solo spot in Marvel Spotlight #28-29 (1976), written by Doug Moench with art by Don Perlin.\n\nDuring the early 1980s Moon Knight was one of the three \\&quot;direct distribution only\\&quot; Marvel titles, starting with issue #15. This series ended with issue #38. In 1985 there was a six-issue series called Moon Knight - Fist Of Khonshu. Then in 1989 Marc Spector: Moon Knight debuted. This ended in issue #60 (March 1994), written by Terry Kavanagh with art by Stephen Platt depicting his death. In 1992 Marc Spector: Moon Knight Special Edition #1 and Moon Knight: Divided We Fall were published, followed in January 1998 and January 1999 by two further four-issue limited series. A new Moon Knight ongoing series was launched in April 2006, written by Charlie Huston with art by David Finch.\n\nThis torrent contains \n1. Moon Knight Vol 1\n2. Moon Knight (Fist of Khonshu) Vol 2\n3. Marc Spector Moon Knight \n4. Moon Knight Vol 4\n5. High Strangers\n6. Moon Knight Specials\n\nMoon Knights apperances in other titles such as Marvel Spotlight and Marvel Two-In-One are not covered here.\n\nMoon Knight is another of Marvels dark vigilante very similiar to Batman. Both are normal humans posing as rich playboys and using high tech gadgetry in fighting crime.Both are schizophrenic. However Batman has a code against killing and Moon Knight as an ex-mercenary has no such issues. Moon Knight also gains superhuman strength as per the ascent and descent of moon. Moon Knight is an avatar of Egyptian god of moon and also has multiple personalities. His comics have a rather distinctive dark tone. Moon Knight is a character who has stood the test of time and is still here after three decades. ","torrent":{"xt":"urn:btih:5db16c45b1c097da2d9b8e90961562d788072a0c","amp;dn":"Moon+Knight+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db16c45b1c097da2d9b8e90961562d788072a0c","infoHashBuffer":{"type":"Buffer","data":[93,177,108,69,177,192,151,218,45,155,142,144,150,21,98,215,136,7,42,12]},"announce":[],"urlList":[]}}