{"title":"[Knitting] Toe-Up 2-at-a-Time Socks [Request]","uid":10584451,"size":58055284,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5dc290e6cba13df60b37a81971b5cb254f8dd4c3&amp;dn=%5BKnitting%5D+Toe-Up+2-at-a-Time+Socks+%5BRequest%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1405730243,"description":"Knitwear designer Melissa Morgan-Oakes revolutionized the world of sock-making with 2-at-a-Time Socks. Her ingenious approach showed delighted knitters how to simultaneously create two socks on a single circular needle. With that book, yarn enthusiasts said goodbye forever to second sock syndrome, the frustration of completing one beautiful hand-knit sock, only to remember that another must be made. Now, Morgan-Oakes turns the approach on its head or rather, its toe with Toe-Up 2-at-a-Time Socks. Knitters adore toe-up socks for both novelty and practicality. Knitters can try on the sock as they work, they never run out of yarn before the foot is complete, and they avoid needing the dreaded kitchener stitch to finish off the toe. Many swear that toe-up socks just plain feel more comfortable, too. Morgan-Oakes combines the pleasures of toe-up knitting with the convenience of her 2-at-a-time approach in 15 original designs for men, women, children, and babies. From the delicate and graceful ballerina sock to the kaleidoscopic, nubby peppercorn pattern, there is a style here for every pair of feet. For each pattern, Morgan-Oakes provides row-by-row instructions, charts for both large and small feet, and captivating, four-color photographs of the finished product. Readers arenï¿½t limited to these patterns, however. Once mastered, the technique can be applied to any sock pattern. With Toe-Up 2-at-a-Time Socks as their guide, knitters will rock the toe-up sock world, two-at-a-time, every time.","torrent":{"xt":"urn:btih:5dc290e6cba13df60b37a81971b5cb254f8dd4c3","amp;dn":"%5BKnitting%5D+Toe-Up+2-at-a-Time+Socks+%5BRequest%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5dc290e6cba13df60b37a81971b5cb254f8dd4c3","infoHashBuffer":{"type":"Buffer","data":[93,194,144,230,203,161,61,246,11,55,168,25,113,181,203,37,79,141,212,195]},"announce":[],"urlList":[]}}