{"title":"Return of Sabata (Western) {Lee Van Cleef} ]1971]","uid":7957122,"size":724033030,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5e097e93c8b2a9f23120f0ccd9226b776820ea7f&amp;dn=Return+of+Sabata+%28Western%29+%7BLee+Van+Cleef%7D+%5D1971%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"alien99","files":-1,"time":1356457398,"description":"No need to bring any Spaghetti or Sauce this one is buried in it, trying to find where i stashed the other 2 movies to this series to many damn hard drives to search in\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0067672/?ref_=fn_al_tt_2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0067672/?ref_=fn_al_tt_2&lt;/a&gt;\n\nStoryline\n\nMaster gunslinger Sabata arrives in Hobsonville, a town completely owned by McIntock, a robber baron who is taxing the inhabitants for the cost of future improvements to the town. Or that's what McIntock says he'll do with the money... \n\n\nUser Review\n\nThe plot of this film has to do with the town of Hobsonville where McIntock, a now prosperous miner and town over seer is taxing the people in order to get the money to build up their fair town into something special. Enter Sabata, who is following a trail that led him from a murder in a traveling circus to the town. Clearly there is a great deal of money at stake and Sabata smells something a miss as well as sensing that there is a buck to be made.\n\nThis is a rambling, often seemingly plot less, (comedic) western. You're a good way into the film before you realize what exactly is going on. There a good number of characters who are two timing or three timing each other and we get dragged into their machinations, and it seems that there really isn't a central story (or real villain), or at least a reason why Sabata is in the town, until the movie is about half over. Its not bad as such but towards the end of the first half you really do begin to wonder why you're watching the film.\n\nThe reason you're watching it is Lee Van Cleef. Van Cleef as Sabata is pure smart mouthed hero. He can't be beat and he knows it. He is a hero we'd all like to be, even if his motivations are questionable. Van Cleef goes along with the nonsense on screen and in the process makes it somehow okay to go along too.\n","torrent":{"xt":"urn:btih:5e097e93c8b2a9f23120f0ccd9226b776820ea7f","amp;dn":"Return+of+Sabata+%28Western%29+%7BLee+Van+Cleef%7D+%5D1971%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e097e93c8b2a9f23120f0ccd9226b776820ea7f","infoHashBuffer":{"type":"Buffer","data":[94,9,126,147,200,178,169,242,49,32,240,204,217,34,107,119,104,32,234,127]},"announce":[],"urlList":[]}}