{"title":"Speed MP3 Downloader 2.1.6.2","uid":6443151,"size":8671688,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5e0f4f433cd5f11b7b4bb09336a8c69db2e88e6a&amp;dn=Speed+MP3+Downloader+2.1.6.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1307038046,"description":"Speed MP3 Downloader 2.1.6.2\n\nSpeed MP3 Downloader is really a hear-and-get tool, via which you can fast obtain unlimited amount of high quality MP3. It has the largest collection of high quality music, and allows you to search your favorites in tags, such as indie, hip-hop, classical. etc.\n\nYou can even search the live, piano, guitar or cover editions of your favorite songs, e.g. the live concert albums of your favorite band. All songs are in the MP3 format and can be played on any computer or on any MP3 Player including iPod, iPhone, cell phone, etc. Moreover, it also recommends the USA AIRPLAY HOT 100 each week and supports all digital players including iPod, cellphone, etc.\n\nSpeed MP3 Downloader is a simple and neat utility for indexing and downloading your favorite music from Internet. The application is so user-friendly that anybody can use it; it just takes a few clicks and less than 5 seconds to bring you the search results.\n\nSpeed MP3 Downloader brings you music by means of searching the public audio sites. Something you'll definitely love in this program is that it can run many searches in parallel. Users can also pretest the downloading MP3 files; if the files are not what they are looking for, users can stop downloading immediately to avoid wasting time.\n\nHome Page - http://www.speedmp3downloader.com\n\n","torrent":{"xt":"urn:btih:5e0f4f433cd5f11b7b4bb09336a8c69db2e88e6a","amp;dn":"Speed+MP3+Downloader+2.1.6.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e0f4f433cd5f11b7b4bb09336a8c69db2e88e6a","infoHashBuffer":{"type":"Buffer","data":[94,15,79,67,60,213,241,27,123,75,176,147,54,168,198,157,178,232,142,106]},"announce":[],"urlList":[]}}