{"title":"Richard Gere collection Nights in Rodanthe (2008)(NL multisubs) ","uid":6848390,"size":3895375222,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5e333999d45d852b73a1af0dc42e3aea6002828b&amp;dn=Richard+Gere+collection+Nights+in+Rodanthe+%282008%29%28NL+multisubs%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Mad_Parrot","files":-1,"time":1322428837,"description":"\n\nRichard Gere collection Nights in Rodanthe (2008)  \n\n\n\n\nVerenigde Staten / AustraliÃƒÂ«\nDrama / Romantiek\n97 minuten\n\ngeregisseerd door George C. Wolfe\nmet Richard Gere, Diane Lane en James Franco\n\n\nNederlands:\n\nEen film geregisseerd door George C. Wolf, gebasseerd op een roman van Nicholas Sparks, (Message In A Bottle, en The Notebook). \nMooie verfilming, de beelden zijn prachtig en de bijpassende soundtrack is een lust voor het oor. \nActeurs Richard Gere en Diane Lane zijn voor de derde keer gezamenlijk te zien. Eerder speelden ze samen in The Cotton Club en Unfaithful.\nOp het moment dat het leven van Adrienne Willis totaal op zijn kop staat, besluit zij zich terug te trekken in het rustieke Rodanthe in North Carolina aan de kust van de Verenigde Staten. \nZe beheert de herberg van een vriendin voor een weekend en hoopt de rust te vinden om na te denken over de conflicten die spelen in haar leven: \neen echtgenoot die haar heeft verlaten en weer thuis wil komen en een tienerdochter voor wie ze niets goed kan doen.\n\nOp het moment dat Adrienne in Rodanthe aankomt wordt een storm voorspeld en arriveert ook dr. Paul Flanner, de enige andere gast die verblijft in de herberg.\nVoor hem is het niet zomaar een weekend weg: Paul is naar Rodanthe gekomen om een eigen gewetenscrisis onder ogen te zien. \nDoor de storm komen ze nader tot elkaar en beleven ze een ingrijpende romance met een onverwachte wending. \n\n\nEngels:\n\n\nAdrienne Willis, a woman with her life in chaos, retreats to the tiny coastal town of Rodanthe, in the Outer Banks of North Carolina, to tend to a friend's inn for the weekend. \nHere she hopes to find the tranquility she so desperately needs to rethink the conflicts surrounding her -- a wayward husband who has asked to come home, \nand a teen-aged daughter who resents her every decision. \nAlmost as soon as Adrienne gets to Rodanthe, a major storm is forecast and a guest named Dr. Paul Flanner arrive. \nThe only guest at the inn, Flanner is not on a weekend escape but rather is there to face his own crisis of conscience. \nNow, with the storm closing in, the two turn to each other for comfort and, in one magical weekend, \nset in motion a life-changing romance that will resonate throughout the rest of their lives.\n\n\n\nSpotinformatie \n\nCategorie     : Beeld \nFormaat       : DVD5 \nBron          : Retail\nMenu          : Ja\nAudio         : Engels Spaans Duits DD 5.1\nExtra's       : Nee\nOndertitels   : Nederlands Engels Deens Zweeds Fins Duits Noors Portugees Spaans\nCover &amp; label : Ja\nGenre         : Drama\n\n\n &lt;a href=&quot;\nhttp://www.moviemeter.nl/film/46443&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.moviemeter.nl/film/46443&lt;/a&gt;\n\n\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0956038/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0956038/&lt;/a&gt;\n\n\n\nVerrast???? \n\n\nKom eens kijken bij \n\n\n\nwww.black-sam.org","torrent":{"xt":"urn:btih:5e333999d45d852b73a1af0dc42e3aea6002828b","amp;dn":"Richard+Gere+collection+Nights+in+Rodanthe+%282008%29%28NL+multisubs%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e333999d45d852b73a1af0dc42e3aea6002828b","infoHashBuffer":{"type":"Buffer","data":[94,51,57,153,212,93,133,43,115,161,175,13,196,46,58,234,96,2,130,139]},"announce":[],"urlList":[]}}