{"title":"Drugs, Poisons, and Chemistry {BBS}","uid":6703740,"size":3930971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5e6009f7527ea1830007f4fa3f3005c34c963a74&amp;dn=Drugs%2C+Poisons%2C+and+Chemistry+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1317081042,"description":"Forensic chemists and toxicologists work with drugs and poisons, but they each start with different evidence. Forensic chemists working in a crime lab must determine if the physical evidence they receive is an illegal substance such as marijuana or cocaine. They are also responsible for samples-including fire debris, soil, paint, glass, explosives, and fibers-obtained from suspected arson crimes. Toxicologists, on the other hand, work with biological evidence such as blood, saliva, urine, and feces, using analytical chemistry to identify chemical traces and unmetabolized drugs. They often work in labs associated with a medical examiner's office or a hospital.\n\nDrugs, Poisons, and Chemistry touches on all aspects of forensic chemistry, including how it developed and what it includes today. This useful new book covers a short history of forensic chemistry, detailing the story of arsenic and those who developed effective tests to detect it. Delving into the tools and techniques used by forensic chemists-ranging from such familiar tools as the microscope to slightly more obscure tools as the use of antibodies to detect toxins-this comprehensive resource provides a thorough examination of these three main areas of forensic chemistry.\n\n\n\n\n# Hardcover: 124 pages\n# Publisher: Facts on File; 1 edition (November 2008)\n# Language: English\n# ISBN-10: 0816055106\n# ISBN-13: 978-0816055104\n","torrent":{"xt":"urn:btih:5e6009f7527ea1830007f4fa3f3005c34c963a74","amp;dn":"Drugs%2C+Poisons%2C+and+Chemistry+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5e6009f7527ea1830007f4fa3f3005c34c963a74","infoHashBuffer":{"type":"Buffer","data":[94,96,9,247,82,126,161,131,0,7,244,250,63,48,5,195,76,150,58,116]},"announce":[],"urlList":[]}}