{"title":"Married.With.Children.Season.2(UKB-RG-BINGOWINGZ)","uid":6362207,"size":4050465834,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5ec82e96bab428d4413a5f7d8b26c254eec1b7b2&amp;dn=Married.With.Children.Season.2%28UKB-RG-BINGOWINGZ%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":".BONE.","files":26,"time":1304372178,"description":"Release Title: Married.With.Children.Season.2(UKB-RG-BINGOWINGZ)\nTV Air Date: 1987\nGenre: Comedy\nRunTime: 24 Minutes x22\nNumber Of Episodes: 22\n8PatD.png\nThe Bundys are a stereotypical &quot;white trash&quot; American family.\nAl is a shoe salesman who is fond of frequently reliving his\ndoubtful 15 seconds of fame on the football field.\nAl is terrified of the all-to-frequent amorous advances his\nditsy wife Peggy, a woman who must spend most of Al's wages\nat the salon and the mall. They have two children: Kelly,\nthe stunning but superficial party animal, and Bud, who is\ntoo wrapped up in himself to realize his goal of &quot;scoring&quot;\nwith a girl.\n\nEpisodes:\n\nEpisode 1: Poppy's by the Tree: Part 1\nOriginal Air Date 27 September 1987\n\nThe Bundys take a vacation to near-beautiful Dumpwater, Florida and stay\nin a cut-rate motel where an ax murderer that hates tourists, shows up\nevery five years since 1967, and redneck locals begin to make bets on who\nthe psycho will strike next.\n\nEpisode 2: Poppy's by the Tree: Part 2\nOriginal Air Date 27 September 1987\n\nAfter a hair-raising encounter with the maniac, Al decides to get the\nfamily out of town. But they realize that they are trapped at the motel\nby a storm and the locals are unwilling to help them. Then things take\na turn when Peggy is taken hostage by the ax murderer in a room and\nAl must rescue her.\n\nEpisode 3: If I Were a Rich Man\nOriginal Air Date4 October 1987\n\nSteve takes Al to the vault at the bank where Steve works for a secret\nafter-hours card game, and the next day, one million dollars is reported\nmissing. Al is then treated like a king by Peggy and the kids as well\nas hostility from Steve all of whom mistakenly think Al stole the money.\n\nEpisode 4: Buck Can Do It\nOriginal Air Date 11 October 1987\n\nAl is loathed to have Buck the dog neutered despite being threatened\nwith lawsuits from numerous neighbors regarding Buck's\n&quot;nocturnal carnal activities&quot; and resulting in &quot;stupid, ugly puppies&quot;\nfrom their dogs. Eventually, Al caves into the pressure by Peggy to\nhave Buck neutered, but only to change his mind from a bizarre dream\nhe has involving the self-loathing, non-monogamous stud that Buck is,\nsince Al himself used to be a zooming stud that he got famous for.\n\nEpisode 5: Girls Just Wanna Have Fun: Part 1\nOriginal Air Date 18 October 1987\n\nWhile Al and Steve are occupied by a female employee who fixes the Bundy's\nrefrigerator, Peggy invites Marcy to a strip club with the girls.\n\nEpisode 6: Girls Just Wanna Have Fun: Part 2\nOriginal Air Date 18 October 1987\n\nMarcy loses her composure and her wedding ring when it slips into a dancer's\nbriefs when she slips him a tip. Desperate to keep the news from Steve,\nMarcy sets out distracting him every chance she gets. However, Zorro the\nStripper suddenly shows up at Al's house and returns Marcy's wedding ring\nto him, who gives it to Steve and tells him about where Marcy was the\nother night.\n\nEpisode 7: For Whom the Bell Tolls\nOriginal Air Date 25 October 1987\n\nAl gets heated up over the large phone bill and refuses to pay it, which\nresults in the disconnection of the Bundy phone line, making him the target\nof hostility from Peggy, the kids and the Rhoades who now take the Bundys\nphone calls on their phone, especially the ones from Peggy's mother.\nTo make matters worse, there's a streetlight that is also bothering Al\nwhich is keeping him awake every night.\n\nEpisode 8: Born to Walk\nOriginal Air Date 1 November 1987\n\nAl flunks his written drivers test the same day that Kelly passes hers,\nleading him confined to the house and unable to get to the racetrack to\nbet on an important horse race.\n\nEpisode 9: Alley of the Dolls\nOriginal Air Date 8 November 1987\n\nVictory seems assured when Steve agrees to join the Bundys for a family\nteam bowling match against Peggy's arch rival from high school, Mimi,\nand her obnoxious family. But Bud reveals that he doesn't know how to\nbowl because he has squandered his bowling lesson money, prompting\nSteve to coach Bud on the pointers of bowling.\n\n\nEpisode 10: The Razor's Edge\nOriginal Air Date 15 November 1987\n\nSteve returns home having grown a beard from a week-long rafting trip.\nHe and Marcy get into a huge argument over his reluctance to shave it\noff, leading him to move in with the Bundys.\n\nEpisode 11: How Do You Spell Revenge?\nOriginal Air DateÃƒÂ¹22 November 1987\n\nAl, Peggy and Bud are part of a shopping mall softball team playing other\nmall teams. After losing a few too many games, Al demands that Peggy improve\nher softball skills or she is off his team. Meanwhile, Kelly's new boyfriend,\nBrian, asks her to prove her love to him by getting a tattoo.\n\n\nEpisode 12: Earth Angel\nOriginal Air Date 6 December 1987\n\nThere's a new light in the neighborhood when Bud brings home an attractive,\nfree spirited, 21-year-old artist named Tiffany on her way to art school in\nNew York and everyone likes her, except Marcy for Tiffany steals the attentions\nof Steve as well.\n\nEpisode 13: You Better Watch Out\nOriginal Air Date 20 December 1987\n\nThe Bundys' Christmas is rudely interrupted when a parachuting mall Santa\ncrash-lands into their backyard, attracting the neighborhood kids.\n\nEpisode 14: Guys and Dolls\nOriginal Air DateÃƒÂ¹10 January 1988\n\nWhen starting a baseball card collection, Al and Steve sell Marcy's old\nBarbie doll. They must get it back, but they learn the shop they sold it\nto was robbed, so they would have to search downtown Chicago and ask every\nbum on the street.\n\nEpisode 15: Build a Better Mousetrap\nOriginal Air Date 24 January 1988\n\nAl's attempts to get rid of a rodent in the Bundy house end badly.\n\nEpisode 16: Master the Possibilities\nOriginal Air Date 7 February 1988\n\nAl, under the impression that you don't have to pay for anything you didn't\norder, takes Peggy and Bud on a wild spending spree, and goes with Peggy to a\nfancy hotel for a weekend getaway when the mailman accidentally leaves a new\ncredit card addressed to Buck the dog.\n\nEpisode 17: Peggy Loves Al - Yeah, Yeah, Yeah\nOriginal Air Date 14 February 1988\n\nOn Valentines Day, Kelly hauls in a load of Valentines, while Steve plans\nto give Marcy a trip to Hawaii. When Marcy finds out from Peggy, she plans\nto give Steve his Valentine present by jumping out of a life-size cake.\nMeanwhile, Bud holds a vigil by the mailbox waiting for his first Valentine,\nwhile Peggy ponders over the decision on whether or not she'll get the gift\nshe wants from Al for him to say &quot;I Love You.&quot;\n\nEpisode 18: The Great Escape\nOriginal Air DateÃƒÂ¹21 February 1988\n\nThe Bundys stay at the shoe store after their houses is tented for termites.\nA grounded Kelly plots to escape and go to a rock concert.\n\nEpisode 19: Im-Po-Dent\nOriginal Air Date 28 February 1988\n\nMarcy regrets denting Steve's new car when he claims that she's made him impotent.\n\nEpisode 20: Just Married... with Children\nOriginal Air Date 6 March 1988\n\nWhile secretly going through Steve and Marcy's mail, Al and Peggy fill out\nan application to a TV game show called &quot;How Do I Love Thee&quot; where the\nobjective is a Bundy natural: surviving physical torture from one's spouse.\nAl and Peggy appear on the show pretending to be Steve and Marcy and they\neasily win many prizes. But when Steve and Marcy find out, they appear at\nthe end of the show pretending to be Al and Peggy, and the husband that\nsurvives the most torture in an electric chair wins a new car.\n\nEpisode 21: Father Lode\nOriginal Air Date 13 March 1988\n\nAfter going with Steve to the racetrack, Al is reluctant to reveal that\nhe won $1,200, because he knows that Peggy and the kids will take the money\nfor themselves. While Al tries to throw off Peggy's suspicions with sex,\nSteve asks for increasingly exuberant bribes of Al's racetrack winnings so\nhe will keep his mouth shut about the money.\n\nEpisode 22: All in the Family\nOriginal Air Date 1 May 1988\n\nAl's quiet three-day weekend plans to watch his favorite John Wayne movie\n&quot;Hondo&quot; are ruined when Peggy's eccentric relatives come to visit the Bundy\nhousehold. They include her unseen, super-obese mother, two feuding gay\nuncles; the hulking Irwin and the transvestite Otto, as well as a singing\nand dancing triplet aunts whose show biz career is threatened by Al's bad\nadvice to them. Al then interrupts and ruins a romantic evening between\nSteve and Marcy to confine with his problems.\nPSMdK.png\nsEK57.jpg\nF8i95.png\nEd O'Neill ... Al Bundy (261 episodes, 1987-1997)\nDavid Faustino ... Bud Bundy (260 episodes, 1987-1997)\nChristina Applegate ... Kelly Bundy (259 episodes, 1987-1997)\nKatey Sagal ... Peggy Bundy (254 episodes, 1987-1997)\nAmanda Bearse ... Marcy D'Arcy (248 episodes, 1987-1997)\nBuck Buck ... Buck the Dog (178 episodes, 1987-1995)\nTed McGinley ... Jefferson D'Arcy (168 episodes, 1989-1997)\n8qSNk.png\nORIGINAL Source: RS","torrent":{"xt":"urn:btih:5ec82e96bab428d4413a5f7d8b26c254eec1b7b2","amp;dn":"Married.With.Children.Season.2%28UKB-RG-BINGOWINGZ%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ec82e96bab428d4413a5f7d8b26c254eec1b7b2","infoHashBuffer":{"type":"Buffer","data":[94,200,46,150,186,180,40,212,65,58,95,125,139,38,194,84,238,193,183,178]},"announce":[],"urlList":[]}}