{"title":"Alexander.Hamilton.AudioBook.Ron.Chernow","uid":3804516,"size":2121911212,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:5f4538ccc812f30947a6ee53cabaf8477ddd91e8&amp;dn=Alexander.Hamilton.AudioBook.Ron.Chernow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tunglov","files":10,"time":1189624133,"description":"By Ron Chernow\nPublished 2004\nPenguin\nStatesmen/ United States\n/ Biography\n600 pages\nISBN 1594200092\n\n\n\nFrom National Book Award winner Ron Chernow, a landmark biography of Alexander Hamilton, the Founding Father who galvanized, inspired, scandalized, and shaped the newborn nation. Ron Chernow, whom the \\&quot;New York Times\\&quot; called \\&quot;as elegant an architect of monumental histories as we\\&amp;#039;ve seen in decades,\\&quot; now brings to startling life the man who was arguably the most important figure in American history, who never attained the presidency, but who had a far more lasting impact than many who did. An illegitimate, largely self-taught orphan from the Caribbean, Hamilton rose with stunning speed to become George Washington\\&amp;#039;s aide-de-camp, a member of the Constitutional Convention, coauthor of \\&quot;The Federalist Papers,\\&quot; leader of the Federalist party, and the country\\&amp;#039;s first Treasury secretary. With masterful storytelling skills, Chernow presents the whole sweep of Hamilton\\&amp;#039;s turbulent life: his exotic, brutal upbringing; his brilliant military, legal, and financial exploits; his titanic feuds with Jefferson, Madison, Adams, and Monroe; his illicit romances; and his famous death in a duel with Aaron Burr in July 1804. For the first time, Chernow captures the personal life of this handsome, witty, and perennially controversial genius and explores his poignant relations with his wife Eliza, their eight children, and numberless friends. This engrossing narrative will dispel forever the stereotype of the Founding Fathers as wooden figures and show that, for all their greatness, they were fiery, passionate, often flawed human beings. Alexander Hamilton was one of the seminal figures in our history. His richly dramatic saga, rendered in Chernow\\&amp;#039;s vivid prose, is nothing less than ariveting account of America\\&amp;#039;s founding, from the Revolutionary War to the rise of the first federal government.","torrent":{"xt":"urn:btih:5f4538ccc812f30947a6ee53cabaf8477ddd91e8","amp;dn":"Alexander.Hamilton.AudioBook.Ron.Chernow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f4538ccc812f30947a6ee53cabaf8477ddd91e8","infoHashBuffer":{"type":"Buffer","data":[95,69,56,204,200,18,243,9,71,166,238,83,202,186,248,71,125,221,145,232]},"announce":[],"urlList":[]}}