{"title":"Our Great Qing: The Mongols, Buddhism, and the State in Late Imp","uid":11739261,"size":2359545,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f914a02ad942f22a5a080811367fbcd8511200b&amp;dn=Our+Great+Qing%3A+The+Mongols%2C+Buddhism%2C+and+the+State+in+Late+Imp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425700926,"description":"Although it is generally believed that the Manchus controlled the Mongols through their patronage of Tibetan Buddhism, scant attention has been paid to the Mongol view of the Qing imperial project. In contrast to other accounts of Manchu rule, &quot;Our Great Qing&quot; focuses not only on what images the metropole wished to project into Mongolia, but also on what images the Mongols acknowledged themselves. Rather than accepting the Manchu's use of Buddhism, Johan Elverskog begins by questioning the static, unhistorical, and hegemonic view of political life implicit in the Buddhist explanation. By stressing instead the fluidity of identity and Buddhist practice as processes continually developing in relation to state formations, this work explores how Qing policies were understood by Mongols and how they came to see themselves as Qing subjects. In his investigation of Mongol society on the eve of the Manchu conquest, Elverskog reveals the distinctive political theory of decentralization that fostered the civil war among the Mongols. He explains how it was that the Manchu Great Enterprise was not to win over &quot;Mongolia&quot; but was instead to create a unified Mongol community of which the disparate preexisting communities would merely be component parts. A key element fostering this change was the Qing court's promotion of Gelukpa orthodoxy, which not only transformed Mongol historical narratives and rituals but also displaced the earlier vernacular Mongolian Buddhism. Finally, Elverskog demonstrates how this eighteenth-century conception of a Mongol community, ruled by an aristocracy and nourished by a Buddhist emperor, gave way to a pan-Qing solidarity of all Buddhist people against Muslims and Christians and to local identities that united for the first time aristocrats with commoners in a new Mongol Buddhist identity on the eve of the twentieth century","torrent":{"xt":"urn:btih:5f914a02ad942f22a5a080811367fbcd8511200b","amp;dn":"Our+Great+Qing%3A+The+Mongols%2C+Buddhism%2C+and+the+State+in+Late+Imp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f914a02ad942f22a5a080811367fbcd8511200b","infoHashBuffer":{"type":"Buffer","data":[95,145,74,2,173,148,47,34,165,160,128,129,19,103,251,205,133,17,32,11]},"announce":[],"urlList":[]}}