{"title":"Fuel Cell Science and Engineering: Materials, Processes, Systems","uid":9720420,"size":10274910,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ff6d52dd01f3fa9db7f11568a0052d00ae977bc&amp;dn=Fuel+Cell+Science+and+Engineering%3A+Materials%2C+Processes%2C+Systems&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1394226044,"description":"English | ISBN: 3527330127 | 2012 | PDF | 1268 pages | 10 MB\n\nFuel cells are expected to play a major role in the future power supply that will transform to renewable, decentralized and fluctuating primary energies. At the same time the share of electric power will continually increase at the expense of thermal and mechanical energy not just in transportation, but also in households. Hydrogen as a perfect fuel for fuel cells and an outstanding and efficient means of bulk storage for renewable energy will spearhead this development together with fuel cells. Moreover, small fuel cells hold great potential for portable devices such as gadgets and medical applications such as pacemakers.\n\nThis handbook will explore specific fuel cells within and beyond the mainstream development and focuses on materials and production processes for both SOFC and lowtemperature fuel cells, analytics and diagnostics for fuel cells, modeling and simulation as well as balance of plant design and components. As fuel cells are getting increasingly sophisticated and industrially developed the issues of quality assurance and methodology of development are included in this handbook. The contributions to this book come from an international panel of experts from academia, industry, institutions and government.\n\nThis handbook is oriented toward people looking for detailed information on specific fuel cell types, their materials, production processes,\nmodeling and analytics. Overview information on the contrary on mainstream fuel cells and applications are provided in the book\n'Hydrogen and Fuel Cells', published in 2010.","torrent":{"xt":"urn:btih:5ff6d52dd01f3fa9db7f11568a0052d00ae977bc","amp;dn":"Fuel+Cell+Science+and+Engineering%3A+Materials%2C+Processes%2C+Systems","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ff6d52dd01f3fa9db7f11568a0052d00ae977bc","infoHashBuffer":{"type":"Buffer","data":[95,246,213,45,208,31,63,169,219,127,17,86,138,0,82,208,10,233,119,188]},"announce":[],"urlList":[]}}