{"title":"Baroque Architecture (Art Ebook).pdf","uid":11102060,"size":66261100,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5ff75b5b907632210d404b764accce9580b20319&amp;dn=Baroque+Architecture+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"STBGD","files":-1,"time":1411680602,"description":"Pdf / English / 224 pages / 1979 Phaidon / 63.1 Mb\n\nThe History of World Architecture is one of Electa's history series, a milestone in the evolution of architecture books, owing to the make-up of each individual volume and especially to its international scope. The presence of authoritative scholars, the combination of texts and illustrations and the careful use of accurate yet accessible terms, have contributed to the series' worldwide popularity. Baroque Architecture examines the principal seventeenth-century architectural themes - &quot;capital city&quot;, &quot;church&quot; and &quot;palace&quot; - using the most famous examples of the period in Rome, Paris, Turin and Versailles. A large section is devoted to religious architecture, analysing works by Della Porta, Maderno, Mansart, Borromini, Bernini and Guarini, envisaged in both a local and European context. The book ends with a general survey of the diffusion of the Baroque in Europe up until the development of an &quot;international style&quot; in its various local versions.\n\nChristian Norberg-Schulz is an architect, critic and professor at the School of Architecture, Oslo University. He is well known internationally for his research on both ancient and contemporary architecture. Author's residence: Oslo, Norway.","torrent":{"xt":"urn:btih:5ff75b5b907632210d404b764accce9580b20319","amp;dn":"Baroque+Architecture+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5ff75b5b907632210d404b764accce9580b20319","infoHashBuffer":{"type":"Buffer","data":[95,247,91,91,144,118,50,33,13,64,75,118,74,204,206,149,128,178,3,25]},"announce":[],"urlList":[]}}