{"title":"The Innocence Mission - Befriended [2003] [FLAC]","uid":8203370,"size":207580993,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:603e51dda3b4f6b8433a8d7db48b6898bf86aaad&amp;dn=The+Innocence+Mission+-+Befriended+%5B2003%5D+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":12,"time":1362069415,"description":"This one is for my friend PO\n\nArtist: The Innocence Mission\nRelease: Befriended\nDiscogs: 2721739\nReleased: 2003-08-25\nLabel: Agenda\nCatalog#: AGN010CD\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: UK\nStyle: Rock, Indie Rock\n\nTracklisting:\n\n01. Tomorrow On The Runway (4:19)\n02. When Mac Was Swimming (3:47)\n03. I Never Knew You From The Sun (3:12)\n04. Beautiful Change (2:57)\n05. Martha Avenue Love Song (3:44)\n06. One For Sorrow, Two For Joy (4:03)\n07. No Storms Come (1:33)\n08. Sweep Down Early (4:20)\n09. Walking Around (4:49)\n10. Look For Me As You Go By (3:25)\n\nThe Innocence Mission possess enough precious quirks to effectively repel even the most charitable of corduroy- heavy, cat-owning bookstore clerks: the players met during their Catholic high school's production of Godspell, the band's singer/guitarist and singer/songwriter married not long after, and Karen Peris still consistently employs phrases like &quot;purity of heart&quot; to describe the Mission's soft, dulcet sound. But Befriended, the band's seventh full-length since forming in 1986, is pretty far from the unabashedly maudlin whining and sentimental gushes their circumstances suggest. Floating on the crushing strength of Peris' breathy, pitch-perfect coo, Befriended is a bucolic, nuanced bit of Sunday morning coffee-and-wistfulness, lovingly strummed acoustic guitars (augmented by the occasional organ line, sparingly applied upright bass, and light, flickering drums), rolling out time-tested chords with unwavering earnestness, revisiting the sweet, confessional early-70s folk of Joni Mitchell and the late-80s lilt of the Sundays and Cocteau Twins.\nThere's an inordinate amount of walking on this record, even for the acoustic neo-folk circuit: &quot;Walking around New Orleans/ Looking for a birthday cake,&quot; &quot;Now I walk for miles/ Into dark forests of piano songs,&quot; &quot;Walking through the world/ Walking under trees,&quot; &quot;We walk the whole two miles to Holly,&quot; or, on the purposefully-titled &quot;Walking Around&quot;, &quot;Walking around/ You know I've had enough of this trouble.&quot; And the verb isn't being evoked, exclusively, via lyric nods: musically, Befriended tugs along gently, contemplative and casual, sauntering purposefully but never building to a full-on sprint or, even, anxious trot. Rather than wearying, Befriended's consistent tempo allows for the formulation of a strikingly cohesive record, an extended stroll through an impressionistically- rendered New England autumn, pastoral and occasionally inspired.\n&quot;Tomorrow on the Runway&quot; sees Peris' sometimes childlike chirrup flitting easily from half-obscured whisper to confident bellow, while thick layers of scraped guitar and organ pile up; the slightly less melancholic &quot;When Mac Was Swimming&quot; is a sparse, airy piano-and-electric-guitar piece featuring a gently tapped tambourine as the sole percussive. &quot;Beautiful Change&quot; is the record's most dynamic cut, with Peris' vocals (here, echoing the Delgados' Emma Pollock) rising and falling dramatically over now- familiar guitar strums. There are certainly distinctions (both thematic and tonal) between each of the record's ten tracks, but Befriended plays best as an extended rumination, a thirty-six minute, singular experience.\nThe Innocence Mission's defining characteristic is their control, and if you can get past any secret desires to tear howling through the studio, knocking down drums and unplugging perfectly-positioned microphones, their restraint can be oddly engaging. Befriended might be comforting and invitingly docile, but it's also a rich, subtly textured record, executed with impressive grace.","torrent":{"xt":"urn:btih:603e51dda3b4f6b8433a8d7db48b6898bf86aaad","amp;dn":"The+Innocence+Mission+-+Befriended+%5B2003%5D+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"603e51dda3b4f6b8433a8d7db48b6898bf86aaad","infoHashBuffer":{"type":"Buffer","data":[96,62,81,221,163,180,246,184,67,58,141,125,180,139,104,152,191,134,170,173]},"announce":[],"urlList":[]}}