{"title":"Slint - Spiderland [24 bit FLAC] vinyl","uid":8343156,"size":869797363,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:603f756eaf086b2a3c6ac2a48d42372994c5c5a8&amp;dn=Slint+-+Spiderland+%5B24+bit+FLAC%5D+vinyl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"24.96","files":-1,"time":1365136982,"description":"  Slint - Spiderland (1991) [24 bit FLAC] vinyl\n\n  Released: 1991\n  Source: T&amp;G LP#64 / US\n  Genre: Pop/Rock\n  Style: Post-Rock, Indie Rock\n  Codec: FLAC\n  Bits Per Sample: 24\n  Sample Rate: 96,000 Hz\n\n  A1. Breadcrumb Trail 5:53 \n  A2. Nosferatu Man 5:31 \n  A3. Don, Aman 6:24 \n  B1. Washer 8:46 \n  B2. For Dinner... 5:02 \n  B3. Good Morning, Captain 7:36\n\n  More known for its frequent name-checks than its actual music, Spiderland remains one of the most essential and chilling releases in the mumbling post-rock arena. Even casual listeners will be able to witness an experimental power-base that the American underground has come to treasure. Indeed, the lumbering quiet-loud motif has been lifted by everybody from Lou Barlow to Mogwai, the album's emotional gelidity has done more to move away from prog-rock mistakes than almost any of the band's subsequent disciples, and it's easy to hear how the term &quot;Slint dynamics&quot; has become an indie categorization of its own. Most interestingly, however, is how even a seething angularity to songs like &quot;Nosferatu Man&quot; (disquieting, vampirish stop-starts) or &quot;Good Morning, Captain&quot; (a murmuring nod to &quot;The Rime of the Ancient Mariner&quot;) certainly signaled the beginning of the end for the band. Recording was intense, traumatic, and one more piece of evidence supporting the theory that band members had to be periodically institutionalized during the completion of the album. Spiderland remains, though, not quite the insurmountable masterpiece its reputation may suggest. Brian McMahan softly speaks/screams his way through the asphyxiated music and too often evokes strangled pity instead of outright empathy. Which probably speaks more about the potential dangers of pretentious post-rock than the frigid musical climate of the album itself. Surely, years later, Spiderland is still a strong, slightly overrated, compelling piece of investigational despair that is a worthy asset to most any experimentalist's record collection.","torrent":{"xt":"urn:btih:603f756eaf086b2a3c6ac2a48d42372994c5c5a8","amp;dn":"Slint+-+Spiderland+%5B24+bit+FLAC%5D+vinyl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"603f756eaf086b2a3c6ac2a48d42372994c5c5a8","infoHashBuffer":{"type":"Buffer","data":[96,63,117,110,175,8,107,42,60,106,194,164,141,66,55,41,148,197,197,168]},"announce":[],"urlList":[]}}