{"title":"The Case for Islamophobia - Walid Shoebat, Ben Barrakk","uid":11726738,"size":1310452,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6073f4c4e19885695809257a2f2c3717ec622115&amp;dn=The+Case+for+Islamophobia+-+Walid+Shoebat%2C+Ben+Barrakk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1425088153,"description":"\n\nSince the Muslim Brotherhood established itself in the United States through various groups, it has sought to exploit America's weakness: a sensitivity with respect to civil rights. Islamists in America have likened themselves to minorities who have been discriminated against and have used intimidation to silence criticism and dissent. That strategy has worked; Islamists have identified their critics as being on par with racists, people who are afflicted with &quot;Islamophobia.&quot; This book makes the case that the use of the word &quot;Islamophobia&quot; is nothing short of a bullying tactic.\n\nLearn how America's enemies have infiltrated us and used our own history against us. The goals of the Muslim Brotherhood are easy to understand for those who are brave enough to conquer their fear. The Brotherhood would have you believe that those who are critical of Islam are afraid of it while those who avoid it or who do not criticize it are brave. This is the lie exposed in the book. \n\n\nAbout the author:\nWalid Shoebat was born and raised in Bethlehem, Israel, by an Arab father and an American mother. His paternal grandfather was an associate of Haj-Ameen Al-Husseni, the Grand Mufti of Jerusalem, an ally of Adolph Hitler who conspired with the Nazis during the holocaust. His maternal great-grandfather, E.W. Georgeson, was Mayor of Eureka, CA, and a great friend of Winston Churchill, who wanted nothing more than the destruction of Hitler and Nazism.\n\nBen Barrack is a conservative, investigative talk show host and writer. Author of Unsung Davids: Ten Men who Battled Goliath without Glory. He has also worked for several years as executive producer of the Lynn Woolley show, a syndicated talk show heard across the state of Texas and currently also works in media publicity. Barrack's columns and articles have appeared on Breitbart's Big Peace and Big Government websites, World Net Daily, Pajamas Media, American Thinker, and Human Events","torrent":{"xt":"urn:btih:6073f4c4e19885695809257a2f2c3717ec622115","amp;dn":"The+Case+for+Islamophobia+-+Walid+Shoebat%2C+Ben+Barrakk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6073f4c4e19885695809257a2f2c3717ec622115","infoHashBuffer":{"type":"Buffer","data":[96,115,244,196,225,152,133,105,88,9,37,122,47,44,55,23,236,98,33,21]},"announce":[],"urlList":[]}}