{"title":"N. T. Wright - Paul and the Faithfulness of God (2-volume set)","uid":9246319,"size":2855061,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61a87231d50b24a63a6ab0f1b0413af0fc1d93db&amp;dn=N.+T.+Wright+-+Paul+and+the+Faithfulness+of+God+%282-volume+set%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"nedand","files":2,"time":1385379532,"description":"Thanks to a friend who shared this file with me two days ago!\n\nI am sharing this also in gratitude to pharmakate (http://thepiratebay.se/user/pharmakate/), workerbee (http://thepiratebay.se/user/workerbee/), livhre (http://thepiratebay.se/user/livhre/) and many others who have uploaded excellent works and enriched our libraries and lives!\n\n\n****************\n\nThis highly anticipated two-book fourth volume in N. T. Wright's magisterial series, &quot;Christian Origins and the Question of God&quot;, is destined to become the standard reference point on the subject for all serious students of the Bible and theology. The mature summation of a lifetime's study, this landmark book pays a rich tribute to the breadth and depth of the apostle's vision, and offers an unparalleled wealth of detailed insights into his life, times, and enduring impact.\n\nWright carefully explores the whole context of Paul's thought and activity? Jewish, Greek and Roman, cultural, philosophical, religious, and imperial? and shows how the apostle's worldview and theology enabled him to engage with the many-sided complexities of first-century life that his churches were facing. Wright also provides close and illuminating readings of the letters and other primary sources, along with critical insights into the major twists and turns of exegetical and theological debate in the vast secondary literature. The result is a rounded and profoundly compelling account of the man who became the world's first, and greatest, Christian theologian.\n\nProduct Details\nPaperback: 1700 pages\nPublisher: Fortress Press (November 1, 2013)\nLanguage: English\nISBN-10: 0800626834\nISBN-13: 978-0800626839\n\n&quot;Breath-taking, mind-expanding, ground-breaking, and more?it is easy to run out of adjectives to describe what N. T. Wright has already accomplished in his multi-volume account of New Testament history and theology. This fourth volume in the series is likewise a game-changer, above all for its adventurous presentation of Paul's ?mindset' and theology, so thoroughly contextualized at the confluence of the apostle's Jewish, Roman, and Greek worlds. This is Wright at his best?part historian, part exegete, part theologian, part pedagogue.&quot; -- Joel B. Green, Fuller Theological Seminary, California\n\nN. T. Wright is the former Bishop of Durham in the Church of England and one of the world's leading Bible scholars. He is now Research Professor of New Testament and Early Christianity at the University of St. Andrews and is a regular broadcaster on radio and television. He is the author of over sixty books, including The New Testament and the People of God (1992), Jesus and the Victory of God (1996), The Resurrection of the Son of God (2003), Pauline Perspectives (2013), and Paul and His Recent Interpreters (2013), all published by Fortress Press. \n\n\nPURCHASE: http://www.amazon.com/gp/product/0800626834/ref=as_li_ss_tl?ie=UTF8&amp;camp=1789&amp;creative=390957&amp;creativeASIN=0800626834&amp;linkCode=as2&amp;tag=izcharshi-20\n\nIf you are able, please support the authors and publishers by purchasing their work!\n\n~~~~~~~~~~~~~~~~~~~~~\n\nFor requests and questions, post in the Books, Comics &amp; Literature section of https://forum.suprbay.org!","torrent":{"xt":"urn:btih:61a87231d50b24a63a6ab0f1b0413af0fc1d93db","amp;dn":"N.+T.+Wright+-+Paul+and+the+Faithfulness+of+God+%282-volume+set%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61a87231d50b24a63a6ab0f1b0413af0fc1d93db","infoHashBuffer":{"type":"Buffer","data":[97,168,114,49,213,11,36,166,58,106,176,241,176,65,58,240,252,29,147,219]},"announce":[],"urlList":[]}}