{"title":"Travels With My Aunt (VHS letterbox) [1972] Maggie Smith","uid":6211687,"size":733125324,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:62c82deffaea6fbde73f417b76c83a4b9df62501&amp;dn=Travels+With+My+Aunt+%28VHS+letterbox%29+%5B1972%5D+Maggie+Smith&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ThorntonWilde","files":-1,"time":1299008140,"description":" &lt;a href=&quot;http://bayimg.com/jAedKAAdD&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/jAedKAAdD&lt;/a&gt;\n\nTravels with My Aunt (1972) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0069404/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0069404/&lt;/a&gt;\n\nTravels with My Aunt (1969) is a novel written by English author Graham Greene.\n\nThe novel follows the travels of Henry Pulling, a retired bank manager, and his eccentric Aunt Augusta as they find their way across Europe, and eventually even further afield. Aunt Augusta pulls Henry away from his quiet suburban existence into a world of adventure, crime and the highly-unconventional details of her past.\n\nTravels with My Aunt is a 1972 American comedy film directed by George Cukor. The screenplay by Jay Presson Allen and Hugh Wheeler is based on the 1969 novel of the same name by Graham Greene.\n\n  Maggie Smith  ...  Aunt Augusta Bertram  \n  Alec McCowen  ...  Henry Pulling  \n  Louis Gossett Jr.  ...  Zachary nicknamed 'Wordsworth' (as Lou Gossett)  \n  Robert Stephens  ...  Ercole Visconti  \n  Cindy Williams  ...  Tooley  \n  Robert Flemyng  ...  Crowder  \n  JosÃƒÂ© Luis LÃƒÂ³pez VÃƒÂ¡zquez  ...  Achille Dambreuse  \n  Raymond GÃƒÂ©rÃƒÂ´me  ...  Mario  \n  Daniel Emilfork  ...  Colonel Hakim  \n  Corinne Marchand  ...  Louise  \n  John Hamill  ...  Crowder's Man  \n  David Swift  ...  Police inspector John Sparrow  \n  Bernard Holley  ...  Bobby  \n  Valerie White  ...  Mme Dambreuse  \n  Antonio Pica  ...  Elegant Man  \n\nThe film was shot on location in England, France, Italy, Morocco, Spain, Turkey, and Yugoslavia.\n\nThe film's theme song, Serenade of Love, was written by Jackie Trent and Tony Hatch and performed by Petula Clark.\n\n\nFor his work in Travels With My Aunt (1972), costume designer Anthony Powell won two prizes: an Oscar and a close and enduring friendship with the film's star, Maggie Smith. Powell would also dress Smith in Death on the Nile (1978), Evil Under the Sun (1982) and Hook (1991), as well as creating sets and/or costumes for her stage appearances including Private Lives (1972) and Lettice and Lovage (1987). After bonding with the brilliant actress, Powell compared her hypersensitive spirit to flayed anatomy, with those missing layers of skin, stripped away to show the formature of muscles and bones. She is more scared of being touched and hurt than anyone I know. Powell, once a protege of John Gielgud, also won Oscars for Death on the Nile and Tess (1981), with additional nominations for Pirates (1986) and Hook (1991). Most recently he created Glenn Close's outrageous costumes for 102 Dalmatians (2000), as he had for 101 Dalmatians (1996).\n\nPowell came close to creating the extravagant wardrobe in Travels With My Aunt for Katharine Hepburn rather than Smith. Hepburn had agreed to star for director George Cukor in a movie version of Graham Greene's comic novel, about a fussy banker caught up in the eccentric adventures of his long-lost aunt. Greene himself had recommended it to her as a book made for films. After British playwright Hugh Wheeler created the first draft of a screenplay, noted screenwriter Jay Presson Allen (Cabaret, 1972) began rewrites.\n\nBut no version of the script pleased Hepburn. According to Cukor biographer Patrick McGilligan, Allen believed that, after the lackluster reception of Hepburn's performance in The Madwoman of Chaillot (1969), she simply didn't want to play another crazy old lady. Allen finally suggested to Hepburn that she rewrite the script herself, which she proceeded to do. Kate wrote and wrote, recalled Allen. But she [still] didn't want to play it. Finally MGM gave Hepburn an ultimatum, ordering her to report to the film set within 10 days. Hepburn said no and quit the project, providing the opening for Smith to take on the flamboyant role. Allen claimed later that only one speech of his remained in the screenplay and that the rest was written by Hepburn, who was denied screen credit because she was not a member of the Screen Writers Guild.\n\nTravels With My Aunt won three other Oscar nominations - for Best Actress (Smith), Art Direction and Cinematography. Cukor, like Powell, fell in love with Smith during filming and added the experience to his select list of favorite working relationships with actresses, along with Greta Garbo in Camille (1937), Vivien Leigh in Gone With the Wind (1939), Judy Garland in A Star Is Born (1954), Audrey Hepburn in My Fair Lady (1964) and Katharine Hepburn in anything.\n\n","torrent":{"xt":"urn:btih:62c82deffaea6fbde73f417b76c83a4b9df62501","amp;dn":"Travels+With+My+Aunt+%28VHS+letterbox%29+%5B1972%5D+Maggie+Smith","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62c82deffaea6fbde73f417b76c83a4b9df62501","infoHashBuffer":{"type":"Buffer","data":[98,200,45,239,250,234,111,189,231,63,65,123,118,200,58,75,157,246,37,1]},"announce":[],"urlList":[]}}