{"title":"Oracle 10.2 in vmware image (version 0.2, with oracle 10.2.0.4)","uid":4206241,"size":3878357184,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:62cc13981417dfd362152b4e1f129fa9f5414ad8&amp;dn=Oracle+10.2+in+vmware+image+%28version+0.2%2C+with+oracle+10.2.0.4%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"aerotux","files":1,"time":1211818639,"description":"\nThe torrent\n=========\n\nThis is a VMWare image of CENT OS Linux 5, with Oracle 10.2.0.4 Enterprise Edition installed.\n\nDISCLAIMER: This if for educational porpose only. CENT OS is a free software, Oracle can be download free (registration needed) from http://otn.oracle.com so I recommend you get this working on your own.\n\n\nQuick Start\n=========\n\nDownload, uncompress, run with VMWare Player/workstation. You&amp;#039;ll need 12.5GB for the uncompressed files.\n\nOS Users and passwords:\n  root/root\n  oracle/oracle\n\nOracle users and password:\n  sys, system, sysman, dbsnmp all with &quot;oracle&quot; password\n\nDB: ORACLE_SID DB1 is already created. Start as usual.\n\n\nRead ahead for detailed instructions.\n\nHOW TO\n=======\n\nStart the virtual machine. You can use VMWare player which is a free download. Double click on sles.vmx (don&amp;#039;t be distracted by the name, this is not a suse linux, it&amp;#039;s a Cent OS, but I base the configuration on a suse vm).\n\nNOTE: Virtual machine is setup to use 768Mb of memory. I don&amp;#039;t recommend downsizing this value, specially if using the DBConsole. Database uses less than that, so you can change it safetly to 512Mb, but the DBConsole won&amp;#039;t probably start.\n\nAfter starting the VM you should get to a graphical login.\n\nLogin as oracle and open a console. You have two ORACLE_HOMEs installed (run .bash_profile to choose one of them at any time from the oracle shell).\n\nFirst home (server on /u01/app/oracle/product/10.2/db_1) is where the database is software is installed and DB1 instance was created. All oracle users (sys, system, sysman, dbsnmp) were created with the &quot;oracle&quot; password.\n\nStart all with: \n\nListener: \n $ lsnrctl start\n\nDatabase: \n $ sqlplus /nolog\n SQL&gt; conn / as sysdba\n SQL&gt; startup;\n\nDB Console:\n $ emctl start dbconsole\n then open browser and go to https://localhost:5500/em  \n You can login as sys/oracle using the SYSDBA role.\n\nSecond home (client on /u01/app/oracle/product/10.2/client) has the Java Enterprise Manager console installed. This is a client/server tool to admin the database (works for previous releases too). From 11g this tool is no longer provided, but since it&amp;#039;s very popular as of today, I&amp;#039;m installing it here. Start it with $ oemapp dbconsole (just type oemapp to see all products available).\n\nListener only listen on localhost (127.0.0.1). To access the database from your network you&amp;#039;ll have to make sure that VMWare networking is working properly. By default it&amp;#039;s configured as &quot;Bridged networking&quot; (see vmware docs for details) and inside you see the network card as eth0, configure with DHCP. Once you can ping the box you can modify the listener.ora file and add the new IP to listen to, and restart it. DBConsole configuration to listen on that IP can be a bit tricky (try setting the iP on the ORACLE_HOSTNAME env var and then reconfigure with emca -reconfig dbconsole db). You can also access it with SSH port fowarding if you know how to do it.\n\nChangelog\n=========\n\nVersion 0.2\n  * Upgraded soft to 10.2.0.4 (db too)\n  * DB Console working.\n  * Linking of soft now works becouse of install of libstdc++.so.5\n  * Better &quot;documentation&quot; with torrent.\n\nVersion 0.1 \n\n  * First release: Vmware image with CentOS 5, xfce4, and oracle 10.2.0.3 (server and client). DB1 already created.\n  * Known bug: dbconsole not working properly.\n  * Posted on http://thepiratebay.se/tor/4039509/Oracle_10.2_in_vmware_image\n\nHelp\n====\n\nYou can post questions on the comments, althought I don&amp;#039;t see them so often, but maybe somebody else can help you.\nIf you need oracle support, you can search the web for help or you can have professional support from us by an email on the comments (good prices, senior dbas).\n","torrent":{"xt":"urn:btih:62cc13981417dfd362152b4e1f129fa9f5414ad8","amp;dn":"Oracle+10.2+in+vmware+image+%28version+0.2%2C+with+oracle+10.2.0.4%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62cc13981417dfd362152b4e1f129fa9f5414ad8","infoHashBuffer":{"type":"Buffer","data":[98,204,19,152,20,23,223,211,98,21,43,78,31,18,159,169,245,65,74,216]},"announce":[],"urlList":[]}}