{"title":"Ashlyn Book 5 The Highland Clan series by Keira Montclair","uid":15865184,"size":846138,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:62cca25fb30062697fd7d7099bb540546c219c62&amp;dn=Ashlyn+Book+5+The+Highland+Clan+series+by+Keira+Montclair&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"KiwiSue","files":3,"time":1474360904,"description":"ASHLYN Book 5 ~ The Highland Clan Book 5 by Keira Montclair\r\n\r\nA lass tortured by the past. A warrior who’s sworn never to love again.\r\n\r\nAshlyn was a wee lassie of eight summers when her mother brought her and her sister to live in the safety of Clan Grant. But despite the love and acceptance of her adoptive clan, Ashlyn is plagued by the past. Her continual nightmares—and her hatred of lads who hurt lasses—drive her to join the search for Ranulf MacNiven, an abuser of women. Ashlyn’s skills with the bow and her knowledge of MacNiven make her a natural fit for the mission, so her uncle, Chief Alexander Grant, gives her permission to join them, on one condition: she will be sent with a protector.\r\n\r\nMagnus never thought he would marry again after losing his beloved wife, but Ashlyn Grant is one of a kind. Her fiery nature creates an answering fire within him, and he longs to soothe her hurts and help heal her soul. When his chief assigns him to protect Ashlyn, he is determined to do his job well, even though the lass will not let him touch her, let alone protect her.\r\n\r\nTo their mutual surprise, the more time Magnus spends with Ashlyn, the more he gets through to her. But can two people who are determined not to fall in love hope to forge a future together?\r\n\r\nEnjoy","torrent":{"xt":"urn:btih:62cca25fb30062697fd7d7099bb540546c219c62","amp;dn":"Ashlyn+Book+5+The+Highland+Clan+series+by+Keira+Montclair","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62cca25fb30062697fd7d7099bb540546c219c62","infoHashBuffer":{"type":"Buffer","data":[98,204,162,95,179,0,98,105,127,215,215,9,155,181,64,84,108,33,156,98]},"announce":[],"urlList":[]}}