{"title":"Literary Knits: 30 Patterns Inspired by Favorite Books ","uid":9243786,"size":12450178,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6347351db372d3b137401fa75ce1af8663d3f887&amp;dn=Literary+Knits%3A+30+Patterns+Inspired+by+Favorite+Books+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385334834,"description":"30 projects inspired by classic literature\nFor pattern information and photos, visit the Literary Knits pattern page on ravelry.\n\nLiterary Knits features 30 knitting patterns inspired by beloved characters from classic books; from Pride and Prejudice to Moby Dick, The Catcher in the Rye to The Chronicles of Narnia--and many more in between.\nInspired by some of the most beloved characters from favorite books, the projects in this unique collection will inspire knitters and book lovers alike.\nEach knitting pattern includes precise instruction and robust information on yarn selection and substitution\nBeautiful photography throughout offers ideas and inspiration for all ages and skill levels, including supporting photos for tricky or less commonly-known techniques\nDiagrams, assembly instructions, and schematic illustrations ease completion of each project\nA generous mix of knitting patterns for women, men, and kids\nIf you're a book lover who knits, or a knitter with an appreciation for vintage patterns, Literary Knits is a timeless collection of one-of-a-kind knitting projects.","torrent":{"xt":"urn:btih:6347351db372d3b137401fa75ce1af8663d3f887","amp;dn":"Literary+Knits%3A+30+Patterns+Inspired+by+Favorite+Books+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6347351db372d3b137401fa75ce1af8663d3f887","infoHashBuffer":{"type":"Buffer","data":[99,71,53,29,179,114,211,177,55,64,31,167,92,225,175,134,99,211,248,135]},"announce":[],"urlList":[]}}