{"title":"The Apostle (Christian Movie)","uid":6585195,"size":735775984,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:636b4c8f4ddc57a87622123fb93ea8a43f0b0deb&amp;dn=The+Apostle+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"IndianChristian","files":3,"time":1312577021,"description":"The Apostle (Christian Movie)\n\n\n&quot;The Apostle&quot;, starring Robert Duvall is an outstanding film, breathtaking in its simplicity and yet imbued with complex and deeply etched characters, a stunning and realistic portrayal of life inside a southern Pentecostal Christian community, and an eloquent chronicle of one man's search for redemption.\n\nThe movie's premise is simple and effective. Euliss &quot;Sonny&quot; Dewey is a Pentecostal preacher who has everything: a loving wife and two adoring children; a doting mother; and a thriving ministry. He is respected and loved by his church community.\n\nBut Sonny also has a problem, he suspects his wife being involved in an adulterous relationship. And his wife is indeed having an affair with the youth minister in their church. When Sonny discovers the truth about his wife, his life unravels. \nHe is ousted as pastor of his church. One day, Sonny momentarily loses control, and in a drunken rage, smashes the youth minister's skull with a baseball bat.\n\nSonny flees from justice. Styling himself an itinerant preacher, he travels through rural southeastern Texas and into the bayou country of Louisiana. While he is traveling, he hears the voice of his conscience peck away at his vanity and worldly ways.\n\nThe majority of this beautiful film takes place in a small town in Louisiana's bayou country. Sonny, now self-baptized as &quot;The Apostle E.F.,&quot; sets about resurrecting a small Pentecostal church which had fallen into disuse after the retirement of its pastor. With an infectious smile, eternally effervescent personality, and obvious love for the Lord, the &quot;Apostle E.F.&quot; soon sets this bayou community on its ear. \n\nThe Apostle, however, is constantly aware of his past, as his conscience reminds him of the enormity of his crime. How he deals with the issue of balancing God's love with God's justice is perhaps the central theme of this marvelous film.\n\n&quot;The Apostle&quot; is a well crafted film which explores many issues confronting humanity: good versus evil; justice versus mercy; and virtue versus vice. This movie provides sensitive answers to pressing questions, and does so without ever becoming moralistic or &quot;preachy.&quot; With a top-shelf screenplay and first-rate performances by an excellent cast, The Apostle is wonderful entertainment, as well as a movie with an important message. \n\nUploading this on special request from many people.\n\nRuntime: 128 mins\nLanguage: English\nYear: 2011\nMy Rating: 10/10\nQuality: 10/10 \nFormat: avi format \n\nI would ask every Christian to do 2 things.\n\n1. If possible please buy this movie. Do you know that there are 2.2 billion Christians on earth today. But only a privileged \n\nfew, around 12% have the means and the accessibility to buy Christian films. Many Christians are too poor to buy movies or \n\nlive in places where Christian films are not available. \nThat's not all. Out of the 12% who have the means and accessibility to buy Christian media, only around 0.5% ever buys a \n\nChristian movie. In other words only 1 out of 200 Christians ever buys a Christian movie. Pathetic ins't it?\nPlease buy the movies to keep Christian films in business.\n\n2. Please seed the movies. If possible make copies and distribute to your poor neighbors. And please do pray for the movie \n\nmakers and their families. Remember the Kingdom of Heaven is in you and so is the choice of Heaven/Hell. \n\nPS: If you need any specific Christian movie or have something to say then kindly send a mail to \n\n&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;eb82858f828a8588839982989f828a85d9dbdbd2ab928a838484c58884c58285&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nKindly mention the subject as Christian Movies or something similar. \n\n&quot;Don't ask me what Christ can do for you! He has done all he could. Tell me what you can do for Christ?&quot;\n\nRe-Uploaded by Indian Christian\n","torrent":{"xt":"urn:btih:636b4c8f4ddc57a87622123fb93ea8a43f0b0deb","amp;dn":"The+Apostle+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"636b4c8f4ddc57a87622123fb93ea8a43f0b0deb","infoHashBuffer":{"type":"Buffer","data":[99,107,76,143,77,220,87,168,118,34,18,63,185,62,168,164,63,11,13,235]},"announce":[],"urlList":[]}}