{"title":"Mathematics for Computer Graphics","uid":4961184,"size":1846770,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:638249ba27e4eb2ca96918d48bc5471562867696&amp;dn=Mathematics+for+Computer+Graphics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1245319734,"description":"Baffled by maths? Then don't give up hope.\n\nJohn Vince will show you how to understand many of the mathematical ideas used in computer animation, virtual reality, CAD, and other areas of computer graphics.\n\nIn thirteen chapters you will rediscover - and hopefully discover for the first time a new way of understanding - the mathematical techniques required to solve problems and design computer programs for computer graphic applications. Each chapter explores a specific mathematical topic and takes you forward into more advanced areas until you are able to understand 3D curves and surface patches, and solve problems using vectors.\n\nAfter reading the book, you should be able to refer to more challenging books with confidence and develop a greater insight into the design of computer graphics software.\n\nGet to grips with mathematics fast - Numbers, Algebra, Trigonometry, Coordinate geometry, Transforms, Vectors, Curves and surfaces, Barycentric coordinates, Analytic geometry.\n\nThe book you will read once, and refer to over and over again!","torrent":{"xt":"urn:btih:638249ba27e4eb2ca96918d48bc5471562867696","amp;dn":"Mathematics+for+Computer+Graphics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"638249ba27e4eb2ca96918d48bc5471562867696","infoHashBuffer":{"type":"Buffer","data":[99,130,73,186,39,228,235,44,169,105,24,212,139,197,71,21,98,134,118,150]},"announce":[],"urlList":[]}}