{"title":"Sweet Deception - Joseph Mercola","uid":11704970,"size":667416,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63b69292ac27e7a8d420cd6c0f619cc3c489c048&amp;dn=Sweet+Deception+-+Joseph+Mercola&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424048377,"description":"Sweet Deception: Why Splenda, NutraSweet, and the FDA May Be Hazardous to Your Health\n\nMost people believe that sucralose (Splenda) is a perfectly safe artificial sweetener. Big business and the FDA have fostered that dangerous misconception. The truth is Splenda is by no means safe; and the same is true for many of the other artificial sweeteners being marketed today. Dr. Joseph Mercola---supported by extensive studies and research---exposes the fact that Splenda actually contributes to a host of serious diseases. Sweet Deception will lay out how the FDA really works for big food companies and should not be trusted when it comes to your health.\n\n\nAbout the Author:\nDr. Joseph Mercola is trained as a family physician but now focuses exclusively on natural medicine education. He has been interviewed by the major television networks and dozens of nationally broadcast radio shows. His website, Mercola.com, is the leading natural health site on the Internet.\n\nKendra Degen Pearsall, N.M.D., is a Naturopathic Medical Doctor (a primary care physician specializing in natural medicine) who graduated from Southwest College of Naturopathic Medicine, one of six Council of Naturopathic Medical Education (CNME) accredited, four-year naturopathic medical schools in North America","torrent":{"xt":"urn:btih:63b69292ac27e7a8d420cd6c0f619cc3c489c048","amp;dn":"Sweet+Deception+-+Joseph+Mercola","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63b69292ac27e7a8d420cd6c0f619cc3c489c048","infoHashBuffer":{"type":"Buffer","data":[99,182,146,146,172,39,231,168,212,32,205,108,15,97,156,195,196,137,192,72]},"announce":[],"urlList":[]}}