{"title":"FSI - Thai Basic Course - PDF Books and MP3 Audio","uid":5243000,"size":396495818,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:63c7c6fc34b2df396bbc5f30382d1c3227384eec&amp;dn=FSI+-+Thai+Basic+Course+-+PDF+Books+and+MP3+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jniska","files":6,"time":1261856214,"description":"Foreign Service Institute Thai Lessons 1970, PDF books and audio files.\n\n\nThe Foreign Service Institute (FSI) at the U.S. Department of State is the federal government's primary training institution for officers and support personnel of the U.S. foreign affiars community. They produced a series of books and accompanying audio tapes for the Thai language in 1970. The preface is by James R. Frith, Dean of the School of Language Studies at the FSI:\n\n\t\nThe FSI Thai Basic Course, Volumes I and II, provides introductory materials in modern spoken Thai for the student who wants to learn to Speak and understand the language used by an estimated 20 to 22 million people in Thailand.\n\nThe programmed introduction to Thai phonology which occupies the first 25 pages of Volume I is the work of Warren G. Yates, chairman of the Department of East Asian Languages at the Foreign Service Institute. Dr. Yates and Absorn Tryon, Thai language instructor at FSI, are co-authors of the 40 lessons comprising the core of the course.\n\nIn the early stages of the project, Richard B. Noss, then chairman of the FSI Department of East Asian Languages made valuable suggestions. The authors have made extensive use of Dr. Noss's Thai Reference Grammar in the preparation of these volumes, and users will find that they are often referred to for fuller explanations.\n\nMr. Prapas Kanchanandul contributed drills and assisted in matters of Thai language usage. Mrs. Tryon re-read the entire text of both volumes in Thailand in late 1969 and suggested changes to make the materials current.\n\nMrs. Phongchan Nabanchang collected and organized the items in the glossaries which appear at the end of each lesson and the the comprehensive glossary for both volumes which appears at the end of Volume I. Irma C. Ponce typed the camera copy of the entire text while Miss Chotchai Kambhu, Mr. Prasert Crupiti and Mr. Thaworn Jireivat assisted in proofreading, having previously participated in the classroom trials of the new materials in pre-publication form. Thai language textual material was tape recorded in the FSI Language Laboratory under the direction of Gary Alley with technical assistance from Jose M. Ramirez and Arthur Young.\n\nThe Foreign Service Institute gratefully acknowledges the financial assistance of the U.S. Office of Education which has made the preparation and publication of these volumes possible.\n\n1. Programmed Introduction to Thai Phonology, Warren G. Yates, 1970\nInstructions on pages xiv - xxxvi of Student Text vol. 1\t \n\nAll Phonology audio files\t19 mp3 files\n\n2. Student Text - vol. 1, Warren G. Yates and Absorn Tryon, 1970\npdf 426 pg.\t 9.83 MB\t\n\nAll Vol. 1 audio files\tzip\t20 mp3 files\n\n\n3.Student Text - vol. 2, Warren G. Yates and Absorn Tryon, 1970\t\npdf 421 pg.\n\nAll Vol. 2 audio files\tzip\t25 mp3 files\n\n4.Thai Reference Grammar, Richard B. Noss, 1964.\npdf 259 pg.\n","torrent":{"xt":"urn:btih:63c7c6fc34b2df396bbc5f30382d1c3227384eec","amp;dn":"FSI+-+Thai+Basic+Course+-+PDF+Books+and+MP3+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c7c6fc34b2df396bbc5f30382d1c3227384eec","infoHashBuffer":{"type":"Buffer","data":[99,199,198,252,52,178,223,57,107,188,95,48,56,45,28,50,39,56,78,236]},"announce":[],"urlList":[]}}