{"title":"Nayak (1966) - Satyajit Ray - BD Rip - 1080p - x264 - AC3 - Eng ","uid":9139361,"size":4727601166,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:6409836d35b40638eeeb8db6079e41efc687b064&amp;dn=Nayak+%281966%29+-+Satyajit+Ray+-+BD+Rip+-+1080p+-+x264+-+AC3+-+Eng+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":5,"uploader":"SaM","files":-1,"time":1383477651,"description":"\nDDR Presents\n\nA rip of the Artificial Eye Blu-Ray\n\nNayak - The Hero - (1966) - Bengali With English Subtitles\n(A film by Satyajit Ray)\n\nBD Rip - 4.4 GB (1 DVD) - x.264/mkv - AC3 (Jt Stereo)\n\n\n\n\n\nSCREENSHOTS\n &lt;a href=&quot;\nhttp://img5.imageshack.us/i/iwe3.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img5.imageshack.us/i/iwe3.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img21.imageshack.us/i/3t23.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img21.imageshack.us/i/3t23.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img11.imageshack.us/i/q4o2.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img11.imageshack.us/i/q4o2.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img855.imageshack.us/i/zmt1.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/i/zmt1.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img855.imageshack.us/i/paxm.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img855.imageshack.us/i/paxm.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img31.imageshack.us/i/nux7.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img31.imageshack.us/i/nux7.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img833.imageshack.us/i/7k4i.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img833.imageshack.us/i/7k4i.png/&lt;/a&gt; &lt;a href=&quot;\nhttp://img822.imageshack.us/i/s1xi.png/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img822.imageshack.us/i/s1xi.png/&lt;/a&gt;\n\n\nTech Specifications\n &lt;a href=&quot;\nhttp://imageshack.us/a/img31/2671/auz3.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://imageshack.us/a/img31/2671/auz3.png&lt;/a&gt;\n\n\n\n\nSynopsis:\nArindam Mukhopadhyay (Uttam Kumar) is a star and he has just been selected for a National Award for his performances. He cannot get a ticket on a flight and so decides to board the Rajdhani Express. On the train he meets a young lady Aditi, who edits a woman-centric magazine. She wants to interview him but he turns her away. Yet Arindam is a person torn by his memories and the uncertainity that is endemic in the world of films. He has seen many who have failed and been left by the wayside. As his insecurity grips him, he finds that the only person he can tell about himself is Aditi. As he lays bare his uncertainties, the story of his life unfolds and the human Arindam emerges.\n\nOn the sides are other characters. The ambitious PR firm chief Pritish Sarkar (Kamu Mukherjee) who desperately wants a contract from a pompous fellow passenger Haren Bose (Ranjit Sen) to the extent that he is not above asking his pretty wife Molly (Susmita Mukherjee) to cosy up to Bose, much to her disgust. The wife of Haren Bose who wants to impress Arindam but gets a polite rebuff and her daughter builds up a rapport with her idol. \n\nThe journey comes to an end and everyone must get back to the lives they lead. \n\nComments:\nWhat can you say about Nayak that hasn't already been said? My personal rating is that it is the fourth best film of Ray (after Pratidwandi, Charulata and Apur Sansar), just easing ahead of Pather Panchali. You may have a different opinion, but I doubt if anyone would rate this film anything below the fifth position. In its time it was a pathbreaking film, bringing out as it does, the human behind the Star, with all his frailties and strengths. Again an individual opinion, but I doubt if Uttam Kumar has ever done a better role. \n\nLike all of Ray's films, the ending is on a positive note. If Arindam gets an assurance that Aditi will not write about his warps, Aditi gets to know the man behind the Star - a no mean achievement. On the sidelines, Molly gets her husband to understand that she will not be the bait for his ambitious plans, but Pritish Sarkar (Kamu Mukherjee) too gets a new contract from an unexpected source. (The only thing surprising was that Pritish was angling for a INR 30,000/- contract. It was a large sum in 1966 but not enough to evince the kind of determination with which Pritish follows it up. But then Satyajit was never too clear about finances!). Overall the film ends with a warm feeling and this is quite in contrast to my three favourite Ray films (see above). The greatness of this film lies in its impeccable story telling, in the restraint in the direction and the remarkable ability of the Director to create and convey the tension within the hero, (and not tension between the hero and others).\n\nYou have to admire the camera work of Subrata Mitra in confined spaces and in night scenes. Camerawork is so good, the the Blu-Ray gives you details you would never expect in a 1966 film made with an arriflex camera. Equally impressive is the taut editing. The side-stories are given just the right amount of space. Anything else and they would have intruded into the main tale. There is nothing to dislike in this movie. there may be a few very small slips here and there but nothing mars the majestic film.\n\nUploader's Notes:\nThis is the rip of the Artificial Eye Blu-Ray Disk. Despite correspondence, Criterion could give no indicative date for the release of Nayak and so I ripped this Disk. If Criterion brings out their version of the film, I'll try and rip that one as well.\n\nThere is a wealth of detail in some parts of the clip and considerably less in some others. To counter this, I have reduced the extent of sharpening a little bit and smoothened the images. Don't get me wrong though. The detail is all there. (Take a good look at the images and you will understand). It is just that my priority was to enhance your viewing pleasure for the entire film and not for any specific parts. I have also retained a bit of the grain that was there in the original as it seemed more pleasing to my eye. I think you will like the end result. So lean back and enjoy!\n\nHowever, do remember that this is a 1080p rip. Please watch it from at least 3-4 feet from your computer screen to see the best image.\n\nIMDB Link:\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0060742/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0060742/&lt;/a&gt;","torrent":{"xt":"urn:btih:6409836d35b40638eeeb8db6079e41efc687b064","amp;dn":"Nayak+%281966%29+-+Satyajit+Ray+-+BD+Rip+-+1080p+-+x264+-+AC3+-+Eng+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6409836d35b40638eeeb8db6079e41efc687b064","infoHashBuffer":{"type":"Buffer","data":[100,9,131,109,53,180,6,56,238,235,141,182,7,158,65,239,198,135,176,100]},"announce":[],"urlList":[]}}