{"title":"School For Scandal from the Greewich Theatre (2009)","uid":15795051,"size":897007840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:646cc2521fbd3f219bb299bdb77192525c2508f8&amp;dn=School+For+Scandal+from+the+Greewich+Theatre+%282009%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"loninappleton","files":3,"time":1473447116,"description":"School For Scandal (2009)  Stage On Screen from The Greenwich Theatre, London\r\nFrom the play by Richard Brinsley Sheridan (produced 1777.)\r\nProduction of dvd date approximate.\r\n\r\nruntime 2 hrs 27 minutes\r\n\r\nNo IMDb reference\r\n\r\nSummary from the website (partial)\r\n\r\n&quot;The School for Scandal was written by Richard Brinsley Sheridan, with a prologue by \r\nthe famous actor David Garrick, and was first performed in 1777.\r\n\r\nIt’s the story of two brothers, one apparently a model citizen, the other a dissolute \r\nne’er-do-well. But as the play progresses and the scandal-mongering backfires, the \r\ntables are turned on the siblings.  An enduring classic that still hits home today...&quot;\r\n\r\n\r\nCast and Creatives\r\n\r\nDirected for the stage by   Elizabeth Freestone\r\nDirected for the screen by  Chris Cowey\r\n\r\nMaria                   Joanna Christie\r\nMr. Snake               Guy Burgess\r\nLady Sneerwell          Amy Rockson\r\nLady Teazle             Beatrice Curnew\r\nSir Peter Teazle        Jonathan Bettersby\r\nSir Benjamin Backbite   Gareth Kennerley\r\nOliver Surface          Mark Extance\r\nCharles Surface         Adam Redmore\r\nJoseph Surface          Samuel Collings\r\n\r\nComplete cast and creatives in the credit roll\r\n\r\nMy notes\r\n\r\n  Though theatre is and should always be for everyone,  this production\r\nshows how broad a production can be.  I'll give nothing away but the best referent I \r\ncan give is the Globe Theatre production of Twelfth Night where Mark Rylance stars in \r\nan original practices version as Lady Olivia.\r\n\r\n\r\n  This is the third of the Greenwich products I have in my fileshare collection.  As \r\nnoted previously, they are teaching editions in their packaged form and have this \r\nunique feature:  A third disk contains a Master Shot of the whole production from \r\nabove.  This allows for students to see how blocking is done and sets are changed.\r\n\r\n  The interval simply goes dark with more black screen than is needed.  I have made \r\nthe torrent in two parts.\r\n\r\n  English subtitles are available for those who wish to follow the performance with \r\ntext. Sheridan like Shakespeare produces dialog where the intricacy of the dialog \r\nmake subtitles a convenient addition.  In VLC or other player, subs can be found in the player's menu top of screen.\r\n\r\n  One note on Stage On Screen.  Please encourage them through their website\r\nto make these dvd boxes of Volpone,  The Duchess of Malfi and School for Scandal\r\nmore readily available.\r\n\r\n  This from the website:  &quot;The School for Scandal is now available to purchase on DVD \r\nor as paid downloads on YouTube.&quot;  The service is new since I last checked.  But \r\nthese plays are file shared for those who may not be in a position to use the services as paid clients.  Those who can, should.  You can find &quot;Volpone&quot; and &quot;The Duchess of Malfi&quot; under my login name.\r\n\r\nNotes written  September 09, 2016","torrent":{"xt":"urn:btih:646cc2521fbd3f219bb299bdb77192525c2508f8","amp;dn":"School+For+Scandal+from+the+Greewich+Theatre+%282009%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"646cc2521fbd3f219bb299bdb77192525c2508f8","infoHashBuffer":{"type":"Buffer","data":[100,108,194,82,31,189,63,33,155,178,153,189,183,113,146,82,92,37,8,248]},"announce":[],"urlList":[]}}