{"title":"Frank Herbert &amp; Bill Ransom - The Ascension Factor","uid":12005469,"size":206458155,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:649f2fff3abe25032677a8886f0af943fe09a8a5&amp;dn=Frank+Herbert+%26amp%3B+Bill+Ransom+-+The+Ascension+Factor&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":1,"time":1433863557,"description":"Frank Herbert &amp; Bill Ransom - The Ascension Factor (The Pandora Sequence #3) [AUDIBLE RIP]\n\nSet 25 years after The Lazarus Effect, this final book in the Destination: Void collaboration between Frank Herbert and Bill Ransom concludes the story of the planet Pandora.\n\nPandora's humans have been recovering land from its raging seas at an accelerated pace since The Lazarus Effect. The great kelp of the seas, sentient but electronically manipulated by humans, buffers Pandora's wild currents to restore land and facilitate the booming sea trade. New settlements rise overnight, but children starve in their shadows. An orbiting assembly station is near completion of Project Voidship, which is the hope of many for finding a better world.\n\nPandora is under the fist of an ambitious clone from hibernation called the Director, who rules with a sadistic security force led by the assassin Spider Nevi. Small resistance groups have had little effect on his absolute power. The Director controls the transportation of foodstuffs; uprisings are punished with starvation.\n\nThe resistance fighters' main hope is Crista Galli, a woman believed by some to be the child of God. Crista pools her talents with Dwarf MacIntosh, Beatriz Tatoosh, and Rico LaPush to transcend the barriers between the different species and overthrow the Director and the sinister cabal with which he rules.\n\n\nNarrated by: Scott Brick\nLength: 14 hrs and 9 mins \nSeries: The Pandora Sequence, Book 3\nUnabridged Audiobook\nRelease Date:04-21-15\nPublisher: Blackstone Audio","torrent":{"xt":"urn:btih:649f2fff3abe25032677a8886f0af943fe09a8a5","amp;dn":"Frank+Herbert+%26amp%3B+Bill+Ransom+-+The+Ascension+Factor","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"649f2fff3abe25032677a8886f0af943fe09a8a5","infoHashBuffer":{"type":"Buffer","data":[100,159,47,255,58,190,37,3,38,119,168,136,111,10,249,67,254,9,168,165]},"announce":[],"urlList":[]}}