{"title":"What I Learned Losing a Million Dollars -  Jim Paul PDF","uid":12782748,"size":43148546,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6531aab9bcff31d530604ba839a06a2394be5611&amp;dn=What+I+Learned+Losing+a+Million+Dollars+-++Jim+Paul+PDF&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1447819798,"description":"Jim Paul's meteoric rise took him from a small town in Northern Kentucky to governor of the Chicago Mercantile Exchange, yet he lost it all--his fortune, his reputation, and his job--in one fatal attack of excessive economic hubris. In this honest, frank analysis, Paul and Brendan Moynihan revisit the events that led to Paul's disastrous decision and examine the psychological factors behind bad financial practices in several economic sectors. This book--winner of a 2014 Axiom Business Book award gold medal--begins with the unbroken string of successes that helped Paul achieve a jet-setting lifestyle and land a key spot with the Chicago Mercantile Exchange. It then describes the circumstances leading up to Paul's $1.6 million loss and the essential lessons he learned from it--primarily that, although there are as many ways to make money in the markets as there are people participating in them, all losses come from the same few sources. Investors lose money in the markets either because of errors in their analysis or because of psychological barriers preventing the application of analysis. While all analytical methods have some validity and make allowances for instances in which they do not work, psychological factors can keep an investor in a losing position, causing him to abandon one method for another in order to rationalize the decisions already made. Paul and Moynihan's cautionary tale includes strategies for avoiding loss tied to a simple framework for understanding, accepting, and dodging the dangers of investing, trading, and speculating","torrent":{"xt":"urn:btih:6531aab9bcff31d530604ba839a06a2394be5611","amp;dn":"What+I+Learned+Losing+a+Million+Dollars+-++Jim+Paul+PDF","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6531aab9bcff31d530604ba839a06a2394be5611","infoHashBuffer":{"type":"Buffer","data":[101,49,170,185,188,255,49,213,48,96,75,168,57,160,106,35,148,190,86,17]},"announce":[],"urlList":[]}}