{"title":"The Bush Pilots - The Epic of Flight Series (History Ebook).pdf","uid":11534218,"size":16244676,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:657afc52998f961c874fb5d7d2ace55a288e8bfc&amp;dn=The+Bush+Pilots+-+The+Epic+of+Flight+Series+%28History+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1416609336,"description":"The Bush Pilots (The Epic of Flight)\nTime Life Books | 1983 | ISBN: 0809433125 | PDF | 184 pages | 15.4 MB\n\n\nOne day in 1932, pilot Bob Reeve, ferrying supplies to a remote Alaskan mining town, landed at his destination to find a grizzled miner eagerly awaiting his arrival. &quot;Got my moose?&quot; asked the oldtimer. It took Reeve a moment to recall that on his last trip he had promised to bring some snuff, a seemingly trivial request he had promptly forgotten. To his chagrin, the miner ignored his apologies and stalked off to proclaim that Reeve was &quot;no good&quot;--teaching the pilot a humiliating lesson in bush-flying etiquette: Always honor a promise. In sparsely populated areas around the globe, where a packet of needles or a pouch of tobacco was regarded as a luxury beyond compare, bush pilots like Reeve were a life line to the outside. And the farther they flew from civilization, the more they were appreciated. Mexican mine operators hired them to wing silver and gold past the bandits who lurked along the mountain trails traversed by slow mule train. Eskimos scrawled messages to friends in distant villages on the flimsy fuselages of bush planes. And in the barren Australian Outback, the citizens of one tiny town gathered to sweep the pebbles off an improvised landing strip so that a flier could make a smooth landing. Trappers and prospectors, missionaries and mountainmen, sportsmen and entrepreneurs in the most remote corners of the world during the first half of the 20th century all came to share one thing--their reliance on the bush pilots","torrent":{"xt":"urn:btih:657afc52998f961c874fb5d7d2ace55a288e8bfc","amp;dn":"The+Bush+Pilots+-+The+Epic+of+Flight+Series+%28History+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"657afc52998f961c874fb5d7d2ace55a288e8bfc","infoHashBuffer":{"type":"Buffer","data":[101,122,252,82,153,143,150,28,135,79,181,215,210,172,229,90,40,142,139,252]},"announce":[],"urlList":[]}}