{"title":"Trey Songz - I Invented/Say Aah  (2nafish)","uid":5271202,"size":135628804,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:65d373eb5d7a0a7becbd994b944600773a870853&amp;dn=Trey+Songz+-+I+Invented%2FSay+Aah++%282nafish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"2nafish","files":-1,"time":1263200515,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\n&quot;Say Aah&quot; is the fifth official single by Trey Songz. It is from the Trey Songz album Ready. It features rapper Fabolous. The music videos for &quot;I Invented Sex&quot; and &quot;Say Aah&quot; were filmed in New York with director Yolande Geralds.\n\nThe music video for the song was released along with the video to &quot;I Invented Sex&quot;. DJ Clue and Wynter Gordon make cameo appearances in the video. The full length video of &quot;Say Aah&quot; was released on January 4, 2010 from Trey Songz officialchannel. Produced by Kyle Anderson\n\nOn the week ending November 28, 2009, &quot;Say Aah&quot; debuted on the Billboard Hot 100 at #81. It has since reached #40 in its fourth week on the chart, and its fifth week the song rose up to #38, thus becoming Trey Songz first solo top forty hit off the album. The single currently sits at #34.\n\nTremaine Aldon Neverson (born November 28, 1984), better known by his stage name Trey Songz, is an American recording artist, producer and actor. He has released three studio albums: I Gotta Make It, Trey Day and Ready.\n\nReady is the third studio album by American recording artist Trey Songz. It was released on August 31, 2009. The album is nominated at the 52nd Grammy Awards, for Best Contemporary R&amp;B Album. \n\n    * &quot;Brand New&quot; is the first promo single for Ready.\n    * The lead single of the album was &quot;I Need a Girl&quot;, peaking at #59 on the Billboard Hot 100.\n    * The second official single is &quot;Successful&quot;, a collaboration with Drake and peaked at #17 on the Billboard Hot 100. The track also appears on Drake's EP So Far Gone. The video was shot in Toronto, and directed by Jake Davis. It is also second official single off So Far Gone.\n    * &quot;LOL :-)&quot; is the third official single off the album, it features Gucci Mane and Soulja Boy Tell 'Em, the song debuted and peaked at #51 on the Billboard Hot 100.\n    * &quot;I Invented Sex&quot;, featuring Drake is the fourth single and has peaked at #42 on the Billboard Hot 100 and has peaked at number 1 for the week of December 26,2009 on Billboard R&amp;B/Hip-Hop Charts.A music video has been filmed back-to-back along with &quot;Say Aah&quot;.\n    * A music video for the fifth official single, &quot;Say Aah&quot; featuring Fabolous has been filmed in New York with director Yolande Geralds. The single is currently at #34 on the Billboard Hot 100.\n    * A music video for &quot;Yo Side of the Bed&quot;, featuring Keri Hilson was filmed in November 2009.\n    * A music video for &quot;One Love&quot; was filmed in December 2009.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:65d373eb5d7a0a7becbd994b944600773a870853","amp;dn":"Trey+Songz+-+I+Invented%2FSay+Aah++%282nafish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65d373eb5d7a0a7becbd994b944600773a870853","infoHashBuffer":{"type":"Buffer","data":[101,211,115,235,93,122,10,123,236,189,153,75,148,70,0,119,58,135,8,83]},"announce":[],"urlList":[]}}