{"title":"David Kilcullen - The Accidental Guerrilla. Fighting Small Wars ","uid":10270813,"size":3927626,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:65fe41320a541f24822a64afa79ddab3b6bbf146&amp;dn=David+Kilcullen+-+The+Accidental+Guerrilla.+Fighting+Small+Wars+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1401584503,"description":"Description\nProduct Details\nBook Title: The Accidental Guerrilla: Fighting Small Wars in the Midst of a Big One\t\nBook Author: David Kilcullen\nHardcover: 384 pages\nPublisher: Oxford University Press, USA; 1 edition (March 16, 2009)\nLanguage: English\nISBN-10: 0195368347\n\n===================================================================================\nBook Description\nPublication Date: March 16, 2009 | ISBN-10: 0195368347 | Edition: 1\nDavid Kilcullen is one of the world's most influential experts on counterinsurgency and modern warfare. A Senior Counterinsurgency Advisor to General David Petraeus in Iraq, his vision of war dramatically influenced America's decision to rethink its military strategy in Iraq and implement &quot;the surge.&quot;\nNow, in The Accidental Guerrilla, Kilcullen provides a remarkably fresh perspective on the War on Terror. Kilcullen takes us &quot;on the ground&quot; to uncover the face of modern warfare, illuminating both the big global war (the &quot;War on Terrorism&quot;) and its relation to the associated &quot;small wars&quot; across the globe: Iraq, Afghanistan, the Philippines, Indonesia, Thailand, Chechnya, Pakistan and North Africa. Kilcullen sees today's conflicts as a complex pairing of contrasting trends: local social networks and worldwide movements; traditional and postmodern culture; local insurgencies seeking autonomy and a broader pan-Islamic campaign. He warns that America's actions in the war on terrorism have tended to conflate these trends, blurring the distinction between local and global struggles and thus enormously complicating our challenges. Indeed, the US had done a poor job of applying different tactics to these very different situations, continually misidentifying insurgents with limited aims and legitimate grievances (whom he calls &quot;accidental guerrillas&quot;) as part of a coordinated worldwide terror network. We must learn how to disentangle these strands, develop strategies that deal with global threats, avoid local conflicts where possible, and win them where necessary.\nColored with gripping battlefield experiences that range from the jungles and highlands of Southeast Asia to the mountains of the Afghanistan-Pakistan border to the dusty towns of the Middle East, The Accidental Guerrilla will, quite simply, change the way we think about war. This much anticipated book will be a must read for everyone concerned about the war on terror.\n\n===================================================================================\nEditorial Review\nFrom Publishers Weekly\nStarred Review. Kilcullen, adviser on counterinsurgency to General Petraeus, defines accidental guerrillas as locals fighting primarily because outsiders (often Westerners) are intruding into their physical and cultural space, but they may also be galvanized by high-tech, internationally oriented ideologues. This interaction of two kinds of nonstate opponents renders both traditional counterterrorism and counterinsurgency inadequate. Kilcullen uses Afghanistan and Iraq as primary case studies for a new kind of war that relies on an ability to provoke Western powers into protracted, exhausting, expensive interventions. Kilcullen presents two possible responses. Strategic disruption keeps existing terrorists off balance. Military assistance attacks the conditions producing accidental guerrillas. That may mean full-spectrum assistance, involving an entire society. Moving beyond a simplistic war on terror depends on rebalancing military and nonmilitary elements of power. It calls for a long view, a measured approach and a need to distinguish among various enemies. It requires limiting the role of government agencies in favor of an indirect approach emphasizing local interests and local relationships. Not least, Kilcullen says, breaking the terrorist cycle requires establishing patterns of virtue, moral authority, and credibility in the larger society. Kilcullen's compelling argument merits wide attention. (Mar.)\nCopyright Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved.\n\n===================================================================================\nReviews\n&quot;This book should be required reading for every American soldier, as well as anyone involved in the war on terror. Kilcullen's central concept of the 'accidental guerrilla' is brilliant and the policy prescriptions that flow from it important. And that's not all; the book has many more insights drawn from various battlefields.&quot; --Fareed Zakaria, Newsweek\n\n&quot;Kilcullen's compelling argument merits wide attention.&quot;--Publishers Weekly Starred Review\n\n&quot;David Kilcullen, man of action and man of ideas, has produced a rare--and indispensable--guide to understanding and winning the so-called 'war on terror' by combining ideas of military theory with those of culture and tradition among tribal peoples.&quot; --Professor Akbar Ahmed, Chair of Islamic Studies, American University, Washington DC.\n\n===================================================================================\nAbout the Author\nDavid Kilcullen was formerly the Senior Counterinsurgency Advisor to General David Petraeus in Iraq and later an advisor to General Stanley McChrystal in Afghanistan. He is currently an advisor to NATO. Kilcullen is also Adjunct Professor of Security Studies at the Johns Hopkins School of Advanced International Studies and a Fellow at the Center for a New American Security.\n===================================================================================","torrent":{"xt":"urn:btih:65fe41320a541f24822a64afa79ddab3b6bbf146","amp;dn":"David+Kilcullen+-+The+Accidental+Guerrilla.+Fighting+Small+Wars+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65fe41320a541f24822a64afa79ddab3b6bbf146","infoHashBuffer":{"type":"Buffer","data":[101,254,65,50,10,84,31,36,130,42,100,175,167,157,218,179,182,187,241,70]},"announce":[],"urlList":[]}}