{"title":"The Copper Scroll Joel C Rosenburg epub (steelballz)","uid":9390484,"size":1418008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66750aa86d076d0161c73b22c0d651170d31c46e&amp;dn=The+Copper+Scroll+Joel+C+Rosenburg+epub+%28steelballz%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"steelballz","files":-1,"time":1387876914,"description":"On June 1, 1956, the New York Times broke a story that captured the imagination of the world. Another Dead Sea Scroll had been found, descibing umimaginable treasures buried in the hills east of Jerusalem and under the holy city itself. But the scroll's code had to be broken, and experts on all sides warned that any effort by Israel to rebuild the Temple with the treasure would undoubtedly trigger a war of biblical proportions. Fifty years later, the world is about to be shocked again. New York Times best-selling author Joel C. Rosenberg takes you on his most exciting and heart-ounding ride yet ? as a new democratic Iraq rises, so, too, a new evil, and White House advisors Jon Bennett and Erin McCoy find themselves facing a terrifying threat triggered by an ancient mystery.\n\nSaddam is gone, Arafat is dead, and a new Iraq is rising. But when a suicide bomber strikes Washington and assassinations unfold from London to Los Angeles, Jon Bennett and Erin McCoy are drawn back into a world of terror they thought was over. At the heart of the mystery lies a 2,000-year-old scroll describing unimaginable treasures that could lead to the Third Jewish Temple. Some call it history's greatest treasure map. Others call it a road map to Armageddon. But the time to find the truth is running out fast. ","torrent":{"xt":"urn:btih:66750aa86d076d0161c73b22c0d651170d31c46e","amp;dn":"The+Copper+Scroll+Joel+C+Rosenburg+epub+%28steelballz%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66750aa86d076d0161c73b22c0d651170d31c46e","infoHashBuffer":{"type":"Buffer","data":[102,117,10,168,109,7,109,1,97,199,59,34,192,214,81,23,13,49,196,110]},"announce":[],"urlList":[]}}