{"title":"Freedom And Neurobiology (Searle).pdf","uid":4475269,"size":403686,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:66b1c859442b481bab39dad9dae576e251dfe1d6&amp;dn=Freedom+And+Neurobiology+%28Searle%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Luarazul","files":1,"time":1225312709,"description":"Product Description (from Amazon)\n\nReview\n&quot;This engaging small volume serves as a token reminder of how masterfully Searle manages to combine philosophical innovation with clarity of prose.&quot; -- Constantine Sandis, Metapsychology &quot;Clear and engaging.&quot; -- Randall J. Russac, Science Books and Films &quot;Searle is a beacon of accessible expertise, a throwback to a time when philosophy was part of the public debate.&quot; -- David Papineau, Times Literary Supplement &quot;[A] slim, elegantly written and intellectually rigorous volume.&quot; -- British Journal of Psychiatry &quot;A brief clearly articulated account by one the world&amp;#039;s foremost philosophers.&quot; --Henry Stapp, Journal of Consciousness Studies, Volume 15, No 7 (2008)\n\nProduct Description\nOur self-conception derives mostly from our own experience. We believe ourselves to be conscious, rational, social, ethical, language-using, political agents who possess free will. Yet we know we exist in a universe that consists of mindless, meaningless, unfree, nonrational, brute physical particles. How can we resolve the conflict between these two visions?In Freedom and Neurobiology, the philosopher John Searle discusses the possibility of free will within the context of contemporary neurobiology. He begins by explaining the relationship between human reality and the more fundamental reality as described by physics and chemistry. Then he proposes a neurobiological resolution to the problem by demonstrating how various conceptions of free will have different consequences for the neurobiology of consciousness. In the second half of the book, Searle applies his theory of social reality to the problem of political power, explaining the role of language in the formation of our political reality.The institutional structures that organize, empower, and regulate our lives-money, property, marriage, government-consist in the assignment and collective acceptance of certain statuses to objects and people. Whether it is the president of the United States, a twenty-dollar bill, or private property, these entities perform functions as determined by their status in our institutional reality. Searle focuses on the political powers that exist within these systems of status functions and the way in which language constitutes them.Searle argues that consciousness and rationality are crucial to our existence and that they are the result of the biological evolution of our species. He addresses the problem of free will within the context of a neurobiological conception of consciousness and rationality, and he addresses the problem of political power within the context of this analysis. A clear and concise contribution to the free-will debate and the study of cognition, Freedom and Neurobiology is essential reading for students and scholars of the philosophy of mind. ","torrent":{"xt":"urn:btih:66b1c859442b481bab39dad9dae576e251dfe1d6","amp;dn":"Freedom+And+Neurobiology+%28Searle%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66b1c859442b481bab39dad9dae576e251dfe1d6","infoHashBuffer":{"type":"Buffer","data":[102,177,200,89,68,43,72,27,171,57,218,217,218,229,118,226,81,223,225,214]},"announce":[],"urlList":[]}}