{"title":"Javelin - Hi Beams (2013) [FLAC]","uid":8236901,"size":225157530,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:671fd67c21ff0f037e02cdf117b476dcec5e9c11&amp;dn=Javelin+-+Hi+Beams+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1362857883,"description":"\n  Javelin - Hi Beams (2013) [FLAC]\n\n  Released: 2013\n  Duration: 31:19\n  Genre: Pop/Rock\n  Style: Indie Electronic, Experimental, Dance\n  Source: WEB\n  Codec: FLAC\n  Bit Rate: ~ 1,000 kbps\n  Bits Per Sample: 16\n  Sample Rate: 44,100 Hz\n\n  01 Light\n  02 Nnormal\n  03 Judgement Nite\n  04 Airfield Revised\n  05 Friending Revised\n  06 l'Ocean\n  07 Drummachines\n  08 City Pals\n  09 Garth Hudson\n  10 The Stars\n\n  The duo of Tom Van Buskirk and George Langford have seemingly approached previous Javelin records as a chance to be as giddy and silly as possible while still creating intricate, sample-based electronic songs that have some real funk and bounce. 2010's No Mas was something of a sampledelic classic, inspiring nothing but smiles and lots of head-shaking-in-disbelief moments. It would be nice to report that 2013's Hi Beams was the same kind of experience, but it's not. The duo changed their ways and decided to leave the bedroom and hit a real studio, writing real songs and using real equipment. Songs that are made to be played in concert, by musicians and not two guys hidden behind laptops. While it could be seen as a cynical move designed to siphon off some of Passion Pit's more adventurous fans, in actuality the album works. \n\n  The duo administer the same amounts of creativity and experimentation here, using lots of unique synth sounds, vocal treatments and quirky arrangements, only now the result is less silly and more serious. Turns out the guys are decent songwriters, too, with a bunch of tracks sounding radio-ready with sparkling verses and easy-to-sing-along-with choruses. &quot;Light Out&quot; is a rousing call to arms; &quot;Airfield&quot; is a glittery disco groover; &quot;L'Ocean&quot; has a super hooky stuttering beat, and the vocoder- and hip-hop-heavy ballad &quot;Normal&quot; is a low-key stunner. \n\n  Along with the club-friendly jams, they drop in straightforward love songs like the very sweet &quot;Drummachines,&quot; a song that sounds like ELO collaborating with Air (&quot;City Pals&quot;), a couple instrumentals that have some of the anything-goes spirit of their previous work (&quot;Garth Hudson&quot; and the very odd Jock Jams jam &quot;Judgement Nite&quot;), and a MGMT-meets-girl group track (&quot;The Stars&quot;) to close the album with a sunny smile. Added up, it's a departure for sure, but it's a swerve that's easy to follow. It'd be a shame if Javelin never returned to the silly, sample-filled side of their sound, if they totally bought into the idea of being a real band only. Still, they do it quite well on Hi Beams, and really give Passion Pit a run for their money. Maybe they even steal most of it.","torrent":{"xt":"urn:btih:671fd67c21ff0f037e02cdf117b476dcec5e9c11","amp;dn":"Javelin+-+Hi+Beams+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"671fd67c21ff0f037e02cdf117b476dcec5e9c11","infoHashBuffer":{"type":"Buffer","data":[103,31,214,124,33,255,15,3,126,2,205,241,23,180,118,220,236,94,156,17]},"announce":[],"urlList":[]}}