{"title":"Arctic Monkeys Whatever People Say I Am, Is What I Am Not 2006ak","uid":11677569,"size":67817028,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:676528c4b7111e46d265d7a73d46cc3ed21e44db&amp;dn=Arctic+Monkeys+Whatever+People+Say+I+Am%2C+Is+What+I+Am+Not+2006ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"analogkid6103","files":13,"time":1422939135,"description":"image\nThe young Uk band via Sheffield, England, tagged to be 'the next big thing,' finally make their first official impression upon the marketplace with Whatever People Say I Am, That's What I'm Not. After setting a buzz boulder hurtling downhill towards the 'swamp of hype' with a collection of ragged edged post-punk demos made available on the internet--the quartet have toured those demos into shape and re-recorded the best of the lot for their debut on Domino Records. With the older songs having been cleaned up and beefed up with a 'radio friendly' sonic punch, the album offers the now familiar &quot;I Bet You Look Good on the Dancefloor&quot;, &quot;Fake Tales of San Francisco&quot;, and &quot;A Certain Romance&quot; alongside new standouts &quot;Red Light Indicates Doors Are Secured&quot;, &quot;Still Take You Home&quot;, and &quot;The View From The Afternoon&quot;.\n\nThe future looks bright as with time the musical influences of The Strokes and lyrical influences of hip hop soften, weaken, and drop away with the band's growth in experience and skill. Led by nineteen year old, Alex Turner, the band's singer and lyricist shows a heavy dose of cynicism in his lyrics, particularly in &quot;Perhaps Vampires Is A Bit Strong But...&quot;. A song labeling some of the people the band has come into contact with since the Arctic Monkeys boulder started rolling, as vampires, or more succinctly, as leeches. Get used to it, Alex, the bigger the money, the bigger the leech. But it's to be expected, the songs are focused, danceable, and controversial--plus the band has captured the imagination of the young. A still raw and very good band with an impressive debut... it's a mass media wet dream.image Label : Domino Records\nStyle : AltRock\nQuality: VBR\nSongs : 13","torrent":{"xt":"urn:btih:676528c4b7111e46d265d7a73d46cc3ed21e44db","amp;dn":"Arctic+Monkeys+Whatever+People+Say+I+Am%2C+Is+What+I+Am+Not+2006ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"676528c4b7111e46d265d7a73d46cc3ed21e44db","infoHashBuffer":{"type":"Buffer","data":[103,101,40,196,183,17,30,70,210,101,215,167,61,70,204,62,210,30,68,219]},"announce":[],"urlList":[]}}