{"title":"UFO AI Alien Invasion v2.5 for Windows","uid":10500232,"size":1314162092,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:680de662d4306ea4b7eb4c929fa0b8d26f7a6999&amp;dn=UFO+AI+Alien+Invasion+v2.5+for+Windows&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"CCnOSnBT","files":-1,"time":1404685455,"description":"It is the year 2084. You control a secret organisation charged with defending Earth from a brutal alien enemy. Build up your bases, prepare your team, and dive head-first into the fast and flowing turn-based combat.\n\nUFO: Alien Invasion is a squad-based tactical strategy game in the tradition of the old X-COM PC games, but with a twist. The game combines military realism with hard science-fiction and the weirdness of an alien invasion. The carefully constructed turn-based system gives you pin-point control of your squad while maintaining a sense of pace and danger.\n\nOver the long term you will need to conduct research into the alien threat to figure out their mysterious goals and use their powerful weapons for your own ends. You will produce unique items and use them in combat against your enemies. If you like, you can even use them against your friends with our multiplayer functionality.\n\nUFO: Alien Invasion. Endless hours of gameplay - absolutely free.\n\nThe game takes a lot of inspiration from the X-COM series by Mythos and Microprose. However, it's neither a sequel nor a remake of any X-COM or other commercial title. What the developers as a team wanted to make is a brand new experience that tries to surpass the quality of games from 1992, rather than simply recreate them with flashier graphics.\n &lt;a href=&quot;\nhttp://ufoai.org/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ufoai.org/&lt;/a&gt;","torrent":{"xt":"urn:btih:680de662d4306ea4b7eb4c929fa0b8d26f7a6999","amp;dn":"UFO+AI+Alien+Invasion+v2.5+for+Windows","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"680de662d4306ea4b7eb4c929fa0b8d26f7a6999","infoHashBuffer":{"type":"Buffer","data":[104,13,230,98,212,48,110,164,183,235,76,146,159,160,184,210,111,122,105,153]},"announce":[],"urlList":[]}}