{"title":"Stevie Wonder 24 Bit Vinyl Pack","uid":8602215,"size":5669563428,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:68ed79d185efcfdaab6de822e0b8d944a46501c7&amp;dn=Stevie+Wonder+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1371914629,"description":"\n  BTC \n\n  1P3bCN55pmnKLvuqHJcsGWyAiu8eSZW3aZ\n\n\n  Stevie Wonder 24 Bit Vinyl Pack\n\n  * Genre: R&amp;B\n  * Styles: Funk, Motown, Pop-Soul, Soul, Album Rock, AM Pop\n  * Source: Vinyl\n  * Codec: FLAC\n  * Bit Rates: ~ 2,800 - 3,200 kbps\n  * Bit Depth: 24\n  * Sampling Rate: 96,000 Hz\n\n  Albums\n\n  * 1972 Talking Book (MFSL Silver Label)\n  * 1972 Music of My Mind\n  * 1973 Innervisions (Motown)\n  * 1976 Songs in the Key of Life\n  * 1980 Hotter Than July (MFSL Silver Label)\n\n  Artist Bio\n\n  * Stevie Wonder is a much-beloved American icon and an indisputable genius not only of R&amp;B but popular music in general. Blind virtually since birth, Wonder's heightened awareness of sound helped him create vibrant, colorful music teeming with life and ambition. Nearly everything he recorded bore the stamp of his sunny, joyous positivity; even when he addressed serious racial, social, and spiritual issues (which he did quite often in his prime), or sang about heartbreak and romantic uncertainty, an underlying sense of optimism and hope always seemed to emerge. Much like his inspiration, Ray Charles, Wonder had a voracious appetite for many different kinds of music, and refused to confine himself to any one sound or style. His best records were a richly eclectic brew of soul, funk, rock &amp; roll, sophisticated Broadway/Tin Pan Alley-style pop, jazz, reggae, and African elements -- and they weren't just stylistic exercises; Wonder took it all and forged it into his own personal form of expression. \n\n  * His range helped account for his broad-based appeal, but so did his unique, elastic voice, his peerless melodic facility, his gift for complex arrangements, and his taste for lovely, often sentimental ballads. Additionally, Wonder's pioneering use of synthesizers during the '70s changed the face of R&amp;B; he employed a kaleidoscope of contrasting textures and voices that made him a virtual one-man band, all the while evoking a surprisingly organic warmth. Along with Marvin Gaye and Isaac Hayes, Wonder brought R&amp;B into the album age, crafting his LPs as cohesive, consistent statements with compositions that often took time to make their point. All of this made Wonder perhaps R&amp;B's greatest individual auteur, rivaled only by Gaye or, in later days, Prince. Originally, Wonder was a child prodigy who started out in the general Motown mold, but he took control of his vision in the '70s, spinning off a series of incredible albums that were as popular as they were acclaimed; most of his reputation rests on these works, which most prominently include Talking Book, Innervisions, and Songs in the Key of Life. His output since then has been inconsistent, marred by excesses of sentimentality and less of the progressive imagination of his best work, but it's hardly lessened the reverence in which he's long been held.\n\n  * Wonder was born Steveland Hardaway Judkins in Saginaw, MI, on May 13, 1950 (he later altered his name to Steveland Morris when his mother married). A premature infant, he was put on oxygen treatment in an incubator; likely it was an excess of oxygen that exacerbated a visual condition known as retinopathy of prematurity, causing his blindness. In 1954, his family moved to Detroit, where the already musically inclined Stevie began singing in his church's choir; from there he blossomed into a genuine prodigy, learning piano, drums, and harmonica all by the age of nine. While performing for some of his friends in 1961, Stevie was discovered by Ronnie White of the Miracles, who helped arrange an audition with Berry Gordy at Motown. Gordy signed the youngster immediately and teamed him with producer/songwriter Clarence Paul, under the new name Little Stevie Wonder. Stevie released his first two albums in 1962: A Tribute to Uncle Ray, which featured covers of Stevie's hero Ray Charles, and The Jazz Soul of Little Stevie, an orchestral jazz album spotlighting his instrumental skills on piano, harmonica, and assorted percussion. Neither sold very well, but that all changed in 1963 with the live album The 12 Year Old Genius, which featured a new extended version of the harmonica instrumental &quot;Fingertips.&quot; Edited for release as a single, &quot;Fingertips, Pt. 2&quot; rocketed to the top of both the pop and R&amp;B charts, thanks to Wonder's irresistible, youthful exuberance; meanwhile, The 12 Year Old Genius became Motown's first chart-topping LP.\n\n  * Wonder charted a few more singles over the next year, but none on the level of &quot;Fingertips, Pt. 2.&quot; As his voice changed, his recording career was temporarily put on hold, and he studied classical piano at the Michigan School for the Blind in the meantime. He dropped the &quot;Little&quot; portion of his stage name in 1964, and re-emerged the following year with the infectious, typically Motown-sounding dance tune &quot;Uptight (Everything's Alright),&quot; a number one R&amp;B/Top Five pop smash. Not only did he co-write the song for his first original hit, but it also reinvented him as a more mature vocalist in the public's mind, making the similar follow-up &quot;Nothing's Too Good for My Baby&quot; another success. The first signs of Wonder's social activism appeared in 1966 via his hit cover of Bob Dylan's &quot;Blowin' in the Wind&quot; and its follow-up, &quot;A Place in the Sun,&quot; but as Motown still had the final say on Wonder's choice of material, this new direction would not yet become a major facet of his work.","torrent":{"xt":"urn:btih:68ed79d185efcfdaab6de822e0b8d944a46501c7","amp;dn":"Stevie+Wonder+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68ed79d185efcfdaab6de822e0b8d944a46501c7","infoHashBuffer":{"type":"Buffer","data":[104,237,121,209,133,239,207,218,171,109,232,34,224,184,217,68,164,101,1,199]},"announce":[],"urlList":[]}}