{"title":"2008 - Po Que No...Claro Que Si - Los Rieleros del Norte - CD/MP","uid":4613993,"size":92909403,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:69d4ee305a78a794ac3ba16f2096fc2971ba803d&amp;dn=2008+-+Po+Que+No...Claro+Que+Si+-+Los+Rieleros+del+Norte+-+CD%2FMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheLabMan","files":13,"time":1230742757,"description":"2008 Album\n\nAlbum Details: Pos Que No: Claro Que Si\nRelease Date:\t05/27/2008\nLabel:\tFonovisa Inc.\nUPC:\t808835357524\nTrack List: Pos Que No: Claro Que Si\n\n   1. Este Adios\n   2. Auxilio\n   3. Entre Dos Amores\n   4. Agobiado Y Solo\n   5. A Punto De Llorar\n   6. Jacinto Trevino\n\n   7. Ahora Sin Ti\n   8. La Barra Enbrujada\n   9. Lagrimas Sinceras\n  10. Voy a Dejarte\n  11. El Amor No Se Ve\n  12. Que Facile Fue\n\n\n\n\n\nIn regional Mexican music, there are certain norteÃƒÂ±o groups whose names are synonymous with authenticity in the minds of purists. One is the sometimes controversial los Tigres del Norte; another is los Huracanes del Norte. And purists almost always have kind words for los Rieleros del Norte, whose Pos Que No: Claro Que SÃƒÂ­ could be described as a 29th anniversary present from the longrunning norteÃƒÂ±o group; los Rieleros' original lineup was formed in 1979, and this 37minute CD came out in 2008. When a group has been together that long and has performed together night after night after night, certain things can go wrong. Members of the group can become bored and get sick of one another; they can reach the point where they sound like they are merely going through the motions and punching a musical time clock. But thankfully, los Rieleros' enthusiasm for norteÃƒÂ±o has remained strong after all these years, and it shows throughout Pos Que No: Claro Que SÃƒÂ­. There are no dull moments on this disc; the group's passion is alive and well on inspired tracks such as &quot;LÃƒÂ¡grimas Sinceras&quot; (&quot;Sincere Tears&quot;), &quot;A Punto de Llorar&quot; (&quot;At the Point of Crying&quot;), &quot;Voy a Dejarte&quot; (&quot;I'm Going to Leave You&quot;) and &quot;Este Adios&quot; (&quot;This Goodbye&quot;). Corridos (Mexican folk narratives) have long been one of los Rieleros' strong points, and their proficiency with corridos is evident on &quot;La Barra Embrujada&quot; and &quot;Jacinto TreviÃƒÂ±o.&quot; None of these performances break any new ground for los Rieleros, but if this 2008 release is predictable, it is predictable in a good, positive way. Pos Que No: Claro Que SÃƒÂ­ isn't quite essential, although it's a fine album that does nothing to jeopardize los Rieleros del Norte's reputation as a consistent and reliable norteÃƒÂ±o powerhouse.\n\n- Alex Henderson, All Music Guide","torrent":{"xt":"urn:btih:69d4ee305a78a794ac3ba16f2096fc2971ba803d","amp;dn":"2008+-+Po+Que+No...Claro+Que+Si+-+Los+Rieleros+del+Norte+-+CD%2FMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69d4ee305a78a794ac3ba16f2096fc2971ba803d","infoHashBuffer":{"type":"Buffer","data":[105,212,238,48,90,120,167,148,172,59,161,111,32,150,252,41,113,186,128,61]},"announce":[],"urlList":[]}}