{"title":"Physics and Technology for Future Presidents","uid":6528355,"size":20489040,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a4af4697fcbe8b54938c2b01e163cc1bf4f4c2f&amp;dn=Physics+and+Technology+for+Future+Presidents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"_F1_","files":-1,"time":1310233326,"description":"By request (made to somebody else):\nlgcanon at 2011-07-09 10:14 CET:\ncan u crack this book?\n &lt;a href=&quot;\nhttp://www.b***********e.com/bla***********bla**********bla&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.b***********e.com/bla***********bla**********bla&lt;/a&gt;\n\n@ lgcanon: Please don't spam links, just name the book /// Here you go:\n\n-----------------------------------------------------------------------------------\nRichard A. Muller, &quot;Physics and Technology for Future Presidents: An Introduction to the Essential Physics Every World Leader Needs to Know&quot;\n Publisher: Princeton University Press | ISBN 10: 0691135045 | 2010 | PDF | 532 pages | 19.7 MB\n\n Physics and Technology for Future Presidents contains the essential physics that students need in order to understand today's core science and technology issues, and to become the next generation of world leaders. From the physics of energy to climate change, and from spy technology to quantum computers, this is the only textbook to focus on the modern physics affecting the decisions of political leaders and CEOs and, consequently, the lives of every citizen. How practical are alternative energy sources? Can satellites really read license plates from space? What is the quantum physics behind iPods and supermarket scanners? And how much should we fear a terrorist nuke? This lively book empowers students possessing any level of scientific background with the tools they need to make informed decisions and to argue their views persuasively with anyone--expert or otherwise. Based on Richard Muller's renowned course at Berkeley, the book explores critical physics topics: energy and power, atoms and heat, gravity and space, nuclei and radioactivity, chain reactions and atomic bombs, electricity and magnetism, waves, light, invisible light, climate change, quantum physics, and relativity. Muller engages readers through many intriguing examples, helpful facts to remember, a fun-to-read text, and an emphasis on real-world problems rather than mathematical computation. He includes chapter summaries, essay and discussion questions, Internet research topics, and handy tips for instructors to make the classroom experience more rewarding. Accessible and entertaining, Physics and Technology for Future Presidents gives students the scientific fluency they need to become well-rounded leaders in a world driven by science and technology. Professors: A supplementary Instructor's Manual is available for this book. It is restricted to teachers using the text in courses.","torrent":{"xt":"urn:btih:6a4af4697fcbe8b54938c2b01e163cc1bf4f4c2f","amp;dn":"Physics+and+Technology+for+Future+Presidents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a4af4697fcbe8b54938c2b01e163cc1bf4f4c2f","infoHashBuffer":{"type":"Buffer","data":[106,74,244,105,127,203,232,181,73,56,194,176,30,22,60,193,191,79,76,47]},"announce":[],"urlList":[]}}