{"title":"Deborah Harkness - The Book of Life - All Souls Book 3","uid":10617719,"size":688718182,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6a738d7690122e580556c49383c3ae1dfdf080b9&amp;dn=Deborah+Harkness+-+The+Book+of+Life+-+All+Souls+Book+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"katelynor","files":4,"time":1406142499,"description":"The highly anticipated finale to the number-one New York Times best-selling trilogy that began with A Discovery of Witches.\n\nAfter traveling through time in Shadow of Night, the second book in Deborah Harkness's enchanting series, historian and witch Diana Bishop and vampire scientist Matthew Clairmont return to the present to face new crises and old enemies. At Matthew's ancestral home at Sept-Tours, they reunite with the cast of characters from A Discovery of Witches - with one significant exception. But the real threat to their future has yet to be revealed, and when it is, the search for Ashmole 782 and its missing pages takes on even more urgency. In the trilogy's final volume, Harkness deepens her themes of power and passion, family and caring, past deeds and their present consequences. In ancestral homes and university laboratories, using ancient knowledge and modern science, from the hills of the Auvergne to the palaces of Venice and beyond, the couple at last learn what the witches discovered so many centuries ago.\n\nWith more than one million copies sold in the United States and appearing in 38 foreign editions and translations, A Discovery of Witches and Shadow of Night have landed on all of the major best seller lists and garnered rave reviews from countless publications. Eagerly awaited by Harkness's legion of fans, The Book of Life brings this superbly written series to a deeply satisfying close. ","torrent":{"xt":"urn:btih:6a738d7690122e580556c49383c3ae1dfdf080b9","amp;dn":"Deborah+Harkness+-+The+Book+of+Life+-+All+Souls+Book+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a738d7690122e580556c49383c3ae1dfdf080b9","infoHashBuffer":{"type":"Buffer","data":[106,115,141,118,144,18,46,88,5,86,196,147,131,195,174,29,253,240,128,185]},"announce":[],"urlList":[]}}