{"title":"Healing-Cancer-World-Summit-2012-Night-1  KRIS CARR and DR. NICH","uid":7872388,"size":108313518,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:6a825d322f5a932a2fa75eafafe837299976c053&amp;dn=Healing-Cancer-World-Summit-2012-Night-1++KRIS+CARR+and+DR.+NICH&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tintom","files":2,"time":1354244714,"description":"Healing-Cancer-World-Summit-2012-Night-1  KRIS CARR and DR. NICHOLAS GONZALEZ\n\nWednesday Nov 7th 8pm EST / 5pm PT\nKris Carr and Dr. Nicholas Gonzalez\n\nWill upload each night and the bonuses soon!\n\nTHERE ARE OPTIONS!\nFind out what therapies these doctors and experts are using that they say can prevent and even treat cancers naturally.\nDiscover herbs and supplements that are scientifically known to prevent cancer.\nDiscover scientific and documented proof that natural cancer treatments work.\nLearn how to detoxify and cleanse the body naturally...and safely.\n\nMeet the Doctors, Nutritionists and Advocates Who Say Cancer May Be Treated Successfully and Naturally - Without Excessive Use of Drugs, Surgery, Radiation and Chemotherapy\n\nIN THIS UNIQUE PROGRAM YOU'LL ALSO DISCOVER...\nThe therapies these doctors and experts are using that they say can prevent and even treat cancers naturally.\nThe cancer fighting herbs and supplements that are scientifically known to prevent cancer - many of which you can buy in your local supermarket (no matter where you live!)\nScientific and documented proof that natural cancer treatments work and why.\nLearn how to detoxify and cleanse the body naturally... and safely.\nWhy many people have no idea these treatments exist and why these doctors are risking their careers to do help people heal.\nAmazing stories of patients who have been healed naturally and are still thriving today.\nHow - in some cases - drugs, chemotherapy, surgery and radiation can cause side effects that may be worse than the cancer itself.\nSimple and affordable ways to prevent cancer and many other diseases using natural, tested methods.\nAnd much more!","torrent":{"xt":"urn:btih:6a825d322f5a932a2fa75eafafe837299976c053","amp;dn":"Healing-Cancer-World-Summit-2012-Night-1++KRIS+CARR+and+DR.+NICH","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a825d322f5a932a2fa75eafafe837299976c053","infoHashBuffer":{"type":"Buffer","data":[106,130,93,50,47,90,147,42,47,167,94,175,175,232,55,41,153,118,192,83]},"announce":[],"urlList":[]}}