{"title":"Bad Boys: Public Schools in the Making of Black Masculinity [bla","uid":8807290,"size":9860242,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6a9a8213f8b1f02224b82b11f01d727034f1b478&amp;dn=Bad+Boys%3A+Public+Schools+in+the+Making+of+Black+Masculinity+%5Bbla&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"blackatk","files":-1,"time":1376369090,"description":"Bad Boys: Public Schools in the Making of Black Masculinity \n\n\n\nPublication Date: August 28, 2001 | ISBN-10: 0472088491 | ISBN-13: 978-0472088492 | Edition: Reprint | filetype: pdf | \n\n\nStatistics show that black males are disproportionately getting in trouble and being suspended from the nation's school systems. Based on three years of participant observation research at an elementary school, Bad Boys offers a richly textured account of daily interactions between teachers and students to understand this serious problem. Ann Arnett Ferguson demonstrates how a group of eleven- and twelve-year-old males are identified by school personnel as &quot;bound for jail&quot; and how the youth construct a sense of self under such adverse circumstances. The author focuses on the perspective and voices of pre-adolescent African American boys. How does it feel to be labeled &quot;unsalvageable&quot; by your teacher? How does one endure school when the educators predict one's future as &quot;a jail cell with your name on it?&quot; Through interviews and participation with these youth in classrooms, playgrounds, movie theaters, and video arcades, the author explores what &quot;getting into trouble&quot; means for the boys themselves. She argues that rather than simply internalizing these labels, the boys look critically at schooling as they dispute and evaluate the meaning and motivation behind the labels that have been attached to them. Supplementing the perspectives of the boys with interviews with teachers, principals, truant officers, and relatives of the students, the author constructs a disturbing picture of how educators' beliefs in a &quot;natural difference&quot; of black children and the &quot;criminal inclination&quot; of black males shapes decisions that disproportionately single out black males as being &quot;at risk&quot; for failure and punishment.\nBad Boys is a powerful challenge to prevailing views on the problem of black males in our schools today. It will be of interest to educators, parents, and youth, and to all professionals and students in the fields of African-American studies, childhood studies, gender studies, juvenile studies, social work, and sociology, as well as anyone who is concerned about the way our schools are shaping the next generation of African American boys.\nAnne Arnett Ferguson is Assistant Professor of Afro-American Studies and Women's Studies, Smith College.\n\n\nPaperback: 272 pages\nPublisher: University of Michigan Press; Reprint edition (August 28, 2001)\nLanguage: English\nISBN-10: 0472088491\nISBN-13: 978-0472088492\n\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Bad-Boys-Schools-Masculinity-Violence/dp/0472088491/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Bad-Boys-Schools-Masculinity-Violence/dp/0472088491/&lt;/a&gt;\n\n\n\n\n\nTags: carib, social, issues, school, teacher, education, school, form, high scool, upper form, GRE, college, university, learn, learning, pedagogy, discrimination, miseducation, inner, city, poverty, ignorance, mentality, self-hate, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery,education, school, at - risk, inner, city, public, schools, disparity, economy, leader, leadership, pedagogy, educators, NCLB, schooling, kids, primary, second, higher education, college, community, PTA, homeschool, minority, black, african, american, usa, latin, latino, hispanic, asian, native american, teacher, teach, test, standard, standardized testing, ","torrent":{"xt":"urn:btih:6a9a8213f8b1f02224b82b11f01d727034f1b478","amp;dn":"Bad+Boys%3A+Public+Schools+in+the+Making+of+Black+Masculinity+%5Bbla","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a9a8213f8b1f02224b82b11f01d727034f1b478","infoHashBuffer":{"type":"Buffer","data":[106,154,130,19,248,177,240,34,36,184,43,17,240,29,114,112,52,241,180,120]},"announce":[],"urlList":[]}}