{"title":"Devoted in Death","uid":12514677,"size":319351003,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6aa1c3fdd62d5a90229bd967083849c47c234d50&amp;dn=Devoted+in+Death&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":2,"time":1443651219,"description":"Written by J.D. Robb\r\nRead by Susan Ericksen\r\nFormat: MP3\r\nUnabridged\r\n\r\nWhen Lieutenant Eve Dallas examines a body in a downtown Manhattan alleyway, the victim's injuries are so extensive that she almost misses the clue. Carved into the skin is the shape of a heart - and initials inside reading E and D.…\r\nElla-Loo and her boyfriend, Darryl, had been separated while Darryl was a guest of the state of Oklahoma, and now that his sentence has been served they don't ever intend to part again. Ella-Loo's got dreams. And Darryl believes there are better ways to achieve your dreams than working for them. So they hit the road, and when their car breaks down in Arkansas, they make plans to take someone else's. Then things get messy and they wind up killing someone - an experience that stokes a fierce, wild desire in Ella-Loo. A desire for Darryl. And a desire to kill again.\r\nAs they cross state lines on their way to New York to find the life they think they deserve, they will leave a trail of evil behind them. But now they've landed in the jurisdiction of Lieutenant Dallas and her team at the New York Police and Security Department. And with her husband, Roarke, at her side, she has every intention of hunting them down and giving them what they truly deserve.…","torrent":{"xt":"urn:btih:6aa1c3fdd62d5a90229bd967083849c47c234d50","amp;dn":"Devoted+in+Death","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6aa1c3fdd62d5a90229bd967083849c47c234d50","infoHashBuffer":{"type":"Buffer","data":[106,161,195,253,214,45,90,144,34,155,217,103,8,56,73,196,124,35,77,80]},"announce":[],"urlList":[]}}