{"title":"POtHS 2 - When The SHTF - SURVIVAL for 2013 Vol 6 - Weapons Self","uid":8372879,"size":12410600387,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6b43a10e0f8b9e8db3eb161f79ea051ea6936b72&amp;dn=POtHS+2+-+When+The+SHTF+-+SURVIVAL+for+2013+Vol+6+-+Weapons+Self&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"POtHS11","files":-1,"time":1365966031,"description":"\n\n\n\n\n PO t HS\n\nPouring Out the Holy Spirit\n\nWhen The SHTF - SURVIVAL for 2013\nVolume 6\nWeapons Self Defense 2\n\n\n\nPOtHS - When The SHTF - SURVIVAL for 2013 Vol 6 - Weapons Self Defense 2\n\n\nSeed long and Prosper with Blessings from our Father. I have prayed to The Father, to Bless all that Seed Long.\n\n\nPOtHS Comment:When The STUFF Hits The Fan you will need to be able to defend yourself with and without a weapon. Time is running Short. When the Time comes to Head for The Hills. You need to be ready to leave town with everything you need in 10 minutes. Once you get out of town THEN you have to Survive!!! Here are some good Survival Tips.\n\nDescription:\n\n1 - Gunsite-Tactical_Pistol,_volume_1\n2 - Gunsite-Tactical_Pistol,_volume_2\n3 - High Risk Entry\n4 - Home Defense Tips\n5 - Night Master\n6 - JPaladin_Press-Close_Range_Gunfighting,_part_1\n7 - Paladin_Press-Close_Range_Gunfighting,_part_2\n8 - Personal Firearm Defense DVD Series Trailer\n9 - Personal Firearm Defense Series- Advanced Pistol Handling\n10- sss gun defense\n11- Tactical Carbine\n12- TR - Defensive Handgun - Disc 1\n13- TR - Defensive Handgun - Disc 2\n14- TR - Defensive Tactics - Disc 1\n15- TR - Defensive Tactics - Disc 2\n16- Ultimate Sniper- Training Video\n17- URBAN RIFLE 1\n18- URBAN RIFLE 2\n19- WW2 German Sniper Training Videos (English subtitles)\n\nJESUS: Believe this about Jesus to move on to Greener Pastures.\n\nBorn of a Virgin, He was killed for our transgressions, His blood was shed as a sacrifice to atone for my sins. He was buried and ROSE three days later, according to The Scriptures. Praise the Lord for HE HAS RISEN. I am now forgiven for my sins, past, present and future and can live on with the Lord in Eternity, forever.\n\nRAPtURE (My transportation outta here).\n\nThe Blessed Hope.  If you believe in The Rapture you better believe The Above Statement and that the Sacrificed Blood of Jesus, on the Cross paid for your sins and there is NOTHING Else you can do to gain Salvation, The GRACE of Christ did it ALL. Now you just have to believe that with all your Heart, Mind and Soul or Maybe Get Left Behind. All PAST, Present and Future Sins are Forgiven with Jesus. (I wouldn't PUSH That Future sin statement to much!!!)\n\nIn a moment, in the twinkling of an eye, at the last trump: for the trumpet shall sound, and the dead shall be raised incorruptible, and we shall be changed...\n\n&quot;And He will send forth His angels with A GREAT TRUMPET and THEY WILL GATHER TOGETHER His elect from the four winds, from one end of the sky to the other.\n\n&quot;Do not marvel at this; for an hour is coming, in which all who are in the tombs will hear His voice,  Then we who are alive and remain will be caught up together with them in the clouds to meet the Lord in The Air, and there we will be forever be with him...hmmm sounds like some of us might be Immortal. (Ask your preacher about that)\n\n\n      thankyou    thankyou     Thank You JESUS\n\n \n","torrent":{"xt":"urn:btih:6b43a10e0f8b9e8db3eb161f79ea051ea6936b72","amp;dn":"POtHS+2+-+When+The+SHTF+-+SURVIVAL+for+2013+Vol+6+-+Weapons+Self","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b43a10e0f8b9e8db3eb161f79ea051ea6936b72","infoHashBuffer":{"type":"Buffer","data":[107,67,161,14,15,139,158,141,179,235,22,31,121,234,5,30,166,147,107,114]},"announce":[],"urlList":[]}}