{"title":"[NubileFilms] Amarna Miller (Playing For Keeps)","uid":11712635,"size":266773263,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:6b703038aa53204991896b38f3cbc8a62a0d556a&amp;dn=%5BNubileFilms%5D+Amarna+Miller+%28Playing+For+Keeps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Upl0ad3rR","files":1,"time":1424390435,"description":"---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-54e66b3fde094.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54e66b3fde094.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://image-tpb.com/img-54e66b41c71f8.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-54e66b41c71f8.html&lt;/a&gt; \n\nTotal hottie Amarna Miller is dressed to the nines in a tight white dress and high heels, all for the sake of seducing Figo. She interrupts his pool game with a request that he show her how to play, but it's really just a ploy to get Figo's attention so that he'll enjoy everything she has to offer.\n\nSearing kisses quickly turn to more as Amarna allows herself to be pushed backwards onto the pool table so that Figo can have easy access to her panty-clad pussy. He pulls her underwear aside to sample Amarna's pussy juices, and once he decides he likes what he tastes he takes them off entirely for better access.\n\nAmarna isn't about to let her lover go unsatisfied, so after enjoying Figo's attentions for a while she gets down on her knees and helps him out of his pants. Once Figo's cock is freed, Amarna eagerly takes it in her mouth and starts sucking until she is deep throating his dick, using her hands and lips with expertise to elicit moans of pleasure her man.\n\nFinally Figo gets the chance to push deep into Amarna's creamy twat when she stands up and bends over the table to present her landing strip pussy for his pleasure. Within moments Figo is pounding away, enjoying Amarna's tight fuck hole. They keep up like that until Amarna is groaning her pleasure at the orgasmic ecstasy sweeping through her.\n\nWhen it's time to change things up, Amarna leans back against the wall for some standing sex that is instantly fast and furious and totally to the redhead's liking. As her body quakes with another climax, Amarna turns around so that Figo can once again take her from behind with strokes hard enough to make her small boobs bounce.\n\nThe couple finishes their frantic lovemaking with Amarna back on the pool table. Her legs are spread as wide as they'll go while Figo delivers a rough pussy pounding in Amarna's landing strip twat that sends her screaming to pleasure town one final time. The last orgasm does Figo in, and a second later he pulls out of Amarna's pulsing snatch and loses his load all over her fuzzy red haired mound.\n\nSize: 266773263 bytes (254,41 MiB), duration: 00:19:59, avg.bitrate: 1780 kb/s\nAudio: aac, 44100 Hz, stereo, s16, 127 kb/s (eng)\nVideo: h264, yuv420p, 960x540, 1645 kb/s, 23,98 fps(r) (eng)","torrent":{"xt":"urn:btih:6b703038aa53204991896b38f3cbc8a62a0d556a","amp;dn":"%5BNubileFilms%5D+Amarna+Miller+%28Playing+For+Keeps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b703038aa53204991896b38f3cbc8a62a0d556a","infoHashBuffer":{"type":"Buffer","data":[107,112,48,56,170,83,32,73,145,137,107,56,243,203,200,166,42,13,85,106]},"announce":[],"urlList":[]}}