{"title":"Julie Felix...Scarborough Fair(2002)[FLAC]","uid":5375340,"size":300646265,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6cb45074ad8951c92576dc9aaa207ee262bc8e5c&amp;dn=Julie+Felix...Scarborough+Fair%282002%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":16,"time":1266558398,"description":"Julie Felix isn't too well-known in her native United States, but since 1964 she's been a major British folk music star and has been compared over there with Joan Baez. Felix was born in California, of mixed Mexican and Native American ancestry. A natural singer by inclination, she was drawn to folk music at an early age but was unable to get a career started in America, even amid the folk revival of the early '60s. In 1964, she decided to go hitchhiking across Europe, and instead of heading home at the end of her travels she made England her destination. She arrived there just in time to catch a fresh wave of enthusiasm for American folk music, fostered by Bob Dylan's emergence internationally as a singer and songwriter. American folk musicians had always found a welcome among England's folk enthusiasts, but just then, thanks to Dylan, the sheer number of folk listeners had ballooned to massive proportions. Felix also found a natural audience for her work -- she had an engaging voice and manner, a distinctive Mexican guitar (a gift from her father), and her combined Mexican and Native American backgrounds, which made her stand out from other of her compatriots, who were white and male. And suddenly, Felix had a major career -- the same year that she arrived in England, she became the first solo folk performer signed to a major British label when she got a contract from English Decca. Felix debuted with a self-titled album and a single of Ian Tyson's, &quot;Someday Soon,&quot; and she also scored a hit on television, on The Eammon Andrews Show. By 1965, she was a headlining performer, referred to in The London Times as Britain's First Lady of Folk. She cut two more LPs for Decca over the next two years, including an album of Bob Dylan and Woody Guthrie songs, and was also one of the biggest exponents of the work of Leonard Cohen before he'd established himself beyond a small cult of listeners in England. She also began getting recognized for her commitment to charitable causes, and not only raised money for hunger relief but visited several of the more troubled countries in the Third World. By the end of 1965, she'd filled Royal Albert Hall for one of her concerts, reportedly the first folksinger based in England to accomplish that feat. In 1966, she moved to the Fontana label, for which she cut three albums -- her 1966 album, Changes, is regarded as one of her best, mixing traditional and contemporary material and utilizing the support of Martin Carthy and Dave Swarbrick; meanwhile, on-stage, she came under the wing of Brian Epstein, who booked her and Georgie Fame together at the Saville Theatre, with a then-unknown Cat Stevens appearing as the opening act. By 1967, she was well-enough established to be a featured weekly guest on David Frost's television series, and by 1968 had earned her own television variety series, with guests that included Dusty Springfield, Leonard Cohen, Donovan, and Richard Harris. Her late-'60s recordings included Going to the Zoo, a delightful collection of children's songs on Fontana, and in 1969 she was one of the artists featured at the Isle of Wight Festival. Finally, in 1970, Felix had her first pop hit when she reached the British Top 20 with her version of &quot;El Condor Pasa,&quot; recorded under the auspices of producer Mickie Most -- indeed, Felix was the first artist on Most's newly formed RAK label to have a hit record, and she later recorded the album Clotho's Web (1972) for RAK. She also made her long-delayed debut on American television, courtesy of her longtime friend David Frost, who booked her on his Metromedia-produced talk show. Felix scored a second hit for Most with her cover of &quot;Heaven Is Here&quot; before moving to EMI in 1974. The mid-'70s marked a period of extreme change for Felix, who was an unapologetic 1960s liberal with a strong commitment to social issues. She became disillusioned with the direction of the world as the '70s wore on, with their more hedonistic orientation. Finding northern Europe a more agreeable place to live and work, she moved to Norway and subsequently enjoyed hit records both there and in Sweden. Felix returned to California late in the decade and used the time to recharge her social conscience -- by the early '80s, she was heavily involved in the human rights campaign in Latin America. She returned to England and resumed her career, writing songs for the first time and directing her activities toward new age philosophy and interests, in addition to political issues. In the mid-'90s, Felix released her first new album in a decade, Bright Shadows, on her own label, Remarkable Records. At the outset of the 21st century, she continues to enjoy a full schedule of performances in England and attention from old listeners who remember her from the 1960s and newer audiences who know Felix for her 1990s music. Her new music has received mixed critical and popular reception, but her 1960s repertory still elicits serious enthusiasm from her audience. ~ Bruce Eder, All Music Guide \n\nAudio CD (26 Feb 2008) \nNumber of Discs: 1 \nLabel: Sanctuary \nASIN: B000063KGI \n\n\n\n1. Soldier From the 60's \n 2. Dona Dona \n 3. Blowing In the Wind \n 4. Where You Are \n 5. Steal Away Again \n 6. Let It Be \n 7. So Much Trouble \n 8. Vincent \n 9. San Francisco (Be Sure To Wear Some Flowers In Your Hair) \n 10. Mr Tambourine Man \n 11. Scarborough Fair \n 12. Amazing Grace \n 13. Soldier From the 60's (Epilogue) \n\n\ncd ripped by dBpoweramp\n\nplease seed\n","torrent":{"xt":"urn:btih:6cb45074ad8951c92576dc9aaa207ee262bc8e5c","amp;dn":"Julie+Felix...Scarborough+Fair%282002%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6cb45074ad8951c92576dc9aaa207ee262bc8e5c","infoHashBuffer":{"type":"Buffer","data":[108,180,80,116,173,137,81,201,37,118,220,154,170,32,126,226,98,188,142,92]},"announce":[],"urlList":[]}}