{"title":"Easy Paediatrics- Sidwell, Thomson [PDF] [StormRG]","uid":11008367,"size":19909238,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6d16b5e0e24225fd5d660f939e16004b06757a8c&amp;dn=Easy+Paediatrics-+Sidwell%2C+Thomson+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":2,"time":1410289386,"description":"Author: Rachel U Sidwell, Mike A Thomson\nPaperback: 544 pages\nPublisher: CRC Press; 1 Pap/Psc edition (May 27, 2011)\nLanguage: English\nISBN-10: 1853158267\nISBN-13: 978-1853158261\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nWritten by the same author team as the successful and well-regarded Concise Paediatrics for postgraduates, Easy Paediatrics is a textbook specifically written for medical students.\n\nEasy Paediatrics is structured in a systems-based fashion, with additional chapters on subjects such as history and examination, development, genetics, emergencies and surgery. The material is presented logically with presentations, clinical findings, investigations and management options, and useful boxes covering differential diagnoses, causes and complications are also included to complete the picture.\n\nClinical photographs and illustrative diagrams are provided throughout to help the student visualise what they are reading about, and the book is enhanced by a companion website, which contains OSCE-style clinical scenarios and MCQs for all the body systems, so the reader can test what they have learned.\n\nPresented in an easy-to-remember style, Easy Paediatrics gives the medical student everything they need to succeed in their paediatrics modules, without bombarding them with excess knowledge that will not be covered in their exams.","torrent":{"xt":"urn:btih:6d16b5e0e24225fd5d660f939e16004b06757a8c","amp;dn":"Easy+Paediatrics-+Sidwell%2C+Thomson+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d16b5e0e24225fd5d660f939e16004b06757a8c","infoHashBuffer":{"type":"Buffer","data":[109,22,181,224,226,66,37,253,93,102,15,147,158,22,0,75,6,117,122,140]},"announce":[],"urlList":[]}}