{"title":"Brandon Sanderson - Shadows of Self (Mistborn #5)","uid":12527965,"size":1818460362,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6d2856d0810eaf7923cc466ef99be18c85fa2eb2&amp;dn=Brandon+Sanderson+-+Shadows+of+Self+%28Mistborn+%235%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":26,"time":1444165915,"description":"With The Alloy of Law, Brandon Sanderson surprised readers with a New York Times bestselling spinoff of his Mistborn books, set after the action of the trilogy, in a period corresponding to late 19th-century America.\r\n\r\nThe trilogy's heroes are now figures of myth and legend, even objects of religious veneration. They are succeeded by wonderful new characters, chief among them Waxillium Ladrian, known as Wax, hereditary Lord of House Ladrian but also, until recently, a lawman in the ungoverned frontier region known as the Roughs. There he worked with his eccentric but effective buddy, Wayne. They are &quot;twinborn,&quot; meaning they are able to use both Allomantic and Feruchemical magic.\r\n\r\nShadows of Self shows Mistborn's society evolving as technology and magic mix, the economy grows, democracy contends with corruption, and religion becomes a growing cultural force, with four faiths competing for converts.\r\n\r\nThis bustling, optimistic, but still shaky society now faces its first instance of terrorism, crimes intended to stir up labor strife and religious conflict. Wax and Wayne, assisted by the lovely, brilliant Marasi, must unravel the conspiracy before civil strife stops Scadrial's progress in its tracks.\r\n\r\nShadows of Self will give fans of The Alloy of Law everything they've been hoping for and, this being a Brandon Sanderson book, more, much more.\r\n\r\n\r\nRead by Michael Kramer\r\nFormat: MP3\r\nBitrate: 256 Kbps\r\nUnabridged","torrent":{"xt":"urn:btih:6d2856d0810eaf7923cc466ef99be18c85fa2eb2","amp;dn":"Brandon+Sanderson+-+Shadows+of+Self+%28Mistborn+%235%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6d2856d0810eaf7923cc466ef99be18c85fa2eb2","infoHashBuffer":{"type":"Buffer","data":[109,40,86,208,129,14,175,121,35,204,70,110,249,155,225,140,133,250,46,178]},"announce":[],"urlList":[]}}