{"title":"GPU Computing Gems Emerald Edition - (Malestrom)","uid":6376554,"size":20176769,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6da598da8dca2d42363997c6a593ad804a3fc754&amp;dn=GPU+Computing+Gems+Emerald+Edition+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1304877635,"description":"Wen-mei W. Hwu, &quot;GPU Computing Gems Emerald Edition&quot;\n2011 | ISBN: 0123849888 | 886 pages | PDF |\n\n&quot;.the perfect companion to Programming Massively Parallel Processors by Hwu &amp; Kirk.&quot; -Nicolas Pinto, Research Scientist at Harvard &amp; MIT, NVIDIA Fellow 2009-2010\n\nGraphics processing units (GPUs) can do much more than render graphics. Scientists and researchers increasingly look to GPUs to improve the efficiency and performance of computationally-intensive experiments across a range of disciplines.\n\nGPU Computing Gems: Emerald Edition brings their techniques to you, showcasing GPU-based solutions including:\nBlack hole simulations with CUDA\nGPU-accelerated computation and interactive display of molecular orbitals\nTemporal data mining for neuroscience\nGPU -based parallelization for fast circuit optimization\nFast graph cuts for computer vision\nReal-time stereo on GPGPU using progressive multi-resolution adaptive windows\nGPU image demosaicing\nTomographic image reconstruction from unordered lines with CUDA\nMedical image processing using GPU -accelerated ITK image filters\n41 more chapters of innovative GPU computing ideas, written to be accessible to researchers from any domain\n\nGPU Computing Gems: Emerald Edition is the first volume in Morgan Kaufmann's Applications of GPU Computing Series, offering the latest insights and research in computer vision, electronic design automation, emerging data-intensive applications, life sciences, medical imaging, ray tracing and rendering, scientific simulation, signal and audio processing, statistical modeling, and video / image processing.\n\n\nCovers the breadth of industry from scientific simulation and electronic design automation to audio / video processing, medical imaging, computer vision, and more\n\nMany examples leverage NVIDIA's CUDA parallel computing architecture, the most widely-adopted massively parallel programming solution\n\nOffers insights and ideas as well as practical &quot;hands-on&quot; skills you can immediately put to use ","torrent":{"xt":"urn:btih:6da598da8dca2d42363997c6a593ad804a3fc754","amp;dn":"GPU+Computing+Gems+Emerald+Edition+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6da598da8dca2d42363997c6a593ad804a3fc754","infoHashBuffer":{"type":"Buffer","data":[109,165,152,218,141,202,45,66,54,57,151,198,165,147,173,128,74,63,199,84]},"announce":[],"urlList":[]}}