{"title":"The Ironwood Collection of Alpha Moves - Ian Ironwood [Epub &amp;amp","uid":9861759,"size":616470,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6edfdcea3318156b974e2df8856bdbef1f2b7191&amp;dn=The+Ironwood+Collection+of+Alpha+Moves+-+Ian+Ironwood+%5BEpub+%26amp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"krystine","files":-1,"time":1396307617,"description":"Description\nThe Ironwood Collection Of Alpha Moves\nAuthor: Ian Ironwood\nPublished: 2013\nASIN: B00B07O4YA\nFormat: Retail Epub and Mobi\nReader Required:\nEpub- Adobe Digital Editions, Calibre, MoonReader for Android\nMobi- Kindle app, Calibre, MoonReader for Android\n\nTested on the above readers with no problems on laptop and Android tablet. \nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. \nPlease allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nEnjoy! \n\n\n\nHas someone hinted that perhaps you could stand to show a little more backbone in your relationship? Does your wife slip away to read mommy porn, substituting 50 Shades of Grey for the sexual attention and excitement that you used to provide her? Do you feel like you just need to step up, man-up, sack-up, and start living life a little more boldly, even if you're married? \n\nWhen someone tells you to just &quot;be more Alpha&quot;, how do you do that, exactly? \n\nThis is a good place to start. Using the disciplines of Married Game, noted Manosphere blogger, sex writer and porn reviewer Ian Ironwood takes you on a Red Pill adventure that is both practical and romantic. You'll learn how to exercise your latent masculinity and assertiveness within your relationship. You'll learn how to build - or rebuild - attraction with your wife . . . without kissing her ass! If you've considered improving your sexual relationship by Gaming your wife, then this collection of Alpha Moves - assertive displays of masculine value designed to promote sexual attraction - is an ideal place to start. \n\nCulled from hundreds of blog posts, Ironwood gives helpful advice on cultivating the Alpha side of your masculinity without severely altering your lifestyle. Ironwood's moves range from the remedial level to the advanced, and he talks you through each element so that you understand why it works. Ironwood uses his own relationship as an example, and the frank-speaking Mrs. Ironwood is always ready to provide her perspective. \n\nAs an additional bonus, this collection comes with three previously-unpublished Alpha Moves!\n\nFor a price of a pack of cigarettes, this book could help you restore your sense of masculinity, provide you with guidance in projecting that effectively toward your wife, and teach you how to understand the nature of her responsive sexuality! With wit, humor, and utter candor, the Sex Nerd shows you what Alpha looks like, regardless of the man.\n","torrent":{"xt":"urn:btih:6edfdcea3318156b974e2df8856bdbef1f2b7191","amp;dn":"The+Ironwood+Collection+of+Alpha+Moves+-+Ian+Ironwood+%5BEpub+%26amp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6edfdcea3318156b974e2df8856bdbef1f2b7191","infoHashBuffer":{"type":"Buffer","data":[110,223,220,234,51,24,21,107,151,78,45,248,133,107,219,239,31,43,113,145]},"announce":[],"urlList":[]}}