{"title":"When Life Isn't Fair - Dr. Joel A. Freeman","uid":10386538,"size":701893,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:701ec7a559e4694829a823c060d1fa5c2b9b662b&amp;dn=When+Life+Isn%27t+Fair+-+Dr.+Joel+A.+Freeman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1403137665,"description":"\nIt is perhaps the most-asked question in any time period: &quot;Why does God allow suffering?&quot;\n\nCertainly, every human experiences pain and rejection. If the difficulty is long-term, one can almost be driven mad with grief or anger. We want to know why. Physical and emotional problems are so draining, we become obsessed with &quot;fairness.&quot; How do we reconcile our concept of a powerful, loving God with the fact of child death? Or greed? Divorce?\n\nOften, we don't. That is exactly where Joel Freeman finds many of the people he counsels. Rather than giving pat answers, he relies on spiritual tools to deal with pain. It's a method that has worked remarkably well, and one that can indeed help you or a loved one through a personal valley.\n\n\nAbout the author:\nDr. Joel Freeman has authored numerous books and speaks internationally on sports issues. In addition, he personally counsels coaches and professional athletes on improving their game. His reservoir of experience and contagious enthusiasm enhances his conference speaking and workshop facilitating.\n","torrent":{"xt":"urn:btih:701ec7a559e4694829a823c060d1fa5c2b9b662b","amp;dn":"When+Life+Isn%27t+Fair+-+Dr.+Joel+A.+Freeman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"701ec7a559e4694829a823c060d1fa5c2b9b662b","infoHashBuffer":{"type":"Buffer","data":[112,30,199,165,89,228,105,72,41,168,35,192,96,209,250,92,43,155,102,43]},"announce":[],"urlList":[]}}