{"title":"Understanding Mobile Human-Computer Interaction","uid":6538091,"size":1173241,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7083dabc598ed0ee186875ffd7f82bf8f6204861&amp;dn=Understanding+Mobile+Human-Computer+Interaction&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_F1_","files":-1,"time":1310577643,"description":"Steve Love, &quot;Understanding Mobile Human-Computer Interaction (Information Systems Series (ISS))&quot;\n Publisher: Butterworth-Heinemann | ISBN 10: 0750663529 | 2005 | PDF | 224 pages | 1.11 MB\n\n Taking a psychological perspective, this book examines the role of Human-Computer Interaction in the field of Information Systems research.\n The introductory section of the book covers the basic tenets of the HCI discipline, including how it developed and an overview of the various academic disciplines that contribute to HCI research. The second part of the book focuses on the application of HCI to Information Systems research, and reviews ways in which HCI techniques, methodologies and other research components have been used to date in the IS field. The third section of the book looks at the research areas where HCI has not yet been fully exploited in relation to IS, such as broadening user groups and user acceptance of technology. The final section of the book comprises of a set of guidelines for students to follow when undertaking an HCI based research project.\n\n * Offers a comprehensive insight into the social shaping of technology\n * Includes in depth analysis of HCI issues relating to mobile devices\n * Provides guidelines, technical tips and an overview of relevant data analysis techniques to help students develop their own research projects","torrent":{"xt":"urn:btih:7083dabc598ed0ee186875ffd7f82bf8f6204861","amp;dn":"Understanding+Mobile+Human-Computer+Interaction","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7083dabc598ed0ee186875ffd7f82bf8f6204861","infoHashBuffer":{"type":"Buffer","data":[112,131,218,188,89,142,208,238,24,104,117,255,215,248,43,248,246,32,72,97]},"announce":[],"urlList":[]}}