{"title":"3 viral/buzz marketing ebooks","uid":14314122,"size":7783414,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:70f870089776c6aa50d71786224dbb37f6f30ee2&amp;dn=3+viral%2Fbuzz+marketing+ebooks&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Spicd","files":4,"time":1460566500,"description":"Hereby 3 e-books about viral/buzz marketing.\r\n\r\nViral loop doesn't pack much content, the other two do. Enjoy the content!\r\n\r\n#1: Viral Loop: The Power of Pass-It-On  \r\nby Adam Penenberg\r\nISBN: 0340918691\r\n\r\nHere’s how it works: you read a book, you recommend it to a friend. That friend tells another friend. And another... until the book becomes this year’s word-of-mouth sensation.\r\nThis is the first to analyze the power of the 'pass-it-on’ phenomenon, introducing us to the architects of the mightily efficient, money-spinning model known as the Viral Loop - the secret behind some of the most successful businesses in recent history.\r\nOutfits such as Google, eBay, Flickr andall employ the model at their core; all have seen their stock valuations skyrocket within years of forming. The genius lies in the model’s reliance on replication: what’s the point of usingif none of your friends can see your profile, or using Flickr if you can’t share your photos? Where’s the joy in posting a video on YouTube if no one watches it? Thus, in creating a viral product that people want, need and desire, growth can, and will, take care of itself.\r\nFind out why the Loop will catch us all up, sooner rather than later...\r\n\r\n\r\n\r\n#2: Buzzmarketing: Get People to Talk About Your Stuff \r\nby Mark Hughes\r\nISBN-10: 1591842131\r\nISBN-13: 978-1591842132\r\n\r\n&quot;There's fake corporate marketing and then there?s real marketing. This is the real stuff for real people.&quot;\r\nBen Cohen, co-founder of Ben &amp; Jerry's Ice Cream\r\n\r\nThese days consumers are paying less and less attention to advertising. A majority already zap commercials, and new technology keeps making it easier to tune out marketing messages.\r\n\r\nMark Hughes has written a breakthrough guide to the art of successful buzzmarketing?which many people talk about but few truly understand. He draws on his own real-world experience as an executive and consultant, as well as untold stories of some of the great buzz generators of our time, including American Idol, tie-dye shirts, and the birth of Lite beer.\r\n\r\n\r\n\r\n#3: Word of Mouth Marketing: How Smart Companies Get People Talking \r\nby Andy Sernovitz\r\nISBN: 1608323668\r\n\r\n\r\nMaster word of mouth marketing with this fun, practical, hands-on guide.\r\n\r\nWith straightforward advice and humor, word of mouth expert Andy Sernovitz will show you how the world's most respected and profitable companies get their best customers for free through the power of word of mouth.\r\n\r\nLearn the five essential steps that make word of mouth work and everything you need to get started. Understand how easy it is to work with social media, viral marketing, evangelists, and buzz. Start using simple techniques that start conversations:\r\n\r\n- 3 Reasons People Talk About You\r\n\r\n- 4 Rules of Word of Mouth Marketing\r\n\r\n- 5 Ts of Word of Mouth Marketing\r\n\r\n- 6 Big Ideas: Deep Stuff That Changes Marketing Forever\r\n\r\nFind out what sparks the irrepressible enthusiasm of Apple and TiVo fans. Understand why everyone is talking about a certain restaurant, car, band, or dry cleaner -- and why other businesses and products are ignored. Discover why some products become huge successes without a penny of promotion -- and why some multi-million-dollar advertising campaigns fail to get noticed.\r\n\r\nOpen your eyes to a new way of doing business: Honest marketing makes more money, because customers who trust you will talk about you. Learn how to be the remarkable company that people want to share with their friends","torrent":{"xt":"urn:btih:70f870089776c6aa50d71786224dbb37f6f30ee2","amp;dn":"3+viral%2Fbuzz+marketing+ebooks","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"70f870089776c6aa50d71786224dbb37f6f30ee2","infoHashBuffer":{"type":"Buffer","data":[112,248,112,8,151,118,198,170,80,215,23,134,34,77,187,55,246,243,14,226]},"announce":[],"urlList":[]}}