{"title":"Total DC Comics for 4/15/2014 (darkhomr) [ALL]","uid":9999486,"size":893882958,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:7146ea89c74fa242077b62496f9a59b8a6413171&amp;dn=Total+DC+Comics+for+4%2F15%2F2014+%28darkhomr%29+%5BALL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"dadrkhomr","files":22,"time":1397962748,"description":"This is the 8th week of a Total DC pack.  Similar to my Total Marvel pack, this gathering of comics will include both DC Universe and non-universe titles.  What will be in here will be Vertigo comics, non-DC Universe titles, and any digital titles released by Friday morning.  This release has 13 DC Universe comics 4 non-Universe titles and 5 digital titles.  \n\nMy release packs are as follows: \n \nDC Universe 52 (Wednesdays based on scanners release times, but not later than Friday morning)\nMarvel NOW! (Marvel Comics in the NOW! universe will be released Wednesdays, based on scanners release times)\nTotal Marvel (All Marvel Universe comics, released on Friday, based on scanners release times)\nIndependent Comics (Non-DC Universe and Major Independent comics, released between Sunday and Monday morning) \nTotal DC (all DC comics released for the current week.  Released by Saturday each week.  Does not include digital only releases)\nDC Monthly (all DC Universe comics for the month, released the first Friday after the end of the month)\nTotal Marvel Monthly (all Marvel Universe comics, released the first Tuesday after the end of the month)\n\n\n\n\n\n\nAdventures of Superman #51 (CBR 4/16/2014)\n\nIn the series' final chapter, legends Jerry Ordway and Steve Rude tell the story of Superman's first encounter with a hero from the future--OMAC: the One-Man Army Corps. \n\nAmerican Vampire Second Cycle #2 (CBR 4/16/2014)\n\nPearl has made The Preston House a place of peace. But when something comes to threaten that peace, she'll do anything to protect her young strays. The blockbuster return of AMERICAN VAMPIRE continues here! \n\nBatman #30 (CBR 4/16/2014)\n\n'ZERO YEAR - SAVAGE CITY' begins! \n\nBatman '66 #32 (CBR 4/16/2014)\n\nAfter breaking out of jail using a special laughing gas, the Joker and Catwoman plan their next dastardly crime. They are now going to utilize the gas to throw Gotham City into chaos! Guest starring Batgirl. \n\nBatman And Wonder Woman #30 (CBR 4/16/2014)\n\nThe quest for Damian's remains takes Batman to Paradise Island and into direct conflict with Wonder Woman! \n\nBatman Beyond 2.0 #18 (CBR 4/16/2014)\n\nAfter being transported to an alternate Earth, Terry McGinnis searches for Lord Batman and encounters some familiar faces. \n\nBatman Eternal #2 (CBR 4/16/2014)\n\nA notorious Batman adversary appears for the first time in The New 52 continuity! \n\nBatwoman #30 (CBR 4/16/2014)\n\nAssault on Arkham Asylum! Wolf Spider needs one more painting, and Batwoman will do anything to keep it out of his hands - even if it means entering the notorious asylum! \n\nBirds Of Prey #30 (CBR 4/16/2014)\n\nAs her teammates fall, only Black Canary stands between the utterly helpless Mother Eve and Ra's al Ghul. If she stands aside, her husband will be saved. If she refuses to fold, everybody else will die! What can she possibly do? \n\nGreen Lantern New Guardians #30 (CBR 4/16/2014)\n\nKyle and the New Guardians are trapped between X'Hal and the Godkillers! Both have the power to destroy dozens of planets-so how does Kyle choose who to stop first? \n\nHarley Quinn #5 (CBR 4/16/2014)\n\nSure, Harley has made some enemies along the way. So what happens when a bunch of them show up to kill her dead? She kills them right back, of course! You've been warned: This issue contains violence. \n\nJustice League #29 (CBR 4/16/2014)\n\nThe Crime Syndicate couldn't kill him, but will Grid destroy him? Cyborg heads directly for the Syndicate with the Metal Men at his side. Can Vic Stone stop his cybernetic half? And how will this battle against the most brutal and evil beings in the universe change Cyborg and the Justice League? \n\nRed Hood And The Outlaws #30 (CBR 4/16/2014)\n\nJason and Kori face off against the Agents of S.H.A.D.E. as they embark on a quest to save a kidnapped Roy from his alien abductors! \n\nSinestro #1 (CBR 4/16/2014)\n\nThaal Sinestro has lost everything he's ever loved: his home, his family, his only friend. But no matter how desperate he becomes, Sinestro will never be without fear . . . a lesson his one-time ally, one-time enemy Lyssa Drak is eager to teach him! Can he take back the despicable Yellow Lantern Corps? Or does the universe have a new destiny in mind for Sinestro? \n\nSmallville: Lantern #6 (CBR 4/16/2014)\n\nWill Clark need to make use of his natural super powers to defeat an enemy John fears? \n\nSupergirl #30 (CBR 4/16/2014)\n\nIn &quot;Red Daughter of Krypton&quot; part 2 of 3, the newest, most powerful Red Lantern finally meets her match! Worldkiller-1 is a cosmic menace from the darkest recesses of Kara's past, and he will gladly destroy every one of her crimson teammates to get to her . . . \n\nTrinity Of Sin Pandora #10 (CBR 4/16/2014)\n\nIn the aftermath of 'Forever Evil: Blight,' Pandora has no time to comprehend the burden facing her when she must take on the awesome power of Giganta!\n\nUnwritten Vol. 2 Apocalypse #4 (CBR 4/16/2014)\n\n'War Stories,' part 3 of 3. Sometimes the closest thing you can find to a friend is your enemy's enemy. But when Tom tries to enlist the help of Madame Rausch, he discovers that she's already fighting a war of her own. \n\nThe Vampire Diaries #21 (CBR 4/16/2014)\n\n&quot;Grunge&quot; part 1 of 3! Seattle, the 1990s. Stefan's surrounded himself with young musicians, but will Damon accept this change in lifestyle? \n\nWonder Woman #30 (CBR 4/16/2014)\n\nWonder Woman, the God of War, takes command of the deadliest army ever! The Amazons are back, and they have some scores to settle! \n","torrent":{"xt":"urn:btih:7146ea89c74fa242077b62496f9a59b8a6413171","amp;dn":"Total+DC+Comics+for+4%2F15%2F2014+%28darkhomr%29+%5BALL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7146ea89c74fa242077b62496f9a59b8a6413171","infoHashBuffer":{"type":"Buffer","data":[113,70,234,137,199,79,162,66,7,123,98,73,111,154,89,184,166,65,49,113]},"announce":[],"urlList":[]}}