{"title":"OpenLayers 2.10 Begginers Guide","uid":10051478,"size":18359111,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:71473bb763cc73dc18cea6dbd11e32fd3506a1a2&amp;dn=OpenLayers+2.10+Begginers+Guide&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"asnaebone","files":841,"time":1398609961,"description":"Web mapping is the process of designing, implementing, generating, and delivering maps on the World Wide Web and its products. OpenLayers is a powerful, community driven, open source, pure JavaScript web mapping library. With it, you can easily create your own web map mashup using WMS, Google Maps, and a myriad of other map backends. Interested in knowing more about OpenLayers? This book is going to help you learn OpenLayers from scratch.\n\nOpenLayers 2.10 Beginner's Guide will walk you through the OpenLayers library in the easiest and most efficient way possible. The core components of OpenLayers are covered in detail, with examples, structured so that you can easily refer back to them later.\n\nThe book starts off by introducing you to the OpenLayers library and ends with developing and deploying a full-fledged web map application, guiding you through every step of the way.\n\nThroughout the book, you'll learn about each component of the OpenLayers library. You'll work with backend services like WMS, third-party APIs like Google Maps, and even create maps from static images. You'll load data from KML and GeoJSON files, create interactive vector layers, and customize the behavior and appearance of your maps.\n\nThere is a growing trend in mixing location data with web applications. OpenLayers 2.10 Beginner's Guide will show you how to create powerful web maps using the best web mapping library around.\n\nThis book will guide you to develop powerful web maps with ease using the open source JavaScript library OpenLayers.","torrent":{"xt":"urn:btih:71473bb763cc73dc18cea6dbd11e32fd3506a1a2","amp;dn":"OpenLayers+2.10+Begginers+Guide","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71473bb763cc73dc18cea6dbd11e32fd3506a1a2","infoHashBuffer":{"type":"Buffer","data":[113,71,59,183,99,204,115,220,24,206,166,219,209,30,50,253,53,6,161,162]},"announce":[],"urlList":[]}}