{"title":"The Abduction By Mark Gimenez","uid":8923273,"size":413382,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:715ce498638f99f47a55548b49ec611f45cb7782&amp;dn=The+Abduction+By+Mark+Gimenez&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"manishpant","files":1,"time":1379306514,"description":"The Abduction By Mark Gimenez\n\nBen Brice lives alone in the New Mexico wilderness where he battles memories of Vietnam with oceans of Jim Beam. Miles away in Texas, his estranged son, John, an internet geek-turned-billionaire, half watches his daughter Gracie's soccer game while conducting business on his cell phone. When her mother Elizabeth arrives, the coach reports that her uncle has already collected Gracie. But Gracie has no uncle - she was kidnapped. From international bestselling author Mark Gimenez comes a terrifying child-in-jeopardy thriller in which dark family secrets make the finding of 10-year-old Gracie Brice more uncertain with every passing minute. And so begins a furious race against time to save Gracie from unknown kidnappers. With the FBI camped out in the Brice mansion, the family offers a reward of $25 million. Somehow, Ben and John Brice must find Gracie before it is too late. As the story unfolds with riveting twists and turns, the listener discovers that behind the kidnapping is an extraordinary government plot that could change the course of American history. ","torrent":{"xt":"urn:btih:715ce498638f99f47a55548b49ec611f45cb7782","amp;dn":"The+Abduction+By+Mark+Gimenez","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715ce498638f99f47a55548b49ec611f45cb7782","infoHashBuffer":{"type":"Buffer","data":[113,92,228,152,99,143,153,244,122,85,84,139,73,236,97,31,69,203,119,130]},"announce":[],"urlList":[]}}