{"title":"Blood Stained Banner: The Confederate Flag (BBC Radio 4 Document","uid":6861977,"size":13317315,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7182c850b8ab43ddae2b2c0dabb012e51768a168&amp;dn=Blood+Stained+Banner%3A+The+Confederate+Flag+%28BBC+Radio+4+Document&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fakeplastictrousers2","files":-1,"time":1322933225,"description":"Blood Stained Banner\n\nFrom BBC Radio 4.\n\nThe Confederate Battle Flag was presented to the armies of the Confederacy in a ceremony on November 28th 1861, a few months after the start of the American Civil War. It wasn't the only flag flown by the Confederacy, nor was it the first, but it has become known as The Confederate Flag.\n\nIn 2011 for some people the Confederate Flag represents their region - the South - and is a symbol of the sacrifices their forbears made to defend their homes. They fly it outside their homes, it appears on car bumper stickers and T-shirts.\n\nBut for others it is a potent symbol of racism; inextricably linked to the South's struggle to preserve slavery during the Civil War and its ongoing legacy of segregation and inequality.\n\nGary Younge explores what attitudes to the Confederate Flag say about American identity today. 150 years after the civil war started, and the flag was first flown, can the American South move beyond its divisive legacy?\n\nHe begins his journey in the city of Columbia, where the Confederate Flag flies just a few meters away from the South Carolina State House.","torrent":{"xt":"urn:btih:7182c850b8ab43ddae2b2c0dabb012e51768a168","amp;dn":"Blood+Stained+Banner%3A+The+Confederate+Flag+%28BBC+Radio+4+Document","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7182c850b8ab43ddae2b2c0dabb012e51768a168","infoHashBuffer":{"type":"Buffer","data":[113,130,200,80,184,171,67,221,174,43,44,13,171,176,18,229,23,104,161,104]},"announce":[],"urlList":[]}}