{"title":"Robbery 1967 DvdRip Avi Lee1001","uid":9826415,"size":1345523200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:71fad78bb208d94fae67fc7ca69487a605d35066&amp;dn=Robbery+1967+DvdRip+Avi+Lee1001&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"xultfoad","files":1,"time":1395786960,"description":"Robbery 1967 DvdRip Avi Lee1001 &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0062207/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0062207/&lt;/a&gt; &lt;a href=&quot;\nhttps://en.wikipedia.org/wiki/Robbery_(1967_film)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://en.wikipedia.org/wiki/Robbery_(1967_film)&lt;/a&gt;\nRobbery is a British crime film first released in 1967, directed by Peter Yates. The film is based on a story by Gerald Wilson and stars Stanley Baker, Joanna Pettet and James Booth. Our overall rating for this film is: good. \n\nHas one of the finest car chases in British film history, and the one which took its director Peter Yates to Hollywood at Steve McQueen's request to direct Bullitt.\n\nRoger Ebert\nAugust 29, 1968 \n&quot;Robbery,&quot; an unheralded British film about the Great Train Robbery of 1963, has crept into neighborhood theaters under cover of night. It works, it's good. It doesn't get sidetracked by a lot of cute dialog and psychoanalysis, like &quot;The Thomas Crown Affair&quot; (1968). We don't need to be told why a man would rob a bank; we just want to know how he gets away with it, right? John Dillinger was not a folk hero in vain.\n\nRobbery movies need two things: The robbery plan has to (a) hold water, and (b) be incredibly complicated but work like clockwork, with a couple of nice touches we weren't expecting. By now, a small genre of movies like this has grown up: &quot;Rififi,&quot; &quot;Topkapi,&quot; &quot;Big Deal on Madonna St.,&quot; &quot;The Jokers&quot; and &quot;Grand Slam&quot; (a mediocre movie, to be sure, but with an absolutely first-class compressed-air device for lifting the acrobatic thieves over the electric-eye beams).\n\nMost of the films are fantasies. In &quot;The Jokers,&quot; two Englishmen lifted the crown jewels because they were there. In &quot;Topkapi,&quot; a gymnast dangled upside down over the sealed glass cage for 45 minutes while Peter Ustinov anchored the other end of the rope as, indeed, only Peter Ustinov could. But all of these intricate schemes made sense. The trouble with &quot;The Thomas Crown Affair&quot; is that there SEEMS to be a labyrinthine plan, but when you sort it out it's just a bunch of guys meeting in front of the bank and sticking it up.\n\n&quot;Robbery&quot; avoids this pitfall. It is a reconstruction of how the Great Train Robbery might have happened. Stanley Baker plays the mastermind, drawing together a team of specialists, timing the Edinburgh-London train with a stopwatch, working out in the park, whispering out of the side of his mouth at soccer games, springing the used bank-note expert from prison, insisting on two of everything, and in general behaving like the masterminds in these movies always behave.\n\nThere is a small intrigue between Baker and his, wife (Joanna Pettet), which was apparently thought obligatory. Every movie has to have sexy girl in it, right? The thing is, love scenes mess up good cops and robbers movies, unless they're played by Bogart and Bacall. &quot;The Detective&quot; would have been twice as good without all that phony psychological soul-searching by Lee Remick.\n\nBut audiences are slow to catch on, and think they want a girl in the picture. So Baker and Pettet have their intrigue, mercifully brief. Otherwise, &quot;Robbery&quot; stays on the track: The plans for the job move ahead meticulously, the job comes off more or less on schedule, the gang gets to look at their loot, most of the conspirators are caught because of loopholes you can't quarrel with, and Baker gets away.\n\nA few people have told me they like the last scene of &quot;Thomas Crown,&quot; where McQueen gives Dunaway the slip. They should see &quot;Robbery.&quot; Baker double-crosses Joanna Pettet like she's never been double-crossed before. That'll teach her to try and mess up a good crime movie.\n\nVIDEO\nSize.... 1.25gb\nDuration.... 01:49:19\nCodec.... divx\nFrame Width..... 640\nFrame Height.... 480\nData Rate.... 7983kbps\nFrame Rate.... 29F/S\nAUDIO\nBit Rate.... 128kbps\n2 Channel Stereo\nAudio Sample Rate.... 48KHz\nBits Per Sample 16 Bit/Sample","torrent":{"xt":"urn:btih:71fad78bb208d94fae67fc7ca69487a605d35066","amp;dn":"Robbery+1967+DvdRip+Avi+Lee1001","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"71fad78bb208d94fae67fc7ca69487a605d35066","infoHashBuffer":{"type":"Buffer","data":[113,250,215,139,178,8,217,79,174,103,252,124,166,148,135,166,5,211,80,102]},"announce":[],"urlList":[]}}