{"title":"FSX Just Flight Flying Club X","uid":3917170,"size":249985680,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7298e109a193e4e818375df7f65ca1e828988161&amp;dn=FSX+Just+Flight+Flying+Club+X+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FlightSimerr","files":5,"time":1196545604,"description":"I know someone requested this and I said I wouldn\\&amp;#039;t upload requests to people that don\\&amp;#039;t upload and help themselves. But I really like this add-on and I think everyone that has FSX should have it. It has some excellent planes almost as nice as Cerenado\\&amp;#039;s and some other fun stuff to do as well. I broke them down into .rar files so i hope no one has any problems.\n\n\nThis also comes with a Face Maker application which allows you to put your actual face on the pilot. I took a picture of my self and edited it a little now when i fly my 172 my ugly mug is the one looking out the cockpit!... lol\n\n\nAnyway Hope everyone is happy with this. Let me know how it works out for yah!! Please only make requests if you are an active up loader on the scene. I know I\\&amp;#039;ve only uploaded A small handful of torrents but I\\&amp;#039;ve only been signed up for a week. All of my torrents Got shut down over at Demonoid So i lost all my ratio and torrents that I worked so hard at building. \n\nAnyway enough of my babbling. Don\\&amp;#039;t forget to install the Schweizer update. It improves the flight dynamics and passengers of the RBI Chopper!\n\n\nGood Luck! \n\n\n1 more thing. I\\&amp;#039;m looking for an F35 Joint Strike Fighter for FSX. I don\\&amp;#039;t mind paying for it I was just curious if any of you folks out there have heard or scene anything worth buying. If you could point me in the right direction that would be great!","torrent":{"xt":"urn:btih:7298e109a193e4e818375df7f65ca1e828988161","amp;dn":"FSX+Just+Flight+Flying+Club+X+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7298e109a193e4e818375df7f65ca1e828988161","infoHashBuffer":{"type":"Buffer","data":[114,152,225,9,161,147,228,232,24,55,93,247,246,92,161,232,40,152,129,97]},"announce":[],"urlList":[]}}