{"title":"Million Dead Collection - 2 Albums + Extras","uid":5026917,"size":180732090,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:72ef7c97240e41b8e4163235dbd7516b8a7f5559&amp;dn=Million+Dead+Collection+-+2+Albums+%2B+Extras&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"ndoc","files":31,"time":1248734932,"description":"Contents:\n\n\nBread And Circuses\tMillion Dead\tHarmony No Harmony\t191 kbps (VBR)\nHolloway Prison Blues\tMillion Dead\tHarmony No Harmony\t198 kbps (VBR)\nAfter The Rush Hour\tMillion Dead\tHarmony No Harmony\t208 kbps (VBR)\nPlan B\tMillion Dead\tHarmony No Harmony\t193 kbps (VBR)\nCarthego Est Delenda\tMillion Dead\tHarmony No Harmony\t187 kbps (VBR)\nTo Whom It May Concern\tMillion Dead\tHarmony No Harmony\t202 kbps (VBR)\nLiving The Dream\tMillion Dead\tHarmony No Harmony\t193 kbps (VBR)\nMorgot Kidder\tMillion Dead\tHarmony No Harmony\t188 kbps (VBR)\nMurder And Create\tMillion Dead\tHarmony No Harmony\t191 kbps (VBR)\nAchilles Lung\tMillion Dead\tHarmony No Harmony\t198 kbps (VBR)\nBovine Spungiform Economics\tMillion Dead\tHarmony No Harmony\t190 kbps (VBR)\nFather My Father\tMillion Dead\tHarmony No Harmony\t190 kbps (VBR)\nEngine Driver\tMillion Dead\tHarmony No Harmony\t193 kbps (VBR)\nHarmony No Harmony\tMillion Dead\tHarmony No Harmony\t126 kbps (VBR)\n\n\n\nPornography for Cowards\tMillion Dead\tSong to Ruin\t192 kbps\nBreaking the Back\tMillion Dead\tSong to Ruin\t192 kbps\nI Am the Party\tMillion Dead\tSong to Ruin\t192 kbps\nCharlie &amp; the Propaganda Myth\tMillion Dead\tSong to Ruin\t192 kbps\nMacgyver\tMillion Dead\tSong to Ruin\t192 kbps\nA Song to Ruin.\tMillion Dead\tSong to Ruin\t192 kbps\nSmiling at Stranger on Trains\tMillion Dead\tSong to Ruin\t192 kbps\nRelentless.\tMillion Dead\tSong to Ruin\t192 kbps\nThe Kids Are Going to Love it\tMillion Dead\tSong to Ruin\t192 kbps\nThe Rise and Fall\tMillion Dead\tSong to Ruin\t192 kbps\nGnostic Front\tMillion Dead\tA Song to Ruin\t202 kbps (VBR)\n\n\n\nDepression (Black Flag Cover)\tMillion Dead\tTotal Rock Session\t192 kbps\nPop-punkyone\tMillion Dead\tUnreleased Songs / No Vocals\t192 kbps\nI Gave My Eyes To Stevie Wonder\tMillion Dead\tXFM Music: Response Session, 5-10-04\t224 kbps\nLiving The Dream\tMillion Dead\tZane Lowe - Radio 1 May 10 2005\t196 kbps (VBR)\nHolloway Prison blues\tMillion Dead\tZane Lowe - Radio 1 May 10 2005\t196 kbps (VBR)\n\n\n\nIf you like this, go out and buy it baby! Support the wonderful Frank turner, buy his records and see him on tour too.","torrent":{"xt":"urn:btih:72ef7c97240e41b8e4163235dbd7516b8a7f5559","amp;dn":"Million+Dead+Collection+-+2+Albums+%2B+Extras","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72ef7c97240e41b8e4163235dbd7516b8a7f5559","infoHashBuffer":{"type":"Buffer","data":[114,239,124,151,36,14,65,184,228,22,50,53,219,215,81,107,138,127,85,89]},"announce":[],"urlList":[]}}