{"title":"Robert Charles Wilson - The Affinities","uid":12054923,"size":270888959,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:72fa51e3b707711fb4e940c3baa1173457f4af80&amp;dn=+Robert+Charles+Wilson+-+The+Affinities&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Cybotage","files":11,"time":1435096397,"description":"\nIn our rapidly changing world of social media, everyday people are more and more able to sort themselves into social groups based on finer and finer criteria. In the near future of Robert Charles Wilson's The Affinities, this process is supercharged by new analytic technologies: genetic, brain-mapping, behavioral. To join one of the twenty-two Affinities is to change one's life. It's like family, and more than family. Your fellow members aren't just like you, and they aren't just people who are likely to like you. They're also the people with whom you can best cooperate in all areas of life, creative, interpersonal, even financial.\n\nAt loose ends both professional and personal, young Adam Fisk takes the suite of tests to see whether he qualifies for any of the Affinities and finds that he's a match for one of the largest, the one called Tau. It's utopian--at first. His problems resolve themselves as he becomes part of a global network of people dedicated to helping one another, to helping him, but as the differing Affinities put their new powers to the test, they begin to rapidly chip away at the power of governments, of global corporations, and of all the institutions of the old world; then, with dreadful inevitability, the different Affinities begin to go to war with one another.\n\n\n\nRead by Scott Brick\nFormat: MP3\nBitrate: 64 Kbps\nLength: 9 hrs and 29 mins\nUnabridged Audiobook\nRelease Date:04-21-15","torrent":{"xt":"urn:btih:72fa51e3b707711fb4e940c3baa1173457f4af80","amp;dn":"+Robert+Charles+Wilson+-+The+Affinities","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72fa51e3b707711fb4e940c3baa1173457f4af80","infoHashBuffer":{"type":"Buffer","data":[114,250,81,227,183,7,113,31,180,233,64,195,186,161,23,52,87,244,175,128]},"announce":[],"urlList":[]}}