{"title":"Big Guy and Rusty the Boy Robot (Complete Series)","uid":4457822,"size":5826780638,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:739378198278d259215f9f567f762837ce3e8d3f&amp;dn=Big+Guy+and+Rusty+the+Boy+Robot+%28Complete+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"vazel","files":-1,"time":1224560194,"description":"&quot;The animated series, produced by Columbia TriStar Television and Dark Horse Entertainment, aired from 1999 to 2001, and in many aspects is a more mature and established series. Whereas the comic book seems like only an introduction to the robots, the animated series is full-fledged with a strong back story which links the episodes together. The plot and setting of the series is different from the comic book as the whole story is based around New Tronic City, a fictional American city clearly modeled after New York City. Rusty is the most advanced robot with human emotional grid and nucleoprotonic powers that is going to replace the Big Guy, the Earth&amp;#039;s last line of defense against all threats alien, domestic, or against the American way. However, Rusty is too inexperienced to stand on his own, so the Big Guy is re-commissioned to teach Rusty the way of trade. Rusty idolizes the Big Guy, regarding him as the best robot ever. Big Guy is actually piloted by Lieutenant Dwayne Hunter, who poses as his chief mechanic. Big Guy&amp;#039;s secret is known only to a few, and many situations involve Lt. Hunter&amp;#039;s clever and impromptu excuses to hide the fact from Rusty for two reasons: that the truth could overload Rusty&amp;#039;s emotional grid; and Rusty has trouble keeping secrets.&quot; &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Big_Guy_and_Rusty&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Big_Guy_and_Rusty&lt;/a&gt;\n\nThere is no official release of this entire series on home video so if you like the series please continue seeding so that other fans can download as well. Check my other uploads for other cartoons that never got complete DVD releases.","torrent":{"xt":"urn:btih:739378198278d259215f9f567f762837ce3e8d3f","amp;dn":"Big+Guy+and+Rusty+the+Boy+Robot+%28Complete+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"739378198278d259215f9f567f762837ce3e8d3f","infoHashBuffer":{"type":"Buffer","data":[115,147,120,25,130,120,210,89,33,95,159,86,127,118,40,55,206,62,141,63]},"announce":[],"urlList":[]}}