{"title":"Neil Levy - Consciousness and Moral Responsibility [2014][A]","uid":11223400,"size":1070152,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:73aaf9b3b512b3a2680ebccd8628622d69d35e90&amp;dn=Neil+Levy+-+Consciousness+and+Moral+Responsibility+%5B2014%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1413411671,"description":"Description\nProduct Details\nBook Title: Consciousness and Moral Responsibility\t\nBook Author: Neil Levy (Author)\nHardcover: 176 pages\nPublisher: Oxford University Press (May 6, 2014)\nLanguage: English\nISBN-10: 0198704631\nISBN-13: 978-0198704638\n\nBook Description\nNeil Levy presents an original theory of freedom and responsibility. Cognitive neuroscience and psychology provide a great deal of evidence that our actions are often shaped by information of which we are not conscious; some psychologists have concluded that we are actually conscious of very few of the facts we respond to. But most people seem to assume that we need to be conscious of the facts we respond to in order to be responsible for what we do. Some thinkers have argued that this naive assumption is wrong, and we need not be conscious of these facts to be responsible, while others think it is correct and therefore we are never responsible. Levy argues that both views are wrong. He sets out and defends a particular account of consciousness--the global workspace view--and argues this account entails that consciousness plays an especially important role in action. We exercise sufficient control over the moral significance of our acts to be responsible for them only when we are conscious of the facts that give to our actions their moral character. Further, our actions are expressive of who we are as moral agents only when we are conscious of these same facts. There are therefore good reasons to think that the naive assumption, that consciousness is needed for moral responsibility, is in fact true. Levy suggests that this entails that people are responsible less often than we might have thought, but the consciousness condition does not entail that we are never morally responsible.\n\nAbout the Author\nNeil Levy is an Australian Research Council Future Fellow at the Florey Institute of Neuroscience and Mental Health, Australia, as well as director of research at the Oxford Centre for Neuroethics, University of Oxford. He works on the philosophy of agency and ethical issues in neuroscience, as well as related areas, and has published extensively on these topics. He is the author of Neuroethics (Cambridge University Press, 2007) and Hard Luck (Oxford University Press, 2011) among other books and edits the journal Neuroethics","torrent":{"xt":"urn:btih:73aaf9b3b512b3a2680ebccd8628622d69d35e90","amp;dn":"Neil+Levy+-+Consciousness+and+Moral+Responsibility+%5B2014%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73aaf9b3b512b3a2680ebccd8628622d69d35e90","infoHashBuffer":{"type":"Buffer","data":[115,170,249,179,181,18,179,162,104,14,188,205,134,40,98,45,105,211,94,144]},"announce":[],"urlList":[]}}