{"title":"Death Note The Movie 1 (Live Action) dual audio JAP &amp; ENG dub","uid":5587851,"size":4512272772,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:742b897d485979853d489fc345330d8f198f3717&amp;dn=Death+Note+The+Movie+1+%28Live+Action%29+dual+audio+JAP+%26+ENG+dub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"classic-only","files":3,"time":1274759634,"description":"This is NOT the TV anime! This is the live action movie of Death Note - Death Note the Movie. It is the first Death Note the Movie, IE Death Note The Movie &quot;1&quot;. This is a reseed of an existing torrent I found wasn't on TPB.\n\nSPOKEN LANGUAGES: English (dubbed over by the anime series English actors), Japanese\nSUBTITLES: English\n\nFILES: DEATH NOTE.iso (4.19 GB)\nJPG scans: 2.14 MB JPG cover, 536 KB JPG Disc Label.\n\nSYNOPSIS: Adapated from a highly popular manga, with original characters and plot twists developed only for live-action film, Death Note finally comes to life, directed by the renowned monster film master Shusuke Kaneko with a theme song by Red Hot Chili Peppers.\n\nAce student Light Yagami find the Death Note, a notebook intentionally dropped by a rogue &quot;Shinigami&quot; death god named Ryuk. Any human whose name is written in the notebook dies. Upset with the current justice system, Light takes matters into his own hands and vows to use the power of the Death Note to rid the world of all evil, and become &quot;the God of the new world&quot;.\n\nA mysterious detective known only as &quot;L&quot; quickly learns that the serial killer, nicknamed &quot;Kira&quot; by the public, is located in Japan. Light realizes that L will be his greatest enemy, and a game of psychological cat and mouse between the two begins.\n\nINSTRUCTIONS: Just burn the ISO to disc with ImgBurn! No AVI player necessary.","torrent":{"xt":"urn:btih:742b897d485979853d489fc345330d8f198f3717","amp;dn":"Death+Note+The+Movie+1+%28Live+Action%29+dual+audio+JAP+%26+ENG+dub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"742b897d485979853d489fc345330d8f198f3717","infoHashBuffer":{"type":"Buffer","data":[116,43,137,125,72,89,121,133,61,72,159,195,69,51,13,143,25,143,55,23]},"announce":[],"urlList":[]}}