{"title":"Nanoscale Issues and Perspectives for the Nano Century","uid":15481219,"size":4853959,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:746d6d9061320ea52dffa4a854aec26aeddd4405&amp;dn=Nanoscale+Issues+and+Perspectives+for+the+Nano+Century&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470258186,"description":"Nanoscale Issues and Perspectives for the Nano Century - Nigel M. de S. Cameron, M. Ellen Mitchell (Wiley, 2007).pdf\r\n\r\nAn authoritative examination of the present and potential impact of nanoscale science and technology on modern life\r\nBecause truly transformative technologies have far-reaching consequences, they always generate controversy. Establishing an effective process for identifying and understanding the broad implications of nanotechnology will advance its acceptance and success, impact the decisions of policymakers and regulatory agencies, and facilitate the development of judicious policy approaches to new technology options.\r\n\r\nNanoscale: Issues and Perspectives for the Nano Century addresses the emerging ethical, legal, policy, business, and social issues. A compilation of provocative treatises, this reference:\r\n\r\nCovers an area of increasing research and funding\r\nOrganizes topics in four sections: Policy and Perspectives; Nano Law and Regulation; Nanomedicine, Ethics, and the Human Condition; and Nano and Society: The NELSI Imperative\r\nPresents differing perspectives, with views from nanotechnology's most ardent supporters as well as its most vocal critics\r\nIncludes contributions from professionals in a variety of industries and disciplines, including science, law, ethics, business, health and safety, government regulation, and policy\r\nThis is a core reference for professionals dealing with nanotechnology, including scientists from academia and industry, policy makers, ethicists and social scientists, safety and risk assessment professionals, investors, and others. It is also an excellent text for students in fields that involve nanotechnology","torrent":{"xt":"urn:btih:746d6d9061320ea52dffa4a854aec26aeddd4405","amp;dn":"Nanoscale+Issues+and+Perspectives+for+the+Nano+Century","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"746d6d9061320ea52dffa4a854aec26aeddd4405","infoHashBuffer":{"type":"Buffer","data":[116,109,109,144,97,50,14,165,45,255,164,168,84,174,194,106,237,221,68,5]},"announce":[],"urlList":[]}}