{"title":"ABC of Diabetes, 6th Edition - ABC Series (7Summits)","uid":5525093,"size":13821528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:74df9eeb046f5238afbc3410f8bf8d1f4b8489af&amp;dn=ABC+of+Diabetes%2C+6th+Edition+-+ABC+Series+%287Summits%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7_summits","files":-1,"time":1272748162,"description":"Publisher: BMJ Books, 2010 | ISBN: 1405177845 | 117pages | PDF | 13.1MB\n\n\nThe ABC of Diabetes provides a complete overview of diabetes including the aetiology, diagnosis and management of Types 1 and 2 diabetes, detection and prevention, and the organization of care and support.\n\nWith new chapters on psychological aspects, surveillance for complications, and support for people living with diabetes, this completely revised edition covers the many changes taking place in diabetes care, particularly in screening for Type 2 diabetes; in monitoring and insulin administration; in the organisation and delivery of care; and the increasing prevalence of diabetes in both developed and developing countries.\n\nThis sixth edition covers the early recognition of diabetes and cardiovascular risk as well as preventing complications specific to diabetes. It also addresses the need to deliver diabetes care in a multidisciplinary setting, including the UK Quality and Outcomes Framework, and reflects the increasing emphasis on self-management and patient-centred care, particularly as it relates to lifestyle changes, glycaemic control and patient choice over treatment options.\n\nDrawing on the expertise of the University of Warwick as a centre of excellence for the teaching of diabetes care, the best selling ABC of Diabetes is ideal for GPs, primary care practitioners, practice nurses, diabetes specialist nurses, health visitors and junior doctors.","torrent":{"xt":"urn:btih:74df9eeb046f5238afbc3410f8bf8d1f4b8489af","amp;dn":"ABC+of+Diabetes%2C+6th+Edition+-+ABC+Series+%287Summits%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74df9eeb046f5238afbc3410f8bf8d1f4b8489af","infoHashBuffer":{"type":"Buffer","data":[116,223,158,235,4,111,82,56,175,188,52,16,248,191,141,31,75,132,137,175]},"announce":[],"urlList":[]}}