{"title":"Sekou Bembeya Diabate - Guitar Fo [FLAC] TQMP","uid":6587273,"size":305314644,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:753eb4e41c6429cd091e682dd778aeac4bdfa1d4&amp;dn=Sekou+Bembeya+Diabate+-+Guitar+Fo+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pastafari","files":-1,"time":1312662239,"description":"SÃƒÂ©kou &quot;Bembeya&quot; DiabatÃƒÂ© - Guitar FÃƒÂ¶\n2004\n\n* * * * * * * * * * * * * * * * * * *\n\nAfter listening to this glorious music many times over, I wonder why this man is not an international superstar. The master of a singular guitar style--widely imitated, never duplicated, let alone surpassed--Sekou Diabate still remains a figure of some obscurity. Yes, he has a reputation among cognoscenti of Guinean popular music, most accessibly purveyed through the group Bembaya Jazz, around since 1961 (!). Yet one wonders why a player of his accomplishment nevertheless languishes is relative obscurity.\n\nThis self-taught master of acoustic/electric guitar, who has forged a sound uniquely his own, a kind of amalgam of kora and balafon styles adapted to guitar and filtered through West African popular music approaches, surely belongs atop any delineation of guitar herodom. One detects everything from country blues to Bayou to reggae to sui generis Africanisms in his uniquely crafted approach to his instrument.\n\nPure joy.\n- Jan P. Dennis &quot;Longboard jazzer&quot; (Amazon top 500 reviewer)\n\n* * * * * * * * * * * * * * * * * * *\n\nIf you listened to Bembeya Jazz's long-overdue 2003 comeback album, Bembeya, and said, &quot;But I need more of that unbelievable guitar playing from Diamond Fingers,&quot; then this is the album you've been waiting for. These 11 tracks showcase many different aspects of one of West Africa's absolute top guitarists, from raging electric Manding pop (&quot;Guitar Fo&quot;) to an elegant, jazzy solo piece played on classical guitar (&quot;Mohamed DiabatÃƒÂ©&quot;). In contrast to solo projects by the West African guitarist DiabatÃƒÂ© inevitably gets compared with--Djelimady Tounkara of Mali--this album mostly lets the guitar shine, keeping the vocals that are so central to most Manding recordings largely off stage. When there is singing, DiabatÃƒÂ© does most of it himself.\n\n&quot;Biduman&quot; kicks things off with a classic, cycling Manding riff that tumbles into an animated rumba shuffle with light percussion backing, not a whole band--old school--and that sounds sets the tone for the whole album. Then the man they call Diamond Fingers' unmistakable guitar phrasing comes in, but he's playing on a nylon-string, acoustic guitar. This is the guitar DiabatÃƒÂ© plays at home, and as far as we know, this is the first time he's extensively featured the sound in a recording. He continues in this vein on a smoldering ballad called &quot;Bala Koura.&quot; Then on the beautiful, expansive &quot;Dabia Baba,&quot; a tribute to Malian businessmen and patron of many modern griots, Babani Sissoko, DiabatÃƒÂ© at last lets loose with his signature electric sound. Pure fire!\n\nMany of these tracks are mid-tempo or even slow, giving DiabatÃƒÂ©'s guitar ample room to stretch out and sing. &quot;Guitar Fo&quot; and &quot;Diamond Fingers&quot; are the real show-stoppers here. The latter, a dark, Manding steamer, has been part of Bembeya Jazz's live show for years, and both these pieces pour forth from DiabatÃƒÂ©'s hands with ease and polish that comes only from countless performances. There's a strain of gushing romanticism in DiabatÃƒÂ©'s playing, and it works best in darker, minor key pieces like this where the moody music grounds his sensuous flights in earthy grit.\n\nOnly on the fourth track, &quot;Ikanam Minala,&quot; do vocals enter the mix. DiabatÃƒÂ© is not blessed with a particularly lovely voice, and on two of the three vocal pieces on this album, he is joined by a jelimouso (female griot) named Safiata CondÃƒÂ©. This works reasonably well once, but when we get to &quot;Dianamo,&quot; a ballad that asks too much of DiabatÃƒÂ©'s limited voice, one wishes he had resisted. His vocal works best in the final section of &quot;Diamond Fingers,&quot; in which he resorts to a playful growl reminiscent of Louis Armstrong, or more aptly, DiabatÃƒÂ©'s late countryman, Momo Wandel Soumah. Here, character rather than technique comes through, and that is something DiabatÃƒÂ© has in spades, whether singing or playing.\n\nNot enough African guitarists make albums that really put the focus on their musicianship, so hats off to a great axeman for letting us experience his mastery in such healthy portions. We need more albums like this. \n- afropop.org\n\n* * * * * * * * * * * * * * * * * * *\n\nSÃƒÂ©kou DiabatÃƒÂ© : Solo guitar / Vocal (4-7-9)\nSafiata CondÃƒÂ© : Vocal (4-7)\nMorikÃƒÂ© KouyatÃƒÂ© : Rhythmic guitar\nLayba CondÃƒÂ©: Rhythmic guitar\nMamady CondÃƒÂ©: Bass guitar \nPapa KouyatÃƒÂ© : Percussion \nMory CondÃƒÂ© Mangalan : Drums \nCompositions / Arrangements: SÃƒÂ©kou DiabatÃƒÂ©\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n\n01 - Biduman\n02 - Bala Kora\n03 - Dabia Baba\n04 - Ikanam Minala\n05 - Guitar FÃƒÂ¶\n06 - Wati\n07 - Dianamo\n08 - Ahmed SÃƒÂ©kou\n09 - Diamond Fingers\n10 - ManguÃƒÂ©\n11 - Mohamed DiabatÃƒÂ©\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:753eb4e41c6429cd091e682dd778aeac4bdfa1d4","amp;dn":"Sekou+Bembeya+Diabate+-+Guitar+Fo+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"753eb4e41c6429cd091e682dd778aeac4bdfa1d4","infoHashBuffer":{"type":"Buffer","data":[117,62,180,228,28,100,41,205,9,30,104,45,215,120,174,172,75,223,161,212]},"announce":[],"urlList":[]}}