{"title":"Spotify Installer.","uid":5085573,"size":2690615,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:75874c34741540589cabecba6d8f73c17a971eec&amp;dn=Spotify+Installer.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"zurera","files":1,"time":1252689200,"description":"Hasta ahora sÃƒÂ³lo podÃƒÂ­amos escuchar mÃƒÂºsica gracias a Internet mediante la descarga discos, la compra de canciones a servicios como iTunes, las radios online o los podcasts dedicados a la mÃƒÂºsica. Spotify rompe con todo lo anterior y cambia de forma radical nuestra manera de escuchar mÃƒÂºsica, ya que pone al alcance de cualquier usuario una base de datos faraÃƒÂ³nica, gracias a la cual podemos escuchar la mÃƒÂºsica que queramos siempre y cuando tengamos conexiÃƒÂ³n a Internet.\n\n  Spotify es un proyecto de un grupo de programadores suecos que cuentan con el apoyo de gran parte de las discogrÃƒÂ¡ficas multinacionales mÃƒÂ¡s importantes y cuyo objetivo es el de ofrecer al pÃƒÂºblico un sistema para escuchar mÃƒÂºsica mediante streaming a gran calidad. Pero Spotify no funciona como el resto de programas de este estilo como last.fm o blip (que hacen una selecciÃƒÂ³n musical a partir del artista que elijamos, creando ellos mismos la lista de reproducciÃƒÂ³n), sino que, tras buscar el artista, la interfaz del programa nos muestra, tomando como referencia los catÃƒÂ¡logos de EMI, Universal, Sony BMG y Warner Music (entre otras muchas), toda la mÃƒÂºsica de ese artista en cuestiÃƒÂ³n y permitiÃƒÂ©ndonos escuchar ÃƒÂ¡lbumes enteros o crear listas de reproducciÃƒÂ³n propias con la mÃƒÂºsica que nosotros elijamos, ya sea de un artista o varios a nuestra elecciÃƒÂ³n, pudiendo archivar listas de reproducciÃƒÂ³n con nuestro usuario para despuÃƒÂ©s escucharlas en otro ordenador y no tener que repetir las bÃƒÂºsquedas. TambiÃƒÂ©n podremos consultar la biografÃƒÂ­a, discografÃƒÂ­a y artistas relacionados de cada uno de estos autores. \n\n  Otra de las funciones mÃƒÂ¡s llamativas de esta aplicaciÃƒÂ³n es su radio, que utiliza un sistema poco ortodoxo, pero realmente prÃƒÂ¡ctico, para elegir la mÃƒÂºsica que queremos escuchar. Tan solo deberemos elegir la dÃƒÂ©cada y el estilo a escuchar y Spotify nos lanzarÃƒÂ¡ a una lista de reproducciÃƒÂ³n que cumpla los parÃƒÂ¡metros impuestos por nosotros, permitiÃƒÂ©ndonos acceder a la biografÃƒÂ­a o a toda mÃƒÂºsica del artista que estÃƒÂ© sonando en cualquier momento y continuar con la sesiÃƒÂ³n de radio cuando nosotros queramos. \n\n  De momento el programa se encuentra en desarrollo y es totalmente gratuito, aunque pronto empezaremos a escuchar algÃƒÂºn corte publicitario cada ciertos temas. TambiÃƒÂ©n se ofrecen dos versiones de pago disponibles una para un dÃƒÂ­a y otra mensual a 1 y 10 dÃƒÂ³lares respectivamente. \n","torrent":{"xt":"urn:btih:75874c34741540589cabecba6d8f73c17a971eec","amp;dn":"Spotify+Installer.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75874c34741540589cabecba6d8f73c17a971eec","infoHashBuffer":{"type":"Buffer","data":[117,135,76,52,116,21,64,88,156,171,236,186,109,143,115,193,122,151,30,236]},"announce":[],"urlList":[]}}