{"title":"Archie Roach - Charcoal Lane [1992][FLAC]","uid":8757883,"size":264075770,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:75c4ae423884a80ae5b0eb0ff783d19c3c14c7be&amp;dn=Archie+Roach+-+Charcoal+Lane+%5B1992%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"dickspic","files":12,"time":1375182844,"description":"Artist: Archie Roach\nRelease: Charcoal Lane\nReleased: 1992\nLabel: Hightone\nCatalog#: 8037\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: AUS\nStyle: folk\n\nNative Born 4:00 \nCharcoal Lane 3:21 \nMunjana 7:36 \nI've Lied 3:17 \nDown City Streets 4:04 \nTook The Children Away 5:24 \nSister Brother 4:27 \nBeautiful Child 4:01 \nNo No No 3:49 \nSummer Of My Life 3:34 \n\nArchie Roach is not only unknown in the US (see last reviewer comments), but also not terribly well known in mainstream Australia. He is one of several Australian singer-songwriters to be associated with Paul Kelly, (who deserves a lot of credit for lending his name and influence to artists who have a great deal to contribute but scant opportunity), and shares some of Kelly's uncomplicated, storytelling songwriting style. I bought Charcoal Lane years ago after I saw Roach perform at the Royal Derby Hotel in Brunswick St., Fitzroy - an inner suburb of Melbourne where Roach spent a great deal of time in his youth - and was immediately affected by the pure emotion in &quot;Took the Children Away&quot;, an autobiographical piece that draws on the experiences of both Roach and his wife. Roach has trodden a hard road, among other things beating alcohol, prejudice and the experience of being removed from his family at a young age, part of the infamous &quot;stolen generation&quot; of koorie children removed from their families in Australia in the 50's and 60's under the then government's reprehensible &quot;White Australia&quot; policy. Other songs, such as the title track and &quot;Down City Streets&quot;, tell of life in Melbourne's inner city, while &quot;Native Born&quot; details the depth of aboriginals' connection with the land and nature.\nThe wonderful thing about Roach's art is the straightforward manner in which he talks about his heritage, his experiences and his struggles without surrendering to bitterness or hatred. Artists such as Roach, Kev Carmody, Paul Kelly, Yothu Yindi and Midnight Oil (to name a few) have played a critical role in informing the Australian public about issues central to the aboriginal psyche in such a manner as to educate without leveling blame in an overly aggressive fashion, allowing the public to come to terms with a shameful chapter in Australia's past without blame-shifting and defensiveness. The result has been an admittedly slow, but clear shifting of national sentiment (particularly amongst the younger generation) towards reconciliation between black and white Australia, a process that most reasonable people see as both inevitable and necessary, and which most recently led to the symbolic (and almost universally acclaimed) choice of Cathy Freeman to ignite the Olympic flame in Sydney.\n\nAnyone interested in uncomplicated honesty and a clear example of the unparalleled ability of music to communicate, educate and facilitate healthy dialog about difficult and complex issues could do much worse than listen to this wonderful piece of music. Its uncomplicated, straightforward style is rewarding and accessible on a number of levels, and to my mind ranks amongst the most important pieces of Australian music of the last 25 years.","torrent":{"xt":"urn:btih:75c4ae423884a80ae5b0eb0ff783d19c3c14c7be","amp;dn":"Archie+Roach+-+Charcoal+Lane+%5B1992%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75c4ae423884a80ae5b0eb0ff783d19c3c14c7be","infoHashBuffer":{"type":"Buffer","data":[117,196,174,66,56,132,168,10,229,176,235,15,247,131,209,156,60,20,199,190]},"announce":[],"urlList":[]}}