{"title":"The Infamous Stringdusters - Things That Fly [2010][EAC,log,cue.","uid":8251266,"size":300059216,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:75e12b8cef56fd7d134f1bb13e187fb18323e3a0&amp;dn=The+Infamous+Stringdusters+-+Things+That+Fly+%5B2010%5D%5BEAC%2Clog%2Ccue.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":16,"time":1363174033,"description":"Artist: The Infamous Stringdusters\nRelease: Things That Fly\nMusicBrainz: 367f4e9e-df65-4941-80f6-05686fb0c277\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nOriginal Release / Sugar Hill / SUG-CD-4059\nReleased: 2010-04-20\nCountry: US\n\n\n\n01. You Can't Stop the Changes (03:55)\n02. In God's Country (02:52)\n03. All the Same (04:49)\n04. Magic #9 (03:25)\n05. Those Who've Gone On (03:13)\n06. It'll Be Alright (03:21)\n07. Masquerade (05:12)\n08. Taking a Chance (03:28)\n09. Toy Rockets (00:47)\n10. Love One Another (04:01)\n11. 17 Cents (02:40)\n12. Not Tonight (03:43)\n13. The Deputy (04:09)\n\nThings That Fly finds bluegrassers the Infamous Stringdusters at a bit of a crossroads. Their first two albums were more traditionally minded affairs, with the band's high-lonesome harmonies and fleet-fingered picking applied to relatively old-school (if not totally trad) formats. For their third album, though, they decided to mix things up, seeming to ask themselves in the process, &quot;What is bluegrass?&quot; Toward that end, they push gently at the boundaries of bluegrass here, stopping short of blowing a hole in the wall and scrambling out the other side as, for instance, Chris Thile and the Punch Brothers have done. For one thing, they've expanded their instrumentation; in addition to the usual fiddles, banjos, mandolins, etc., the multi-talented Stringdusters employ not only lap steel, but very un-bluegrassy axes like organ and viola. And while the band's trademark vocal blend is a fine one, this time around they've varied up the vocals by bringing in a few guest singers, including country star Dierks Bentley, Aoife O'Donovan of alt-folk band Crooked Still, and singer/songwriter Sarah Siskind (who happens to be the wife of Stringdusters bassist/singer Travis Book). But the most striking change that takes place on Things That Fly is in the songs themselves. On one hand, the band pushes the envelope by delivering a twang-filled cover of U2's &quot;In God's Country,&quot; but just as important are the strides they've made with some of their own compositions, like the sultry, almost funky &quot;All the Same,&quot; the harmonically complex ballad &quot;Masquerade,&quot; and &quot;Taking a Chance on the Truth,&quot; which would be a pop/rock tune if it was played on electric instruments. Admittedly, there are other newgrass bands that have already gone farther down the road of stylistic expansion, but for the Infamous Stringdusters, Things That Fly marks an undeniable progression.","torrent":{"xt":"urn:btih:75e12b8cef56fd7d134f1bb13e187fb18323e3a0","amp;dn":"The+Infamous+Stringdusters+-+Things+That+Fly+%5B2010%5D%5BEAC%2Clog%2Ccue.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75e12b8cef56fd7d134f1bb13e187fb18323e3a0","infoHashBuffer":{"type":"Buffer","data":[117,225,43,140,239,86,253,125,19,79,27,177,62,24,127,177,131,35,227,160]},"announce":[],"urlList":[]}}