{"title":"Miles Davis - Cookin' With The Miles Davis Quintet (1956)","uid":4618844,"size":82754727,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:75f303a42dfdf187ed41aca8790c800772bab9e8&amp;dn=Miles+Davis+-+Cookin%5C%27+With+The+Miles+Davis+Quintet+%281956%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":7,"time":1230948890,"description":"Miles Davis - Cookin' With The Miles Davis Quintet\nRecorded: On 11 May and 26 October 1956\nBitrate: mp3 320kbps\n\nMany jazz fans of the era and of present day considered this to be the best small combo ever in jazz music. Not only did they improve as a unit while they were together but each member benefited individually from the association. Miles found an incentive to play again and reached new heights because of the musical environment he had created in choosing his sidemen. The sidemen, in turn, flowered in the climate of the Davis latitude. By the beginning of 1957 Coltrane had broken the shackles of self-doubt and breathed freely into his singing horn. Garland had recorded successfully as a trio pianist ( A Garland of Red ) and the Chambers-Jones duo was fused into the most powerful of pulses.\n\nIn essence, what you are hearing is a portion of the group's repertoire. Some have been recorded before by Miles but with different personnel. This is similar to the way bands used to record. I do not refer to the calling of tunes as in a set but the idea of recording numbers that have been in the book for a while, ones with which the musicians are completely at home. I'm sure this had a lot to do with the great string of records that Count Basie made for Decca in the Thirties and although a small group has less difficulty in &quot;shedding&quot; an arrangement, the benefits they reap from experience of playing a piece on the job for several months prior to recording it, are unmistakable.\n\nThe Personnel: \nMiles Davis - Trumpet\nJohn Coltrane - Tenor saxophone\nPhilly Joe Jones - Drums\nRed Garland - Piano\nPaul Chambers - Bass\n\nMiles Davis - Cookin' With The Miles Davis Quintet Tracks:\n01 My Funny Valentine 6:04\n02 Studio Chatter 0:25\n03 Blues by Five10:02\n04 Airegin 4:29\n05 Tune Up/When Lights Are Low 13:13","torrent":{"xt":"urn:btih:75f303a42dfdf187ed41aca8790c800772bab9e8","amp;dn":"Miles+Davis+-+Cookin%5C%27+With+The+Miles+Davis+Quintet+%281956%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75f303a42dfdf187ed41aca8790c800772bab9e8","infoHashBuffer":{"type":"Buffer","data":[117,243,3,164,45,253,241,135,237,65,172,168,121,12,128,7,114,186,185,232]},"announce":[],"urlList":[]}}