{"title":"Vile Bodies - by Evelyn Waugh (1930 6CDs unabridged)","uid":4512359,"size":339241213,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:761b55f4de14ff6ad6cb2bbc67991fcca3970493&amp;dn=Vile+Bodies+-+by+Evelyn+Waugh+%281930+6CDs+unabridged%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"paulyearwig","files":-1,"time":1226836014,"description":"In the years following the First World War a new generation emerges, wistful and vulnerable beneath the glitter. The Bright Young Things of Twenties Mayfair, with their paradoxical mix of innocence and sophistication, exercise their inventive minds and vile bodies in every kind of capricious escapade. In a quest for treasure, a favourite party occupation, a vivid assortment of characters hunt fast and furiously for ever greater sensations and the fulfilment of unconscious desires. \n&quot;Evelyn Waugh&amp;#039;s second novel, written in 1930, boasts an enjoyable collection of zanies. This satire of the London smart set relies on rich conversational rhythms and repartee, and Robert Hardy works wonders of versatility in his reading. Waugh&amp;#039;s comedy is served well by Hardy&amp;#039;s attentive, animated performance.&quot; \nAudioFile \n\n\nThe minute one hears certain voices, the tone is set for the entire reading. Hardy barely has the first sentence out of his mouth before the listener knows that this is British satire of the first order. Maybe it takes another sentence or two before we know we are in what was known as the Roaring 20s in the States. Decadence, sophistication- real and imagined- a love story or two, and even a treasure hunt make this one of Waugh&amp;#039;s best books. They make great British film comedies, and audiobooks, because Waugh has deliciously descriptive skills regarding clothes and manners and is brilliant at using dialog to portray character. Some listeners may find the story dated, but others will love this dip into decadence. \n\nrunning time 5 hours 20 mins","torrent":{"xt":"urn:btih:761b55f4de14ff6ad6cb2bbc67991fcca3970493","amp;dn":"Vile+Bodies+-+by+Evelyn+Waugh+%281930+6CDs+unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"761b55f4de14ff6ad6cb2bbc67991fcca3970493","infoHashBuffer":{"type":"Buffer","data":[118,27,85,244,222,20,255,106,214,203,43,188,103,153,31,204,163,151,4,147]},"announce":[],"urlList":[]}}