{"title":"Legends of Benin [FLAC] TQMP","uid":6288258,"size":460293221,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:772f2b397e268e58b4a28a6ff55d450263c8d1b6&amp;dn=Legends+of+Benin+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pastafari","files":-1,"time":1301696601,"description":"Various Artists - Legends of Benin\n2009\n\nReview --\nAnalog Africa's Samy Ben Redjeb has spent a lot of time in Benin getting the story of the country's music down, both on paper and on disc. Legends of Benin is his label's third compilation of wicked Beninois groove, and it's easily on par with the first two, one of which was devoted entirely to TP Orchestre Poly-Rythmo, Benin's greatest band. Poly-Rythmo actually make a few appearances as a backing band on this compilation, which is one of uncountable reasons to check it out. The tracklist focuses on four of Benin's greatest, most distinctive bandleaders-- Honore Avolonto, Antoine Dougbe, Gnonnas Pedro, and El Rego-- and each brings something special to the table.\n\nEach singer could support a compilation on his own, so getting to hear all four duke it out in the same space is a total blast-- they had decidedly different approaches to floor-burning Afrofunk, but there's not a track here that won't make you want to move. Two of the men featured here preferred to lead their own bands, with musicians they selected. Gnonnas Pedro put together a succession of tight outfits over his career, assembling groups that could throw down a hard funk groove one minute and then turn around and reel off a lilting Afro-Cuban track. El Rego's Commandos often came off a little more rocked-up than their counterparts but could hold their own with just about any kind of beat. Antoine Dougbe and Honore Avolonto tended to bring in the ringers; each spent time with both Poly-Rythmo and sensational trumpeter Ignace de Souza's Black Santiago orchestra.\n\nDe Souza and Black Santiago (and before Black Santiago, the Melody Aces) were among the first groups in Benin to incorporate Western soul and R&amp;B into their sound in the early 1960s, and they make a perfect backing band for Avolonto on &quot;Dou Dagbe We&quot;, a burbling Afrobeat track underpinned by a laidback organ figure and head-nodding bass line. He's that much harder with Poly-Rythmo behind him on &quot;Tin Lin Non&quot;, a sick Fela-influenced Afrofunk workout that shares a lot with what was being recorded next door in Nigeria around the same time in the mid-70s. Yehouessi Leopold uses his drumsticks more to kiss his snare than to smack it, painting behind the needling guitar and staccato bass as the catchy vocal call-and-response works itself into a lather up top.\n\nDougbe's track with Poly-Rythmo, &quot;Ya Mi Ton Gbo&quot;, has an infectious bounce buoyed by a summery organ, and it reaches an ebulliently joyous high as Dougbe calls out to Poly-Rythmo vocalists Vicky and Eskill, who provide spirited backing for Dougbe's rapid-fire vocal. The song is positively weightless, but if that track floats, &quot;Non Akuenon Hwlin Me Sin Koussio&quot; practically scours the earth with its heavy reggae thump. The song's completely unexpected modulation after the first couple of verses for a concise instrumental jam is a great example of the kind of detailed, thoughtful composition that makes funk from Benin so constantly rewarding to listen to.\n\nGnonnas Pedro and His Dadjes Band's 1966 cut &quot;Dadje Von O Von Non&quot; updates an old rhythm called agbadja, spinning it into a crazily memorable light-speed bed for an earworm of a vocal call-and-response. Pedro was an eclectic bandleader, and that shows even in the small sample heard here. &quot;La Musica en Verite&quot; shows his Afro-Cuban side, combining hints of Cubano son with voodoo rhythms, highlife guitar, and a touch of psychedelic organ to emerge with something all his own. &quot;Okpo Videa Bassouo&quot; is more of a crash-and-bash, chicken-scratch funk track with heart-stopping drum fills and stabbing horns.\n\nThat leaves El Rego, whose &quot;Feeling You Got&quot; launched the entire &quot;jerk&quot; scene in Benin. Dig the accordion holding down the chord progression as a raw guitar hammers the beat. Ghanaian singer Eddy Black Power, who clearly had some James Brown records, provides the gritty soul-man vocal. &quot;Vimado Wingnan&quot; is spiked with a wah'd-out guitar solo, as if the buzzy organ and wild drums (catch the insane break two minutes in) weren't enough to drive it home by themselves. He dials it back for some slow, airy funk on &quot;E Nan Mian Nuku&quot;.\n\nThe sequencing of the tracks is well done, moving you from a light bounce to a heavy rhythm and back, playing up the variety without throwing you out of the groove. Mixing the four bandleaders together makes it feel a little like a battle of the bands where everyone won, and it accentuates the contrasts in their styles while allowing for the similarities to show through. Analog Africa is mining serious gold from Benin's funky past, and Legends of Benin is yet more proof that the country had an incredible scene in the 60s and 70s, equal in quality if not quantity to the country's much larger neighbors.\n-- Pitchfork's Best New Reissue (8.5)\n\nAnalog Africa &lt;a href=&quot;\nhttp://analogafrica.blogspot.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://analogafrica.blogspot.com&lt;/a&gt;\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01 - Gnonnas Pedro Et Ses Dadjes - DaDJe Von O Vone\n02 - El Regno Et Ses Commandos - Feeling You Gote\n03 - Antoine Dougbe - Honton Soukpou Gnone\n04 - El Rego Et Ses Commandos - E Nan Mian Nukue\n05 - Honore Avolonto Et L'orchestre Poly-Rythmo - Lin Tin None\n06 - Gnonnas Pedro Et Ses Panchos - Okpo Videa Bassouoe\n07 - Antoine Dougbe Et L'orchestre Poly-Rythmo - Ya Min Ton Gboe\n08 - Antoine Dougbe - Nou Akuenon Hwlin Me Sin Koussioe\n09 - Honore Avolonto - Na Mi Do Gbe Hue Nue\n10 - El Rego Et Ses Commandos - Vimado Wingnane\n11 - Honore Avolonto Et L'orchestre Black Santiago - Dou Dagbe Wee\n12 - El Rego Et Ses Commandos - DJobimee\n13 - Antoine Dougbe - Kovito Gbe De Towee\n14 - Gnonnas Pedro Et Ses Dadjes - La Musica En Veritee\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\n-----------------------------------\nNot my rip. Kudos to original releaser\n-----------------------------------\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;","torrent":{"xt":"urn:btih:772f2b397e268e58b4a28a6ff55d450263c8d1b6","amp;dn":"Legends+of+Benin+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"772f2b397e268e58b4a28a6ff55d450263c8d1b6","infoHashBuffer":{"type":"Buffer","data":[119,47,43,57,126,38,142,88,180,162,138,111,245,93,69,2,99,200,209,182]},"announce":[],"urlList":[]}}