{"title":"Wildgames Bubble Town- Pastry Passion- Leeloo's Talent Agency","uid":4719965,"size":100878363,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7742391ef8d43a9fca2c077f23ab3a0f81176bd0&amp;dn=Wildgames+Bubble+Town-+Pastry+Passion-+Leeloo%5C%27s+Talent+Agency&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"no_cr","files":3,"time":1234469538,"description":"Bubble Town\n\nSave Borb Bay from calamity in this addictive arcade/puzzler - one shot from the chute and you'll be hooked! This MySpace and Facebook phenomenon is now available for download. Bubble Town will test your wits, not just your reflexes. Join an unforgettable cast of characters for an adventure of bubble-popping proportions. Choose from Journey Mode or Arcade Mode, but watch out for the Danger Zone. Pick from four difficulty levels, and rest assured, Bubble Town's addictive puzzle and arcade gameplay will provide you with hours of fun! \n\nPastry Passion\n\nWhip up a passion for puzzles with this sweet treat! Help Henri, a high-spirited baker with a penchant for pastries, arrange scrumptious ingredients into groups of three or more to make colorful confections. Boost your bakery with helpful tools and rise to the rank of Master Pastry Chef in level after level of mouth-watering matching fun! Featuring two original game modes, special in-game trophies, and rich full-screen graphics, Pastry Passion is a delightful indulgence for your mind. \n\n\nLeeloo's Talent Agency\n\nHelp a movie buff start her own talent agency! Leeloo's Talent Agency combines time management and hidden object gameplay to a create fun, fast-paced world. Welcome aspiring actors to Leeloo's office and get them ready for their big break. Hand out scripts, apply make-up, film screen tests, sign contracts, and more. Once the actors are taken care of, you'll need to get the set ready for a full day of filming by locating missing items. Play over 70 colorful levels and make 7 movies in Leelo's Talent Agency! \n","torrent":{"xt":"urn:btih:7742391ef8d43a9fca2c077f23ab3a0f81176bd0","amp;dn":"Wildgames+Bubble+Town-+Pastry+Passion-+Leeloo%5C%27s+Talent+Agency","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7742391ef8d43a9fca2c077f23ab3a0f81176bd0","infoHashBuffer":{"type":"Buffer","data":[119,66,57,30,248,212,58,159,202,44,7,127,35,171,58,15,129,23,107,208]},"announce":[],"urlList":[]}}