{"title":"[InfernalRestraints] Sister Dee-The Fly [540p]","uid":13996183,"size":549192722,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:792422904e1348b6ef24eb565cc059765a787a01&amp;dn=%5BInfernalRestraints%5D+Sister+Dee-The+Fly+%5B540p%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"distinc","files":1,"time":1458741982,"description":".......:::Screenshots:::.......\r\n\r\n \nhttp://imagedisco.net/?v=6558079915\r\n \nhttp://imagedisco.net/?g=4866314610\r\n\r\n\r\n\r\nDescription:\r\n\r\nTrapped in the floor, first Sister Dee gets the ring gag, then she gets Mr. Pogo. PD wants more flavor and throws her hair into her mouth, too. She has her face distorted into a grotesque mask of clamps and hooks.\r\n\r\nChained to the mattress, Sister Dee is set up to take Mr. Pogo in her ass while PD takes her pussy. Then its time to violate her sore little back door. When PD asks if she is ready to suffer for him, he means it. She gets Mr.Pogo in the pussy, but she also gets the cane across her feet. When she has screamed enough for him again, PD takes her pussy again.\r\n\r\nHis little slut is trotted in, hooded and bound, and shackled to her post. She may be struggling to breathe but her pussy is dripping wet. She moans and screams for PD pleasure constantly while he canes her tits, thighs and pussy. It only takes a little bit of tape to completely cut off her airways. The slut even cums at command, shackled and screaming through her tiny air hole.\r\n\r\nCock and balls take a tour of her mouth while she kneels before him. She sucks his cock like it's her mission in life, taking it all the way down her throat. Her blow job well done gets a reward of load all over her face and a seat in a very special chair.\r\n\r\nFinally, her tits are cuffed and her clit and tongue are clamped. Bound tightly, she is subjected to another attack of the vibrator. After PD has heard enough of her moans, he goes after a few screams. With a ring gag firmly in place, her head is covered in a sack of flies. They buzz around her and as she screams, begging and pleading, they even fly into her mouth","torrent":{"xt":"urn:btih:792422904e1348b6ef24eb565cc059765a787a01","amp;dn":"%5BInfernalRestraints%5D+Sister+Dee-The+Fly+%5B540p%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"792422904e1348b6ef24eb565cc059765a787a01","infoHashBuffer":{"type":"Buffer","data":[121,36,34,144,78,19,72,182,239,36,235,86,92,192,89,118,90,120,122,1]},"announce":[],"urlList":[]}}