{"title":"Eric Hufschmid - Pt.9 - Eisenhower Vs. Hitler - The Death Camps","uid":4493918,"size":12337813,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:7939ad44a7837d02153cb476103f3bf3bfcce6a8&amp;dn=Eric+Hufschmid+-+Pt.9+-+Eisenhower+Vs.+Hitler+-+The+Death+Camps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Hufschmid_Jr","files":-1,"time":1226095981,"description":"Will You Help Expose The Corruption? &lt;a href=&quot;\nhttp://www.erichufschmid.net/TFC/HowToHelp.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.erichufschmid.net/TFC/HowToHelp.html&lt;/a&gt;\n\nA French Professor, Robert Faurisson, claims to have read thousands of pages of memoirs of World War 2 from Eisenhower, Churchill, and de Gaulle, and there was not a single word about gas chambers\n\nAs A Thanks From The Jewish Community, A Thing That Should Come As A Good News:\n\nProfessor Faurisson was attacked by three Jews while walking his dog.\nThey kicked him in the face, and broke his jaw.\n\n\nWhy were the prisoners wearing uniforms?\nAll Nazi camp photos show that the prisoners wore uniforms, such as the prisoners at Dachau below in 1945 who are cheering at the Americans. \n\nThe Jews tell us that piles of shoes, hair, clothing, and other personal items are evidence of a phenomenal extermination program, but prisons all over the world routinely replace the clothing of prisoners with uniforms, and they often cut the hair of male prisoners and provide razors for them to shave.\n\n\n\nPiles of clothing and hair do not prove that there was an extermination program. \nIf they really were &quot;death camps&quot;, how did Finkelstein's parents survive? Why did the Nazis provide beds for the prisoners? \n\n\nWhy do Jews want to arrest Holocaust Deniers?\n\nThe Jews are not merely ignoring the Holocaust, they are actively trying to stop people from looking into it, and they want people arrested for investigating the Holocaust. \n\nIn 1933 the Zionist Jews staged a boycott of Germany to create economic problems for Germany, and to create anger towards Jews.  \n- &quot;Judea Declares War On Germany&quot;\n\n\nCrystal Night:\nConsidering that the Nazis had control of Germany for five years, why would they break windows if their goal was to exterminate Jews? Why would the Germans attack buildings if they wanted to exterminate Jews?\n\nWhy didn't the German police quietly arrest the Jews without damaging their buildings and disrupting life for their citizens?\n\nThe obnoxious rampage that we know as Crystal Night appears to be an act of terrorism to frighten Jews into leaving Germany. Not surprisingly, most of the Jews who were still in Germany as of 1938 moved out after that rampage.\n\nAmerica was only accepting some of those German Jews, so a lot of them ended up in Palestine. \n\n----------------------------------------------------------------------------------\n\nThere is only one way to resolve all of these disputes. Specifically, the European goyim must grow a backbone and get rid of the laws that prohibit investigations of the Holocaust.\n\nWhat is wrong with the European Goyim? If you have goy friends or relatives in Europe, tell them to stop embarrassing us, and starting helping us! \n\n\n\n             Eric Hufschmid... Avoiding Zionist Tricks And Traps Since 2002. \n                            \n                         Learn Their Tricks And Join Me!\n                             \n                              www.EricHufschmid.net","torrent":{"xt":"urn:btih:7939ad44a7837d02153cb476103f3bf3bfcce6a8","amp;dn":"Eric+Hufschmid+-+Pt.9+-+Eisenhower+Vs.+Hitler+-+The+Death+Camps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7939ad44a7837d02153cb476103f3bf3bfcce6a8","infoHashBuffer":{"type":"Buffer","data":[121,57,173,68,167,131,125,2,21,60,180,118,16,63,59,243,191,204,230,168]},"announce":[],"urlList":[]}}