{"title":"An Introduction to the Ajanta Caves - With Examples of Six Caves","uid":10492284,"size":20296159,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a078776ee830dcf6d33beb94655a75de8faafed&amp;dn=An+Introduction+to+the+Ajanta+Caves+-+With+Examples+of+Six+Caves&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1404567814,"description":"An Introduction to the Ajanta Caves: With Examples of Six Caves by Rajesh Singh\nEnglish | 2012 | 256 pages | PDF | 19,4 MB\n\nThis is the most up to date book on the art, architecture, and history of the famous Ajanta caves (Maharashtra, India, UNESCO World Heritage Site since 1983). It includes chapters on political background, religious background, and epigraphy. It includes a summary of the latest research carried out in the last few decades. It brings together critical information from scholarly books and periodicals.\n\nThere are 284 colour photographs depicting architecture, paintings, sculpture, and decorative motifs in comprehensive detail. For the first time at least one photograph of all the narrative themes of the Ajanta paintings have been printed in a book.\n\nThe identifications of the painted themes by James Burgess, A. Foucher, James Griffiths, Dieter Schlingloff, and Monika Zin have been included to create a collective up-to-date corpus. On historical matters, the timeline of Walter M. Spink for the Ajanta caves has been included.\n\nIn order to satisfy the curiosities of the general reader and invoke research interest in advanced learners, an account of how the excavation progressed step-by-step in some of the caves has been included.","torrent":{"xt":"urn:btih:7a078776ee830dcf6d33beb94655a75de8faafed","amp;dn":"An+Introduction+to+the+Ajanta+Caves+-+With+Examples+of+Six+Caves","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a078776ee830dcf6d33beb94655a75de8faafed","infoHashBuffer":{"type":"Buffer","data":[122,7,135,118,238,131,13,207,109,51,190,185,70,85,167,93,232,250,175,237]},"announce":[],"urlList":[]}}