{"title":"Jacob Z Flores Provincetown Books 1-4 MM Romance","uid":11471740,"size":846671946,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7a1520797e239b7bb765d88e6657c70f8d4d205b&amp;dn=Jacob+Z+Flores+Provincetown+Books+1-4+MM+Romance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"katelynor","files":5,"time":1416097434,"description":"This series surprised me. Again, maybe not in my favorites list, but fun and worth a listen if you enjoy the genre of MM romance.\n\nWhen Love Takes Over\n\nWritten by: Jacob Z. Flores\nNarrated by: T.J. Jamesin\nLength: 9 hrs and 15 mins\nSeries: Provincetown, Book 1\nUnabridged Audiobook\n\nZach Kelly's life is a shambles. His boyfriend of three years dumped him, and his writing career is going nowhere. On a whim, he heads to Provincetown, Massachusetts, to nurse his broken heart and figure out his next step. He's expecting to find rest and relaxation on the sandy beaches of Cape Cod. Instead, Zach meets a hunky porn star during a chance encounter at a leather shop he mistakes as a place to buy a belt that is definitely not for whipping.\n\nVan Pierce is smitten when shy and inexperienced Zach crashes through a shelf of fetish gear. Though Van's got an insatiable appetite for men on and off the set, his porn persona, Hart Throb, hides a broken heart. He's struggling to find the reality the porno set doesn't offer, and Zach is fighting to find the fantasy that will set his writing on fire. The odd goofball and the suave beefcake may either find love amid Provincetown's colorful pageantry where summer never seems to end-or more heartbreak than either can imagine.\n\nChasing the Sun: Provincetown, Book 2\n\nAs a physician and prominent citizen of Victoria, Texas, Dr. Gil Kelly took a hard fall when his vengeful wife revealed his infidelity with other men. Closing ranks around her, the town's elite ostracized him, and his relationship with his children was nearly destroyed. After spending his life focused on living for others, he has no idea how to live for himself. He wants to find love but now settles for anonymous sex that only further clouds his world with shame and guilt. Gil believes finding true love is an unobtainable dream, what his father used to call &quot;chasing the sun.&quot;\n\nWritten by: Jacob Z. Flores\nNarrated by: TJ Jamesin\nLength: 3 hrs and 39 mins\nSeries: Provincetown, Book 2\nUnabridged Audiobook\n\nWhen Love Gets Hairy: Provincetown, Book 3\n\nAs vain as he is beautiful, Nino Santos happily lives life waiting for the next ferry full of fairies to bring him new conquests. As long as they aren't hirsute, he's all in. So he's shocked to wake up after a beach party he cannot remember with a hairy naked man lying next to him.\n\nWritten by: Jacob Z. Flores\nNarrated by: TJ Jamesin\nLength: 7 hrs and 55 mins\nSeries: Provincetown, Book 3\nUnabridged Audiobook\n\nWhen Love Comes to Town: Provincetown, Book 4\n\nBrody O'Shea isn't looking for much, just a hot guy with a decent job, who is sane and doesn't have kids. The son of a former rock star, Brody has lived through the pain of bankruptcy and bad parenting, and he doesn't want to experience it again. As a reformed horndog, he wants the security and stability of a relationship. But almost every guy he meets seems satisfied with Mr. Right Now, and he wants to find Mr. Right - now!\n\nWritten by: Jacob Z. Flores\nNarrated by: TJ Jamesin\nLength: 7 hrs and 32 mins\nSeries: Provincetown, Book 4\nUnabridged Audiobook","torrent":{"xt":"urn:btih:7a1520797e239b7bb765d88e6657c70f8d4d205b","amp;dn":"Jacob+Z+Flores+Provincetown+Books+1-4+MM+Romance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a1520797e239b7bb765d88e6657c70f8d4d205b","infoHashBuffer":{"type":"Buffer","data":[122,21,32,121,126,35,155,123,183,101,216,142,102,87,199,15,141,77,32,91]},"announce":[],"urlList":[]}}