{"title":"I Was a Male War Bride (Cary Grant - Ann Sheridan  1949)","uid":4737116,"size":1027078462,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7a437279161bfd61e6314bfd8e526b0da8615932&amp;dn=I+Was+a+Male+War+Bride+%28Cary+Grant+-+Ann+Sheridan++1949%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"bobo66","files":-1,"time":1235374595,"description":"Screwed up the last upload of this film by accidentally deleting the torrent, since I can't reload that same hash, I am uploading a new torrent. Both are seeded. Sorry for any confusion. \n\n \nThis Torrent was originally created by jim1949 over at Demonoid. Thanks.\n\nThe film is &quot;a classic&quot; and needs to be further disseminated, so I &quot;stole it&quot; to make it more widely available.\n\nDecent movie, give it a shot, better than 75% of the crap out today.\n\n\n\nI Was a Male War Bride (1949)\n\nCaptain Henri Rochard is a French officer assigned to work with Lieut. Catherine Gates. Through a wacky series of misadventures, they fall in love and marry. When the war ends, Capt. Rochard tries to return to America with the other female war brides. Zany gender-confusing antics follow. Written by Thor Thapsigargin\n\nCaptain Henri Rochard of the French army, and Lieutenant Catherine Gates, of the American, are assigned a mission together to stop a German high-level scientist in postwar Germany. They start out thinking they hate each other, but end up falling in love. They encounter various bureaucratic hassles trying to get married. When Catherine's army unit gets recalled back to the USA, the only way they have to stay together is by invoking a law allowing the spouse of American army personnel to enter the country -- the War Bride's act.\n\n\nCary Grant ... Capt. Henri Rochard\n\nAnn Sheridan ... Lt. Catherine Gates\nMarion Marshall ... Lt. Kitty Lawrence\nRandy Stuart ... Lt. Eloise Billings\nBill Neff ... Capt. Jack Ramsey (as William Neff)","torrent":{"xt":"urn:btih:7a437279161bfd61e6314bfd8e526b0da8615932","amp;dn":"I+Was+a+Male+War+Bride+%28Cary+Grant+-+Ann+Sheridan++1949%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a437279161bfd61e6314bfd8e526b0da8615932","infoHashBuffer":{"type":"Buffer","data":[122,67,114,121,22,27,253,97,230,49,75,253,142,82,107,13,168,97,89,50]},"announce":[],"urlList":[]}}