{"title":"Mai Jia - Decoded.epub","uid":9865071,"size":323611,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7a7d75816bb9c67e5d79846ea82b02c932d93ad4&amp;dn=Mai+Jia+-+Decoded.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Papushi","files":-1,"time":1396339813,"description":"\n\nDecoded tells the story of Rong Jinzhwen, one of the great code-breakers in the world.\n\nA semi-autistic mathematical genius, Jinzhen is recruited to the cryptography department of China's secret services, Unit 701, where he is assigned the task of breaking the elusive 'Code Purple'. Jinzhen rises through the ranks to eventually become China's greatest and most celebrated code-breaker; until he makes a mistake. Then begins his descent through the unfathomable darkness of the world of cryptology into madness.\n\n'Decoded is a subtle and complex exploration of cryptography, politics, dreams and their significance...There is much of interest in this book, from the strange, superstitious beginning to the gradual decline of the Rong family as the twentieth century progresses...But in the end, it's the complexity of the characters that is Decoded's enduring pleasure' London Review of Books\n\nDecoded was an immediate success when it was published in 2002 in China and has become an international bestseller. With the pacing of a literary crime thriller, Mai Jia's masterpiece also combines elements of historical fiction and state espionage. Taking place in the shadowy world of Chinese secret security, where Mai Jia worked for decades, it introduces us to a place that is unfamiliar, intriguing and authentic. And with Rong Jinzhen, it introduces us to a character who is deeply flawed and fragile, yet possessing exceptional intelligence. Decoded is an unforgettable and gripping story of genius, brilliance, insanity and human frailty.\n\n'Decoded is a subtle and complex exploration of cryptography, politics, dreams and their significance....There is much of interest in this book, from the strange, superstitious beginning to the gradual decline of the Rong family as the twentieth century progresses...But, in the end, it is the complexity of the characters that is Decoded's enduring pleasure' Times Literary Supplement\n\n'Readers skate the line separating insanity from genius in Mai Jia's riveting tale of cryptographic warfare...A denouement at once heartbreaking and thought-provoking leaves readers pondering the collective sanity of a world shrouding knowledge in enigmas. Gifted translators bring English-speaking readers a Chinese literary treasure' Booklist\n\nMai Jia (the pseudonym of Jiang Benhu) is arguably the most successful writer in China today. His books are constant bestsellers, with total sales over three million copies. He became the highest paid author in China last year with his new book, Wind Talk. He has achieved unprecedented success with film adaptation: all of his novels are made - or are being made - into major films or TV series, the screenplays of which are often written by Mai Jia himself. He is hailed as the forerunner of Chinese espionage fiction, and has created a unique genre that combines spycraft, code-breaking, crime, human drama, historical fiction, and metafiction. He has won almost every major award in China, including the highest literary honor - the Mao Dun Award.\n","torrent":{"xt":"urn:btih:7a7d75816bb9c67e5d79846ea82b02c932d93ad4","amp;dn":"Mai+Jia+-+Decoded.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a7d75816bb9c67e5d79846ea82b02c932d93ad4","infoHashBuffer":{"type":"Buffer","data":[122,125,117,129,107,185,198,126,93,121,132,110,168,43,2,201,50,217,58,212]},"announce":[],"urlList":[]}}