{"title":"The Second Coming of Steve Jobs - Alan Deutschman  (2000)","uid":6773394,"size":170667412,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7a8360fca7249a8bd9716fc5c4e386492b5289f1&amp;dn=The+Second+Coming+of+Steve+Jobs+-+Alan+Deutschman++%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"neil1966hardy","files":4,"time":1319647546,"description":"General Information\n===================\nTitle: The Second Coming of Steve Jobs\nAuthor: Alan Deutschman\nRead By: Charles Stransky\nCopyright: 2000\nAudiobook Copyright: 2000\nGenre: Technology\nPublisher: Random House Audible\nSeries Name: n/a\nPosition in Series: n/a\nAbridged: No\n\nOriginal Media Information\n==========================\nMedia: Digital\nSource: Audible\nCondition: Good\n\nFile Information\n================\nNumber of MP3s: 1\nTotal Duration: 7:53\nTotal MP3 Size: 162MB\nParity Archive: No\nRipped By: hugmenot\nRipped With: SoundTaxi\nEncoded With: LAME\nEncoded At: CBR 48 kbit/s 44000 Hz\nID3 Tags: 2.3\n\nBook Description\n================\nFrom the acclaimed Vanity Fair and GQ journalist - an unprecedented, in-depth portrait of the man whose return to Apple precipitated one of the biggest turnarounds in business history.\n\nWhen Steve Jobs became the acting CEO of Apple Computers, it was hemorrhaging more than a billion dollars a year. His return after twelve years of exile to the company he co-founded completely revitalized Apple. With the revolutionary success of the iMac, Apple turned a profit of over $600 million last year.\n\nBased on interviews with scores of people - rivals, colleagues, friends - who have worked with Jobs over the years, The Second Coming of Steve Jobs presents the most revealing portrait yet of this extraordinarily complex man; how and why he almost gave up his career; the details of his negotiations with Disney's Jeffrey Kaztenberg and Michael Eisner and of the culture clash between Silicon Valley and Hollywood; his methods of leadership, management, creativity, and innovation; his friendship and rivalry with Bill Gates - and much more.\n\nSince the early days of Apple, Steve Jobs has captivated the public. Now, as Jobs prepares to conquer Hollywood with his enormously successful animation film studio, Pixar, Alan Deutschman brings listeners what will be one of the most talked-about business audios of the year.\n\nAlan Deutschman is a contributing editor at Vanity Fair. For the past twelve years, he has covered business and technology. He was a correspondent for Fortune for seven years, a senior writer at GQ, and a contributing editor at New York magazine.\n\nWhat the Critics Say\n====================\n&quot;...a behind-the-scenes account of the supreme showman's resurrection from high-tech oblivion to cover-story glory...likely to raise hackles - not to mention blood pressure - in the corridors of Apple Computer and Pixar Animation Studios.&quot; - USA Today\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:7a8360fca7249a8bd9716fc5c4e386492b5289f1","amp;dn":"The+Second+Coming+of+Steve+Jobs+-+Alan+Deutschman++%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7a8360fca7249a8bd9716fc5c4e386492b5289f1","infoHashBuffer":{"type":"Buffer","data":[122,131,96,252,167,36,154,139,217,113,111,197,196,227,134,73,43,82,137,241]},"announce":[],"urlList":[]}}