{"title":"Carole King - The Carnegie Hall Concert (1996) [Rock Pop][mp3 32","uid":4990044,"size":173309122,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7c12ab4e60f88958d905b81e11c5f79b83dc17f7&amp;dn=Carole+King+-+The+Carnegie+Hall+Concert+%281996%29+%5BRock+Pop%5D%5Bmp3+32&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schon55","files":26,"time":1246990962,"description":"Carole King - The Carnegie Hall Concert \nAudio CD: October 29, 1996 \nOriginal Release Date: October 29, 1996 \nFormat: Live \nLabel: Sony \nBitrate: 320 kbps\n\nDon't let the fact that you already have the &quot;Tapestry&quot; CD (presumably after wearing out two or three copies of the LP before it) make you think this album isn't worth picking up as well.  While many of the songs on here were standards long before the CD was released (and the others should have been!), the performances found here have a magic all their own. \nKing was apparently famous for her stage fright back in those days, and her somewhat nervous between-songs chatter with the extremely appreciative audience seems to confirm that rumor.  This, after all, was just a matter of weeks after &quot;Tapestry&quot; had suddenly transformed her into a superstar after over a decade of behind-the-scenes work in the music business - and already, each song she performs from that album here receives a hero's welcome from the audience.  But if King sometimes sounds a bit bewildered by her newfound popularity (she introduces &quot;It's Too Late,&quot; the #1 song in the country that night, with a shy &quot;Thank you for this, by the way!&quot; ), her performances don't suffer at all from it.  \n\nNaturally, the set list is dominated by songs from &quot;Tapestry&quot; - all of them are here, except for the title track and &quot;Where You Lead&quot; - but the combination of a stripped-down performance, an enthusiastic hometown audience and the spacious acoustics of the concert hall gives them all a refreshing sound.  (The sound quality of the recording does occasionally show its age and King even runs out of breath at one point, but so what?)  The much-fabled duet with James Taylor on &quot;You've Got a Friend&quot; is another nice touch for those of us who grew up dreaming of just such a recording.  \n\nBut the best surprise here is the trio of gorgeous performances from King's 1970 solo debut, &quot;Writer. &quot; That album featured most of the lyrical grace of its much more famous successor, but it lacked the near-perfect subtle instrumental styling that made &quot;Tapestry&quot; great and sounds unavoidably dated now for that reason.  The spare production at work here proves to be the perfect remedy for that shortcoming, and &quot;No Easy Way Down,&quot; &quot;Eventually,&quot; and especially &quot;Child of Mine&quot; sound just as timeless as the better-known selections alongside them.  If you've only heard the original versions of those songs, this album will be a revelation! Even her short-lived late-`60s band, The City, receives a nod with &quot;Snow Queen,&quot; a quirky but interesting number from a usually-forgotten period of her long career. \n\nIt's not exactly witnessing the emergence of a star (she had, after all, been making records for over a decade, including a few of her own), but as an intimate performance by a master musician at what proved to be the top of her game, this is definitely one of the all time great live albums of its era.  ~ David A.  Bede\n\nThis is a wonderful live album capitualting all of Carole King's greatest hits.  Carole King was one of those singer-songwriters who provided the musical backdrop for the exploration of alternative ways of looking at, exploring, and experiencing the world around us.  Her many popular anthems described her feelings, existential angst, and sentimental deliberations about life, love and the battles between the sexes in very approachable and appealing ways.  Both the melodies and the lyrics are topical, memorable, and quite up beat, although she is certainly capable of delivering some thought-provoking and plaintive songs, such as an existential wail over the problems with maintaining a long- distance relationship in songs like &quot;So Far Away&quot;.  \nYet Carole always keeps the tunes within the pop realm, and packages them in a seamless production with great vocals and impeccable musical arrangements, and what is included in this classic album is a treasure for the ages.  From &quot;Tapestry&quot; to &quot;Will You Still Love Me Tomorrow&quot;, from &quot;(You Make Me Feel) Like A Natural Woman&quot; to &quot;&quot;You've Got A Friend&quot;, and from &quot;Home Again&quot; to &quot;It's Too Late&quot;, the entire album resonates with her unique gift for terrific lyrics showcasing unforgettable melodies.  It's all here, folks, a wonderful album that recapitulates all of the songs that this great pop star gave us as she emerges from the unbelievable sixties to prove the best just keep on singing!  Enjoy! ~ Barron Laycock &quot;Labradorman&quot;\n\nCarole King - The Carnegie Hall Concert Tracks:\n01  I Feel The Earth Move\n02  Home Again\n03  After All This Time\n04  Child Of Mine\n05  Carry Your Load\n06  No Easy Way Down\n07  Song Of Long Ago\n08  Snow Queen\n09  Smackwater Jack\n10  So Far Away\n11  It's Too Late\n12  Eventually\n13  Way Over Yonder\n14  Beautiful\n15  You've Got A Friend\n16  Will You Still Love Me Tomorrow, Some Kind Of Wonderful, Up On The Road\n17  (You Make Me Feel Like) A Natural Woman \n\n\n","torrent":{"xt":"urn:btih:7c12ab4e60f88958d905b81e11c5f79b83dc17f7","amp;dn":"Carole+King+-+The+Carnegie+Hall+Concert+%281996%29+%5BRock+Pop%5D%5Bmp3+32","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c12ab4e60f88958d905b81e11c5f79b83dc17f7","infoHashBuffer":{"type":"Buffer","data":[124,18,171,78,96,248,137,88,217,5,184,30,17,197,247,155,131,220,23,247]},"announce":[],"urlList":[]}}