{"title":"PowerISO FULL 5.8 + Serials","uid":9149312,"size":6139317,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c34e95d5fbbc213d7150413640ca0ad3fb5ec49&amp;dn=PowerISO+FULL+5.8+%2B+Serials&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kishordeepu","files":-1,"time":1383658506,"description":"PowerISO FULL 5.8 + Serials\n\nIf you need an easy way to create disk images, it's hard to imagine an option that's easier than PowerISO. This simple program makes it a breeze to create disk images in several different formats, open existing images, and burn disk images to CDs and DVDs.\nPowerISO has a straightforward interface that's easy to navigate. A set of clearly marked buttons across the top make the program's main features easily accessible. It took us just a few seconds to navigate to a handful of files we wanted to include and then save them as an ISO file, though the program also gave us the option of DAA and BIN files. PowerISO also has options for mounting and compressing existing disk images, as well as burning disk images to disks. A built-in Help file is brief but well-written. There's a configuration menu from which to select options for virtual drives and audio formats. PowerISO doesn't overwhelm with its features -- its capabilities are fairly basic -- but it gets high marks for being easy to use and providing disk image tools that meet the needs of users at all levels.\nThe trial version of PowerISO limits users to creating disk images of 300M or less. The program installs a desktop icon without asking but uninstalls cleanly.\n\n\nRead more: PowerISO - Free download and software reviews - CNET Download.com http://download.cnet.com/PowerISO/3000-2646_4-10439118.html#ixzz2jm1njfex","torrent":{"xt":"urn:btih:7c34e95d5fbbc213d7150413640ca0ad3fb5ec49","amp;dn":"PowerISO+FULL+5.8+%2B+Serials","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c34e95d5fbbc213d7150413640ca0ad3fb5ec49","infoHashBuffer":{"type":"Buffer","data":[124,52,233,93,95,187,194,19,215,21,4,19,100,12,160,173,63,181,236,73]},"announce":[],"urlList":[]}}