{"title":"John Abercrombie Quartet - 39 Steps (2013)  [EAC-FLAC]","uid":9082274,"size":328255751,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7c5e19ee2afd45712c22ba7ee7d32210bb541d88&amp;dn=John+Abercrombie+Quartet+-+39+Steps+%282013%29++%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":-1,"time":1382398877,"description":"                John Abercrombie Quartet - 39 Steps (2013) [EAC-FLAC]\n               EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 313 Mb\n                            Full Artwork @ 300 dpi (jpg)\n\n\n\nThere is an easy familiarity among the participants on the John Abercrombie Quartet's 39 Steps. Each of its members -- guitarist, pianist Marc Copland, bassist Drew Gress, and drummer Joey Baron -- have played together in various situations for decades. In the case of Abercrombie and Copland, their association goes back some 40 years to Chico Hamilton's touring group and the fusion band Dreams. Both Baron and Gress have played with the guitarist and pianist on and off since the '90s.\n\nThe predominate mood here is linear post-bop and lyric balladry, though there is an overarching group meditation on at least the titles of Alfred Hitchock's films: Abercrombie composed six pieces here (including &quot;Vertigo&quot; and the title track); Copland two (including &quot;Spellbound&quot;), and there's a group improvisation called &quot;Shadow of a Doubt.&quot; It is interesting to note the inclusion of Copland -- Abercrombie hasn't featured a pianist on his recordings since the early '80s -- who creates a wider tonal palette. The pianist's &quot;LST&quot; is a midtempo number with an elaborate melody and a gorgeous solo by Copland showcasing motivic invention in the upper register accompanied by gorgeous chord voicings from Abercrombie. The lush, melodic invention in the guitarist's &quot;Bacharach&quot; offers the pianist a platform to build a multi-hued timbral spectrum, while Abercrombie slips along its underside in an understated yet intricate solo; Gress punctuates his lines with rich wooden tones and Baron whispers along on snare and cymbals.\n\nCopland's &quot;Spellbound&quot; is as mysterious as its title implies. Abercrombie's dual string intro is followed by Gress' solo, which is darkly illumined by the pianist's middle-register chordal inventions and Baron's slippery shuffle. The guitarist's solo follows a scalar line, purposely syncopating his movements and creating a gentle swing. The title track is one of the loveliest ballads Abercrombie has ever composed. It makes full use of both the piano's and guitar's possibilities as chord instruments, but its solos all move fluidly along subtle yet intensely lyrical lines. The set closes on the most unusual version of &quot;Melancholy Baby&quot; ever committed to tape, though even in its angular rhythmic thrust and contrapuntal individual statements, exhibits a keen sense of listening and melodic counterpoint. Abercrombie's 39 Steps offers the sound of a veteran quartet playing at the height of its individual members' intuitive and collective abilities.\n\n\n-----------------------------------------------------------------------------------\nTracklist:\n-----------------------------------------------------------------------------------\n\n01. Vertigo\n02. LST\n03. Bacharach\n04. Greenstreet\n05. As It Stands\n06. Spellbound\n07. Another Ralph's\n08. Shadow Of A Doubt\n09. 39 Steps\n10. Melancholy Baby\n\n*2013 ECM Records | ECM 2334\n\n\nPersonnel:\nJohn Abercrombie - guitar\nMarc Copland - piano\nDrew Gress - bass\nJoey Baron - drums\n\n\n\nThe Lonnie Smith = John Abercrombie Trio - Afro Blue (1994) [EAC-FLAC]:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/9061329/Lonnie_Smith___John_Abercrombie_Trio_-_Afro_Blue_(1994)_[EAC-FLA&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/9061329/Lonnie_Smith___John_Abercrombie_Trio_-_Afro_Blue_(1994)_[EAC-FLA&lt;/a&gt;\n\n\nEnjoy, SEED and SHARING... Thanks!\n\n","torrent":{"xt":"urn:btih:7c5e19ee2afd45712c22ba7ee7d32210bb541d88","amp;dn":"John+Abercrombie+Quartet+-+39+Steps+%282013%29++%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c5e19ee2afd45712c22ba7ee7d32210bb541d88","infoHashBuffer":{"type":"Buffer","data":[124,94,25,238,42,253,69,113,44,34,186,126,231,211,34,16,187,84,29,136]},"announce":[],"urlList":[]}}