{"title":"Politics and Society in Ancient Greece","uid":11728531,"size":1588109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7c7d4a6ec0fefde48638de827256a9b3c414e357&amp;dn=Politics+and+Society+in+Ancient+Greece&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1425187428,"description":"Western democracies often trace their political roots back to Ancient Greece. While politics today may seem the dusty domain of lawmakers and pundits, in the classical era virtually no aspect of life was beyond its reach. Political life was not limited to acts of a legislature, magistrates, and the courts but routinely included the activities of social clubs, the patronage system, and expression through literature, art, and architecture. Through these varied means, even non-enfranchised groups (such as women and non-citizens) gained entry into a wider democratic process.\n\nBeyond the citizen world of traditional politics, there existed multiple layers of Greek political life-reflecting many aspects of our own modern political landscape. Religious cults served as venues for female office-holders; private clubs and drinking parties served significant social functions. Popular athletes capitalized on their fame to run for elected office. Military veterans struggled to bring back the good old days much to the dismay of the forward-thinking ambitions of naive twenty-somethings. Liberals and conservatives of all classes battled over important issues of the day. Scandal and intrigue made or ended many a political career. Taken collectively, these aspects of political life serve as a lens for viewing the whole of Greek civilization in some of its characteristic and distinctive dimensions","torrent":{"xt":"urn:btih:7c7d4a6ec0fefde48638de827256a9b3c414e357","amp;dn":"Politics+and+Society+in+Ancient+Greece","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c7d4a6ec0fefde48638de827256a9b3c414e357","infoHashBuffer":{"type":"Buffer","data":[124,125,74,110,192,254,253,228,134,56,222,130,114,86,169,179,196,20,227,87]},"announce":[],"urlList":[]}}