{"title":"D:REAM -- The Platinum Collection ( Phino / 2006 )","uid":4155803,"size":109665554,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7d805a77376c991886536c043a69404deacee7a5&amp;dn=D%3AREAM+--+The+Platinum+Collection+%28+Phino+%2F+2006+%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"badbigdog","files":-1,"time":1209148443,"description":"D:REAM -- THE PLATINUM COLLECTION ( 2006 / Phino )\n\n\n\n 1\n Things Can Only Get Better\n 4:22\n\n 2\n Take Me Away\n 3:42\n\n 3\n U R the Best Thing\n 6:00\n\n 4\n Shoot Me with Your Love\n 4:12\n\n 5\n Unforgiven\n 4:22\n\n 6\n I Like It\n 4:39\n\n 7\n Party Up the World\n 3:22\n\n 8\n Blame It on Me\n 3:44\n\n 9\n Hold Me Now\n 4:57\n\n 10\n Star\n 3:53\n\n 11\n Heart of Gold\n 5:07\n\n 12\n Picture My World\n 5:40\n\n 13\n Glorious\n 6:01\n\n 14\n So Long Movin' On\n 5:11\n\n 15\n The Power (Of All the Love in the World)\n 5:04\n\n 16\n U R the Best Thing (Perfecto Radio Mix)\n 4:24\n\n 17\n Take Me Away (Brothers in Rhythm Radio Edit)\n 3:37\n\nPLEASE SEED # # # # ---------------------------------------------------------------D:Ream was a Northern Ireland pop rock / synthpop and dance band of the 1990s. Between 1992 and 1997, the period during which they were active, the band released two studio albums (D:Ream On Volume 1 and World), ten different singles (some of them re-released twice or three times, until totally reaching 14 singles - but two tracks were featured together on a double A-side single), and an official greatest hits album (The Best of D:Ream). In 2006, a second collection was out, for the well known series entitled The Platinum Collection (with many artists and groups in the catalogue), without the band's permission.\n\nWhen D:Ream got famous, its main members were Peter Cunnah (vocalist and songwriter) and Al Mackenzie (musician and producer), though, afterwards, the group would in fact become a one man band, exclusively centred upon the singer. The latter took part to 1994 Gay Pride in London, where he had an argument with Sara Dallin and Keren Woodward from musical duo Bananarama, who once beat him up, after he insulted them at an industry event: Dallin grabbed his face and pushed him to the ground, whilst Woodward kicked his legs as he fell down. [1] [2]\n\nHowever, Keren of Bananarama's version of the events are different saying: &quot;We'd be sitting there and he was saying some really, really odd things to us, and I think he'd had a few drinks. Then it all got a bit bitter and we'd just about had enough of him. He just turned round and said 'come and talk to me when you've written a hit song.' He'd had the one and we'd had quite a lot at that point. I think Sarah just gave him a push off of his seat and I gave him a dead leg on the way down really...&quot;\n\nAnother member, Brian Cox played keyboards for several years in D:Ream, while studying for his PhD. Drumtech trained Mark Roberts played drums in the band, instead. There were a number of vocalists who changed over time - a popular one was T.J. Davis, who is featured as co-lead vocalist on &quot;The Power (Of All the Love in the World)&quot;, one of the singles taken from their second album, World, in 1995, as well as performing backing vocals on many other songs.\n\nThe band's first album, D:Ream On Volume 1, which was promoted for almost two years, since its date of release, in 1993, until a short time before the first single taken from the second album, &quot;Shoot Me with Your Love&quot;, was out, in 1995, has produced some 7 singles (in fact, 'only' six, since &quot;Star&quot; and &quot;I Like It&quot; came on a joint release as a double A-side single), but it was the track called &quot;Things Can Only Get Better&quot; - an original song by the group, not to be confused with the single of the same name by Howard Jones - that gave them UK success and international fame.\n\nAfter supporting Take That on their tour, their song &quot;Things Can Only Get Better&quot; topped the UK Charts, in early 1994. Already released in late 1993, when the track did not get higher than Number 24, it was later adopted by the UK Labour Party as their theme for the 1997 UK General Election, and consequently released for the third time, this time getting to Number 19. Though this respectable chart position, the group's record company chose to release their first compilation, The Best of D:Ream, in 1997, instead of their third studio album, which was never out so far.\n\nD:Ream can claim as part of the achievements in their musical career:\n\n    * 1 Number 1 hit: the re-release of &quot;Things Can Only Get Better&quot;;\n    * 2 Top 10 hits: the second re-release of &quot;U R The Best Thing&quot;, and &quot;Shoot Me with Your Love&quot;;\n    * 4 Top 20 hits: the re-release of &quot;U R The Best Thing&quot;, &quot;Take Me Away&quot;, &quot;Party Up the World&quot;, and the second re-release of &quot;Things Can Only Get Better&quot;;\n    * 4 Top 30 hits: the first release of &quot;Things Can Only Get Better&quot;, &quot;Unforgiven&quot;, &quot;Blame It on Me&quot;, and the double A-side &quot;Star&quot; / &quot;I Like It&quot;;\n    * 1 Top 40 hit: &quot;The Power (Of All the Love in the World)&quot;;\n    * 1 Top 75 hit: the first release of &quot;U R The Best Thing&quot;.\n[ WIKIPEDIA : http://en.wikipedia.org/wiki/D:Ream ]\n","torrent":{"xt":"urn:btih:7d805a77376c991886536c043a69404deacee7a5","amp;dn":"D%3AREAM+--+The+Platinum+Collection+%28+Phino+%2F+2006+%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7d805a77376c991886536c043a69404deacee7a5","infoHashBuffer":{"type":"Buffer","data":[125,128,90,119,55,108,153,24,134,83,108,4,58,105,64,77,234,206,231,165]},"announce":[],"urlList":[]}}