{"title":"Iris DeMent - Lifeline [2004] [EAC/FLAC]","uid":11699567,"size":303397674,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7dc5955e48f5831df11dca2215fed031de04c3cf&amp;dn=Iris+DeMent+-+Lifeline+%5B2004%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":16,"time":1423888698,"description":"FLAC / Lossless / Log (100%) / Cue \nLabel/Cat#: FlariElla Records #FER 1004\nCountry: USA\nYear: October 19, 2004\nGenre: folk\nFormat:CD\n\n1.\tI've Got That Old Time Religion In My Heart (3:05)\n2.\tBlessed Assurance (6:27)\n3.\tFill My Way With Love (3:03)\n4.\tHide Thou Me (5:09)\n5.\tThe Old Gospel Ship (3:11)\n6.\tSweet Hour Of Prayer (5:09)\n7.\tThat Glad Reunion Day (2:11)\n8.\tLeaning On The Everlasting Arms (2:54)\n9.\tHe Reached Down (4:12)\n10.\tNear The Cross (5:04)\n11.\tI Never Shall Forget The Day (2:43)\n12.\tI Don't Want To Get Adjusted (To This World) (3:38)\n13.\tGod Walks The Dark Hills (5:23)\n\n\n\n\n\nOn the surface, Lifeline, Iris Dement's return to recording after an eight-year hiatus, is a collection of age-old gospel and church tunes from the 19th century -- or earlier -- in the grand Protestant tradition. He liner notes tell a different story. She recounts how her mother played and sang these songs in times of stress looking straight at the sky, &quot;as if she were talking to someone.&quot; She claims that for her, too, the music contained here became her lifeline through a season of hardship, and that when calling her mother from the road in difficult straits, she was told to get to a piano. Dement's raw, high lonesome voice is as out of time as the material, though these presentations are not exactly rough-hewn. They are plaintive but polished with accompaniment from a host of players, including Bo Ramsey, Mark Howard, Stu Basore, Stuart Duncan, and others. Dement plays piano on some tracks, guitar on others. ForDement they may indeed represent places of comfort in the midst of despair and desolation, yet for the casual observer, they feel like simply-rendered, distinguished readings of familiar spirituals. Dement goes out of her way to distance herself from the religion spoken of in these pieces, saying in her notes that the songs represent something bigger than that to her, but to the listener they come off as reverent and quaint, hardly the stuff of earthshaking experience. It is only on &quot;Sweet Hour of Prayer,&quot; where Dement accompanies herself on piano, that the notion of shelter from the storm comes through brilliantly and unmistakably. There is one new song here, an original called &quot;He Reached Down&quot; recorded with Ramsey, that reaches the heights of Infamous Angel or &quot;My Life.&quot; The narrative, though biblical, is saturated in Dement's singular storytelling manner, where her voice reaches into the grain of the material and pulls at its mystery until its emotion and truth become unfettered and fall free. While this is far from a full return to form for Dement, it is truly good to have her back","torrent":{"xt":"urn:btih:7dc5955e48f5831df11dca2215fed031de04c3cf","amp;dn":"Iris+DeMent+-+Lifeline+%5B2004%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7dc5955e48f5831df11dca2215fed031de04c3cf","infoHashBuffer":{"type":"Buffer","data":[125,197,149,94,72,245,131,29,241,29,202,34,21,254,208,49,222,4,195,207]},"announce":[],"urlList":[]}}