{"title":"Armin van Buuren Discography (Part 1) (mp3) (Inspiron)","uid":11550329,"size":22919841115,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e176caa6a03d901d262fb68ecd2c142d52b782a&amp;dn=Armin+van+Buuren+Discography+%28Part+1%29+%28mp3%29+%28Inspiron%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"-inspiron-","files":-1,"time":1416773953,"description":"=======================================================\nSite: &lt;a href=&quot; http://inspiron-trance.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://inspiron-trance.com&lt;/a&gt;\n=======================================================\n\n\n=======================================================\nF B Page: Inspiron Trance \n=======================================================\n\n\n=======================================================\nTWITTER : inspiron22\n=======================================================\t\n\n\n\n\n\nState Of Trance 550 - Invasion\nVA - A State Of Trance 2004\nVA - A State Of Trance 2005\nVA - A State Of Trance 2006\nVA - A State Of Trance 2007\nVA - A State Of Trance 2008\nVA - A State Of Trance 2009\nVA - A State Of Trance 2010\nVA - A State Of Trance 2011\nVA - A State Of Trance 2012\nVA - A State Of Trance 2013\nVA - A State Of Trance 500\nVA - A State Of Trance 600 - The Expedition\nVA - A State Of Trance Year Mix 2005\nVA - A State Of Trance Year Mix 2006\nVA - A State Of Trance Year Mix 2007\nVA - A State Of Trance Year Mix 2008\nVA - A State Of Trance Year Mix 2009\nVA - A State Of Trance Year Mix 2010\nVA - A State Of Trance Year Mix 2011\nVA - A State Of Trance Year Mix 2012\nArmin Only - Imagine The Music\nVA - 001 - A State Of Trance\nVA - 002 - Basic Instinct\nVA - 003 - In Motion\nVA - 004 - Transparance\nVA - Artist Profile Series 4 - Boundaries Of Imagination\nVA - System F vs. Armin - TranceMatch\nve At The Gallery - Ministry Of Sound\n\nArmin Only - Mirage The Music\nVA - Armin Only - Imagine Limited Edition\nArmin van Buuren - 10 Years Limited Edition\nArmin van Buuren - 76\nArmin van Buuren - Imagine\nArmin van Buuren - Imagine Extended DJ Mixes\nArmin van Buuren - Imagine The Remixes\nArmin van Buuren - Intense\nArmin van Buuren - Intense Extended Versions\nArmin van Buuren - Intense The More Intense Edition\nArmin van Buuren - Intense The More Intense Extended Edition\nArmin van Buuren - Mirage Deluxe Edition\nArmin van Buuren - Mirage Deluxe Edition 2\nArmin van Buuren - Mirage Extended Versions\nArmin van Buuren - Mirage The Remixes\nArmin van Buuren - Mirage The Remixes (Bonus Tracks Edition)\nArmin van Buuren - Shivers\n24 - The Longest Day (Armin Van Buuren Dub).flac\n24 - The Longest Day (Armin Van Buuren Remix Radio Edit).flac\n24 - The Longest Day (Armin Van Buuren Remix).flac\nAria - Dido (Armin Van Buuren's Universal Religion Mix).flac\nAyumi Hamasaki - Appears (Armin Van Buuren's Sunset Dub Mix).flac\nBt Feat. Jes - Every Other Way (Armin Van Buuren Remix).flac\nCerf, Mitiska &amp; Jaren - Beggin' You (Armin Van Buuren Remix Edit).flac\nCerf, Mitiska &amp; Jaren - Beggin' You (Armin Van Buuren Remix).flac\nChakra &amp; Edi Mis - X-File '99 (Armin &amp; Dj Johan's Cyber Mix).flac\nChicane - Where Do I Start (Armin Van Buuren Edit).flac\nChicane - Where Do I Start (Armin Van Buuren Remix).flac\nCygnus X - Positron (Armin Van Buuren Remix).flac\nD'note Feat. Beth Hirsch - D'votion 2000 (Armin Van Buuren Remix).flac\nDave202 Vs. Cerf, Mitiska &amp; Jaren - Arrival Vs. Beggin You (Acapella) (Armin Van Buuren Mashup).flac\nDavid Guetta Feat. Usher - Without You (Armin Van Buuren Remix).flac\nDe Bos - Chase (Follow-That-Carmix).flac\nDido - Everything To Lose (Armin Van Buuren Remix).flac\nDj Rene - All Over The World (Dj Rene &amp; Armin Van Buuren Radio Edit).flac\nDj Rene - All Over The World (Dj Rene &amp; Armin Van Buuren Remix).flac\nDominica - Gotta Let You Go (Watch Your Step Edit).flac\nEmma Hewitt - Colours (Armin Van Buuren Radio Edit).flac\nEmma Hewitt - Colours (Armin Van Buuren Remix Dub).flac\nEmma Hewitt - Colours (Armin Van Buuren Remix Edit).flac\nEmma Hewitt - Colours (Armin Van Buuren Remix).flac\nEnvio - Love Poison (Ryan G Remix - Avb Edit).flac\nFaithless - Not Going Home (Armin Van Buuren Remix).flac\nFragile Feat. Alex Lemon - Inertia (Armin Van Buuren Radio Edit).flac\nFragile Feat. Alex Lemon - Inertia (Armin Van Buuren Remix).flac\nFrans Bak - The Killing (Armin Van Buuren Radio Edit).flac\nFrans Bak - The Killing (Armin Van Buuren Remix).flac\nGroove Solution - Magic Melody (Armin Mix).flac\nHannah - Falling Away (Armin Van Buuren Remix Edit).flac\nHannah - Falling Away (Armin Van Buuren Remix).flac\nIio - Rapture (Armin Van Buuren Edit).flac\nIio - Rapture (Armin Van Buuren Remix).flac\nIio Feat. Nadia Ali - Rapture (Armin Van Burren Made Edit).flac\nIio Feat. Nadia Ali - Rapture (Armin Van Buuren Remix Remastered).flac\nInsight - Prophecy (Cyber Mix).flac\nIsco - Funkytown (Mothafunky Armin Mix).flac\nJan Vayne - Fruits &amp; Passion (Armin Van Buuren's Downtempo Mix).flac\nKirsty - Twilight (Armin Van Buuren Remix Edit).flac\nKirsty - Twilight (Armin Van Buuren Remix).flac\nLaura Jansen - Use Somebody (Armin Van Buuren Rework Edit).flac\nLaura Jansen - Use Somebody (Armin Van Buuren Rework).flac\nMadison Avenue - Don't Call Me Baby (Armin Van Buuren's Scratchin' Stalker Dub).flac\nMadison Avenue - Don't Call Me Baby (Armin Van Buuren's Stalker Mix).flac\nMagnusson Arrived From Fjornebo - Mary Go Around (Armin Van Buuren's 'this Round's On Me' Edit).flac\nMark Otten - Mushroom Therapy (Armin Van Buuren Remix Radio Edit).flac\nMark Otten - Mushroom Therapy (Armin Van Buuren Remix).flac\nMark Otten Vs. Carrie Skipper - Time Is Serene (Menno De Jong Remix - Avb Mash Up).flac\nMoogwai - Viola (Armin Van Buuren Remix Edit).flac\nMoogwai - Viola (Armin Van Buuren Remix).flac\nMotorcycle - As The Rush Comes (Armin Van Buuren's Universal Religion Mix).flac\nMotorcycle - As The Rush Comes (Armin Van Buuren's Universal Religion Radio Mix).flac\nNadine Coyle - Put Your Hands Up (Armin Van Buuren Remix).flac\nOceanlab - Sky Falls Down (Armin Van Buuren Instrumental Remix).flac\nOceanlab - Sky Falls Down (Armin Van Buuren Remix).flac\nRiva - Ime Is The Healer (Armin Van Buuren Remix).flac\nRiva - Time Is The Healer (Armin Van Buuren Dub).flac\nRiva - Time Is The Healer (Armin Van Buuren Edit).flac\nShane - C'est Musique (Armin Van Buuren Mix).flac\nShane - C'est Musique (Armin Van Buuren Radio Edit).flac\nShane Feat. Clannad - It's Too Late To Turn (Armin Van Buuren Instrumental).flac\nShane Feat. Clannad - It's Too Late To Turn (Armin Van Buuren Remix).flac\nSolar Stone - Seven Cities (Armin Van Buuren Remix).flac\nSolar Stone - Seven Cities (Armin Van Buuren Vocal Remix Radio Edit).flac\nSolar Stone - Seven Cities (Armin Van Buuren Vocal Remix).flac\nSolid Sessions - Janeiro (Armin Van Buuren Remix).flac\nSophie Sugar Vs. Sunlounger Feat. Zara - Lost Together (Armin Van Buuren Mashup).flac\nStuart - Fuel To Fire (Armin's Drumrama Dub).flac\nSunkids Feat. Chance - Rescue Me (Olav &amp; Armin's Xcessive Wodkawasters Filter Dub).flac\nTemple Of The Groove - Without Your Love (Armin's Radio Mix).flac\nThe Killers - Human (Armin Van Buuren Club Remix).flac\nThe Killers - Human (Armin Van Buuren Dub Remix).flac\nThe Killers - Human (Armin Van Buuren Radio Remix).flac\nThe Michael Zager Band - Let's All Chant 2000 (Armin Van Buuren's Retro Club Mix).flac\nThe Michael Zager Band - Let's All Chant 2000 (Armin Van Buuren's Retro Radio Mix).flac\nVibe-Rations Feat. Floyd Lloyd - Steppin' Out (Armin Van Buuren's Big Bass Remix).flac\nVincent De Moor - Shamu (Armin Remix).flac\nWamdue Project - King Of My Castle (Armin Van Buuren Remix).flac\nWamdue Project - King Of My Castle 2009 (Armin Van Buuren Remix).flac\nWiegel Meirmans Snitker - Nova Zembla (Armin Van Buuren Radio Edit).flac\nWiegel Meirmans Snitker - Nova Zembla (Armin Van Buuren Remix).flac\nYahel - Devotion (Armin Mix).flac\nZedd Feat. Matthew Koma - Spectrum (Armin Van Buuren Remix).flac\nArmin - Blue Fear\nArmin - Check Out Your Mind\nArmin - Communication\nArmin van Buuren &amp; DJ Shah feat. Chris Jones - Going Wrong\nArmin van Buuren &amp; Markus Schulz - The Expedition\nArmin van Buuren &amp; Markus Schulz - The Expedition  (Remixes)\nArmin van Buuren &amp; Orjan Nilsen - Belter\nArmin van Buuren &amp; W&amp;W - D# Fat\nArmin van Buuren - Blue Fear 2004 (Promo)\nArmin van Buuren - Communication Part 3\nArmin van Buuren - Communication Part 3 (Remixes)\nArmin van Buuren - Control Freak\nArmin van Buuren - Full Focus\nArmin van Buuren - Hymne (De Postbank SAILtrack 2005)\nArmin van Buuren - Orbion\nArmin van Buuren - Rush Hour\nArmin van Buuren - Sail\nArmin van Buuren - Shivers\nArmin van Buuren - Shivers &amp; Serenity\nArmin van Buuren - Shivers &amp; Serenity &amp; Who Is Watching\nArmin van Buuren - Shivers (Limited Mixes)\nArmin van Buuren - Sunburn (Walk Through The Fire)\nArmin van Buuren - The Sound Of Goodbye\nArmin van Buuren - We Are Here To Make Some Noise\nArmin van Buuren - We Are Here To Make Some Noise (Remixes)\nArmin van Buuren - Who's Afraid Of 138\nArmin van Buuren feat. Adam Young - Youtopia\nArmin van Buuren feat. Ana Criado - I'll Listen\nArmin van Buuren feat. Ana Criado - I'll Listen (The Remixes)\nArmin van Buuren feat. Ana Criado - Suddenly Summer\nArmin van Buuren feat. Ana Criado - Suddenly Summer (The Remixes)\nArmin van Buuren feat. Christian Burns - This Light Between Us\nArmin van Buuren feat. Cindy Alma - Beautiful Life\nArmin van Buuren feat. Fiora - Waiting For The Night\nArmin van Buuren feat. Jacqueline Govaert - Never Say Never\nArmin van Buuren feat. Jan Vayne - Serenity\nArmin van Buuren feat. Jan Vayne - Serenity (Remixes)\nArmin van Buuren feat. Jaren - Unforgivable\nArmin van Buuren feat. Jennifer Rene - Fine Without You\nArmin van Buuren feat. Justine Suissa - Burned With Desire\nArmin van Buuren feat. Laura V - Drowning\nArmin van Buuren feat. Nadia Ali - Feels So Good\nArmin van Buuren feat. Nadia Ali - Who Is Watching\nArmin van Buuren feat. Racoon - Love You More\nArmin van Buuren feat. Ray Wilson - Yet Another Day\nArmin van Buuren feat. Sharon den Adel - In &amp; Out Of Love\nArmin van Buuren feat. Sharon den Adel - In And Out Of Love\nArmin van Buuren feat. Susana - If You Should Go\nArmin van Buuren feat. Trevor Guthrie - This Is What It Feels Like\nArmin van Buuren feat. Trevor Guthrie - This Is What It Feels Like (Remixes)\nArmin van Buuren feat. Trevor Guthrie - This Is What It Feels Like (The Remixes)\nArmin van Buuren feat. VanVelzen - Broken Tonight\nArmin van Buuren feat. VanVelzen - Broken Tonight (Remixes)\nArmin van Buuren pres. Rising Star - Clear Blue Moon &amp; Star Theme\nArmin van Buuren pres. Rising Star - Touch Me\nArmin van Buuren vs. Arty - Nehalennia\nArmin van Buuren vs. DJ Remy &amp; Roland Klinkenberg &amp; Tony Scott - Bounce Back&amp;Something For The People\nArmin van Buuren vs. Herman Brood - Saturday Night\nArmin van Buuren vs. Rank 1 feat. Kush - This World Is Watching Me\nArmin van Buuren vs. Sophie Ellis Bextor - Not Giving Up On Love\nArmin vs. M.I.K.E. - Intruder &amp; Pound\nFerry Corsten vs. Armin van Buuren - Brute\nFerry Corsten vs. Armin van Buuren - Brute (Armin's Illegal Drum Edit)\nSystem F feat. Armin van Buuren - Exhale\n\n\n\n\n\n\nEnjoy\n(Inspiron)","torrent":{"xt":"urn:btih:7e176caa6a03d901d262fb68ecd2c142d52b782a","amp;dn":"Armin+van+Buuren+Discography+%28Part+1%29+%28mp3%29+%28Inspiron%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e176caa6a03d901d262fb68ecd2c142d52b782a","infoHashBuffer":{"type":"Buffer","data":[126,23,108,170,106,3,217,1,210,98,251,104,236,210,193,66,213,43,120,42]},"announce":[],"urlList":[]}}