{"title":"Udemy - Master Udemy - John Colley","uid":11754097,"size":968790489,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:7e1d8e3f438c4dfc8270b55b4ac59afa9278aeb5&amp;dn=Udemy+-+Master+Udemy+-+John+Colley&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"paybacktime","files":201,"time":1426313568,"description":"Master Udemy - Plan, Publish And Promote Profitable Courses - John Colley\n\n\n\nURL: https://www.udemy.com/strategiccd/\n\n\n\nCourse Description:\n\n\nOver 900 Students have Enrolled for this Course!\n\nLATEST: Course Updated Again On 9 Mar 2015: I have just added a new lecture on how to Optimise your Course in the Udemy Market Place - under Promotion.\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nThis Course is NOT a how to produce a Udemy Course - this course teaches you how to create a successful Online Business focused around creating Udemy Courses!\n\nHow can you set up your own an Online Business around Teaching Online Courses and Udemy?\n\nDo you want to know what the most successful Instructors are doing on Udemy?\n\nHave you considered the Competition in Your Niche?\n\nDo you know how to Structure and Price your Course based on what is actually happening on Udemy?\n\nI have made over $13,000 from my Udemy Courses and Made my First $1,000 in my First Three Months - Now I am Using this Data to create MORE COURSES and MORE COURSES = MORE $ALES!\n\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\nIf you want to have your own Online Business selling information products like I do, you need to know how to set up a business online, not just publish a Course\n\nDiscover the Key Stages of Producing a Udemy Course\n\nI share with you EXACTLY How my online, Udemy focused business, is set up and how I run it, with specific actionable strategies\n\nWith this Course I share with you exactly what I do and how I do it\n\nHow my online business is set up, with specific objectives and strategies\nThe key aspects of planning your course, including an exclusive (free) data management tool for researching the Udemy Marketplace\nThe key things you need to know when producing your course\nWhat you have to do when you publish\nThe importance of establishing proof\nWhy promotion is so critical and strategies for promoting your courses successfully\nHow to exploit other platforms to monetise your existing Udemy courses on other Course Platforms and which ones to focus on\n******************************************************************************************************\n\n&quot;Let me be clear, this course should be commissioned by Udemy and given to all instructors. I am convinced this would serve the students as well as the instructors. If you are an Instructor this will jump start your numbers be it dollars or pupils. This course is like Google Analytics for a web site and without it you are blind. Statistics in graphic form has been very successfully used by Professor Hans Rosling,you can see his presentations on TED. The presentation style is crisp,clear and to the point. Clear statements are made when &quot;opinions&quot; of the presenter are present. Simply brilliant Mr. Colley.&quot;\n\nCarl Spira\n\n******************************************************************************************************\n\nTake a Detailed Review of the Udemy Course Landscape - Download Every Spreadsheet to do your own analysis!\n\nSTOP PRESS: New Database Added at October 2014 with over 9700 courses\n\n******************************************************************************************************\n\n&quot;John, We are blown away by your Course, Well Done!&quot;\n\nAlex Mozes, Instructor Liaison, Udemy\n\n*****************************************************************************************************\n\nIf you want to be more advanced, I have provided the data, with pre-formated tabs, in a file which you can use opening a Free Visokio Omniscope Player and you can do more in depth analysis\n\nThe Course contains over 80 lectures and over 8 hours of Content, with more being added regularly\n\n*****************************************************************************************************\n\n&quot;A Must For All Udemy Instructors - In this course John answered every question I had about pricing and positioning my course on Udemy along with a lot of questions I hadn't even thought of in the areas of number of lectures, length of individual lectures, course sub-categorization and much more. For example, I learned that courses priced just $2 more than what I have priced my course at, generate almost double the amount of total revenue on average. That is what I would call an important piece of actionable information. If you are an active Udemy instructor or are considering building a course for this platform, I highly recommend this course to you.&quot;\n\nFrank Felker, 5 Stars\n\n*****************************************************************************************************\n\nYou will learn...\n\nHow to run an Online Business\nHow to Plan your Courses\nHow to Produce exceptional Courses\nHow to Publish your Courses\nHow to establish Social Proof\nHow to Promote your Courses\nHow to monetise other Platforms using your Udemy Course content\nIf you are creating a Udemy Course, this Course takes you beyond the Course into the Online Course Business\n\n*****************************************************************************************************\n\n&quot;Very impressive course, and amount of work from John Colley (i.e data collection and analysis). This course is very valuable for instructors or instructors-to-be, in order to understand the Udemy landscape of all other courses, to pinpoint the perfect category for your course and price it wisely. I started John's course yesterday and already finished it and watched the key lectures several times.&quot;\n\nPatricia Brun Torre\n\n*****************************************************************************************************\n\nThis is one of my Flagship Courses where I share everything that works for me with you to save you making all the mistakes I have made and to get you to success and sales faster.\n\nI made over $1,000 in my first 10 weeks as a Udemy Instructor...you can too!\n\nI am currently making over $2500 a month from my Online Business and this is increasing every month!\n\n*****************************************************************************************************\n\n&quot;Best &quot;How To Do Udemy&quot; course I've Taken\n\nI've taken several Udemy courses that help instructors become more successful and in my opinion this is the most helpful yet. John gives excellent resources and an in depth look at analyzing your market opportunities. I highly recommend the course. John is very clear and also to the point so doesn't drone on repeating himself to make the point. He uses good&quot;\n\nMark Gregory, 5 Stars\n\n*****************************************************************************************************\n\nGet it right first time to give yourself the best chance of being successful on Udemy!\n\nHave I missed a topic you would like covered?\n\nHave a question relating to the course?\n\nMessage me here on Udemy!\n\nPlease don't forget to leave me a comment and a rating if you think it is appropriate to do so. :)\n\nWhat are the requirements?\n\nBasic Knowledge of Excel\nDownload Free Visokio Omniscope Viewer and learn its basic use (Optional)\nWhat am I going to get from this course?\n\nOver 92 lectures and 10 hours of content!\nBy the end of this Course you will be able to:\nUnderstand the Four Key Stages of Creating Your Online Course\nDiscover How I Structure and Plan my Online Course Business\nPlan your Course using my Database of Udemy Courses and exclusive Data Visualisation Software, for Free\nAnswer Key Questions relating to Course Design\nLearn how to Create a Lecture in Under 30 Minutes\nDiscover the Optimal Course Length and Number of Lectures\nDiscover the Six Lectures Every Course Should Have\nUncover the Secret of Choosing the Right Category for Your Course\nEvaluate the Correct Pricing Strategy for Your Course\nDiscover How to Price and Sell Your Course on Udemy\nDiscover How to Create a Lead Magnet Sales Funnel and WHY you MUST have this\nHow to uses Images and Automation in your Marketing\nHow to List Your Course on Coupon Sites\nHow to use Canva, Instagram and Flipagram in your Marketing\nWhy you need a Black Friday Marketing Strategy","torrent":{"xt":"urn:btih:7e1d8e3f438c4dfc8270b55b4ac59afa9278aeb5","amp;dn":"Udemy+-+Master+Udemy+-+John+Colley","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e1d8e3f438c4dfc8270b55b4ac59afa9278aeb5","infoHashBuffer":{"type":"Buffer","data":[126,29,142,63,67,140,77,252,130,112,181,91,74,197,154,250,146,120,174,181]},"announce":[],"urlList":[]}}