{"title":"Classic Albums Deep Purple(2011) NL Sub NLT-Release (Divx) + CD ","uid":6307228,"size":559826004,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7e6dbf0ff3aa0a7278f77697590b55458261a87f&amp;dn=Classic+Albums+Deep+Purple%282011%29+NL+Sub+NLT-Release+%28Divx%29+%2B+CD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"luiehond69","files":-1,"time":1302383893,"description":"Classic Albums Deep Purple(2011) NL Sub NLT-Release (Divx) + CD Machine Head\n\n\nClassic Albums is a documentary series on the Netherlands on 3 pop and rock albums, which are considered the best or most notable albums of a famous band, or a period of musical highlight.\nMusicians, producers and sound engineers dissect the music and thus give insight into the way the album was born.\nSaturday, February 19 is Machine Head by Deep Purple's turn.\n\nNever thought that rock classic Smoke On The Water is about? Yes, Frank Zappa and the Mothers had something to do.\nBut otherwise? In this episode of Classic Albums is the true story behind Smoke and its accompanying album, Machine Head was revealed.\n\nWe all Came out to Montreux on the Lake Geneva Shoreline\nTo make records with a mobile, we did not have much time.\n\nOn December 4, 1971 were guitarist Ritchie Blackmore, singer Ian Gillian, bassist Roger Glover, keyboardist John Lord and drummer Ian Paice in Montreux, Switzerland,\nto begin the recording of Machine Head. A mobile studio rented from the Rolling Stones was parked outside the Montreux Casino, at that time a regular stop in the European live circuit.\n========================================================\nClassic Albums is een documentaireserie op Nederland 3 over pop- en rockalbums, die worden beschouwd als de beste of meest opmerkelijke albums van een bekende band,\nof die een periode in de muziekgeschiedenis markeren. Muzikanten, producers en geluidstechnici ontleden de muziek en geven zo inzicht in de manier hoe het album is ontstaan.\nZaterdag 19 februari is Machine Head van Deep Purple aan de beurt.\n\nOok nooit nagedacht waar rockklassieker Smoke On The Water precies over gaat? Ja, Frank Zappa en de Mothers hadden er iets mee te maken. Maar verder?\nIn deze aflevering van Classic Albums wordt het waargebeurde verhaal achter Smoke en het bijbehorende album Machine Head uit de doeken gedaan.\n\nWe all came out to Montreux, on the Lake Geneva shoreline\nTo make records with a mobile, we didn't have much time.\n\nOp 4 december 1971 kwamen gitarist Ritchie Blackmore, zanger Ian Gillian, bassist Roger Glover, keyboardspeler John Lord en drummer Ian Paice aan in Montreux,\nZwitserland, om te beginnen aan de opnames van Machine Head. Een gehuurde mobiele studio van de Rolling Stones stond geparkeerd buiten het Montreux Casino,\nin die tijd een reguliere stop in het Europese live circuit.\n\nGEGEVENS:\ncategorie:Docu\nkwaliteit: DVDR\nLanguage: Englisch\nsub: Dutch ((hardcoded))\njaar: 2011\ntijdsduur: 50 min\nbestand: Divx\nvideo codec: XVID\nbitrate: 1257 Kbps\nafmetinge: 640 X 480\ngeluidsindeling: Lame Mp3 128kb/s\n\nYoutube:\n========================================================\n\nMachine Head\n\nTrack list:\n\n1. &quot;Highway Star&quot; 6:05\n2. &quot;Maybe I'm a Leo&quot; 4:51\n3. &quot;Pictures of Home&quot; 5:03.\n4. &quot;Never Before&quot; 3:56.\n5. &quot;Smoke on the Water&quot; 5:40\n6. &quot;Lazy&quot; 7:19\n7. &quot;Space Truckin'&quot; 4:31\n\ngeluidsindeling: acc\ncover: yes\n\nLUIEHOND69 ;)\n========================================== &lt;a href=&quot;\nhttp://www.nlt.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.nlt.ons-forum.nl&lt;/a&gt;\nENJOY THE MOVIE :D\n","torrent":{"xt":"urn:btih:7e6dbf0ff3aa0a7278f77697590b55458261a87f","amp;dn":"Classic+Albums+Deep+Purple%282011%29+NL+Sub+NLT-Release+%28Divx%29+%2B+CD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e6dbf0ff3aa0a7278f77697590b55458261a87f","infoHashBuffer":{"type":"Buffer","data":[126,109,191,15,243,170,10,114,120,247,118,151,89,11,85,69,130,97,168,127]},"announce":[],"urlList":[]}}