{"title":"Teaching of Buddha","uid":4663702,"size":552574,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7ea6eee2a3d2f2f7432449043fdd61160bd99e81&amp;dn=Teaching+of+Buddha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"timnehguy","files":2,"time":1232486866,"description":"Bukkyo Dendo Kyokai: The Teaching of Buddha\n\nAnyone who has stayed in a hotel in Japan has probably seen a copy of The Teaching of Buddha. First published in 1925, the book was originally edited by Japanese scholars of Buddhism before WWII and distributed widely throughout Japan. The first English edition was published in 1934. The Reverend Dr. Yehan Numata brought out another English edition in 1962, and in 1966, after the establishment of the Bukkyo Dendo Kyokai (BDK) (Society for the Promotion of Buddhism), Dr. Numata assembled a committee of Buddhist scholars to substantially revise and edit a new English-Japanese edition. The Teaching of Buddha has undergone minor revisions and numerous reprintings since. It is now available in fourty-one languages and over 7 million copies have been distributed and placed in hotel rooms in over fifty countries throughout the world.\n\nThe Teaching of Buddha is a collection of writings on the essence of Buddhism, selected and edited from the vast Buddhist canon, presented in a concise, easy-to-read, and nonsectarian format. It also includes a brief history of Buddhism, a listing of the source texts, a glossary of Sanskrit terms, and an index. \n\nHTML format only - sorry. I've tried to convert it to PDF, but I didn't like the way it turned out. If there is interest in this, I'll post the audiobook later.\n\nA great companion for this book is the 999-page The Seeker's Glossary of Buddhism, available for free download at http://buddhanet.net/ebooks_g.htm (next to last entry).\n\nHere's an index page of articles on Buddhism: http://www.squidoo.com/donthavetobebuddhist.","torrent":{"xt":"urn:btih:7ea6eee2a3d2f2f7432449043fdd61160bd99e81","amp;dn":"Teaching+of+Buddha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ea6eee2a3d2f2f7432449043fdd61160bd99e81","infoHashBuffer":{"type":"Buffer","data":[126,166,238,226,163,210,242,247,67,36,73,4,63,221,97,22,11,217,158,129]},"announce":[],"urlList":[]}}