{"title":"The Christian Traveler's Guide to the Holy Land (gnv64)","uid":14256790,"size":21937651,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:7eba06d6a64304c3b83492714db2cbd45ed8f755&amp;dn=The+Christian+Traveler%27s+Guide+to+the+Holy+Land+%28gnv64%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gnv65","files":2,"time":1460196716,"description":"The Christian Traveler's Guide to the Holy Land (Revised, Updated edition)\r\nby Charles H. Dyer and Gregory A. Hatteberg\r\nMoody Publishers | April 2014 | ISBN-10: 0802411622 | ePUB | 20.4 mb\r\n\r\nA trip to the Holy Land is, for most, a once-in-a-lifetime opportunity. In this one-stop guide, two professionals—Charles Dyer, a Bible scholar and veteran Holy Land tour guide, and Greg Hatteberg, graduate of the Institute of Holy Land Studies in Jerusalem—help you make the most of your trip.\r\nWith detailed maps and a full-color 16-page photo insert, this book walks you through five key biblical regions: Israel, Egypt, Greece, Jordan, and Turkey, giving you a preview of what’s to come and helping you make the most of every moment along the way.\r\nPacking lists, jet lag tips, passport requirements, and a wealth of other practical information will assure you that have everything you need, while a four-week prayer guide and Bible study prepare you for the spiritual journey you are about to take.\r\nThe Christian Traveler’s Guide to the Holy Land traces the biblical events of over ninety of the most visited sites and will ensure that your trip is an exciting, spiritually satisfying, and unforgettable experience.\r\nThis revised edition features newly excavated sites, up-to-date photos and maps, and relevant advice for preparing for and preserving your trip.\r\n\r\nAbout the Authors\r\nCHARLES DYER (B.A., Washington Bible College; Th.M. and Ph.D., Dallas Theological Seminary) served as provost and dean of education at Moody Bible Institute before becoming Professor-at-Large of Bible at Moody and host of The Land and the Book radio program. His most recent book is The Isis Crisis. Charlie and his wife, Kathy, have been married for more than 40 years and have two grown children.\r\nGREGORY A. HATTEBERG (Joliet College; Moody Bible Institute; Dallas Theological Seminary) is the director of Alumni for Dallas Theological Seminary and a seminar leader for Walk Thru the Bible Ministries. He and his wife, Lisa, are the parents of four children.\r\n\r\nCONTENTS\r\nIntroduction\r\nPART I: Preparing for the Trip\r\nPART II: The Land of Israel\r\nPART III: The Land of Egypt\r\nPART IV: The Land of Greece\r\nPART V: The Land of Jordan\r\nPART VI: The Land of Turkey\r\n \nhttp://i.imgur.com/ohJdX7Y.jpg","torrent":{"xt":"urn:btih:7eba06d6a64304c3b83492714db2cbd45ed8f755","amp;dn":"The+Christian+Traveler%27s+Guide+to+the+Holy+Land+%28gnv64%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7eba06d6a64304c3b83492714db2cbd45ed8f755","infoHashBuffer":{"type":"Buffer","data":[126,186,6,214,166,67,4,195,184,52,146,113,77,178,203,212,94,216,247,85]},"announce":[],"urlList":[]}}