{"title":"2014 - The Year In Christian Music (Bundle 02)","uid":9544544,"size":2144319351,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7ee573bf468e623bb9d543858f004d3608dfbccc&amp;dn=2014+-+The+Year+In+Christian+Music+%28Bundle+02%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"TorrentTracts","files":243,"time":1391105706,"description":"-----------------------------------------------------------------------\n2014 - THE YEAR IN CHRISTIAN MUSIC\n-----------------------------------------------------------------------\n\nAs I have said in my Bundle #1 text, I'm tired.  And I just don't feel emotionally connected to sharing music on this stage any longer.\n\nBut for the fact that I had a few gigs (enough for two bundles) of 2014 music already sorted out, and sitting in a separate directory on my hard drive while I was tidying up this morning, and but for the fact that there are lots of good, caring Christians right here on The Pirate Bay whom I have the utmost respect for, I wouldn't be torrenting this today.  And I likely wouldn't be torrenting at all in 2014.\n\nAlthough it's only been a month and a half since my last torrent, I've already found plenty to occupy my time.  I'm sharing more Christian music elsewhere online.  And I am beginning to tutor people one-on-one through Bible Study.  People who want to come to know Christ as I do.  And in doing so, I feel pretty satisfied.\n\nBecause of that, so far in January I have probably only been putting in 25% of my usual effort in gathering this music.  Instead my days are spent doing other works in His name.  So I'm quite sure there is plenty more 2014 Christian titles out there beyond what is in my first two bundles here today.\n\nI'm not going to commit to sharing anything else here for 2014.  Not today.  Instead, I want to see how these first two bundles go.  I know many of you will likely continue to try and encourage me to stick around.  And continue to share.  But it's not about that.  Although I appreciate the sincerity behind it, and I very much appreciate the opportunities we've been blessed to exchange over time.  It's about being led in this ministry by the Son of God, and not by man.  What more can I say?  I just don't know if I have another year of this left in me.  :(\n\nThe music is scattered all over the internet.  Free for the download.  Some websites you have to sign up for.  True.  Some require you to pay membership to.  True.  Some websites are in Chinese so you have to use translators.  True.  Some are in Russian, Greek, and other languages you might not know.  True.  But it's all there, and ready for the taking if you're willing to put in the time and effort of gathering it.\n\nAnd if someone does, and they want to start torrenting it here, I would appreciate it.  That way I can sit back with my feet up on my desk, and with the single click of my mouse, I can quite easily add 25 or more titles at a time to my collection.\n\n\n\nSINGER-SONGWRITER: Andrew Ripp, Copperlily, Damien Jurado, Grayson Kessenich, Seeker And Servant.  PRAISE &amp; WORSHIP: Brad Rickard, iWorship, VWorship.  HIP-HOP/RAP: Chosen, Du2ce, Young Paul.  POP: David Thulin, Jamie Grace, Lynn Cifuentes, Rebecca St. James, The Seasons.  ROCK: Fourtones, Switchfoot.  ALTERNATIVE: Good Son, Kye Kye.  CONTEMPORARY: KXC.  HARDCORE/METAL: Saving Grace.  GOSPEL: Soul'd Out Quartet.  INSTRUMENTAL: Tord Gustavsen\n\nBundle #2 contains the following 24 releases...\n\n * Andrew Ripp - 2014 - Simple\n * Brad Rickard - 2014 - Volume 1\n * Chosen - 2014 - Heart Of Savannah\n * Copperlily - 2014 - Love Is A Legend\n * Damien Jurado - 2014 - Brothers And Sisters Of The Eternal Son\n * David Thulin - 2014 - Light In Me - Single\n * Du2ce - 2014 - JC Saved Me, Vol 4\n * Fourtones - 2014 - Fourtones EP\n * Good Son - 2014 - Ceramic Eyes\n * Grayson Kessenich - 2014 - Colors\n * iWorship - 2014 - Now Next\n * Jamie Grace - 2014 - Ready To Fly\n * KXC - 2014 - Chapter One - The Father's Love EP\n * Kye Kye - 2014 - Fantasize\n * Lynn Cifuentes - 2014 - Staring At The Sky\n * Rebecca St. James - 2014 - Best Of Rebecca St. James\n * Saving Grace - 2014 - The Urgency\n * Seasons, The - 2014 - Velvet EP\n * Seeker And Servant - 2014 - Into Your Love I Go\n * Soul'd Out Quartet - 2014 - Re-Soul'd, Vol 3\n * Switchfoot - 2014 - Fading West\n * Tord Gustavsen - 2014 - Extended Circle\n * VWorship - 2014 - Bring Your Kingdom\n * Young Paul - 2014 - Da Proclamation\n\nFor Him,\nTorrentTracts, January 2014\n","torrent":{"xt":"urn:btih:7ee573bf468e623bb9d543858f004d3608dfbccc","amp;dn":"2014+-+The+Year+In+Christian+Music+%28Bundle+02%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ee573bf468e623bb9d543858f004d3608dfbccc","infoHashBuffer":{"type":"Buffer","data":[126,229,115,191,70,142,98,59,185,213,67,133,143,0,77,54,8,223,188,204]},"announce":[],"urlList":[]}}