{"title":"Flatout (GOG)","uid":10473344,"size":1089168684,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7f0ee9f1fbf7378d2733d8d00776c0d19a843a19&amp;dn=Flatout+%28GOG%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Sarah116","files":5,"time":1404283599,"description":"Hey, here flatout. Hope you enjoy and please help seed.\n\n\n----------------\n\n\nBonus content included for FREE with purchase: \n\n- manual (7 pages) \n\n- screensaver \n\n- 2 HD wallpapers \n\n- soundtrack\n\n\n\n-----------------\n\n\n\nWhat's cool about it:\n\n- A sophisticated physics engine, enabling ragdoll animations and a very advanced collision model\n\n- Bonus mini-games including Figure of 8 and Demolition Bowl\n\n- 36 race tracks with fully destructible environments and 16 badass, customisable cars!\n\n\nOverview:\nDrivers thrown across the track, shattered fences, mangled cars, exploding tire walls, and that's just the first corner! Use every trick, shortcut and jump as you battle 7 rivals for the championship.\n\nFlatOut delivers a thrilling combination of high-octane racing, smash-em-up demolition derby action and death defying stunts propelling the driver through the windshield!\n\nWreak havoc, as you race on 36 tracks in fully destructible environments. Choose among 16 different upgradeable cars that take realistic damage, affecting their appearance and drivability. Invite a friend to a B-player LAN carnage.\n\nFlatOut features 6 death defying minigames (High Jump, Long Jump, Darts, Bowling, Bullseye, Clown) and 6 destruction arenas and dirt tracks (Demolition Dash, Super Mud Mayhem, Demolition Sandpit, Circle of Eight, Super Roundabout, Crashalley Run).\n\nWin all of them, because if you're not the first you're the last!","torrent":{"xt":"urn:btih:7f0ee9f1fbf7378d2733d8d00776c0d19a843a19","amp;dn":"Flatout+%28GOG%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f0ee9f1fbf7378d2733d8d00776c0d19a843a19","infoHashBuffer":{"type":"Buffer","data":[127,14,233,241,251,247,55,141,39,51,216,208,7,118,192,209,154,132,58,25]},"announce":[],"urlList":[]}}