{"title":"Fr. Larry Richards - Confession (Original Recording)","uid":10739609,"size":29678118,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:7f9783c1e71835c62b877f3649abc557ce63a010&amp;dn=Fr.+Larry+Richards+-+Confession+%28Original+Recording%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ancapcatholic","files":-1,"time":1407733936,"description":"This is the original recording of Fr. Larry Richards' famous talk on confession. A more-recent version is available here: https://thepiratebay.se/torrent/10204588\n\n---\n\nThe #1 all-time recording on the Sacrament of Reconciliation is must-listening for practicing and non-practicing Catholics alike. Riveting, hilarious, insightful, earthy, and inspirational. An essential parish resource for RCIA, Youth Ministry, and Adult Education. You will never experience this most important sacrament in the same way again.\n\nFather Larry Richards is the founder and president of The Reason for Our Hope Foundation. He is a preacher and retreat master who speaks from experience as a pastor of an inner city parish, a high school chaplain, a counselor and evangelist. He hosts a nightly radio show called Changed Forever with Father Larry Richards, heard nationwide on Relevant Radio, and has directed hundreds of retreats, parish missions, and conferences. \n\nIn just a few short years, &quot;Confession&quot; has become one of the most popular and life-changing Catholic recordings of all time. Father Larry Richards has given this talk hundreds of times during his priesthood. Every time, many of his listeners return to the Sacrament of Reconciliation with humility, sincere contrition, and renewed hope for a closer relationship with Jesus Christ. You will no doubt want to give &quot;Confession&quot; to others. Many of the folks you reach (real people in broken relationships with Our Lord) will return to Confession and find healing.\n\nBased on a proven and powerful parish mission presentation, &quot;Confession&quot; has become the #1 talk in North America on this most misunderstood sacrament because it is humorous (even hilarious), riveting, honest, human, and often touchingly gentle. It confronts without being confrontational. It persuades without being manipulative.\n\nThis talk has helped countless listeners comprehend what sin really is, sometimes for the first time since we were children. It is just as important for practicing Catholics (even those who go to Confession fairly often) to hear this talk as it is for fallen-away Catholics to hear it.\n\nGive it to your friends. Bring it to your parish. Guide souls towards healing in Christ in one of most glorious, rejuvenating, and intimate ways imaginable.\n\nORDER YOUR FREE COPIES ONLINE NOW  &lt;a href=&quot;\nhttp://www.catholicity.com/cds/confession.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.catholicity.com/cds/confession.html&lt;/a&gt;\n\n---\n\nCatholiCity runs a large deficit each year because they give away free life-changing Catholic CDs, booklets and novels. Your generosity will ensure that millions continue to have the opportunity to receive them. Your gift is tax deductible, and you will receive a free gift with your donation of any amount, and larger gifts for donations of $25, $50 or $100.\n       &lt;a href=&quot;\nhttp://www.catholicity.com/support/donation.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.catholicity.com/support/donation.html&lt;/a&gt;\n\n\n\n--Dr. Scott Hahn - The Healing Power of Confession (1 hour)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10174056&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10174056&lt;/a&gt;\n\n--Dr. Scott Hahn - Lord, Have Mercy (13-part audio series + book)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10277790&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10277790&lt;/a&gt;\n\n--Vinny Flynn - Healing and Holiness\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10738206&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10738206&lt;/a&gt;\n\n--Dr. Scott Hahn - Answering Common Objections (6 CD SET)\n  &lt;a href=&quot; https://thepiratebay.se/torrent/10211970&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/torrent/10211970&lt;/a&gt;\n\n\n\nPlease seed!\n\nMore: https://thepiratebay.se/user/ancapcatholic/\n\nTips: https://bit.co.in/ancapcatholic\t","torrent":{"xt":"urn:btih:7f9783c1e71835c62b877f3649abc557ce63a010","amp;dn":"Fr.+Larry+Richards+-+Confession+%28Original+Recording%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f9783c1e71835c62b877f3649abc557ce63a010","infoHashBuffer":{"type":"Buffer","data":[127,151,131,193,231,24,53,198,43,135,127,54,73,171,197,87,206,99,160,16]},"announce":[],"urlList":[]}}