{"title":"Need For Speed Underground repack","uid":10674565,"size":851346529,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7fcde18c72c345c8692fb76c21ef772c9bf1f283&amp;dn=Need+For+Speed+Underground+repack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ObiVan25","files":14,"time":1406924445,"description":"\n\nSystem Requirements\nCPU:\tIntel Pentium III (or compatible) CPU running at 700Mhz or higher\nRAM:\t256MB of RAM\nVGA:\t32MB DirectX 9 compatible video card (Geforce2 or higher) using a supported chipset (see below)\nDX:\tDirectX 9\nOS:\tWindows 98, 98 Second Edition, ME, 2000 Professional, XP Professional, or XP Home operating system\nHDD:\t450 MB free Hard Disk space, plus space for Direct X9 installation\nSound:\tDirectX compatible Sound Card\nODD:\t8X CD-ROM\nNetwork:\tNetwork card for broadband connectivity\nNote:\t* Supported Video Card Chipsets: * ATI Radeon 7500 or greater * Intel i865 * Matrox Parhelia * NVidia geForce2 or greater * SiS Xabre 400\n\n\nNeed for Speed: Underground (NFSU) is the tenth racing game in the Need for Speed video game series developed by EA Black Box and published by Electronic Arts in 2003.\n\nNeed for Speed: Underground reboots completely the franchise, ignoring the previous games and is the first game in the series to offer a career mode featuring a storyline, and a garage mode that allowed players to fully customize their cars with a large variety of brand-name performance and visual upgrades. All races take place in a generic city at night, though the city bears some resemblance to New York, San Francisco and Los Angeles. Rather than exotic cars, Underground featured vehicles associated with the Import Scene. Underground was commercially successful, and inspired a sequel.\nThe player starts straight into the action, at a circuit race driving a uniquely styled Acura Integra Type R with wide body kit, easily winning over his opponents...only to be woken up by Samantha from his daydreaming.\n\nSamantha is the player's friend in the new environment; she shows the player how the console with the races works, who's who, and makes fun of the player's starter car. Eddie (and his orange-metallic Nissan Skyline), is the leader of the Eastsiders and current top racer of the streets, and Melissa is his girlfriend.\n\nTime passes, races are won. The player meets other racers, and eventually gathers a small list of nemeses that continually challenge him and are defeated. He's introduced to TJ, who promises unique vehicle upgrades in exchange of beating time trial challenges; Samantha does the same from time to time, offering unique visual modifications instead.\n\nThe player's successive victories don't impress Eddie. First, he mocks the player's skill, saying he has a long way to go to 'roll his streets'. Later in the game, the player builds enough hype to be too hard to ignore, so Eddie challenges him to beat Samantha in a sprint race before coming after him; the player's willingness in going for it infuriates her. Samantha totals her Civic's engine trying to beat the player, unsuccessfully. TJ takes the junked car for himself after the event.\n\nWhen the player comes close to reaching #1 in all kinds of races, Eddie tries to once again get rid of his rival. Around the same time, the Player sees TJ in Samantha's recovered car, now working again, but has been vandalized. Both run a circuit race worth the other's vehicle, which the player wins. The player returns the car to Samantha to make amends, and she gives the player a choice of a wide body kit for his car.\n\nRight after the touching moment, Eddie challenges the player and loses, like everyone else who ever challenged the player so far. Before any victory can be sung, a mysterious, legendary silver Nissan 350Z challenges the player for a last run through the Market Street circuit. A challenger who, after being beaten by the player, is revealed to be Eddie's girlfriend, Melissa.\n\nThat event solidifies the player's status as the new best underground racer in the city.\n\n\n\n\n\nHow to install:\n-run setup exe and chose install directory,\n-skip directx and visual install,\n- whait until is done.\nNote:\n-if when you click on desctop shortcut and nothing hapens,go to tasck manager and find speed.exe process an close it,after thet run the game again and it will work.Or download a new crack for the game,and replace the existing one\n-necesary hdd space for instal 1.3 Gb\n\nIf you like it ,seed it\nHappy gaming","torrent":{"xt":"urn:btih:7fcde18c72c345c8692fb76c21ef772c9bf1f283","amp;dn":"Need+For+Speed+Underground+repack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fcde18c72c345c8692fb76c21ef772c9bf1f283","infoHashBuffer":{"type":"Buffer","data":[127,205,225,140,114,195,69,200,105,47,183,108,33,239,119,44,155,241,242,131]},"announce":[],"urlList":[]}}