{"title":"Oddworld.Munchs.Oddysee.HD-SKIDROW","uid":15480441,"size":1745103696,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7fe69bdff44c6e54fd3a37a8be036d9ac857e706&amp;dn=Oddworld.Munchs.Oddysee.HD-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Itanium2","files":2,"time":1470245226,"description":"Oddworld: Munch's Oddysee HD\r\n(c) Oddworld Inhabitants\r\n\r\n03-08-2016......Release Date &lt;-&gt; Protection.................Steam\r\nAction.............Game Type &lt;-&gt; Disk(s)....................1 DVD\r\n\r\nRELEASE NOTES\r\n\r\nNew port for 2016\r\nWe've reported the game for 2016, which now runs at 60 FPS, includes\r\nhigher resolution textures, better quality cut-scenes, improved audio\r\nhigher poly models, numerous fixes and improvements, and trading cards\r\nbadges, emotes and backgrounds!\r\n\r\nPlayers guide Mudokon champion Abe, and his aquatic Gabbit partner\r\nMunch, in Oddworld's third adventure, using special psychic powers\r\ncool power-ups, and other special abilities to deliver payback as they\r\nreclaim the last gabbit eggs on Oddworld, which have been packaged in a\r\ncan of gabbiar\r\n\r\nKey features:\r\n\r\nPlay as a team - players use Munch and Abe cooperatively to make their\r\nway through the trials of Oddworld. Leverage both characters' unique\r\nstrengths:\r\n\r\nAbe- Abe can climb and jump to reach new areas, and then run to escape\r\nfrom dangerous enemies. When all else fails, chant to take control of\r\nthe enemy's soul, and use their guns to clear a path to safety\r\n\r\nMunch - Munch can swim around the new realms of Oddworld. When on the\r\nground, zip along with a wheelchair power up. Need to move some yapping\r\nSlogs out of the way? Just use Munch's nifty remote control head port\r\nto fire up the crane and drop those Sloggies in their pen\r\n\r\nSpecial psychic powers - Munch and Abe's psychic powers can extend\r\ntheir reach and get others to do the dirty work:\r\nAs Abe - Let Abe's chant roar to take possession of a gun-toting Big\r\nBro Slig and clear almost anything out of the way. Abe can use spooce\r\nor spiritual power gained byharvesting SpooceShrubs to posses other\r\ncreatures as well, but why think small?\r\n\r\nAs Munch - If Abe can't mesmerize someone into getting the job done\r\nMunch can use his handy remote control head port to hijack nearby\r\nmachines including cranes, and 50-caliber Anesthesia bots to tackle the\r\nreally tough obstacles\r\nPower-Ups - Every friendly character you can find becomes a fighting\r\nally, Fuzzles, Mudokons . Need to get somewhere quickly or get over a\r\nwall, like right now? Use Oddworld's consumer power-ups like Expresso\r\nand Bounce to amp up\r\n\r\nMunch and Abe's abilities to perform cool moves. For the more direct\r\napproach, possess high-caliber weapon toting enemies\r\n\r\nOddworld, now in &quot;new and improved 3D!&quot; - it's a whole new Oddworld\r\nwith lush rivers, towering mountains and hundreds of trees that bloom\r\nor die\r\n\r\nInteract with dozens of different oddball races - use GameSpeak to get\r\nOddworld's Inhabitants from the heavily armed\r\nBig Bro Sligs to the cute but ferocious Fuzzles) to carry out tricky\r\ntasks or just beat the crap out of enemies\r\n&quot;Frustration Free&quot; gaming - Oddworld's new intelligent cinematic\r\ncamera, auto-targeting system and no-stick navigation system makes\r\nplaying a breeze! Plus with easy\r\n\r\nQuikSave and limitless lives, players have plenty of chances to take\r\non any situation\r\nno matter how Odd!\r\n\r\nINSTALL NOTES\r\n\r\n1. Unpack the release\r\n2. Mount or burn image\r\n3. Install\r\n4. Copy the cracked content from the SKIDROW folder and into the main\r\ninstall folder and overwrite\r\n5. Block the game in your firewall and mark our cracked content as\r\nsecure/trusted in your antivirus program\r\n6. Play the game\r\n7. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:7fe69bdff44c6e54fd3a37a8be036d9ac857e706","amp;dn":"Oddworld.Munchs.Oddysee.HD-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7fe69bdff44c6e54fd3a37a8be036d9ac857e706","infoHashBuffer":{"type":"Buffer","data":[127,230,155,223,244,76,110,84,253,58,55,168,190,3,109,154,200,87,231,6]},"announce":[],"urlList":[]}}