{"title":"DropDMG 3.2.6 [Mac Os X] [Coque599]","uid":11672721,"size":17255220,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:809866dc0691ede7bc4d2125b6749ff2e641e947&amp;dn=DropDMG+3.2.6+%5BMac+Os+X%5D+%5BCoque599%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"coque599","files":1,"time":1422736827,"description":"Version: 3.2.6\n\nDescription\nThe easiest way to create and work with Mac disk images (.dmg files).\nRequires: Mac OS X 10.6.8, 10.7, 10.8, 10.9, or 10.10\n\nDropDMG is the easiest way to create Mac OS X disk images, as well as cross-platform archives. Just drag and drop a folder or file and you're done. Or, you can drag an existing disk image or archive onto DropDMG to convert it to any of the other supported formats or to burn it to CD or DVD.\n\nDisk images pack entire folders or disks into a single compressed file, either for transport across the Internet or simply for backup. They are the only archive format whose contents you can directly access in the Finder, without the potentially slow and disk-consuming step of expanding the files into a folder.\n\nDropDMG supports advanced options such as encrypted and segmented disk images, Retina-optimized background pictures and custom volume icons, and rich-text license agreements in multiple languages. There are many time-saving features such as configurations to keep track of your favorite combinations of settings. It can also be automated via AppleScript, the command-line, and Automator.\n\n* Create and convert disk images and archives with a simple drag and drop. There are also many other convenient ways to invoke DropDMG.\n\n* DropDMG supports all the major formats, including compressed .dmg files, .sparsebundle files, .zip and .tar.gz archives, and hybrid disk images. Zlib disk images and ZIP archives created by DropDMG are smaller than those created by Disk Utility and the Finder.\n\nBackups, Archival, and Cloning:\n\n* Save disk space and network transfer time by compressing your files. Choose faster or more efficient compression.\n\n* Split large files or folders into multiple segments to burn them to optical discs or easily transfer them over a network.\n\n* Verify the integrity of your backups and archives to ensure that the media is still intact and that you'll be able to restore them if needed.\n\n* Create a device image that records the exact contents of a data CD or DVD. You can then burn bootable backup copies of the disc, or double-click the disk image to access its contents as though the disc were still in your optical drive.\n\n* In one step, create a device image clone of an entire hard drive, optimized for restoring using Apple Software Restore or Disk Utility.\n\nEncryption:\n\n* Encrypt files that you want to keep private. DropDMG's encrypted, writable disk images are faster and safer than Apple's FileVault, but just as secure and searchable via Spotlight.\n\n* Create encrypted, compressed disk images to securely transfer files via e-mail, iDisk, or FTP or to store backups safely off-site.\n\n* Choose from 128-bit and 256-bit AES encryption, approved by the U.S. National Security Agency.\n\n* Optionally store your passphrases in the Mac OS X keychain, so that you can quickly create and access encrypted disk images, without the hassle of double-typing or the risk of typos.\n\n* Mount disk images at specific locations in the filesystem, so that your applications can keep their support files encrypted.\n\n* Mount encrypted, segmented disk images without having to enter the passphrase separately for each segment.\n\nAdvanced:\n\n* Runs multiple operations simultaneously, so you that you can keep working while DropDMG processes in the background.\n\n* Takes advantage of multiple processor cores for faster compression and encryption.\n\n* Keeps a detailed log of all the successful operations as well as any errors, including statistics such as the throughput and how much space was saved using compression. New log entries are also reported via Growl.\n\n* Get detailed information about your disk images: their formats, partitions, compression ratios, checksums, etc.\n\n* Easily queue up bulk operations for creating, converting, mounting, verifying, getting info, burning, joining, etc. If multiple encrypted disk images share a passphrase, you only need to enter it once.\n\n* Process the names of the output files to add the current date or make the filename server-friendly.\n\nSEED AND ENJOY\nIf you like my work vote it good","torrent":{"xt":"urn:btih:809866dc0691ede7bc4d2125b6749ff2e641e947","amp;dn":"DropDMG+3.2.6+%5BMac+Os+X%5D+%5BCoque599%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"809866dc0691ede7bc4d2125b6749ff2e641e947","infoHashBuffer":{"type":"Buffer","data":[128,152,102,220,6,145,237,231,188,77,33,37,182,116,159,242,230,65,233,71]},"announce":[],"urlList":[]}}