{"title":"Thomas Merton - The Seven Storey Mountain (pdf)","uid":8593793,"size":4718206,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:818b8ed1bfd2b4e3f52d0e7c9e326969d7e41d20&amp;dn=Thomas+Merton+-+The+Seven+Storey+Mountain+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1371699296,"description":"Thomas Merton - The Seven Storey Mountain (Harcourt, 1948). 429 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc.\n\n\nClassic autobiography of faith by the great Trappist monk.\n\n\ndescription:\n\nThe fervor of his progress to the Trappist monastery at Gethsemani is deeply moving. It is a difficult matter to write about, but I think there will be many who, however alien the experience may remain to them personally, will put the narrative down with wonder and respect. --New York Herald Tribune Books.\n\nReview\n\nIn 1941, a brilliant, good-looking young man decided to give up a promising literary career in New York to enter a monastery in Kentucky, from where he proceeded to become one of the most influential writers of this century. Talk about losing your life in order to find it. Thomas Merton's first book, The Seven Storey Mountain, describes his early doubts, his conversion to a Catholic faith of extreme certainty, and his decision to take life vows as a Trappist. Although his conversionary piety sometimes falls into sticky-sweet abstractions, Merton's autobiographical reflections are mostly wise, humble, and concrete. The best reason to read The Seven Storey Mountain, however, may be the one Merton provided in his introduction to its Japanese translation: &quot;I seek to speak to you, in some way, as your own self. Who can tell what this may mean? I myself do not know, but if you listen, things will be said that are perhaps not written in this book. And this will be due not to me but to the One who lives and speaks in both.&quot; --Michael Joseph Gross\n","torrent":{"xt":"urn:btih:818b8ed1bfd2b4e3f52d0e7c9e326969d7e41d20","amp;dn":"Thomas+Merton+-+The+Seven+Storey+Mountain+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818b8ed1bfd2b4e3f52d0e7c9e326969d7e41d20","infoHashBuffer":{"type":"Buffer","data":[129,139,142,209,191,210,180,227,245,45,14,124,158,50,105,105,215,228,29,32]},"announce":[],"urlList":[]}}