{"title":"Doc Martin Series 6 dmusic","uid":10186618,"size":1817788999,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:818e986f4a7ef29cbbd58600d768c7055d04b6ac&amp;dn=Doc+Martin+Series+6+dmusic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dwmusic","files":-1,"time":1400547123,"description":"Episode 1 Sickness and Health: \nMartin finally marries Louisa, with Joe Penhale as best man; though, neither party has a parent present, and Martin is irritated by the gate-crashers at the reception. The villagers club together for a night in an isolated, but luxurious, lodge for the honeymooners -- whose seclusion they enjoy -- though, Bert drives off with their day clothes and luggage. Following a chimney fire, the Ellinghams set out to find a phone; but, instead, run into gun-wielding recluse Bellamy, whose life Martin saves after an accident. Back in the village, Ruth is grateful to jack-of-all-trades Mike Pruddy, who helps her out with advice for baby James, after fixing her electrics following a power cut. However, the disheveled newlyweds still return to find everything in chaos. \n\nEpisode 2 Guess Who's Coming to Dinner:\nWith Louisa back at work, the Ellinghams hire nanny Mel; but, she keeps scratching; and, when Martin tells her she has an infection caused by obesity, she leaves. Fortunately, Mike Pruddy steps into the breach, impressing Martin and allowing him to take Louisa to the school play. Here, they meet chair of governors Dennis Dodd, and his younger wife Karen, and ask them to dinner. The dinner party is awkward, as Martin believes Dennis is drunk, and tells Louisa so when they have to tend to baby James, unaware that their guests can hear them on the baby monitor. Whilst Morwenna inherits a house and takes Al in as her lodger, Ruth is roped into doing a phone-in for local radio; and, takes a call from Joe Penhale, under an assumed name, worried that he has no friends. She advises him to be nice to everybody; so, he takes her at her word, reluctantly arresting Dennis, who has crashed his car. But, when Dennis later has a fall, Martin discovers that his slurred speech is due to his having ...\n\nEpisode 3 The Tameness of a Wolf:\nBert welcomes old flame Jennifer Cardew, Sally Tishell's replacement as pharmacist, as his lodger; but, is less than pleased when pupil Becky Wead claims in the school magazine that she got food poisoning from his restaurant -- especially when it turns out that her stomach ache was actually caused by an ulcer. Whilst Mike continues to impress as an immaculate nanny, Louisa is slightly perturbed by his obsessive neatness. Meanwhile, Robert Campbell, an articulate drifter, is found unconscious on the beach, and proceeds to stalk Ruth, eventually getting into her house to declare his love for her. It turns out that he is a former patient of hers, a diabetic, who has developed an obsession with her. Between them, Ruth and Martin sedate him, but she seriously considers moving. \n\nEpisode 4 Nobody Likes Me:\nollowing her stalker scare, Ruth moves into a new house, next door to cantankerous, asthmatic hoarder John Moysey, who matches Martin in rudeness. When Ruth's attic is flooded, Moysey is responsible; but, when he suffers from excessive nose-bleeds, Martin discovers that his unhealthy life-style has given him scurvy. Martin grudgingly takes James to a play-group, where his brusqueness does not go down well with the other mothers; though, he does diagnose another baby's eye problem. Bert suspects Jennifer is on drugs when her Botox goes wrong, and Morwenna agrees to help a lonely Al find a girlfriend online.\n\nEpisode 5 The Practice Around the Corner: \nSally Tishell returns to Port Wenn, apparently cured of her obsession with Martin; though, she is hostile to Jennifer, whom she sees as a professional rival, and put out that Martin refuses to declare her fit enough to work on her own. Joe Penhale takes part in a survival course in the wilds where he ends up literally shooting himself in the foot; whilst, Morwenna and Al find that they have unwittingly corresponded with each other on a dating website, causing Al to move out and lodge with Joe. Martin attends to beach-comber Lorna, whose mystery illness turns out to be too much iron in the blood.\n\nEpisode 6 Hazardous Exposure: \nAfter vying with Jennifer for customer attention, Sally learns that she is finally allowed to practice alone and resume her old job, so she is keen to see off her rival. Jennifer plans to leave Port Wenn, but a marriage proposal from Bert changes her mind. Hypochondriac Malcolm Rayner complains of a cough, which Martin, given that Malcolm is a builder, diagnoses as asbestos poisoning. Malcolm, believing he is dying, gets drunk and arrested by Joe, who panics, posting asbestos warnings around the village. When he impales himself on his staple gun, Martin rescues him, but his blood phobia makes him vomit. A bigger blow for the doctor is the arrival of his mother, Margaret, who coldly informs him that his father has died. Nor is she very good with baby James, though she seems anxious to make amends. Martin is wary.\n\nEpisode 7 Listen with Mother:\nRuth bumps into Margaret and berates her for being an unloving mother to Martin; but, even Margaret, like Louisa, is concerned that Martin seems withdrawn and unwell. He attends the school prize giving, but his curt manner ends with him stomping off, and Louisa, running after him, is hit by a car and hospitalized. Visiting her, Martin is concerned that she may have an embolism, but is shocked when she announces she wants to take James for a break with her mother Eleanor in Spain. Military policemen visit Port Wenn, looking for Mike, an Army deserter. He is prepared for a life on the run, but Martin persuades him that things will go better for him if he gives himself up.\n\nEpisode 8 Departure:\nMartin watches sadly as Louisa and their baby get in a taxi on their way to Spain, after which he seeks advice from Ruth. She believes his emotional detachment and fear of blood both stem from his loveless upbringing, and advises him to go after Louisa. As a result, he confronts his mother, who has come to stay purely because she is penniless after her bereavement, and he throws her out. Discovering that Louisa has a condition that could be fatal if in flight, he gets Penhale to drive him to the airport, and gets her off the plane, performing a successful operation on her. Meanwhile, Ruth and Al go into partnership in a Bed and Breakfast venture whilst the wedding reception of Bert and Jennifer hits disaster when, due to Bert's penny-pinching, an inferior generator electrocutes DJ Caroline, and Morwenna and Al have to save her by phoning Martin for his advice.","torrent":{"xt":"urn:btih:818e986f4a7ef29cbbd58600d768c7055d04b6ac","amp;dn":"Doc+Martin+Series+6+dmusic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"818e986f4a7ef29cbbd58600d768c7055d04b6ac","infoHashBuffer":{"type":"Buffer","data":[129,142,152,111,74,126,242,156,187,213,134,0,215,104,199,5,93,4,182,172]},"announce":[],"urlList":[]}}