{"title":"Cass McCombs - A [2003][EAC,log,cue. FLAC]","uid":8890743,"size":278316749,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8217cc9361ca8fe3327c920af7c9e0389893e3de&amp;dn=Cass+McCombs+-+A+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":17,"time":1378578088,"description":"Artist:Cass McCombs\nRelease:A\nReleased: 2003\nLabel: MTR / Monitor\nCatalog#: 015\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle:folk rock\n\n\n1. I Went To The Hospital\n2. Bobby, King Of Boys Town\n3. What Isn't Nature\n4. Aids In Africa\n5. A Comedian Is Someone Who Tells Jokes\n6. Gee, It's Good To Be Back Home\n7. Meet Me Here At Dawn\n8. When The Bible Was Wrote\n9. My Pilgrim Dear\n10. Bedding Down Post Xmas Time\n11. My Master\n\nCass McCombs is an intriguing man. His songwriting abilities are undeniable but weirdly de-emphasized. His reedy voice is either awfully affected (he sounds like Procol Harum's Gary Brooker, or like a male Maria McKee) or poised to become one of our Great Acquired Tastes alongside Robert Smith's meow and Stephen Malkmus's yawn. A, while a fine album, is full of head-scratching choices; just as its harsh lyrics policy can't be explained by financial reasons (the inside of the CD booklet is wasted on a large Pollockian doodle), some of the production touches are just as odd. But it does make you suspect that we're dealing with a genius-- one that has yet to be properly framed.\nThis music, designed to resist classification, is basically (horrors) indie rock, except with a crooning pianist at the helm. Stop before you imagine Ben Folds: everything here is solemn and slow, and glistens with analog reverb. Shoegazing, with wing-tip shoes. The lyrics appear fittingly sad and literate. The album's first track, &quot;The Hospital&quot;, wastes little time before imagining the protagonist's demise: &quot;I may soon be gone/ To pluck on a harp/ Like those colored-pencil portraits of dogs/ We saw on a blue tarp.&quot; Not sure about the blue tarp. Could be Plutarch.\nDreamy and disturbing, &quot;The Hospital&quot; is a terrific song, and folks at Monitor are correct in focussing on it as The Single. It also sets the tone for about 80% of the disc-- literally. Over the course of the next ten numbers, there are precious few deviations in tempo, style or delivery; the same pall hovers over the entire record. &quot;AIDS in Africa&quot;, meanwhile, achieved distinction by annoying me. Delivering the title line in an urbane croon just doesn't work. If McCombs is going for Situationist-style semiotic disorientation, it's way too convoluted a gag.\nThe two relatively upbeat tracks are &quot;Bobby, King of Boys Town&quot;, which sounds like Blondie's &quot;The Tide Is High&quot; on 15rpm, and &quot;When the Bible Was Wrote&quot;. The latter, fast by McCombs' standards, is a shaggy piece of Western swing with a history lesson for lyrics. If not for all the reverb, it could have been the Silver Jews.\nBut one frustrating aspect of listening to A is trying to gauge exactly how serious McCombs is. Some signs point to the possibility that he's a supremely deadpan ironist, an indie Robbie Williams come to mock the genre from the inside. But, as one of his songs defensively puts it, &quot;A Comedian Is Someone Who Tells Jokes&quot;. Cass McCombs arrives in a cloak of fanciful ambiguity. It already feels a couple sizes too small for him.","torrent":{"xt":"urn:btih:8217cc9361ca8fe3327c920af7c9e0389893e3de","amp;dn":"Cass+McCombs+-+A+%5B2003%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8217cc9361ca8fe3327c920af7c9e0389893e3de","infoHashBuffer":{"type":"Buffer","data":[130,23,204,147,97,202,143,227,50,124,146,10,247,201,224,56,152,147,227,222]},"announce":[],"urlList":[]}}