{"title":"The Psychic Vampire Codex","uid":5430379,"size":187923,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82751771edd2f139b01fb5a6e1f04b87d9117557&amp;dn=The+Psychic+Vampire+Codex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"LordSidonus","files":-1,"time":1268392677,"description":"This book is quite helpful for those who know how to use it, I shall again post some information on it, I hope you enjoy.\n\n&quot;The Vampire Codex is a document written by occultist and psychic vampire Michelle Belanger for use as the instructional text of House Kheperu (www.kheperu.org). The prototype of this work was first set to paper in late 1991. A specially printed version was offered to select students in conjunction with the International Society of Vampires beginning in 1995. Later revisions led to the Sanguinarium edition, published by the Sanguiarium Press in October 2000. This version is derived from the Sanguinarium edition which also came to be circulated widely on the Internet.\n\nThe Vampire Codex has had a significant impact on the worldwide community of psychic vampires, becoming the fundamental text used by numerous Houses, Orders, Covens, and Clans. It has influenced the teachings of vampire groups throughout the US, Canada, and Western Europe. It has also come to the attention of several noteworthy occult organizations, including the Temple of Set, the IOT and the Church of Satan. (Peter Gilmore, current head of the Church of Satan, expressed his disappointment at Michelle's absence at the New York City release of &quot;V&quot; as he wanted her autograph on the special edition of the Codex released with that work).\n\nAs the Kheprian Order has continued to expand and reveal deeper and more complicated levels of its teachings, the Codex has continued to grow since its first underground releases. A special edition written for the Order of the Strigoi Vii was released as book two of &quot;V&quot; October 2003 by vampyrealmanac.com in conjunction with Aangel Publishing. An expanded, revised edition will be published by Weiser Books in the fall of 2004. This will be the definitive edition, featuring 108 individual sections broken up into divisions which address psychic vampirism, basic energy work, and advanced metaphysical techniques. The version below has come to be known as the Vampire Codex: Internet Edition and is freely and widely shared with any and all interested parties. It is derived mainly from the 2000 Sanguinarium edition, although it includes a few sections originally left out of that published edition.&quot;\n\nIf you have any requests, please send them to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;066a697462756f6269687375466e69726b676f6a2865696b&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; and in the subject bar put thepiratebay, thank you and adieu.","torrent":{"xt":"urn:btih:82751771edd2f139b01fb5a6e1f04b87d9117557","amp;dn":"The+Psychic+Vampire+Codex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82751771edd2f139b01fb5a6e1f04b87d9117557","infoHashBuffer":{"type":"Buffer","data":[130,117,23,113,237,210,241,57,176,31,181,166,225,240,75,135,217,17,117,87]},"announce":[],"urlList":[]}}