{"title":"CrossOver Mac Professional v7.0.2 Mac OSX","uid":4443003,"size":37365240,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:828177a91c573bcee38a1f94722ea85b626e8a9c&amp;dn=CrossOver+Mac+Professional+v7.0.2+Mac+OSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ttt2009","files":2,"time":1223914518,"description":"uploaded b/c the only torrent I found was from a dumbass private tracker (data force sh*t)\n\n--------\n\nCrossOver Mac allows you to install many popular Windows applications and games on your Intel OS X Mac. CrossOver includes an easy to use, single click interface, which makes installing Windows software simple and fast. Once installed, your application integrates seamlessly in OS X. Just click and run your application directly from the OS X Finder. Clicking a Windows file or document - including email attachments - will launch the appropriate Windows program, allowing you to work on the files. Best of all, you do it all easily and affordably, without needing a Microsoft operating system license.\n\nAdding new Windows software is easy. Just place your install CD in your Intel Mac, and CrossOver will recognize it and offer to begin the installation process. CrossOver then completes the installation and configures your application to run on your Mac. That's all there is to it.\nOne Application: Two Delicious Flavors!\n\nWe've created two versions of CrossOver Mac - Standard and Professional - to serve our home-user/enthusiast and corporate markets even better. CrossOver Mac Standard provides individual users with the ability to run a wide variety of Windows software cleanly and economically. CrossOver Mac Professional provides corporate users with the enhanced deployability and manageability features their environments demand.\n\nLikewise, if you're the kind of customer that likes a one-shot deal to make just one particular Windows application run, Standard is for you. But if you're the sort of customer who likes to stay under support, and get a steady stream of updates, Pro is for you: you'll get a better level of support, longer support, and a lower price over the long haul.\n\n--------","torrent":{"xt":"urn:btih:828177a91c573bcee38a1f94722ea85b626e8a9c","amp;dn":"CrossOver+Mac+Professional+v7.0.2+Mac+OSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"828177a91c573bcee38a1f94722ea85b626e8a9c","infoHashBuffer":{"type":"Buffer","data":[130,129,119,169,28,87,59,206,227,138,31,148,114,46,168,91,98,110,138,156]},"announce":[],"urlList":[]}}