{"title":"J'entends Plus la Guitare (Philippe Garrel, 1991)","uid":6604915,"size":2141342993,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:82be089d758a46f8c8e103f7132429f037c3c228&amp;dn=J%5C%27entends+Plus+la+Guitare+%28Philippe+Garrel%2C+1991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tonioferah","files":4,"time":1313358083,"description":"&quot;J'entends plus la guitare&quot; is dedicated to the memory of Nico, the Swedish model and actress who was director Garrel's muse, most famous as the blonde Marcello meets at the castle party in &quot;La Dolce Vita&quot;, and the singer with the haunted monotone on the Velvet Underground's extraordinary &quot;Banana&quot; album. the heroine of the film is a blonde German who, like Nico, turns to drugs - her last appearance is marked by a pun on heroine/heroin (the Velvets' most famous song), and the Velvet-esque guitar of the title is no longer heard by the hero, or the director. The female is usually signalled in Garrel's films by music, as if music itself was somehow a feminine principle - the &quot;Je&quot;, therefore, is plausibly the director's, offering the film as a mea culpa, blaming himself for a death triggered by pure male egotism. Gerard is one of the least likeable characters in European cinema, an emotional vampire who needs to suck the emotional blood out of countless women, leaving them diminished, empty, to save himself from a similar fate\n\nPerhaps, again in tribute to Nico, Garrel's usual stylistic austerity is filtered through a Warhol-like sensibility. this is one of the most gruelling films I have ever squirmed through, in terms of style - long, punishing takes in shabby, bare environments of people either talking self-serving philosophical twaddle, or, worse, little at all, the peeling of the walls against which the characters are framed speaking more eloquently for the emotional and imaginative inertia; takes that are so long and unadorned that the characters (or actors) arent' allowed to hide, and the various mannerisms or tics or little theatrical heightenings are exposed for what they are, not as accretions to be stripped away to reveal some real 'truth', but as part of the truth that we can never strip them away, never truly give ourselves to another - and in terms of content.\n\n________________________________________\n\n\nDVDrip\n\n(143123 frames in first part, 552 frames follow)\nInterleave: 96 ms (2.4 v.frames), preload=96\nAudio frames: Aligned on interleaves\n\nAudio\n\nCodec : 0x2000(AC3, Dolby Laboratories, Inc) AC3\nInfo : 48000Hz 256 kb/s total (2 chnls)\n\nVideo\n\nCodec : xvid\nInfo : XviD\npics/sec 25.000 frms/sec 25.000\nframe : 720 x 432 ","torrent":{"xt":"urn:btih:82be089d758a46f8c8e103f7132429f037c3c228","amp;dn":"J%5C%27entends+Plus+la+Guitare+%28Philippe+Garrel%2C+1991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82be089d758a46f8c8e103f7132429f037c3c228","infoHashBuffer":{"type":"Buffer","data":[130,190,8,157,117,138,70,248,200,225,3,247,19,36,41,240,55,195,194,40]},"announce":[],"urlList":[]}}