{"title":"Nursing Outcomes Classification (NOC), 5E [PDF][StormRG]{HTD15}","uid":11785066,"size":48673465,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:82ed370dec3dd7eddc1b47bc5bd26470c3242099&amp;dn=Nursing+Outcomes+Classification+%28NOC%29%2C+5E+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":3,"time":1427724156,"description":"TITLE/EDITION Nursing Outcomes Classification (NOC): Measurement of Health Outcomes, 5e\nBy: Sue Moorhead PhD RN (Author), Marion Johnson PhD RN (Author), Meridean L. Maas PhD RN FAAN (Author), Elizabeth Swanson PhD RN (Author)\nSeries: Nursing Outcomes Classification\nPaperback: 776 pages\nPublisher: Mosby; 5 edition (November 28, 2012)\nLanguage: English\nISBN-10: 0323100104\nISBN-13: 978-0323100106\nNOTE: This is the standalone ebook and may not include access codes that come packaged with the bound book\n\n\n\n\nPromoting safe and effective nursing care, Nursing Outcomes Classification (NOC), 5th Edition standardizes the terminology and criteria needed to measure and evaluate outcomes that result from nursing interventions. Nearly 500 research-based nursing outcome labels - including 107 that are NEW to this edition - help to standardize expected patient outcomes. Specific indicators make it easier to evaluate and rate the patient in relation to outcome achievement. Written by an expert author team led by Sue Moorhead, this book is ideal for practicing nurses, students, educators, researchers, and administrators seeking to improve cost containment and patient outcomes.\n\n490 research-based nursing outcome labels promote standardization of expected patient outcomes.\nDefinitions, lists of indicators, publication facts lines, and references provide all of the information you need to understand outcomes.\nA label name, definition, set of indications, 5 point Likert measurement scale, a publication facts line, and selected references are presented for each outcomes.\nLinkages between NOC outcomes and 2012-2014 NANDA-I Diagnoses and Functional Health Patterns promote clinical decision-making.\nCore outcomes are included for specialty practice across care settings.\n107 NEW outcome labels allow you to better define patient outcomes that are responsive to nursing care.\nNEW! Health Management class added to the NOC taxonomy includes outcomes that describe the individual's role in the management of an acute or chronic condition","torrent":{"xt":"urn:btih:82ed370dec3dd7eddc1b47bc5bd26470c3242099","amp;dn":"Nursing+Outcomes+Classification+%28NOC%29%2C+5E+%5BPDF%5D%5BStormRG%5D%7BHTD15%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"82ed370dec3dd7eddc1b47bc5bd26470c3242099","infoHashBuffer":{"type":"Buffer","data":[130,237,55,13,236,61,215,237,220,27,71,188,91,210,100,112,195,36,32,153]},"announce":[],"urlList":[]}}