{"title":"Spy Fox in Dry Cereal [ZimbiXEL] (Win64-bit Compatibile)","uid":6388623,"size":397539047,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8326ef7586a76f334aaf244c20dc07310ec9dd7c&amp;dn=Spy+Fox+in+Dry+Cereal+%5BZimbiXEL%5D+%28Win64-bit+Compatibile%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zimbixel","files":2,"time":1305283541,"description":"The original 1997 version of the classic children's game, Spy Fox, modified to also allow compatibility with Windows 64-bit (that is, some files have been copied from the 64-bit compatible UK version)\n\nTested on Windows 7 Home Premium 64-bit and Android (HTC Desire HD)\n\nJust burn/mount the iso to play\n\nDescription from IMDB:\nWilliam The Kid has stolen all the dairy cows in an effort to take over the dairy industry. SPY Corp has sent their top agent, Spy Fox to stop William's plan of dairy destruction. Monkey Penny (who gives Spy Fox important clues), Professor Quack (gives Spy Fox his inventions) Walter Wireless (who helps Spy Fox track down William The Kid's hidden fortress) and Mata Hairy (who gives Spy Fox the passwords) help out Spy Fox on his mission. Along the way he meets villians Artemis J. Bigpig (villainous &quot;go fish&quot; player), Russian Blue (seductive owner of the SS Deadweight), and Hong Kong Doodle (NOG's top martial arts master) and of course, William The Kid himself. Set in the Greek island of Asodopolos, Spy Fox gets clues from the inhabitants of the island, and aboard the suspicious SS Deadweight. It's up to Spy Fox to stop William's plans to make dairy milk go bad. Written by Anthony LoGatto\n\n\nMy favourite childhood game XD\nStill a fantastic game for any child - they recommend it's for kids aged 8+, but really it's suitable for any primary school-aged kid. Just play through it with them for the first time round and they'll pick it up quickly! You'll probably enjoy the jokes too =)\n\nPlease Seed!\nEnjoy! =D\n\nI hope to get around to uploading the rest of my Humongous Entertainment collection, but I just saw a real need for this one right now! The USA voices are tonnes better than the UK ones XP\n\n - ZimbiXEL","torrent":{"xt":"urn:btih:8326ef7586a76f334aaf244c20dc07310ec9dd7c","amp;dn":"Spy+Fox+in+Dry+Cereal+%5BZimbiXEL%5D+%28Win64-bit+Compatibile%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8326ef7586a76f334aaf244c20dc07310ec9dd7c","infoHashBuffer":{"type":"Buffer","data":[131,38,239,117,134,167,111,51,74,175,36,76,32,220,7,49,14,201,221,124]},"announce":[],"urlList":[]}}