{"title":"Fire Safety Engineering - Design of Structures (Malestrom)","uid":4659070,"size":6295984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8331bcc3362082dc6fe73f2501e9f7d206b9fda1&amp;dn=Fire+Safety+Engineering+-+Design+of+Structures+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1232313255,"description":" &lt;a href=&quot;http://www.image-upload.net/images/30xbhj8nva6jko8ac.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/30xbhj8nva6jko8ac.jpeg&lt;/a&gt;\n\nJohn A Purkiss, &quot;Fire Safety Engineering&quot;\nButterworth-Heinemann | 2006-12-07 | ISBN: 0750664436 | 424 pages | PDF | \n\nFire Safety Engineering: Design of Structures provides the knowledge needed to design a structure which will withstand the effects of fire.\nThe book covers everything from design concerns and philosophies, regulatory control, the behaviour characteristics of natural fires through to the properties of different materials at elevated temperatures.\nFocusing on the fire sections of the Structural Eurocodes, the book provides detailed design advice on each of the main structural elements such as concrete, steel, composite steel-concrete, timber, and masonry, aluminium, plastics and glass.\n\nJ. A Purkiss, Consultant, previously lectured Structural Engineering at Aston University. His main areas of research were the behaviour of concrete, concrete composite materials and concrete structures at elevated temperatures, the experimental determination of the effects of spalling and its modelling using coupled heat and mass transfer, the determination of the characteristics of fire damaged concrete structures.\n\n* Design methods based on the fire sections of the new Structural Eurocodes\n* Worked calculations and examples clearly illustrate the effect of temperature rise and structural performance of structural elements\n* Essential reading for Structural Engineers, Building Designers, Architects, Fire Engineers and Building Control Officers\n","torrent":{"xt":"urn:btih:8331bcc3362082dc6fe73f2501e9f7d206b9fda1","amp;dn":"Fire+Safety+Engineering+-+Design+of+Structures+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8331bcc3362082dc6fe73f2501e9f7d206b9fda1","infoHashBuffer":{"type":"Buffer","data":[131,49,188,195,54,32,130,220,111,231,63,37,1,233,247,210,6,185,253,161]},"announce":[],"urlList":[]}}