{"title":"Digital Juice Party and Celebration Canvases","uid":7044450,"size":437478479,"categoryP":"other","categoryS":"pictures","magnet":"?xt=urn:btih:83565eff8218c771c268e03a05ccba73afd0702c&amp;dn=Digital+Juice+Party+and+Celebration+Canvases&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"skoxpress","files":209,"time":1329694422,"description":"Put on your party hats and pop open the champagne, because with this new addition to the Canvases product line you have a whole new reason to celebrate! Party &amp; Celebration Canvases contains 41 party-themed image backgrounds, each delivered in 5 useful size formats for a total of 205 brand new canvases to suit any special occasion! No more staring at a blank page or an empty timeline hoping for inspiration. This bright new library of fun and festive images contains a variety of party or celebration-themed backgrounds, giving you an array of powerful starting points with a fun, high-spirited feel to set the ideal mood for your next graphics project. As always, these canvases are about giving your text, your photos and your ideas the perfect foundation to come alive and project your message.\nWe know you are working on a limited budget and with constant deadlines. You need something you can use right away that will make an impact and drive your message home. Look at any professionally designed poster, magazine ad or multimedia presentation and you are unlikely to find a simple solid color background. Instead you will find a sophisticated mix of color and texture that creates a perfect backdrop for the message or product being promoted. This is what Party &amp; Celebration Canvases provides for you - without all the hard work and without breaking the bank. It gives you a fun, versatile graphic foundation and a creative nudge to get your ideas flowing and your project moving, providing a subtle, fun environment that enhances your text, photos or videos and makes your material stand out.","torrent":{"xt":"urn:btih:83565eff8218c771c268e03a05ccba73afd0702c","amp;dn":"Digital+Juice+Party+and+Celebration+Canvases","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83565eff8218c771c268e03a05ccba73afd0702c","infoHashBuffer":{"type":"Buffer","data":[131,86,94,255,130,24,199,113,194,104,224,58,5,204,186,115,175,208,112,44]},"announce":[],"urlList":[]}}