{"title":"Who Really Killed Kennedy - Jerome Corsi.epub","uid":9851494,"size":2045701,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83992b7b10056ad45211988a9699c92a7d34a955&amp;dn=Who+Really+Killed+Kennedy+-+Jerome+Corsi.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1396154868,"description":"Almost nothing gives rise to more national intrigue than the murder of an American president. And on November 22, 2013, the nation will experience the 50th anniversary of one of the most traumatic events in modern American history, the assassination of President John F. Kennedy. From day one, the truth behind JFK's assassination has been mired in controversy and dispute. The Warren Commission, established just seven days after Kennedy's death, delved into the who, what, when, and where of the tragedy, and over the course of the following year compiled an 889-page report that arrived at the now widely contested conclusion: Lee Harvey Oswald was the sole assassin. In Who Really Killed Kennedy?, No. 1 New York Times bestselling author Jerome R. Corsi, Ph.D., provides readers with the ultimate JFK assassination theory book. One-by-one, each chapter will examine the strongest arguments regarding the killing of JFK, including theories surrounding the mob, the CIA, Cuban radicals, LBJ, right-wing extremists and more. By book's end, Who Really Killed Kennedy? will provide convincing analysis that existing evidence rules out the possibility that JFK was killed by a lone assassin. Fifty years after this epic American tragedy, there's still a gunman on the loose.","torrent":{"xt":"urn:btih:83992b7b10056ad45211988a9699c92a7d34a955","amp;dn":"Who+Really+Killed+Kennedy+-+Jerome+Corsi.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83992b7b10056ad45211988a9699c92a7d34a955","infoHashBuffer":{"type":"Buffer","data":[131,153,43,123,16,5,106,212,82,17,152,138,150,153,201,42,125,52,169,85]},"announce":[],"urlList":[]}}