{"title":"Guitar Masters 01 of 16 Robbie Basho","uid":8816240,"size":960568257,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:83afe736b2733217c24a97bc748145e521ee7a76&amp;dn=Guitar+Masters+01+of+16+Robbie+Basho&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"n0b0dyh0me","files":114,"time":1376591915,"description":"Guitar Masters 01 of 16 Robbie Basho\n\nStill today people ask me about the old guitar torrents that I shared years ago at my first times at the Bay.\nThey often tell me that is difficult to find them all, cause the TPB search engine sucks, cause their trackers are dead and they seem deserted.\nSo I've decided to reshare them all with a unifying pattern in the name of the torrent:\n\nGuitar Masters\n\nfollowed by a progressive number, so those who are interested can find them easily.\nThey deal primarily with fingerstyle, and the albums they contain are not generally easy to find... so dont expect overall 320 bitrates.\nThe founding criterion here is to find and remember them as a document of great music of the past.\n\nEnjoy :)\n\n\nTrackers:\n\n &lt;a href=&quot;\nhttp://www.h33t.com:3310/announce&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.h33t.com:3310/announce&lt;/a&gt;\n\nudp://tracker.openbittorrent.com:80/announce\n\nudp://tracker.istole.it:6969\n\nudp://tracker.publicbt.com:80/announce\n\n____________\n\n\n\nUnknown to most people, Robbie Basho has been one of the most innovative pioneers for the acoustic guitar\n\n    &lt;a href=&quot;\nhttp://www.bluemomentarts.de/bma/rbasho/en/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bluemomentarts.de/bma/rbasho/en/&lt;/a&gt;\n\n&quot;He had a big effect on me. He had an old 12-string guitar and used to wear cowboy outfits and carry around Japanese movie review books. He sang a lot more a traditional mode back then, and I always loved his voice -- it was really good, and spooky . I'd keep trying to talk to him, and one night at a place called the Unicorn I was following him and I said, &quot;Gee, I'm really kind of nervous, because I've been listening to you so much, I'm afraid I'm going to sound a lot like you.&quot; And he said &quot;Aw, that's all right, we all go through somebody sooner or later.&quot; (Leo Kottke)\n\n&quot;Robbie Basho was an angel. I don't believe he was terrestrial. I would watch him play and be transported in a way I've never been transported before. I'd see him have conversations with people who I did not see in the room. I truly believe that his reality was more accurate than mine. He was seeing a spirit that I was not. I think he may have died a virgin. Robbie didn't have a driver's license. He was not of this world and was not equipped to be part of this world. I'm not surprised he left this world early. It must have been very tiring for him to try to be in it, but his influence on me is so vast and seminal that I can't possibly overemphasize it. I think people should go back and listen to his music. There's some powerful, powerful stuff. Though his voice was odd, it was so powerful. I never really studied with Robbie. I wanted to but I was just too undisciplined to do it and at some point Robbie, exasperated, said to me &quot;Oh, so you need the short lesson.&quot; I said &quot;I guess so,&quot; and he said &quot;Don't be afraid to feel anything&quot; and &quot;Sing every melody out loud. If all you're doing is guitar riffs, there won't be enough there.&quot; Very often a guitarist thinks he's playing a melody when all he's doing is a chordal progression with a picking pattern. Unless you can sing the melody as an independent thing and have it work as a melody just note by note by note, you haven't really written a melody. It's one of the greatest exercises to engage in when writing. It was a tremendous tool that he gave me. He lived on a spiritual plane that was very real and he made beautiful, beautiful music that people would be well served to listen to today. \nDoing records with this man who I revered was a big deal for me.&quot; \n(William Ackerman)\n\nWhat follows is almost all his discography that I would like you know:\n\n\nrobbie basho - 1978 - visions of the country\nrobbie basho - bashovia\nrobbie basho - the falconers arm i\nrobbie basho - the falconers arm ii\nrobbie basho - the grail and the blue lotus\nrobbie basho - 1965 - the seal of the blue lotus\nrobbie basho - 1974 - zarthus\nrobbie basho - 1996 - guitar soli\nrobbie basho - 24-11-1980 - bonn, germany\nrobbie basho - art of the acoustic steel string guitar 6 &amp; 12\nrobbie basho - basho sings (1967)\nrobbie basho - rainbow thunder\nRobbie Basho - Song of the Stallion\n\n\n(browse all my torrents:\n         &lt;a href=&quot;\nhttp://thepiratebay.se/user/n0b0dyh0me/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/n0b0dyh0me/&lt;/a&gt; \n\n\nfor private posts:\n      &lt;a href=&quot;\nhttp://forum.suprbay.org/member.php?action=profile&amp;uid=113028&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://forum.suprbay.org/member.php?action=profile&amp;uid=113028&lt;/a&gt;\n\n)\t","torrent":{"xt":"urn:btih:83afe736b2733217c24a97bc748145e521ee7a76","amp;dn":"Guitar+Masters+01+of+16+Robbie+Basho","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83afe736b2733217c24a97bc748145e521ee7a76","infoHashBuffer":{"type":"Buffer","data":[131,175,231,54,178,115,50,23,194,74,151,188,116,129,69,229,33,238,122,118]},"announce":[],"urlList":[]}}