{"title":"Between the Sunset and the Sea - A View of 16 British Mountains","uid":14105761,"size":3806380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:83cc59bbb7b2e9552d6be0cbaf6cb291fb2b33c9&amp;dn=Between+the+Sunset+and+the+Sea+-+A+View+of+16+British+Mountains+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1459352425,"description":"Between the Sunset and the Sea - A View of 16 British Mountains (2015).epub Gooner\r\n\r\nHappy Torrent Day 30th March 2016!\r\n\r\nPublisher: William Collins (March 12, 2015)\r\nLanguage: English\r\nISBN-10: 0007545401\r\nISBN-13: 978-0007545407\r\n\r\n'I watched the mirror for a last view, for now, of the frozen mountains of Glen Coe. As the road bent and the outline of Buachaille Etive Mor slid into sight, I did what I always did, and always would. I felt for that flutter of awe and that indefinable, unmistakable quickening of the pulse.' In the late 18th century, mountains shifted from being universally reviled to becoming the most inspiring things on earth. Simply put, the monsters became muses - and an entire artistic movement was born. This movement became a love affair, the love affair became an obsession, and gradually but surely, obsession became lifestyle as mountains became stitched into the fabric of the British cultural tapestry. In his compelling new book, Simon Ingram explores how mountains became such a preoccupation for the modern western imagination, weaving his own adventures into a powerful narrative which provides a kind of experiential hit list for people who don't have the time nor the will to climb a thousand mountains. For some of these mountains, the most amazing thing about them might be the journey they've taken to get here. Others, the tales of science, endeavour and art that have played out on their slopes. The mythology they're drenched in. The history they've seen. The genius they've inspired. The danger that draws people to them. The life that clusters around them, human and otherwise. The extreme weather they conjure. The adventure they fuel. The way that some raise the hairs on the back of your neck, and trigger powerful, strange emotions. And moreover, what they're like to be amidst, under, on - just what that indefinable quality is that the British mountains wield which takes possession of you so powerfully, and never goes away. Ingram takes us high into the rafters of Britain's most forbidding, unflinching and unchanging wild places through all the seasons of the year - from the first blush of spring to the deepest, darkest bite of the mountain winter. From Beinn Dearg to Ben Nevis, he takes us on a journey spanning sixteen of Britain's most evocative mountainous landscapes, and what they mean to us today","torrent":{"xt":"urn:btih:83cc59bbb7b2e9552d6be0cbaf6cb291fb2b33c9","amp;dn":"Between+the+Sunset+and+the+Sea+-+A+View+of+16+British+Mountains+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83cc59bbb7b2e9552d6be0cbaf6cb291fb2b33c9","infoHashBuffer":{"type":"Buffer","data":[131,204,89,187,183,178,233,85,45,107,224,203,175,108,178,145,251,43,51,201]},"announce":[],"urlList":[]}}