{"title":"PureBasic V5.00 Please Seed!","uid":8048494,"size":251863988,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:83d9cd9ee95033268a6fb2772aa7f23d9f960140&amp;dn=PureBasic+V5.00+Please+Seed%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MarcosVS","files":-1,"time":1358803332,"description":"PureBasic is a native 32 bit and 64 bit programming language based on established BASIC rules. The key features of PureBasic are portability (Windows, Linux, MacOS X and AmigaOS are currently supported), the production of very fast and highly optimized executables and, of course, the very simple BASIC syntax. PureBasic has been created for the beginner and expert alike. We have put a lot of effort into its realization to produce a fast, reliable system friendly language.\n\nIn spite of its beginner-friendly syntax, the possibilities are endless with PureBasic's advanced features such as pointers, structures, procedures, dynamically linked lists and much more. Experienced coders will have no problem gaining access to any of the legal OS structures or API objects and PureBasic even allows inline ASM.\n\n\n\nThe main features of PureBasic\n\n   - Huge set of internal commands (1100+) to quickly and easily build any application or game\n   - All BASIC keywords are supported\n   - Very fast compiler which creates highly optimized executables\n   - No external DLLs, runtime interpreter or anything else required when creating executables\n   - Procedure support for structured programming with local and global variables\n   - Full unicode support\n   - Access to full OS API for advanced programmers\n   - Easy but very fast 2D game support through dedicated libraries (DirectX, SDL, ...)\n   - Easy and high quality 3D support based on OGRE\n   - Optimal use of the available hardware by using highly optimized (assembly) commands\n   - Source code is portable between AmigaOS, Windows, MacOS X and Linux\n   - Dedicated editor and development environment\n   - Powerful integrated debugger and profiler to easily trace and analyze code\n\nenjoy ...\n","torrent":{"xt":"urn:btih:83d9cd9ee95033268a6fb2772aa7f23d9f960140","amp;dn":"PureBasic+V5.00+Please+Seed%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83d9cd9ee95033268a6fb2772aa7f23d9f960140","infoHashBuffer":{"type":"Buffer","data":[131,217,205,158,233,80,51,38,138,111,178,119,42,167,242,61,159,150,1,64]},"announce":[],"urlList":[]}}