{"title":"Rafael Sabatini - Scaramouche","uid":9687135,"size":513963344,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8474d7276b1dbbb913b071c41ca12654beae33d8&amp;dn=Rafael+Sabatini+-+Scaramouche&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1393790598,"description":"\nScaramouche is not only Rafael Sabatini's crowning literary achievement, it is one of the most engaging, thought-provoking and exciting historical novels ever written.\nAndre-Louis Moreau, (or Scaramouche, as he later becomes known), is a fascinatingly complex protagonist. Courageous, intelligent, quick-witted and intensely moral, Moreau is a character whose personal quest for revenge against the villainous Marquis de La Tour d'Azyr is a masterfully-woven story of swashbuckling action, romance and social conflict during the turbulent years of the French Revolution.\nWell-born lawyer. Fugitive. Dramatic actor. Expert swordsman. Impassioned, mob-inciting orator. Revolutionary politician. Sabatini sets Moreau upon an intriguing path of fate, development and discovery, a fictionalized yet compelling account of a single man's ultimate test of human character as the world around him spirals into madness.\nSabatini has often been compared to Alexandre Dumas (author of the Three Musketeers, the Count of Monte Cristo) as a master of historical fiction. Though I believe Dumas to be the finest action-adventure writer of all time, and though some of Sabatini's other works (which I have not yet read) have been criticized as overly melodramatic, Sabatini has created in Scaramouche an historical action-adventure novel that transcends Dumas (and all modern action-adventure writers, for that matter) in that Moreau, his protagonist, is a thoroughly multi-dimensional character. Though Moreau is driven by his hatred and his quest for revenge, the spirit of his character is not defined by them, and the conflict of these passions with his ideals brings depth and substance to his exploits on the Theatre Feydau, the fencing halls of Paris, the floor of the National Assembly and his pursuit of the beautiful Aline de Kercadiou.\nDuels. Intrigue. Romance. More duels. Moral and political introspection. Its all here. Enjoy!\n","torrent":{"xt":"urn:btih:8474d7276b1dbbb913b071c41ca12654beae33d8","amp;dn":"Rafael+Sabatini+-+Scaramouche","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8474d7276b1dbbb913b071c41ca12654beae33d8","infoHashBuffer":{"type":"Buffer","data":[132,116,215,39,107,29,187,185,19,176,113,196,28,161,38,84,190,174,51,216]},"announce":[],"urlList":[]}}