{"title":"The Dilbert Principle A Cubicle's-Eye View of Bosses, Meetings,","uid":6381710,"size":16121216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:858acb4a64ae99a4336542f35f97b918956c55eb&amp;dn=The+Dilbert+Principle+A+Cubicle%5C%27s-Eye+View+of+Bosses%2C+Meetings%2C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lionzbay","files":1,"time":1305051735,"description":"Author(s):Scott Adams\nPublisher: Harper-Collins\nDate: 1996\nFormat: pdf\nLanguage: English\nISBN10: 0887307876\nPages:336\nOCR: Y\nISBN13: 9780887307874\n\nThe creator of Dilbert, the fastest-growing comic strip in the nation (syndicated in nearly 1000 newspapers), takes a look at corporate America in all its glorious lunacy. Lavishly illustrated with Dilbert  strips, these hilarious essays on incompetent bosses, management fads, bewildering technological changes and so much more, will make anyone who has ever worked in an office laugh out loud in recognition.\n\nThe Dilbert Principle: The most ineffective workers will be systematically moved to the place where they can do the least damage -- management.\n\nSince 1989, Scott Adams has been illustrating this principle each day, lampooning the corporate world through Dilbert, his enormously popular comic strip. In Dilbert, the potato-shaped, abuse-absorbing hero of the strip, Adams has given voice to the millions of Americans buffeted by the many adversities of the workplace.\n\nNow he takes the next step, attacking corporate culture head-on in this lighthearted series of essays. Packed with more than 100 hilarious cartoons, these 25 chapters explore the zeitgeist of ever-changing management trends, overbearing egos, management incompetence, bottomless bureaucracies, petrifying performance reviews, three-hour meetings, the confusion of the information superhighway and more. With sharp eyes, and an even sharper wit, Adams exposes -- and skewers -- the bizarre absurdities of everyday corporate life. Readers will be convinced that he must be spying on their bosses, The Dilbert Principle rings so true!","torrent":{"xt":"urn:btih:858acb4a64ae99a4336542f35f97b918956c55eb","amp;dn":"The+Dilbert+Principle+A+Cubicle%5C%27s-Eye+View+of+Bosses%2C+Meetings%2C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"858acb4a64ae99a4336542f35f97b918956c55eb","infoHashBuffer":{"type":"Buffer","data":[133,138,203,74,100,174,153,164,51,101,66,243,95,151,185,24,149,108,85,235]},"announce":[],"urlList":[]}}