{"title":"Adobe Dreamweaver CS5.5 Studio Techniques","uid":6547597,"size":8688004,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85a68e755a5a149d190fb9fb1a4bca476fe63a87&amp;dn=Adobe+Dreamweaver+CS5.5+Studio+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheBookie","files":-1,"time":1310934416,"description":"Adobe Dreamweaver CS5.5 Studio Techniques: Designing and Developing for Mobile with jQuery, HTML5, and CSS3\n\n\nIts widely predicted that mobile phones and tablets will overtake desktop PCs as the most common Web access devices within the next two or three years. Adobe is responding to this dramatic shift by focusing on new tools to develop websites for multiple platforms with HTML, CSS, and javascript in Dreamweaver CS5.5. In particular, Dreamweaver engineers have been working closely with the developers of jQuery, the de-facto standard javascript framework, to develop jQuery Mobile. This is a new javascript/CSS framework designed to create websites and applications that work consistently in all major mobile platforms, including iPhone, Android, BlackBerry, and Symbian (Nokia). This book explores in depth the integration of jQuery Mobile in Dreamweaver, together with other new features aimed at building websites that work across multiple devices.\nUsing a series of practical examples, the book will show how to optimize an existing website for display in desktops, tablets, and mobile phones, using CSS media queries. Readers will also learn how to create a dedicated mobile site using jQuery Mobile. Although Dreamweaver will generate much of the necessary code automatically, the book will explain the structure of jQuery Mobile websites and web applications, so that developers can go beyond the basics to add custom functionality and design features. The book will also utilize the core jQuery framework, demonstrating how the new jQuery code hinting in Dreamweaver CS5.5 speeds up the development process for experienced developers and acts as a learning aid for those new to jQuery. Readers will learn how to convert a jQuery Mobile web application into a native app (that can be loaded on an iPhone or Android device) using PhoneGap, another open source framework.\n\n","torrent":{"xt":"urn:btih:85a68e755a5a149d190fb9fb1a4bca476fe63a87","amp;dn":"Adobe+Dreamweaver+CS5.5+Studio+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85a68e755a5a149d190fb9fb1a4bca476fe63a87","infoHashBuffer":{"type":"Buffer","data":[133,166,142,117,90,90,20,157,25,15,185,251,26,75,202,71,111,230,58,135]},"announce":[],"urlList":[]}}