{"title":"Google SketchUp and SketchUp Pro 7 Bible","uid":4818816,"size":51961801,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85af49f38faed5634b09d9649c82341c08a0dee9&amp;dn=Google+SketchUp+and+SketchUp+Pro+7+Bible&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1238660049,"description":"Google SketchUp &amp; SketchUp Pro Bible will target design professionals who are increasingly turning to SketchUp and SketchUp Pro to easily create professional quality designs and design presentations. This book will cover creating 2D and 3D designs, exporting models to Google Earth, and using LayOut to create professional quality design presentations. Offering everything that a professional or hobbyist needs to know, Google SketchUp and SketchUp Pro Bible will include tips and tricks to make using this software easy and efficient.\n\n\nWhy scribble on a notepad when, with a few computer strokes, you can create 3D drawings in SketchUp and capture your best ideas in software? With the step-by-step instruction in this in-depth guide, you'll soon be modeling your ideas like a pro, from designing buildings to drawing room layouts or planning landscaping. Whether you're brainstorming ideas, preparing a formal presentation, or finalizing a project to upload to Google Earth, this is the SketchUp book you need to succeed.\n\n*Jump into SketchUp by designing a windmill right off the bat\n*Explore the user interface and learn SketchUp tools and shortcuts\n*Master objects, drawing, modeling, effects, and the art of modification\n*Combine 3D models with 2D images using the LayOut tool\n*Browse 3D Warehouse for components and models\n*Export your SketchUp projects to Google Earth\n*Extend functionality with Ruby scripting and plug-ins \n","torrent":{"xt":"urn:btih:85af49f38faed5634b09d9649c82341c08a0dee9","amp;dn":"Google+SketchUp+and+SketchUp+Pro+7+Bible","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85af49f38faed5634b09d9649c82341c08a0dee9","infoHashBuffer":{"type":"Buffer","data":[133,175,73,243,143,174,213,99,75,9,217,100,156,130,52,28,8,160,222,233]},"announce":[],"urlList":[]}}