{"title":"Inside Organized Racism: Women in the Hate Movement [blackatk]","uid":8788383,"size":3394560,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:85b703c989752ad24c64dd66cb3d509c639d0be0&amp;dn=Inside+Organized+Racism%3A+Women+in+the+Hate+Movement+%5Bblackatk%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blackatk","files":-1,"time":1375881116,"description":"Publication Date: July 9, 2003 | ISBN-10: 0520240553 | ISBN-13: 978-0520240551 | With A special thanks to &quot;wetworx12&quot; - The bitter, race-baiting troll who inspired this upload | filetype: pdf |\n\n\n\nFollowing up her highly praised study of the women in the 1920s Ku Klux Klan, Blee discovers that many of today's racist women combine dangerous racist and anti-Semitic agendas with otherwise mainstream lives. The only national sample of a broad spectrum of racist activists and the only major work on women racists, this important book also sheds light on how gender relationships shape participation in the movement as a whole.\n\n\n\nFrom Publishers Weekly\nIn this timely account, based on in-depth interviews with 34 women in organized racist and anti-Semitic groups (Christian Identity, neo-Nazi, white power skinheads, Ku Klux Klan) and a study of their publications between 1993 and 1994, Blee, a sociology professor and author of Women of the Klan, takes a penetrating look at how &quot;ordinary women... become wedded to dangerous and bizarre racist agendas.&quot; Blee reveals these woman as monstrous, but not monsters distinguished from mainstream society by their virulent racism and anti-Semitism and their general hostility toward the most benign feminism. They come from every region, and are often educated and middle-class, working in professions like education, nursing and engineering. For women, Blee explains, intense racism is often the result of their participation in racist groups, rather than a passion for the cause; they learn within the groups, which they more often stumble into for social reasons than seek out. Blee's disquieting account of how &quot;everyday racism&quot; morphs into &quot;extraordinary racism&quot; is full of surprises among them how different the path is for women than for men: whereas &quot;male racial activists talk about their empowerment by racial knowledge and racial activism... for these women, racism is a politics of despair.&quot; Blee, who does not share the views of her subjects, writes of their lives and concerns with uncommon empathy, in spite of some harrowing personal experiences. Most readers will share her subjects' concerns with home and family and with establishing a personal and group identity. It is chilling, though, to read of the advertisements for Aryan cookbooks that appear in white power newsletters. Blee's work is a must-read for its fresh, pertinent scholarship and its riveting prose. Photos not seen by PW. (Jan. 7)Forecast: This scholarly book merits a readership beyond academia and is fully accessible to general readers.\n\nCopyright 2002 Cahners Business Information, Inc.\n--This text refers to an out of print or unavailable edition of this title.\nFrom Library Journal\n\nSociologist Blee (Univ. of Pittsburgh; The Road to Poverty: The Making of Wealth and Hardship in Appalachia) interviewed 34 women members of neo-Nazi groups, the KKK, Christian Identity groups, or white-power skinhead groups for this study of women in hate movements. Based on these interviews and on secondary sources, her book contends that women account for about half of new recruits to these groups, although total membership is very difficult to estimate. Blee explores how women come to adopt racist attitudes, how they learn about whiteness and hatred of nonwhites, their varied experiences within racist groups, racist group practices that foster group loyalty, and, finally, ways to combat organized racism. Some of her observations challenge stereotypes. For instance, most of these women are not poor, uneducated, raised in abusive families, or drawn into racism through a male partner. Racist groups also use mainstream values like love of family and group fellowship to recruit new members. Three appendixes describe individual racist groups, the author's methodology, and antiracist organizations. This scholarly study is most appropriate for academic collections. (Photos and index not seen.) Patricia A. Beaber, Coll. of New Jersey Lib., Ewing\n\n\n\nPaperback: 272 pages\nPublisher: University of California Press (July 9, 2003)\nLanguage: English\nISBN-10: 0520240553\nISBN-13: 978-0520240551\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Inside-Organized-Racism-Women-Movement/dp/0520240553/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Inside-Organized-Racism-Women-Movement/dp/0520240553/&lt;/a&gt;\n\n\n\n\n\nTags: women, kkk, aryan, nation, posse, commitatus, white, brother, hood, white, power, skin, head, skinhead, knight, knights, grand, wizard, blacks, african, african american, africans, negro, negrophobia, black brute, stereotype, police, brutality, lynching, kkk, white, race, racism, oppression, extrajudicial, crazed, prison, police, ghettoization, fear, guilt, white guilt, racism, discrimination, oppression, bias, psychology, sociology, bad faith, race, black, african, american, african american, AA, african american studies, society, institutional racism, white guilt, white privilige, denial, double standard, profiling, fear, responsibility, cognitive dissonance, freedom, white anxiety, abuse, disparity, disparities, slavery, unconscious, subconscious,\n","torrent":{"xt":"urn:btih:85b703c989752ad24c64dd66cb3d509c639d0be0","amp;dn":"Inside+Organized+Racism%3A+Women+in+the+Hate+Movement+%5Bblackatk%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"85b703c989752ad24c64dd66cb3d509c639d0be0","infoHashBuffer":{"type":"Buffer","data":[133,183,3,201,137,117,42,210,76,100,221,102,203,61,80,156,99,157,11,224]},"announce":[],"urlList":[]}}