{"title":"Knitting New Scarves: 27 Distinctly Modern Designs","uid":9155709,"size":33793388,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:863ce702a61ed3dddefec6327c8400103ac92a97&amp;dn=Knitting+New+Scarves%3A+27+Distinctly+Modern+Designs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1383774038,"description":"Scarves are often the first garments beginning knitters try. Then, when they feel ready for a greater creative thrill, they move on to other types of garments. In Knitting New Scarves, Lynne Barr beckons all levels of knitters back to their humble beginnings and then wows them with 27 spectacularly modern designs, each created using an innovative new technique or a unique take on a traditional one. \n\nThis novel approach, which dares knitters to rethink what is possible by simply manipulating knits and purls, leads to a collection of flattering, functional, and fun-to-make accessories. Imagine a scarf that looks like a strand of black pearls or unfolds like an accordion, one that playfully draws inspiration from the famed Chanel jacket or a twisting futuristic high-rise. \n\nEvery scarf is shown in its finished form in beautiful still-lifes by photographer Tyllie Barbosa, and, when unusual techniques are called for, up-close step-by-step photos are provided as well. This means every scarf in this masterful collection is both captivating and accessible for all levels of knitters.","torrent":{"xt":"urn:btih:863ce702a61ed3dddefec6327c8400103ac92a97","amp;dn":"Knitting+New+Scarves%3A+27+Distinctly+Modern+Designs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"863ce702a61ed3dddefec6327c8400103ac92a97","infoHashBuffer":{"type":"Buffer","data":[134,60,231,2,166,30,211,221,222,254,198,50,124,132,0,16,58,201,42,151]},"announce":[],"urlList":[]}}