{"title":"Venture Deals: Be Smarter Than Your Lawyer and Venture Capitalis","uid":9135456,"size":347144395,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8658dff57699f04644286d1c588c5836cdd1bd84&amp;dn=Venture+Deals%3A+Be+Smarter+Than+Your+Lawyer+and+Venture+Capitalis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sgv1980","files":-1,"time":1383405465,"description":"Venture Deals: Be Smarter Than Your Lawyer and Venture Capitalist\nBy Jason Mendelson &amp; Brad Feld.\nAs each new generation of entrepreneurs emerges, there is a renewed interest in how venture capital deals come together. Yet there is little reliable information focused on venture capital deals. Nobody understands this better than authors Brad Feld and Jason Mendelson. For more than twenty years, they've been involved in hundreds of venture capital financings, and now, with the Second Edition of Venture Deals, they continue to share their experiences in this field with you.\n\nEngaging and informative, this reliable resource skillfully outlines the essential elements of the venture capital term sheet--from terms related to economics to terms related to control. It strives to give a balanced view of the particular terms along with the strategies to getting to a fair deal. In addition to examining the nuts and bolts of the term sheet, Venture Deals, Second Edition also introduces you to the various participants in the process and discusses how fundraising works.\nFully updated to reflect the intricacies of startups and entrepreneurship in today's dynamic economic environment\nOffers valuable insights into venture capital deal structure and strategies\nBrings a level of transparency to a process that is rarely well understood\nWhether you're an experienced or aspiring entrepreneur, venture capitalist, or lawyer who partakes in these particular types of deals, you will benefit from the insights found throughout this new book.","torrent":{"xt":"urn:btih:8658dff57699f04644286d1c588c5836cdd1bd84","amp;dn":"Venture+Deals%3A+Be+Smarter+Than+Your+Lawyer+and+Venture+Capitalis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8658dff57699f04644286d1c588c5836cdd1bd84","infoHashBuffer":{"type":"Buffer","data":[134,88,223,245,118,153,240,70,68,40,109,28,88,140,88,54,205,209,189,132]},"announce":[],"urlList":[]}}