{"title":"Communications, Radar &amp; Electronic Warfare (2011)","uid":6540957,"size":18297475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:866439f642caf4f616224f033908f968a88cdf4a&amp;dn=Communications%2C+Radar+%26+Electronic+Warfare+%282011%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"theLEAK","files":-1,"time":1310685966,"description":"A practical guide to the principles of radio communications for both civilian and military applicationsIn this book, the author covers both the civilian and military uses of technology, focusing particularly on the applications of radio propagation and prediction. Divided into two parts, the author introduces the basic theory of radio prediction before providing a step-by-step explanation of how this theory can be translated into real-life applications.\n\nIn addition, the book presents up-to-date systems and methods to illustrate how these applications work in practice. This includes systems working in the HF bands and SHF. Furthermore, the author examines the performance of these systems, and also the effects of noise, interference and deliberate jamming, as well as the performance of jamming, detection and intercept systems.\n\nParticular attention is paid to the problems caused by Radio Controlled Improvised Explosive Devices (RCIEDs).Key Features:A practical handbook on the topic of radio communications and propagationWritten by an expert in both the civilian and military applications of the technologyFocuses on methods such as radio and radar jamming, and radio-controlled improvised explosive devices (IEDs)Contains problems and solutions to clarify key topics","torrent":{"xt":"urn:btih:866439f642caf4f616224f033908f968a88cdf4a","amp;dn":"Communications%2C+Radar+%26+Electronic+Warfare+%282011%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"866439f642caf4f616224f033908f968a88cdf4a","infoHashBuffer":{"type":"Buffer","data":[134,100,57,246,66,202,244,246,22,34,79,3,57,8,249,104,168,140,223,74]},"announce":[],"urlList":[]}}