{"title":"Practical Computing on the Cell Broadband Engine - (Malestrom)","uid":6346369,"size":3874643,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:86be0e758588150d9234197174ddaa6866244456&amp;dn=Practical+Computing+on+the+Cell+Broadband+Engine+-+%28Malestrom%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":-1,"time":1303847153,"description":"\n\n\n\nSandeep Koranne, &quot;Practical Computing on the Cell Broadband Engine&quot;\nSpringer | 2009 | ISBN: 1441903070 | 485 pages | PDF | 3,2 MB\n\nPractical Programming in the Cell Broadband Engine offers a unique programming guide for the Cell Broadband Engine, demonstrating a large number of real-life programs to identify and solve problems in engineering, logic design, VLSI CAD, number-theory, graph-theory, computational geometry, image processing, and other subjects. This book:\n\nExplores a wide variety of problems presenting the Cell Broadband Engine in a new, distinctive way.\n\nPresents a number of software programming projects which can be used by faculty for engaging students into the area of actual code development for practical high-performance computing.\n\nProvides professionals with the tools needed to analyze the capabilities of the Cell Broadband Engine in their application domain.\n\nKey features include numerous diagrams, mnemonics, tables, charts, code samples for making program development on the CBE as accessible as possible, a comprehensive reading list for introductory material to the subject matter, and a website providing all source codes and sample-data for examples presented in this text.","torrent":{"xt":"urn:btih:86be0e758588150d9234197174ddaa6866244456","amp;dn":"Practical+Computing+on+the+Cell+Broadband+Engine+-+%28Malestrom%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86be0e758588150d9234197174ddaa6866244456","infoHashBuffer":{"type":"Buffer","data":[134,190,14,117,133,136,21,13,146,52,25,113,116,221,170,104,102,36,68,86]},"announce":[],"urlList":[]}}