{"title":"Juan Gabriel - La Historia del Divo !","uid":4341118,"size":77721187,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86de9ace82935ba5b528df6e3f3d5bcea0ef1bd2&amp;dn=Juan+Gabriel+-+La+Historia+del+Divo+%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"TheLabMan","files":18,"time":1218600894,"description":"UPC:  \t0082876810792\n\n \n                           About the Album\n\nEverybody who has ever heard Latin music has heard a Juan Gabriel song. You may not know it, but I assure you, you have. A superstar in his own right, Juan Gabriel&amp;#039;s songs have also been covered in more genres and by more artists -- including Marc Anthony, RocÃƒÂ­o Durcal, Marco Antonio SolÃƒÂ­s, Christian Castro and Vicente FernÃƒÂ¡ndez -- than any other Latin singer/songwriter,\n\nLa Historia del Divo is a collection of some of Juan Gabriel&amp;#039;s best-known tracks -- 16 in all -- spanning more than 30 years. &quot;Some&quot; is the operative word here, because notwithstanding the length of this compilation, it doesn&amp;#039;t come close to covering the wealth of music this man has produced. Still, here you will find the original renditions of great romantic hits like &quot;Hasta Que Te ConocÃƒÂ­,&quot; &quot;No Vale La Pena,&quot; &quot;No Me Vuelvo A Enamorar&quot; and &quot;Siempre En Mi Mente,&quot; all radio favorites not only in the United States but throughout Latin America.\n\nAs hit-filled as Juan Gabriel&amp;#039;s catalog is, it isn&amp;#039;t predictable in a radio-friendly way. The songs are surprising, both clever and colloquial, often long. Such is the case with the opening &quot;Querida,&quot; a five-minute plus track that goes on for well over two minutes before culminating in the drama-filled, high-pitched, high intensity chorus. Talk about dramatic tension; this song should be a textbook. In a similar vein is &quot;Siempre En Mi Mente,&quot; a pan regional hit where the verse and chorus are variations on each other, the repetitive, steady beat matching the repeating words.\n\nAside from his timeless pop songs, Juan Gabriel is, of course, also known for his ranchera fare, which has been sung in pop versions, but appears here in the original renditions. Standouts include the cutting rancheras like &quot;Te Voy a Olvidar&quot; a castigating song aimed at a cheating girlfriend, and the more delicate &quot;No Vale La Pena,&quot; with beautiful harmonies sung to strumming guitars and trumpets.\n\nNo Juan Gabriel compilation would be complete without his first hit, the almost innocent &quot;No Tengo Dinero,&quot; which dates back to 1971. It&amp;#039;s peppy, feel-good 1970s bubblegum pop, whose lasting popularity has as much to do with its catchy melody as with its universal story (the guy is broke, but can offer his love). The second Juan Gabriel must-have (if we need to choose), would be &quot;Hasta Que Te ConocÃƒÂ­.&quot; All of seven minutes long, many listeners not familiar with this original version and may remember it as the song that broke Marc Anthony in the salsa world. This, more than any other of his compositions, embodies all that is Juan Gabriel; from the slow, ruminating beginning, almost a soliloquy, to the unforgettable chorus, to a broad, grandiose instrumental coda over which he improvises.\n\nSuch artistic license has no other parallel in Latin pop. Which is why Juan Gabriel is the original &quot;divo&quot; of Latin music.\n\nBy Leila Cobo\n\n\n                           Track Listings\n\n\n1. Querida\n2. No Tengo Dinero\n3. Con Tu Amor\n4. Siempre En Mi Mente\n5. No Me Vuelvo A Enamorar\n6. Tu Sigues Siendo El Mismo\n7. No Vale La Pena\n8. Te Voy A Olvidar\n9. Se Mi Olvido Otra Vez\n10. La Diferencia\n11. Ya Lo Se Que Tu Te Vas\n12. Inocente Pobre Amigo\n13. Pero Que Necesidad\n14. Abrazame Muy Fuerte\n15. Hasta Que Te Conoci\n16. Amor Eterno (En Vivo) ","torrent":{"xt":"urn:btih:86de9ace82935ba5b528df6e3f3d5bcea0ef1bd2","amp;dn":"Juan+Gabriel+-+La+Historia+del+Divo+%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86de9ace82935ba5b528df6e3f3d5bcea0ef1bd2","infoHashBuffer":{"type":"Buffer","data":[134,222,154,206,130,147,91,165,181,40,223,110,63,61,91,206,160,239,27,210]},"announce":[],"urlList":[]}}