{"title":"Il Barbiere di Siviglia - 1988 Colonia, [XviD - Ita Mp3] Cecilia","uid":5324168,"size":1609870328,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:871347fa17d797895ff75332d498f84b22cba8f4&amp;dn=Il+Barbiere+di+Siviglia+-+1988+Colonia%2C+%5BXviD+-+Ita+Mp3%5D+Cecilia&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Duracell72","files":1,"time":1264962167,"description":"D A T I\n\nLingua originale: Italiano\nGenere: Opera buffa\nMusica: Gioachino Rossini\nLibretto: Cesare Sterbini\nFonti letterarie: Le Barbier de SÃƒÂ©ville ou la PrÃƒÂ©caution inutile di Pierre-Augustin Caron de Beaumarchais\nAtti:due\nPrima rappresentazione: 20 febbraio 1816\nTeatro: Teatro Argentina, Roma\n\nPersonaggi ed Interpreti\n\nIl Conte d'Almaviva (tenore): David Kuebler\nDon Bartolo,in medicina, tutore di Rosina (basso): Carlos Feller\nRosina (contralto): Cecilia Bartoli\nFigaro, barbiere (baritono): Gino Quilico\nDon Basilio, maestro di musica di Rosina (basso): Robert LLoyd \nBerta vecchia governante in casa di Bartolo (soprano): Edith KertÃƒÂ©z-Gabry\nFiorello, servitore di Almaviva (baritono): Klaus Bruch\nAmbrogio, servitore di Bartolo (mimo): Paul Kappler\n\nAnno: 1988\nNazione: Germania\nTeatro: Choir of Cologne City Opera\nOrchestra: Radio Sinphony Orchestra Stuttgart\nDirettore d'orchestra: Gabriele Ferro\nStage director: Michael Hampe\nStege desiner: Ezio Frigerio\nCostume desiner: Mauro Pagano\nRegia televisiva: Claus Viller\n\nTrama\n\nIl barbiere di Siviglia ÃƒÂ¨ un'opera di Gioachino Rossini su libretto di Cesare Sterbini tratto dalla commedia omonima di Beaumarchais.\nIl titolo originale ÃƒÂ¨ Almaviva, o sia l'inutile precauzione. Il libretto era stato giÃƒÂ  musicato l'anno prima da Francesco Morlacchi. Prima di lui, Giovanni Paisiello aveva messo in scena il suo Barbiere di Siviglia nel 1782.\nLa prima rappresentazione ebbe luogo il 20 febbraio 1816 al Teatro Argentina, a Roma, e terminÃƒÂ² fra i fischi. A provocarli, secondo i pettegolezzi dell'epoca, sarebbero stati gli impresari di un teatro concorrente, il Teatro Valle; secondo altri, la colpa fu di alcuni seguaci di Paisiello e della sua versione dell'opera. Il solo annuncio che Rossini stava preparando una nuova versione del Barbiere di Siviglia aveva suscitato non poche polemiche, anche in considerazione del fatto che all'epoca Paisiello era ancora vivo.\nIl fiasco della prima fu perÃƒÂ² riscattato immediatamente dal successo delle repliche, e l'opera di Rossini finÃƒÂ¬ presto per oscurare la precedente versione di Paisiello.\nIl contralto Geltrude Righetti Giorgi fu la prima Rosina della storia mentre il ruolo di Almaviva fu affidato al grande tenore spagnolo Manuel GarcÃƒÂ­a\n\nAtto I\n\nIl conte di Almaviva ÃƒÂ¨ innamorato della bella Rosina, che abita nella casa del suo anziano tutore, don Bartolo, a sua volta segretamente intenzionato a sposarla. Il conte chiede a Figaro, barbiere nonchÃƒÂ© &quot;factotum della cittÃƒÂ &quot;, di aiutarlo a conquistare il cuore della ragazza, alla quale si ÃƒÂ¨ presentato sotto il falso nome di Lindoro.\nFigaro consiglia al conte di cambiare personalitÃƒÂ  e fingersi un giovane soldato, cui Rosina si dimostra presto interessata grazie anche ad una bella serenata cantata sotto le finestre della casa delil barbiere procura inoltre a Lindoro un foglio che ne attesta la temporanea residenza in casa di don Bartolo e tenta di allacciare i rapporti con Rosina.\nDon Basilio, il maestro di musica della ragazza, sa della presenza del conte di Almaviva in Siviglia e suggerisce a don Bartolo di calunniarlo per sminuirne la figura, giunge in casa sorprendendo Figaro e Rosina. La ragazza aveva giÃƒÂ  scritto un biglietto per Lindoro, ma Don Bartolo si accorge che manca un foglio dal taccuino e striglia Rosina.\nSecondo i piani, il conte di Almaviva irrompe nella casa di don Bartolo fingendosi un soldato ubriaco, ma crea una tale confusione che arrivano i gendarmi. Quando perÃƒÂ² il conte si fa riconoscere di nascosto dall'ufficiale, i soldati si ritirano in buon ordine, lasciando don Bartolo esterrefatto.\n\nAtto II\n\nDon Bartolo comincia a sospettare riguardo alla vera identitÃƒÂ  del giovane soldato. Giunge il sedicente maestro di musica don Alonso (in realtÃƒÂ  sempre il conte, celato in un nuovo travestimento), che afferma di essere stato inviato da don Basilio, rimasto a casa febbricitante, a sostituirlo nella lezione di canto per Rosina.\nPer guadagnare la fiducia del tutore, il finto don Alonso gli mostra il biglietto che Rosina gli aveva mandato. Nel frattempo giunge Figaro con il compito di radere la barba al padrone di casa. Nonostante Figaro faccia il possibile per coprire la conversazione dei due giovani, don Bartolo capta le loro parole e caccia tutti. Con lui resta solo Berta, la serva, a commiserare il vecchio padrone.\nDon Bartolo fa credere a Rosina, mostrandole il biglietto consegnatogli da don Alonso, che Lindoro e Figaro si vogliano prendere gioco di lei, e quest'ultima amareggiata acconsente alle nozze con il suo tutore, che prontamente fa chiamare il notaio. In quel momento arriva anche don Basilio, mentre con una scala Figaro e il Conte entrano in casa dalla finestra e raggiungono Rosina. Finalmente il conte rivela la propria identitÃƒÂ , per chiarire la situazione e convincere la fanciulla della sinceritÃƒÂ  del suo amore.\nDon Bartolo ha perÃƒÂ² fatto togliere la scala e i tre complici si trovano senza via di fuga. In quel momento sopraggiunge il notaio chiamato a stendere il contratto delle nozze tra don Bartolo e Rosina. Approfittando dell'assenza temporanea del tutore, il conte convince lui e don Basilio (dietro congrua ricompensa) a inserire nel contratto il nome suo in luogo di quello di don Bartolo. Giunto troppo tardi, a quest'ultimo resta la magra consolazione di aver risparmiato laper Rosina, che il conte di Almaviva rifiuta. Gli amanti coronano dunque il loro sogno.\n\nDati Tecnici DVX\n\nInformazioni sul File\n\nTitolo: Il Barbiere di Siviglia.avi \nDimensione File [in bytes]: 1,609,870,328\nDurata [hh:mm:ss]: 2:37:57\nNumero di tracce Audio: 1\n\nInformazioni Video\n\nNome Codec Video: XviD 1.1.2 Final\nNumero Frame: 284312\nLarghezza Frame [pixels]: 720\nAltezza frame [pixels]: 576 \nDisplay Aspect Ratio [DAR]: 1.250\nFPS: 30.000 \nVideo Bitrate [kbps]: 1034\nQF: 0.083\n\nInformazioni Audio\n\nCodec audio: 0x0055 MPEG-1 Layer 3\nFrequenza audio [Hz]: 48000\nBitrate [kbps]: 320\nTipo: VBR\nCanali: 2\n\n\n\n","torrent":{"xt":"urn:btih:871347fa17d797895ff75332d498f84b22cba8f4","amp;dn":"Il+Barbiere+di+Siviglia+-+1988+Colonia%2C+%5BXviD+-+Ita+Mp3%5D+Cecilia","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"871347fa17d797895ff75332d498f84b22cba8f4","infoHashBuffer":{"type":"Buffer","data":[135,19,71,250,23,215,151,137,95,247,83,50,212,152,248,75,34,203,168,244]},"announce":[],"urlList":[]}}