{"title":"EXPLOITED COLLEGE GIRLS - Kim - Big Tits Redhead 720p","uid":11713181,"size":2054003884,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:8945fb59ec9d4b079f814733d2cfde556d683f5b&amp;dn=EXPLOITED+COLLEGE+GIRLS+-+Kim+-+Big+Tits+Redhead+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"beta2008x","files":1,"time":1424415969,"description":" &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=usybm_bba1fd3b9ee9d61e75ec.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=usybm_bba1fd3b9ee9d61e75ec.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.dumppix.com/viewer.php?file=ltcfo_ecg_kim_720p_s.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.dumppix.com/viewer.php?file=ltcfo_ecg_kim_720p_s.jpg&lt;/a&gt;\n\nMeet Kim, a skinny country girl from the rural south. She's got both exotic Filipina looks and a refreshingly quirky amateur attitude. As the scene opens, Jay gets a little behind the scenes footage as he is explaining how indoor showers work (Kim's very impressed!) And as she strips we get our first look at her prominently enhanced rack and tight Filipina body while she tells Jay about her relatively tame sex life. The interview moves to the bed and Kim explains, without a trace of irony as she cups her grapefruit sized artificial titties, that she doesn't wear make up or use sex toys because she doesn't like &quot;fake things.&quot; Fortunately, this isn't an issue. Here at Ex Co Gi we've never used IQ tests to recruit our lovely models. One thing we do look for, however, is sex drive and Kim has that in spades. Jay has her lay back and spread her legs for a quick finger bang and in no time at all she's showing what could possibly the greatest O face in the ten year history of the site. Kim drops to the floor and does her best to get Jay ready for action with a fantastic blowjob. It works and he has her climb on top for some cowgirl. Things start off slowly and as Kim gets closer to cumming Jay steps things up with some jackhammer like pounding that gets her off a second time. Repeating the process from behind she cums a third and a fourth time before it's time for the big facial finish. Jay unleashes a torrent of jizz on Kim's unsuspecting face, neck and chest which she is not at all pleased about. So, yes, Kim's tits are the very definition of the term &quot;bolt ons&quot; but she has the dubious honor of inventing a new finish to future Ex Co Gi's updates: the sad facial! Thanks Kim! Y'all come back now, ya hear?","torrent":{"xt":"urn:btih:8945fb59ec9d4b079f814733d2cfde556d683f5b","amp;dn":"EXPLOITED+COLLEGE+GIRLS+-+Kim+-+Big+Tits+Redhead+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8945fb59ec9d4b079f814733d2cfde556d683f5b","infoHashBuffer":{"type":"Buffer","data":[137,69,251,89,236,157,75,7,159,129,71,51,210,207,222,85,109,104,63,91]},"announce":[],"urlList":[]}}