{"title":"Why are you Not Reading -  Copra? (2013|Darkness-Empire)","uid":9653340,"size":796477876,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:89498bb1ec8afc25a986376b0e928955d0586103&amp;dn=Why+are+you+Not+Reading+-++Copra%3F+%282013%7CDarkness-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1393131211,"description":"This project was started by gesserit and STFMaryville, and so I have decided to join them and form an unholy trinity of recommendations that will gobble your rfree time, consume your soul, eat your children and possibly make love to your wife or husband. Last part untested (as yet).\n\nAnywho, yes I've ranted and raved like a madman about teh awesome that is COPRA before but since I am reposting/adding my stuff to KAT and I have an excuse to compile the series into one torrent, I decided to kill two birds with one stone and cross post it here under this banner. Fuck those birds, all they did was shit and chirp anyway. \n\nFrom the weird and wonderful mind of Michel Fiffe comes Copra, a brilliant and highly praised series about a group of misfits and killers whose latest mission goes horribly wrong - and it is up to them to pick up the pieces. An avowed and obsessed fan of John Ostrander's Suicide Squad, the influence is clearly on the page - but Fiffe creates his own unique take on the tropes of that series and makes all his characters their own entities. There are weird powers, dimension hoppers, magic, and lots of lots of combat. Fiffe writes, pencils, inks, colors, and letters this series entirely on his own - initially it started out as a one-year (12-issue) project but now due to the popularity of the work he has plans to continue it. I for one cannot wait to see where all these dudes and dudettes go next. If you like comics of ANY kind, you are sure to find something to enjoy about Copra. Don't miss it!\n\nSERIOUSLY, I CANNOT RECOMMEND THIS ENOUGH. Please give it a shot and make sure to visit the artist's website for all sorts of cool info, interviews and art - Michel Fiffe.com\n\nThis torrent has the entire first run of 12 issues in various forms. Copra Compendium 01 covers issues #1-3, and CC 02 covers issues #4-6. The remaining six issues #7-12 are all individual, with the titles included. Everything here is a HQ scan by Darkness-Empire, and though the series is not available digitally it might as well be because these copies are pristine and crystal clear. Thanks so much to D-E for their incredible work, and I hope I have sold you on this series from the art and description - please seed and enjoy! :-)\n\nAlso, there is the off chance that if you don't drop everything and download this immediately, I will be forced to execute everyone you have truly known and loved. Why take that risk, I ask you?","torrent":{"xt":"urn:btih:89498bb1ec8afc25a986376b0e928955d0586103","amp;dn":"Why+are+you+Not+Reading+-++Copra%3F+%282013%7CDarkness-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89498bb1ec8afc25a986376b0e928955d0586103","infoHashBuffer":{"type":"Buffer","data":[137,73,139,177,236,138,252,37,169,134,55,107,14,146,137,85,208,88,97,3]},"announce":[],"urlList":[]}}