{"title":"The History of Apple Pie - Feel Something (2014) [FLAC]","uid":11141539,"size":296931755,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:89d97eb73efc815ca2f26b6f59d688fe05ae9a33&amp;dn=The+History+of+Apple+Pie+-+Feel+Something+%282014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1412175142,"description":"\n  The History of Apple Pie - Feel Something (2014) [FLAC]\n\n  Genre: Rock\n  Styles: Indie, Shoegaze\n  Source: WEB\n  Codec: FLAC\n  Bit rate: ~ 1,000 kpbs\n  Bit depth: 16\n  Sample rate: 44.1 kHz\n\n  01 Come Undone\n  02 Tame \n  03 Keep Wondering \n  04 Special Girl \n  05 Jamais Vu \n  06 Puzzles \n  07 Don't You Wanna Be Mine \n  08 Ordinary Boy \n  09 Snowball \n  10 Just Like This \n\n  The History of Apple Pie's debut album, Out of View, was an impressive bolt of shoegaze energy, memorable songcraft, and production savvy that staked a claim for the band in the rush and tumble of groups revisiting that very specific style. Following up impressive first albums is always a tricky proposition, one that not a few of the original shoegazers found hard to manage. On their 2014 record, Feel Something, the History of Apple Pie do a fine job of delivering a second album that has much of the same sterling properties as their debut, while giving their guitar noise with sugar-sweet melodies some tweaks here and there, just enough to serve as a progression instead of an unwanted stylistic leap into mediocrity. Bandmember Jerome Watson is once again in the producer's chair, and he does a nice job of scaling back on the group's previously established avalanche of sound in favor of a more precise and subtle approach that pays off with a wider variety of feelings and atmospheres. Songs like &quot;Puzzles&quot; and the super-poppy &quot;Tame&quot; are well served by less cacophony-filled arrangements, and the songs that are supposed to be loud and ragged sound even more so when balanced against the album's calmer moments. Like on the debut, the range of guitar tones and effects the band uses is varied and perfectly chosen to suit the song, and Stephanie Min's vocals are even stronger this time. She carries songs like the lilting &quot;Snowball&quot; with her airy tones, but can also give some real meaning to the slower, deeper songs like &quot;Just Like This,&quot; which ends the record in a drifting cloud of melancholy and Hammond organs. The guys in Ride would have been proud to call that song theirs; the rest of the original shoegazers would no doubt feel the same about other songs on the album. Like their debut, Feel Something is a throwback to a brief shining moment when noise and melody met in a quick burning blaze of inspiration, but more than that, it's a continuation of that era done with skill and energy equal to -- if not greater than -- those who were there first.","torrent":{"xt":"urn:btih:89d97eb73efc815ca2f26b6f59d688fe05ae9a33","amp;dn":"The+History+of+Apple+Pie+-+Feel+Something+%282014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89d97eb73efc815ca2f26b6f59d688fe05ae9a33","infoHashBuffer":{"type":"Buffer","data":[137,217,126,183,62,252,129,92,162,242,107,111,89,214,136,254,5,174,154,51]},"announce":[],"urlList":[]}}