{"title":"Lies &amp; The Lying Liars Who Tell Them by Al Franken (2003)","uid":10062456,"size":5618352,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:89f0854e1f21828ca5cc06a24b921fd92b5de164&amp;dn=Lies+%26amp%3B+The+Lying+Liars+Who+Tell+Them+by+Al+Franken+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1398748770,"description":"Title: Lies &amp; The Lying Liars Who Tell Them (A Fair And Balanced Look At The Right)\nAuthor: Al Franken\nCategory: Non-Fiction\nPublisher: Dutton (August 21, 2003)\nLanguage: English\nISBN-10: 0525947647\nISBN-13: 978-0525947646\n\nIn Lies &amp; The Lying Liars Who Tell Them, comedian and future senator Al Franken dissects the far political right, and attacks the credibility of many of the mainstrean pundits and bloviators who are on that side of the aisle. He also takes sharp jabs at George W. Bush, just prior to and after re-election. From Bill O'Reilly - splotchy bully - to Bernie Goldberg and Ann Coulter, and then to his own adventures in the conservative heart of America, Franken weaves his jabs with careful timing and sharp wit as well as offering strong rebuttals to the extremist, neo-conservation point of view. Whether you love or hate him, he is a great humorist and talented writer and this is worth checking out if you are a fan of his comedy or politics - or to read and seethe in anger and outrage.\n\nPromotional info for the hardcover edition - &quot;Al Franken, &quot;one of our savviest satirists&quot; (People), takes on the issues, the politicians, and the pundits in one of the most anticipated books of the year. \n\nFor the first time since his own classic Rush Limbaugh Is a Big Fat Idiot and Other Observations, Al Franken trains his subversive wit directly on the contemporary political scene. Now, the &quot;master of political humor&quot; (Washington Times) destroys the myth of liberal bias in the media, and exposes how the Right shamelessly tries to deceive the rest of us. \n\nNo one is spared as Al uses the Right's own words against them. Not the Bush administration and their rhetorical hypocrisy. Not Ann Coulter and her specious screeds. Not the new generation of talk-radio hosts, and not Bill O'Reilly, Roger Ailes, and the entire Fox network. This is the book Al Franken fans have been waiting for (and his foes have been dreading). Timely, provocative, unfailingly honest, and always funny, Lies is sure to become the most talked about book of political humor in 2003 and beyond.&quot;\n\nThis torrent contains the book in both PDF and EPUB format, from different sources. The front cover is also included. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:89f0854e1f21828ca5cc06a24b921fd92b5de164","amp;dn":"Lies+%26amp%3B+The+Lying+Liars+Who+Tell+Them+by+Al+Franken+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89f0854e1f21828ca5cc06a24b921fd92b5de164","infoHashBuffer":{"type":"Buffer","data":[137,240,133,78,31,33,130,140,165,204,6,162,75,146,31,217,43,93,225,100]},"announce":[],"urlList":[]}}