{"title":"Prince Of Egypt &amp; Josef King Of Dreams(dvd5)(Nl subs)RETAIL ","uid":7004266,"size":4683061252,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:89fe5918d7b473ebb53b7c98f0394640383425a2&amp;dn=Prince+Of+Egypt+%26amp%3B+Josef+King+Of+Dreams%28dvd5%29%28Nl+subs%29RETAIL+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Sammynet","files":-1,"time":1328206569,"description":"Josef King Of Dreams\n\nNederlands\nJoseph, ÃƒÂ©ÃƒÂ©n van de twaalf zonen van Jakob, wordt op een dag achtergelaten in een waterput.\nEnkele dagen later wordt hij als slaaf meegenomen naar Egypte.\nIn een visioen ziet hij dat Egypte gaat worden getroffen door een hongersnood en meldt dit aan de farao.\n\nEnglish\nWhen Joseph receives a beautiful coat from his parents,\nhis eleven brothers hate him even more and are driven to sell him to desert merchants who take him to Egypt!\nThere he is made the servant of a wealthy Egyptian who misunderstands him and has him thrown into prison!\nHe shows his God-given gift by interpreting the dreams of two other prisoners.\nEventually, the Pharaoh begins to be plagued by dreams and sends for Joseph,\nwho interprets them and saves Egypt in the process.\nHe is made second in command to Pharaoh, and has most of Egypt's grain stored.\nEventually his brothers arrive in Egypt to buy food because of famine, and he must forgive them.\nThen the dreams that had angered his brothers were in reality prophecies that had come from God.\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels en nederlands\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Animatie / Avontuur\nPlay time     : 75 minuten\n\n\n\n\nPrince Of Egypt\n\nNederlands\nDe Egyptische farao Seti geeft het bevel om alle Hebreeuwse baby's te verdrinken.\nEen wanhopige moeder plaatst haar zoon in een mandje, die terecht komt bij de koningin.\nMoses wordt opgevoed als een broer van de troonopvolger Ramses.\nJaren later worden de broers van elkaar gescheiden wanneer Moses achter zijn ware achtergrond komt.\nHij krijgt van God de taak om als boodschapper te fungeren,\nen de onderdrukte Hebreeuwse bevolking te leiden naar een eigen land.\n\nEnglish\nThis is the extraordinary tale of two brothers named Moses and Ramses,\none born of royal blood, and one an orphan with a secret past.\nGrowing up the best of friends, they share a strong bond of free-spirited youth and good-natured rivalry.\nBut the truth will ultimately set them at odds, as one becomes the ruler of the most powerful empire on earth,\nand the other the chosen leader of his people!\nTheir final confrontation will forever change their lives and the world.\n\nSpotinformatie\n\nCategorie     : Beeld\nFormaat       : DVD5\nBron          : Retail\nMenu          : Ja\nAudio         : Engels en nederlands\nOndertitels   : Nederlands\nCover &amp; label : Ja\nGenre         : Animatie / Avontuur\nPlay time     : 97 minuten","torrent":{"xt":"urn:btih:89fe5918d7b473ebb53b7c98f0394640383425a2","amp;dn":"Prince+Of+Egypt+%26amp%3B+Josef+King+Of+Dreams%28dvd5%29%28Nl+subs%29RETAIL+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"89fe5918d7b473ebb53b7c98f0394640383425a2","infoHashBuffer":{"type":"Buffer","data":[137,254,89,24,215,180,115,235,181,59,124,152,240,57,70,64,56,52,37,162]},"announce":[],"urlList":[]}}