{"title":"Generation.Kill.S01E05.HDTV.XviD-0TV","uid":4338069,"size":734061752,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8a08c145bd34c5c22bee46e752a5a060d3a385e1&amp;dn=Generation.Kill.S01E05.HDTV.XviD-0TV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"circlensess","files":1,"time":1218433800,"description":"Generation.Kill.S01E05.HDTV.XviD-0TV.[eztv]\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0995832/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0995832/&lt;/a&gt;\n\nAs they scope a tiny hamlet, the men of Bravo are frustrated by the capricious nature of the war, and Colbert struggles to defend the actions of the higher-ups. First Recon finally gets a chance to use their skills and exploit some intelligence from Iraqi locals about an ambush at a bridge ahead. For once, First Recon isn't tasked with heading straight into the ambush, but instead gets to rest and watch as better armed LAVs assault the bridge. With the ambush thought to be quelled, Colbert's team is ordered to lead Bravo across the bridge. They quickly discover that the enemy combatants still have some fight in them, but led by Colbert, they manage to escape almost unscathed. After regrouping, Bravo is ordered to cross the bridge again, this time with Bravo 3 in the lead, and again hits a snag. The following morning, First Recon examines the bodies of the men they fought the night before, and discover their enemy is not who they imagined. Bravo continues north to Al Muwafaqiyah, where they are tasked with setting up another roadblock and with destroying the Republican Guard outpost, which, unfortunately, is in the town's only school. Despite Colbert's exhortations to the men to hold their fire unless its absolutely necessary, Bravo has an incident at the road block. As they again head north, the inexactitude of the war weighs heavily on the men. (TVMA) (AC,AL)\n\nActors: ALEXANDER SKARSGARD, JAMES RANSONE, STARK SANDS, LEE TERGESEN, JON HUERTAS\n\nDirector(s): SIMON CELLAN JONES\n\n\n\n             0TV Brings You ---\n             Generation.Kill.S01E05.HDTV.XviD-0TV\n             aired   08.10.2008\n\n notes - we might be interested in another capper (East Coast HD/Verizon\n       fios tv/bev or digital cable) -- find us if you know how\n\n","torrent":{"xt":"urn:btih:8a08c145bd34c5c22bee46e752a5a060d3a385e1","amp;dn":"Generation.Kill.S01E05.HDTV.XviD-0TV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a08c145bd34c5c22bee46e752a5a060d3a385e1","infoHashBuffer":{"type":"Buffer","data":[138,8,193,69,189,52,197,194,43,238,70,231,82,165,160,96,211,163,133,225]},"announce":[],"urlList":[]}}