{"title":"Eric Bibb - Friends [2004][EAC,log,cue.FLAC] ","uid":9113182,"size":352015586,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8a2f7326b1c32d8448c7faf14129c989c9271196&amp;dn=Eric+Bibb+-+Friends+%5B2004%5D%5BEAC%2Clog%2Ccue.FLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":19,"time":1382986727,"description":"Artist: Eric Bibb\nRelease: Friends\nReleased: 2004\nLabel: Dixiefrog\nCatalog#: DFGCD 8578\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: Blues\n\nimage\n\n99 1/2 Won't Do\nSix O'Clock Blues\nGoin' Down Slow\nLovin' In My Baby's Eyes\nFor You\nThe Cape\n'Tain't Such a Much\nNeeded Time\nIf I Stayed\nConnected\nRibbons and Bows\nJust Look Up\nCowgirl Queen\nKulanjan / Sebastian's Tune\nDance Me to the End of Love\n\n\n\nFriends is the accurate and revealing title for New York bluesman Eric Bibb's tenth album since 1997. There are 15 cuts here, each of them featuring rootsy folk and blues collaborations with different &quot;friends&quot; in differing small group settings. The set starts with a killer acoustic slide duet between Bibb and Guy Davis on the nugget &quot;99 Â½ Won't Do.&quot; The contrast between Davis' sweet and smoky delivery and Bibb's husky wail -- akin to Blind Willie Johnson's in places -- offers a double-sided dimension in interpretation for the listener, as well. Elsewhere, Charlie Musselwhite gives a killer snaky harmonica performance on &quot;Six O' Clock Blues.&quot; Taj Mahal makes two appearances; one in a duet on &quot;Goin' Down Slow,&quot; and one in a trio with Bibb and Malian guitarist Djelimady Tounkara on a medley of the traditional &quot;Kulanjan&quot; and Bibb's own &quot;Sebastian's Tune.&quot; Speaking of Mali, and Mahal, Bibb also covers the elder bluesman's classic &quot;Lovin' in My Baby's Eyes,&quot; with the great kora player Mamadou Diabate that rivals the original. There's also a gorgeous version of Guy and Susanna Clark's &quot;The Cape,&quot; with guitarist Martin Simpson, Bibb's moving &quot;For You&quot; with Ruthie Foster, and &quot;Tain't No Such Thing,&quot; a bright new folk song written and sung with legendary folksinger Odetta. Mohan Veena ace Harry Manx performs with Bibb on the high lonesome, droning blues of &quot;Needed Time,&quot; and with Kristina Olsen on her &quot;If I Stayed.&quot; The set closes with the tender &quot;Dance Me to the End of Love,&quot; (an original, not the Leonard Cohen tune) with the Lovin' Spoonful's Jerry Yester playing piano. In addition to the many performers on this collection, there are 15 different engineers! Given that most records of this type are mixed bags at best, with &quot;star-studded&quot; collabs serving to muck up or water down rather than enhance performances, Friends is an anomaly. There is nothing that's obvious or overblown here, everything is subtly shaded, and the performers serve the songs and not themselves. The listener gets no sense of back-patting or self-congratulation, only the great pleasure of hearing this music in a revealing, emotionally honest way. Bravo.","torrent":{"xt":"urn:btih:8a2f7326b1c32d8448c7faf14129c989c9271196","amp;dn":"Eric+Bibb+-+Friends+%5B2004%5D%5BEAC%2Clog%2Ccue.FLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8a2f7326b1c32d8448c7faf14129c989c9271196","infoHashBuffer":{"type":"Buffer","data":[138,47,115,38,177,195,45,132,72,199,250,241,65,41,201,137,201,39,17,150]},"announce":[],"urlList":[]}}