{"title":"Brendan Benson - Lapalco (2002)","uid":3380835,"size":62003907,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ad2cfc6ddb46dd521bbceffad5489bd864a232d&amp;dn=Brendan+Benson+-+Lapalco+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"raisincain78","files":12,"time":1126215304,"description":"From Pitchfork Media:\n\nLou Pearlman is in a world of shit. After a series of highly publicized in-court battles with the Backstreet Boys and N'Sync resulted in the legal annulment of his managerial duties, he's been forced to subsist on a disrespectfully small severance package (only one-sixth of the respective groups' entire earnings?) and a diet of &quot;exclusive&quot; tell-alls. But the question plaguing every pre-pubescent music lover and-- let's face it-- the whole world is: what will this self-professed 'pop guru' do next?\n\nThough his name is nowhere to be found amongst the album's succinct liner notes, it's pretty hard to ignore the argument that Brendan Benson's Lapalco could very well mark Pearlman's return to the world of image consultation and pre-packaged musical commodity. Nevermind that there's no actual evidence of any official contact between Benson and Lou (or &quot;Big Poppa,&quot; as he's come to be known in the most elite circles of Tigerbeat fandom). All the tell-tale signs of Pearlman's influence are here, if you look hard enough. Lapalco's cover art, for instance, finds Benson dressed in prototypical thrift store attire and eating from a single-serving box of breakfast cereal; an ingenious marketing ploy that immediately establishes the album's target demographic! It almost makes one feel guilty for enjoying the disc so thoroughly.\n\nWith 1996's One Mississippi, Brendan Benson crafted an impressively catchy collection of songs whose instant accessibility belied the complex arrangements that resided just beneath the obvious hooks. Pieces such as &quot;Sittin' Pretty&quot; and &quot;Tea&quot; invoked the ghosts of early R.E.M. and the Beatles while managing to elude the nauseating sense of pastiche induced by many like-minded acts who populated mid-90s alternative radio. Unfortunately, Virgin's mishandling of the album squandered whatever commercial success Benson was poised to achieve and precipitated a number of label disputes, delaying the recording of a proper follow-up for years on end. Die-hard fans-- and there actually were a handful-- wept. Luckily, their wait was not in vain, as Benson has fashioned yet another sterling pop record replete with his standard jangle-pop songs and anthemic rockers, and a smattering of pastoral psychedelia.\n\nAside from guest production by Jason Falkner and his occasional vocal accompaniment, Brendan performs, sings, and produces every note of Lapalco, lending even the most aggressive tracks an indefinable sort of intimacy. Nowhere is this more evident than &quot;Metarie,&quot; which features a surprisingly effective lyrical meditation on lost love while skirting an obvious structural similarity to Elton John's &quot;Rocket Man&quot; (of all things!).\n\nOccasionally, though, the very elements that make Benson's music endearing can, in excess, be counterproductive. &quot;You're Quiet&quot; which boasts the refrain, &quot;I've been a little down on my luck/ I think you know where I'm coming from/ I need a pick-up and I don't mean truck,&quot; typifying the record's lyrical pandering and goofiness. Elsewhere, &quot;What&quot; strives to use the word &quot;girl&quot; as many times as humanly possible within a 3&amp;frac12;-minute window, which not only proves that Brendan ascribes to the musical school of thought which prizes quantity over quality, but also hints at his presumed employment by Big Poppa.\n\nBut regardless of its spotty lyricism, Lapalco's intelligent and understated melodies indicate that we have a true talent on our hands-- especially on &quot;Tiny Spark,&quot; which launches the album with an infectious Moog riff that soon blossoms into one of the most driving tracks in the man's canon. His unadulterated giddiness is certainly contagious and, when channeled correctly, makes for some surprisingly potent music. Though it's futile to predict whether or not he's capable of transcending his influences, it's comforting to know that, with rave reviews in Esquire and an endorsement from Jack White of the White Stripes, Lou Pearlman will sleep soundly tonight.\n\n-Kevin Adickes, April 3rd, 2002","torrent":{"xt":"urn:btih:8ad2cfc6ddb46dd521bbceffad5489bd864a232d","amp;dn":"Brendan+Benson+-+Lapalco+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ad2cfc6ddb46dd521bbceffad5489bd864a232d","infoHashBuffer":{"type":"Buffer","data":[138,210,207,198,221,180,109,213,33,187,206,255,173,84,137,189,134,74,35,45]},"announce":[],"urlList":[]}}