{"title":"Moodscapes Meditation Library 4 CD Set with Dane Spotts [FLAC]","uid":11884402,"size":647574509,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8b286bc4f8e8035a92c2fb4e2c0f9a42ba7b9bc2&amp;dn=Moodscapes+Meditation+Library+4+CD+Set+with+Dane+Spotts+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"elessedilgirl","files":9,"time":1430773104,"description":"Using new digital technology that creates an almost perfect 3-D soundform these four Moodscape Environments mix musical patterns and a special neuro-matrix into four powerful and unique meditations.\n\nEach is designed to place your consciousness in the middle of a different environment...Thunderstorm, Spring Day, Savanna Night, or a Seashore scene. For meditation and adventurous mind escapes.\n\nThunderstorm\n\nA storm is coming. You hear the thunder's approach; you can feel it in your soul. Lightning flashes, illuminating the horizon as rain begins to fall. You feel safe but charged by the powerful forces of nature. You can almost smell the cleansing ozone; hear the rivulets cutting through the rejuvenated landscape. This is the rejuvenation of life, the renewal of the senses. Bathe yourself in the energy and be recharged.\n\nSpring Day\n\nBask in a warm breeze as the scent of wildflowers and tender shoots of new grass fill the air. A soothing brook trickles through the shimmering aspens, bringing the promise of journeys yet to follow. The sounds of birds awakening in the dawn celebrate the ecstasy of being alive. It is a new day, and nothing but possibilities lay before you, waiting to be filled.\n\nSavanna Night\n\nThe brilliant night sky is filled with endless stars. From a high overlook you watch a vast African plain come alive. A cool zephyr rushes up from below, plays with the edges of your hair, carries with it the sweet scent of earth and history. Ancient drumbeats from a far away distance permeate the air with magic. There is promise here. The promise of a new dawn.\n\nSeashore\n\nGentle waves caress the shore as the sea gulls dance on the breeze, suspended in the joy of the moment. Ocean mist rolls into the dunes,\nblankets you with the scent of salt and faraway lands. Far out to sea, a lone ship passes slowly by. A musical texture surrounds you with love. Here on the beach, you find yourself replete with a deep, fathomless peace, your breath moving in and out with the rhythm of the tides.\n\nreference libFLAC 1.3.1 20141125\n\nSecure rips. Logs included","torrent":{"xt":"urn:btih:8b286bc4f8e8035a92c2fb4e2c0f9a42ba7b9bc2","amp;dn":"Moodscapes+Meditation+Library+4+CD+Set+with+Dane+Spotts+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b286bc4f8e8035a92c2fb4e2c0f9a42ba7b9bc2","infoHashBuffer":{"type":"Buffer","data":[139,40,107,196,248,232,3,90,146,194,251,78,44,15,154,66,186,123,155,194]},"announce":[],"urlList":[]}}