{"title":"Battlefleet Gothic: Armada v16.8910","uid":15442283,"size":5665655377,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:8c2c1b63e3125b1a044868a70439da6f2cd7e7e8&amp;dn=Battlefleet+Gothic%3A+Armada+v16.8910&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dauphong","files":1,"time":1469834121,"description":"Battlefleet Gothic: Armada is the RTS videogame adaptation of Games Workshop’s classic tabletop game, pitting the Chaos, Imperium, Eldar, and Orks against each other in visceral space-battles.\r\n\r\nDeveloped with Unreal Engine 4, Battlefleet Gothic: Armada offers deep management of every ship composing the player’s fleet, both during and between battles. From the fastest frigates to the gigantic, miles-long battleships, the player will customize all aspects of his ships: weaponry, defense and support sub-systems, but also crew, captains, and more... each customization affecting the very performances of the ship and the special abilities available during battle. From battle to battle, the admirals and crew of surviving ships will gain experience and promotions, improving the battle-readiness of the ships for future, bigger and more dangerous battles.\r\n\r\nAdditionally an extensive multiplayer mode with persistent fleets where up to 4 players can battle simultaneously, Battlefleet Gothic: Armada also features a big story campaign, taking place during the 12th Black Crusade and putting players in the middle of the Gothic War that raged between the Imperium and Abaddon the Despoiler. Players will be at the centre of every fight, commanding fleets of gigantic ships as the Chaos unleash a sequential chain of surprise attacks on Imperium worlds – the start of 20 years of warring in the sector.\r\n\r\n\r\n\r\n    An expansive single-player campaign across the Gothic sector.\r\n    Four factions to command, each one with its own strengths and skills.\r\n    Tactical PVP multiplayer offering infinite replayability.\r\n    A huge array of authentically recreated Battlefleet Gothic ships.\r\n    A real-time strategy experience retaining many of the tactical Battlefleet Gothic elements.\r\n    A plethora of lore-abiding skills to fill the player’s arsenal.\r\n    Upgrade and apply skills at port Maw","torrent":{"xt":"urn:btih:8c2c1b63e3125b1a044868a70439da6f2cd7e7e8","amp;dn":"Battlefleet+Gothic%3A+Armada+v16.8910","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c2c1b63e3125b1a044868a70439da6f2cd7e7e8","infoHashBuffer":{"type":"Buffer","data":[140,44,27,99,227,18,91,26,4,72,104,167,4,57,218,111,44,215,231,232]},"announce":[],"urlList":[]}}