{"title":"Stossel.2014.04.24.[They Know What You Do].FBN.CF.avi","uid":10043807,"size":355346884,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8c373b75fa110909084a37b60cf7f3a0954e8ad2&amp;dn=Stossel.2014.04.24.%5BThey+Know+What+You+Do%5D.FBN.CF.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"skJGZV6z","files":-1,"time":1398507338,"description":"----------\n\nSTOSSEL - [They Know What You Do] - Fox Business Network\n2014, April 24, Thursday\n\nXvid/MP3 AVI - encoded from medium quality ReplayTV stream\n\n----------\n\n[excerpted from John Stossel's blog:]\n\n\nTHE DEATH OF PRIVACY: I love the internet. It makes my life better. But there's a tradeoff. Eric Yaverbaum of SocialMediaMags.com says social media freaks him out because &quot;your life isn't private anymore.&quot;\n\nTERMS &amp; CONDITIONS: Do you agree to the &quot;terms and conditions&quot; on a website without reading them? I do. I doubt that anyone reads them. Terms And Conditions May Apply director Cullen Hoback explains what &quot;people give up when they agree to these things.&quot;\n\nHACK ATTACKS: Crooks can sneak into your computer and watch what you do. Today's computer viruses are less likely to try to harm your computer, more likely to steal private information. Robert Siciliano of McAfee says everyone needs &quot;a good anti-virus program&quot; to &quot;keep the bad guys out.&quot;\n\nGPS: Now the government wants to know where you drive. And how you drive. Tech Reporter &quot;Cyberguy&quot; Kurt Knutsson says &quot;Big Brother has been chomping at our heels and our privacy for years now.&quot;\n\nDATA COLLECTORS: Advertisers track what I do on the web and then run ads targeted at me. This infuriates people but I agree with Kate Kaye of Advertising Age, who says &quot;less fear-mongering&quot; is in order\n\nOFF THE GRID: Are you sick of constant emails, texting, and internet noise? Paul Miller of The Verge &quot;just wanted to quit and get away&quot; so he went off the grid for a year. He says he felt lonely, out of sync, and couldn't work: &quot;everybody's job requires them to at least have email now.&quot;\n\nMY TAKE: For all the privacy I've lost, I'd never give up my smartphone or favorite websites to get it back. Facebook, Amazon, Cato @ Liberty, and Reason.com provide me with so much good stuff. What bothers me is that people say, when it comes to loss of privacy, business worries them more than government. Why? Businesses can't use force; businesses can't forcibly take our money and put us in jail. But government can. Government spying is a much bigger threat than anything business might do.","torrent":{"xt":"urn:btih:8c373b75fa110909084a37b60cf7f3a0954e8ad2","amp;dn":"Stossel.2014.04.24.%5BThey+Know+What+You+Do%5D.FBN.CF.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c373b75fa110909084a37b60cf7f3a0954e8ad2","infoHashBuffer":{"type":"Buffer","data":[140,55,59,117,250,17,9,9,8,74,55,182,12,247,243,160,149,78,138,210]},"announce":[],"urlList":[]}}