{"title":"Xenozoic Tales (Request)","uid":7639681,"size":553582552,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8cdbb2d6a983de6c0771fb7adb48d9b76e2c55b9&amp;dn=Xenozoic+Tales+%28Request%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"LeonardTSpock","files":-1,"time":1347744956,"description":"Issues 1-14 of 'Xenozoic Tales'\nKitchen Sink Press, 1987-1996\nWritten and Illustrated by Mark Schultz\nBack-up story art by Steve Stiles\n\nXenozoic Tales is an alternative comic book by Mark Schultz set in a post-apocalyptic future. Publication began in 1986 with the story &quot;Xenozoic!&quot; included in the comic anthology Death Rattle. This was shortly followed by Xenozoic Tales #1 in February 1987. The comic series ran for 14 issues, and has been reprinted by several publishers, including Kitchen Sink Press, Marvel, and Dark Horse.\n\nIn the storyline, the Earth has been ravaged by pollution and natural disasters of all sorts. To escape this, humanity built vast underground cities in which they lived for approximately 600 years. Upon emerging, the humans found that the world had been reclaimed by previously extinct lifeforms (most spectacularly, dinosaurs). In the new 'Xenozoic' era, technology is extremely limited and those with mechanical skills command a great deal of respect and influence.\n\nThe two chief protagonists of the series are mechanic Jack Tenrec and scientist and love interest, Hannah Dundee. Tenrec operates a garage in which he restores cars, particularly Cadillacs. Given that the post-apocalyptic world no longer possesses the ability to refine oil, Tenrec modifies his cars to run on dinosaur guano. These cars, of course, are frequently chased by rampaging dinosaurs in pulp action-style adventure stories.\n\nOther characters include various criminals, politicians, scientists, and inventors who populate the dystopian world of tomorrow. There is also a race of reptilian humanoids who cannot speak in a human language but instead communicate by spelling words with Scrabble tiles. These creatures have befriended Tenrec, and apparently have the ability to communicate telepathically with the dinosaurs. Added into the mix is Hermes, an allosaurus Jack raised, and who basically acts as the most threatening guard dog one could ask for.","torrent":{"xt":"urn:btih:8cdbb2d6a983de6c0771fb7adb48d9b76e2c55b9","amp;dn":"Xenozoic+Tales+%28Request%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cdbb2d6a983de6c0771fb7adb48d9b76e2c55b9","infoHashBuffer":{"type":"Buffer","data":[140,219,178,214,169,131,222,108,7,113,251,122,219,72,217,183,110,44,85,185]},"announce":[],"urlList":[]}}