{"title":"How Proust Can Change Your Life - Alan de Botton","uid":3582579,"size":174342794,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8cec3393c7484377513ea86e5f663c2b4712f976&amp;dn=How+Proust+Can+Change+Your+Life+-+Alan+de+Botton&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"charlesrbeard","files":27,"time":1166892539,"description":"One doesn&amp;#039;t usually think of Marcel Proust as the author of a great self-help book. Unless of course what you admire most about &amp;#039;&amp;#039;Remembrance of Things Past&amp;#039;&amp;#039; is its usefulness for killing huge amounts of time.\n\nAlain de Botton, a novelist, doesn&amp;#039;t take quite such a crassly utilitarian view in his delightfully original work of literary criticism, &amp;#039;&amp;#039;How Proust Can Change Your Life: Not a Novel.&amp;#039;&amp;#039; But he does come close in places. For instance, in Chapter 3, called &amp;#039;&amp;#039;How to Take Your Time,&amp;#039;&amp;#039; he points out that one reaction to the great length of Proust&amp;#039;s famous novel was the &amp;#039;&amp;#039;All-England Summarize Proust Competition,&amp;#039;&amp;#039; once presented by the Monty Python troupe in the belief, as Mr. de Botton puts it, that &amp;#039;&amp;#039;what had originally taken seven volumes to express could reasonably be condensed into 15 seconds or less, without too great a loss of integrity or meaning, if only an appropriate candidate could be found.&amp;#039;&amp;#039;\n\nMr. de Botton&amp;#039;s tongue is only partly in his cheek here. The point of this chapter is that Proust really does teach important lessons in how to slow down life and see its details more clearly. And, to illustrate the point, Mr. de Botton too takes his sweet time here.\n\nHe quotes the longest sentence in Proust&amp;#039;s novel, which he insists on referring to by its literal translation from the French, &amp;#039;&amp;#039;In Search of Lost Time,&amp;#039;&amp;#039; rather than by the more poetic but inaccurate &amp;#039;&amp;#039;Remembrance of Things Past.&amp;#039;&amp;#039; He recalls the novel&amp;#039;s publishing history. He describes what Proust ate for breakfast. He explains why Proust liked to read railway schedules. In short, Mr. de Botton takes the local train to his point.\n\nElsewhere, his tongue is more firmly in his cheek, as in Chapter 2, &amp;#039;&amp;#039;How to Read for Yourself,&amp;#039;&amp;#039; where he recounts how Proust&amp;#039;s father, the distinguished Dr. Adrien Proust, set a family precedent for successful self-help books with his &amp;#039;&amp;#039;Elements of Hygiene,&amp;#039;&amp;#039; among his 34 books. This work was complete with drawings of how ladies ought to exercise by swinging their arms, by balancing on one foot and by jumping off a wall, which illustrations Mr. de Botton whimsically reproduces.\n\nMore often, however, his tongue isn&amp;#039;t in his cheek at all. Mr. Bouton, the author of three novels -- the latest, &amp;#039;&amp;#039;Kiss and Tell,&amp;#039;&amp;#039; to be published next month by Picador -- explores Proust&amp;#039;s irritation with cliches in Chapter 5, &amp;#039;&amp;#039;How to Express Your Emotions.&amp;#039;&amp;#039; &amp;#039;&amp;#039;The problem with cliches,&amp;#039;&amp;#039; Mr. de Botton writes, &amp;#039;&amp;#039;is not that they contain false ideas, but rather that they are superficial articulations of very good ones.&amp;#039;&amp;#039; They insulate us from expressing our real emotions. As Proust himself put it, we are all in the habit of &amp;#039;&amp;#039;giving to what we feel a form of expression which differs so much from, and which we nevertheless after a little time take to be, reality itself.&amp;#039;&amp;#039; This leads to the substitution of conventional feelings for real ones.\n\nIn a matching chapter, &amp;#039;&amp;#039;How to Open Your Eyes,&amp;#039;&amp;#039; Mr. de Botton comments on how the narrator of Proust&amp;#039;s novel recalls his disappointment as a child over the difference between his romantic image of the seashore and its workaday actuality: &amp;#039;&amp;#039;Though the narrator experiences a particularly extreme gap between his surroundings and his internal conception of beauty, it is arguable that a degree of discrepancy is characteristic of modern life.&amp;#039;&amp;#039;\n\nMr. de Botton continues: &amp;#039;&amp;#039;Because of the speed of technological and architectural change, the world is liable to be full of scenes and objects that have not yet been transformed into appropriate images and may therefore make us nostalgic for another, now lost world, which is not inherently more beautiful but might seem so because it has already been widely depicted by those who open our eyes.&amp;#039;&amp;#039; Paradoxically, although Proust is famous for intense nostalgia, he championed opening people&amp;#039;s eyes to contemporary beauty.\n\nSo as well as being criticism, biography, literary history and a reader&amp;#039;s guide to Proust&amp;#039;s masterpiece, &amp;#039;&amp;#039;How Proust Can Change Your Life&amp;#039;&amp;#039; is a self-help book in the deepest sense of the term. My goodness; it may even change your life.","torrent":{"xt":"urn:btih:8cec3393c7484377513ea86e5f663c2b4712f976","amp;dn":"How+Proust+Can+Change+Your+Life+-+Alan+de+Botton","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8cec3393c7484377513ea86e5f663c2b4712f976","infoHashBuffer":{"type":"Buffer","data":[140,236,51,147,199,72,67,119,81,62,168,110,95,102,60,43,71,18,249,118]},"announce":[],"urlList":[]}}