{"title":"Sexy Losers Complete","uid":4557724,"size":34307264,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:8d058066dac4615661209827510ce8cbf56a74cf&amp;dn=Sexy+Losers+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mcu","files":338,"time":1228557160,"description":"Sexy Losers was an adult webcomic by Clay, a Canadian living in Japan, who from 2001 to 2004 was known under the pseudonym &quot;Hard.&quot; The strip has a significant following; its web hosting company&amp;#039;s promotional material indicated that it received one million unique visitors in August 2003.[2] Before being hosted on its own from September 2003 and on, it was the most popular webcomic on Keenspace, getting over 10% of all page views.[3]\n\nThe strip, a satire of human sexual foibles, draws from themes generally alien to light comic fare, namely sex, fetishism, and sexual relationships. Though the author describes the comic as ribaldry as opposed to pornography, the strip does contain graphic depictions of sex acts, as well as full nudity of both male and female characters. A number of its jokes are drawn from recurring elements of pornographic or animated pornographic (hentai) films. One character, for instance, is a bukkake film actress. The strips stayed true to its bawdy genre, and often attempted humour through the quirks of human sexuality intensified with shock value and depiction of taboos.[4][5] Clay cites the comic Heartbroken Angels by Kikuni Masahito as his largest inspiration in making the comic.[6]","torrent":{"xt":"urn:btih:8d058066dac4615661209827510ce8cbf56a74cf","amp;dn":"Sexy+Losers+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d058066dac4615661209827510ce8cbf56a74cf","infoHashBuffer":{"type":"Buffer","data":[141,5,128,102,218,196,97,86,97,32,152,39,81,12,232,203,245,106,116,207]},"announce":[],"urlList":[]}}