{"title":"Dead Kennedys 24 Bit Vinyl Pack","uid":9019746,"size":2316828007,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8d1afd0f38b469c21f505cc9e36b65ab4c0d868c&amp;dn=Dead+Kennedys+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"politux","files":-1,"time":1381270045,"description":"\n  Dead Kennedys 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock\n  Styles: Punk, Hardcore\n  Source: vinyl\n  Codec: FLAC\n  Bit Rate: ~ 2,900 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1980 Fresh Fruit for Rotting Vegetables\n  1982 Plastic Surgery Disasters\n  1986 Bedtime for Democracy\n\n  The Dead Kennedys merged revolutionary politics with hardcore punk music and, in the process, became one of the defining hardcore bands. Often, they were more notable for their politics than their music, but that was part of their impact. The Kennedys were more inspired by British punk and the fiery, revolutionary-implied politics of the Sex Pistols than the artier tendencies of New York punk rockers. Under the direction of lead vocalist Jello Biafra, The Dead Kennedys became the most political and -- to the eyes of many observers, including Christians and right-wing politicians -- the most dangerous band in hardcore. By the mid-'80s, the band had become notorious enough to open themselves up to a prosecution for obscenity (concerning a poster inserted into their 1985 Frankenchrist album), and the ensuing court battle sped the band toward a breakup, but they left behind a legacy that influenced countless punk bands that followed.\n\n  The Dead Kennedys formed in 1978 in San Francisco when Biafra (vocals; born Eric Boucher) and bassist Klaus Flouride responded to a magazine ad placed by guitarist East Bay Ray. Drummer Ted (born Bruce Slesinger) joined soon after and the band played locally for the first two years of their career, occasionally venturing outside the Bay Area. Within a year, the band released their first independent single, &quot;California Ãœber Alles,&quot; an attack on the then-current governor, Jerry Brown. It was followed shortly afterward by their second single, &quot;Holiday in Cambodia.&quot; In 1979, Biafra ran for mayor of San Francisco; he finished fourth. By this time, the band had become quite popular in both the American and British underground. Finally, in 1980, the band released their debut album, Fresh Fruit for Rotting Vegetables, on IRS Records. After its release, Ted left the band; he was replaced by drummer Darren H. Peligro.\n\n  Following the release of Fresh Fruit for Rotting Vegetables, The Dead Kennedys formed their own independent record label, Alternative Tentacles, in 1981. The first release on the label was The Kennedys' EP, In God We Trust. That same year, the single &quot;Too Drunk to Fuck&quot; scraped the bottom of Britain's pop Top 40, despite being banned from airplay. In 1982, The Kennedys released their second full-length album, Plastic Surgery Disasters. After its release, the band took a hiatus, during which bandmembers -- most notably Klaus Flouride -- performed with various side projects. During that time, Alternative Tentacles began to establish itself as a major force in the American underground.\nThe Dead Kennedys returned in 1985 with Frankenchrist, which was the record that earned the band its greatest notoriety. Included with the album was a poster of the Swiss artist H.R. Giger's Landscape #XX, a garish illustration of penises and anuses. A year after the release of the album, The Kennedys and Alternative Tentacles were prosecuted under revised Californian anti-obscenity laws for distributing pornography to minors because of the poster. For the next two years, the band was embroiled in a bitter legal battle, during which Biafra emerged as one of the most articulate advocates for free speech and vocal opponents of the PMRC. In the summer of 1987, the case ended with a hung jury and was dismissed.\n\n  Although The Dead Kennedys emerged victorious from the court battle, they didn't remain a band for much longer. Just before the prosecution began in 1986, the band released Bedtime for Democracy, which turned out to be their last official album. After the case was settled, The Kennedys split, releasing the posthumous compilation Give Me Convenience or Give Me Death in 1987. Biafra embarked on a solo career, releasing musical and spoken-word recordings sporadically over the next couple decades. Flouride returned to his fledgling solo career, releasing two albums in the late '80s and early '90s. The DVD format of Dmpo's On Broadway, The Dead Kennedys' June 1984 performance marking the closing of San Francisco's avant-garde theater and nightclub, was released in May 2000.","torrent":{"xt":"urn:btih:8d1afd0f38b469c21f505cc9e36b65ab4c0d868c","amp;dn":"Dead+Kennedys+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8d1afd0f38b469c21f505cc9e36b65ab4c0d868c","infoHashBuffer":{"type":"Buffer","data":[141,26,253,15,56,180,105,194,31,80,92,201,227,107,101,171,76,13,134,140]},"announce":[],"urlList":[]}}