{"title":"Alfred Hitchcock Classics - The Farmer's Wife (1928) Silent - Xv","uid":9564771,"size":586702848,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8db684c8b7213c16de7059c78ab0e213b81b04b0&amp;dn=Alfred+Hitchcock+Classics+-+The+Farmer%27s+Wife+%281928%29+Silent+-+Xv&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SaM","files":-1,"time":1391487956,"description":"Alfred Hitchcock Classics - The Farmer's Wife (1928) Silent - Xvid 1cd - Lilian Hall Davis [DDR]\n\nThe Farmer's Wife is a 1928 British silent romantic comedy film directed by Alfred Hitchcock and starring Jameson Thomas, Lillian Hall-Davis and Gordon Harker.\nIt was made by British International Pictures at Elstree Studios. It was based on a play of the same name by British novelist, poet and playwright Eden Phillpotts, best known for a series of novels based on Dartmoor, in Devon.\n\nCAST:-\nJameson Thomas - Samuel Sweetland\nLillian Hall-Davis - Araminta Dench, his Housekeeper\nGordon Harker - Churdles Ash: his Handyman\nGibb McLaughlin - Henry Coaker\nMaud Gill - Thirza Tapper\nLouie Pounds - Widow Windeatt\nOlga Slade - Mary Hearn: Postmistress\nRuth Maitland - Mercy Bassett\nAntonia Brough - Susan\nHaward Watts - Dick Coaker\n\nDirected by Alfred Hitchcock\nWritten by Eden Phillpotts, Eliot Stannard\nRunning time 129 minutes\n\nSYNOPSIS:- The Farmers Wife (1928) Silent\nTibby, the wife of Samuel Sweetland (Jameson Thomas) dies, and shortly afterwards his daughter marries and leaves home, leaving him on his own with his two servants. His wife had told him that he should remarry after her death, so he pursues some local spinsters who were at his daughter's wedding after he and his housekeeper Minta (Lillian Hall-Davis) make out a list of possibles.\n\nFirst is widow Louisa Windeatt, but Sweetland is shocked and mad when she rejects his advances and says she is too independent for him. Next, he attempts to court Thirza Tapper, a confirmed spinster and nervous wreck who almost collapses when Sweetland proposes to her. She, too, rejects him because she says she has no need for a man, and he is furious yet again. He wanders outside as other guests arrive for her party. His servant Ash is helping at the party and Ash steals the scene here as a bolshie butler wearing an ill-fitting coat and trying to keep his trousers up while doing his work at the party.\n\nWhile the others are outside listening to some singers, Sweetland proposes to Mary Hearn, but she rejects him as too old, but then goes into hysterics when he angrily tells her that she is &quot;full blown and a bit over.&quot;\n\nLater Sweetland tells Minta that he is not going to finish the list of women because he is so dejected. He leaves the room and Ash returns and tells Minta what an embarrassment to men that Sweetland is by going around and practically begging any woman to be his wife. Sweetland overhears this and orders Ash to saddle his horse because he is going to try number four, Mercy Bassett, a barmaid at a local inn. After he, Minta is in love with him. Bassett rejects him too and he comes home dejectedly. Meanwhile postmistress Hearn and Tapper compare notes and Hearn decides she should marry him after all and she goes to his house with Tapper.\n\nHaving run through the women who have turned him down, Samuel sees Minta for the first time as more than a housekeeper and decides that she is the woman for him, if she'll have him. He tells her he has got used to being rejected and will not be angry if she rejects him, too. She accepts him and he tells her to put on the dress Tibby gave her. As she goes to the room, Hearn and Tapper arrive. Hearn says she is now willing to be his wife. Samuel says all should drink a toast to his wife to be and Hearn is sure it is her till Minta comes down the stairs in an attractive dress. Hearn lapses into hysterics as the couple get together.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages : Silent\nRunTime 129 mins\nSubtitles: English Intertitles\nRipped by: Trinidad [DDR]\nDuration: 129 mins","torrent":{"xt":"urn:btih:8db684c8b7213c16de7059c78ab0e213b81b04b0","amp;dn":"Alfred+Hitchcock+Classics+-+The+Farmer%27s+Wife+%281928%29+Silent+-+Xv","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8db684c8b7213c16de7059c78ab0e213b81b04b0","infoHashBuffer":{"type":"Buffer","data":[141,182,132,200,183,33,60,22,222,112,89,199,138,176,226,19,184,27,4,176]},"announce":[],"urlList":[]}}