{"title":"Plug Your Book! Online Book Marketing for Authors by Steve Weber","uid":10398367,"size":129877545,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90d46291c6834eeb224fcf0454ac70913db14eb2&amp;dn=Plug+Your+Book%21+Online+Book+Marketing+for+Authors+by+Steve+Weber&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1403306449,"description":"Get massive exposure for your book, no special computer skills needed -- trade published or self published, fiction or nonfiction\n....................................................................................\nAbout the author: Steve Weber is founding publisher of KindleBuffet.com, which showcases five-star Kindle books currently available free (you may never have to pay for books again!).\n....................................................................................\nDiscover why authors fail with paid advertising, pay-per-click, fee-based reviews, and &quot;bestseller&quot; campaigns \n\nBlog to connect with readers, driving them to Amazon and bookstores\nBoost your visibility with Google, use MySpace for viral marketing\nIgnite word of mouth with Web social networks\nCapitalize on peer content and &quot;amateur&quot; book reviews\n\nHere's what the experts say about this book:\n\n&quot;A wealth of ideas for making your book stand out, including many techniques for Internet buzz you won't find elsewhere.&quot;\n\n-- Jane Corn,Top Reviewer\n\n&quot;I spent two years building up skills to market my books Earthcore and Ancestor online, and I can tell you right now that Plug Your Book would have saved me MONTHS of time. I bought this book just to make sure I wasn't missing anything, but it blew me away.&quot;\n\n-- Scott Sigler, # 1 bestselling author\n\n&quot;An amazingly rich collection of cutting-edge promotional tactics and strategies. Makes most other books about online publicity look sickly.&quot;\n\n-- Aaron Shepard, author: Aiming at Amazon\n\n&quot;...The one book every author needs to read. I don't care if you're writing a computer book, a science fiction novel or the next great self-help guide, you need to get copy of Steve Weber's Plug Your Book!&quot;\n\n- Joe Wikert, executive publisher, John Wiley &amp; Sons &quot;Practical, pragmatic, low-cost ideas for promoting the heck out of your own book, whether it's fiction, nonfiction, technical, business or anything else.&quot;\n\n-- Dave Taylor, author: 'Growing Your Business with Google'\n\n&quot;I've worked with most of America's largest book publishers, helping many of them build online marketing departments. I've worked for authors too. Plug Your Book is the new training manual.&quot;\n\n-- Steve O'Keefe, author: 'Publicity on the Internet'\n\n&quot;...Plug Your Book reveals the most effective and least expensive tools to promote your titles and to increase your exposure. It's the best book on online marketing I have ever read, and I read quite a few in the course of my consulting practice with small presses.&quot;\n\n-- Marion Gropen, president, Gropen Associates\n\nHere's what's inside the book:\n\n... Taking control of your book sales; Electric word of mouth; Amazon's `long tail;' Personalized bookstores; Book recommendation effectiveness\n\n... Amazon Bestseller Campaigns; How Bestseller Campaigns work; Haywired recommendations\n\n... Amateur book reviews; Credibility through peers; Amazon Top Reviewers; Negative reviews; Posting trade reviews on Amazon; Fee-based book reviews\n\n... Building your author Web site; A survey of author Web sites; Your online press kit; Multimedia for books; Podcasting for publicity; When to launch your site\n\n... Blogging for authors; Connecting with readers; Blog comments: pros and cons; Blogging categories; Over the long haul; Blog-to-e-mail service\n\n... Social networking; MySpace: Not just for kids; Facebook; Create your own group; Other places on MySpace; More social-networking sites\n\n... Tag - You're it!; Personal book tagging; Amazon tags; Amazon Media Library; LibraryThing; Tag-based marketing\n\n... Advanced Amazon tools; Buy X, Get Y; Free paired placement; Single New Product e-mails; Amazon Connect; Listmania; So You'd Like to . . . guides; Search Inside the Book; Statistically Improbable Phrases; Writing book reviews; Amapedia; Customer discussions; BookSurge; Your Amazon profile","torrent":{"xt":"urn:btih:90d46291c6834eeb224fcf0454ac70913db14eb2","amp;dn":"Plug+Your+Book%21+Online+Book+Marketing+for+Authors+by+Steve+Weber","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90d46291c6834eeb224fcf0454ac70913db14eb2","infoHashBuffer":{"type":"Buffer","data":[144,212,98,145,198,131,78,235,34,79,207,4,84,172,112,145,61,177,78,178]},"announce":[],"urlList":[]}}