{"title":"Mom's Cuckold #11 - Interracial Porn XXX","uid":8973695,"size":2380173407,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:90fb68f16135c6f54f029d7c80f222b21e7c0162&amp;dn=Mom%27s+Cuckold+%2311+-+Interracial+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1380387424,"description":"Moms Cuckold 11: When Dana`s husband brags about his golf game, Dana shows him that the caddy really gets the prize. Eva`s husband can`t control himself when he sees her in sexy lingerie, so Eva calls a friend with some better self-control.Katja convinces her husband to ask the boss for a raise, but she decides to raise something on the boss instead.Krissy`s husband is ordering erection pills online, but all Krissy need is the package in the delivery guy`s pants.\n\n    Scene 1. Dana DeArmond, Nat Turnher\n    Scene 2. Eva Karera, Lexington Steele\n    Scene 3. Katja Kassin, Sean Michaels\n    Scene 4. Krissy Lynn, Prince Yahshua\n\nLength 2 hrs. 2 mins.\nRating XXX\nReleased Mar 05 2013\nProduction Year 2012\nStudio  Reality Junkies\n\nActresses:\n    Dana DeArmond [Facial IR]\n    Eva Karera [Facial IR]\n    Katja Kassin [Facial Swallow IR]\n    Krissy Lynn [Facial IR]\n\nActors:\n    Lexington Steele\n    Nat Turnher\n    Prince Yahshua\n    Sean Michaels\n    \nNonSex Performers:\n    Adam Wood\n    Chad Diamond\n    Filthy Rich\n    Jeremy Conway\n\n The Movie: Mom's Cuckold 11 collects four scenes featuring white wives sick of their wimpy white hubbies not satisfying them and making them watch as they get some big black dick.\n\nMom's Cuckold 11 is a fun little interracial cuckolding release. The action is never nasty, and focuses on the verbal humiliation of the guys as much as the interracial action. The girls do a great job taking the big black cocks, and the guys often make it just as enjoyable. Dana starts things off on a very high note talking down to Filthy as she takes on Nat with plenty of energy and vocals. Jeremy really raises the second scene up with his background pouting as Eva and Lex turn out a hot fuck with plenty of chemistry. I haven't seen much of Katja since her return, but she does a fantastic job as the bitchy wife taking on boss Sean, and Chad also does a great job as the outraged pussy hubby. Finally there's Krissy, who turns out her usual very solid performance taking on Prince and showing off her big beautiful ass. I'm a little surprised that the action didn't mix in any anal or cream pies, but it's still nicely done and can even make for a bit of role playing fun for couples wanting to watch something naughty together. Mom's Cuckold 11 is a hot and fun little interracial fetish release. \n\n","torrent":{"xt":"urn:btih:90fb68f16135c6f54f029d7c80f222b21e7c0162","amp;dn":"Mom%27s+Cuckold+%2311+-+Interracial+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90fb68f16135c6f54f029d7c80f222b21e7c0162","infoHashBuffer":{"type":"Buffer","data":[144,251,104,241,97,53,198,245,79,2,157,124,128,242,34,178,30,124,1,98]},"announce":[],"urlList":[]}}