{"title":"Win XP Pro SP3 Performance Edition Dec.2009 {Sanpork}","uid":5379741,"size":222782021,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:919db6a04465f4be97fd5e8a4ed810a0b7bf4af9&amp;dn=Win+XP+Pro+SP3+Performance+Edition+Dec.2009+%7BSanpork%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sanpork","files":1,"time":1266693416,"description":"&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;\n\n                Win XP Pro SP3 Performance Edition Dec.2009\n\n&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\n\n\n This supports ONLY English Language and ONLY English Keyboard Layouts.\n\nThis is a FULL Install. You CANNOT Upgrade from previous versions of Windows.\n\nThere is no validation required. This PASSES WGA. This works 100% with Windows Update.\nI have included the CD-Key already in the install process. This means at no point will you have to enter it.\nSome people using Macs or Virtual Machines might need the serial. See Serial.txt if you do need it.\nSerial.txt is located in the download folder and in a folder on the disc/iso.\nThis has all windows updates through December 2009. This is has been tested numerous times with no errors.\nThis has minimalist Internet Explorer 6. (Use It To Download Firefox, Opera, Safari, Chrome, Etc)\nThis is the x86 version (32Bit).\n\nI have integrated a few new driver packs this time. I kept all the Sata, Raid, &amp; Mass Storage Drivers from before, but also added Chipset, Lan, and WLan drivers.\nThis is why it is slightly larger in size than the previous releases. I did this because of people previously having such a hard time finding correct network drivers.\nThis way they are now able to connect to the internet and download all the other necessary drivers themselves. You will still probably need to install other drivers\nyourself. Graphics, Sound, Printer, Etc. Unfortunately, the newest driver packs leave behind a little garbage on the main hard drive (Usually C: Drive). You can\nsafely delete everything EXCEPT WINDOWS, Program Files, &amp; Documents and Settings.\n\nUpdates currently work fine and this also currently passes WGA. As a preventative measure, I've also\nincluded Office and Windows WGA Cracks which are in a folder called &quot;TJ&quot; on the disc in case they start blocking the serial number included.\nYou don't need to use these unless you can't get updates, or this is no longer passing WGA.\n\nThis is set to automatically log you in each time you start up. If you want to be prompted for a username and password\nplease see the &quot;TJ&quot; folder on the disc. It contains a registry patch that you can run to have it prompt for username and password again.\nThis folder on the disc also contains numerous other little tweak applications, registry patches, WGA Cracks &amp; More.\nPlease look at it before asking questions.\n\nIn the &quot;TJ&quot; folder on the disc, in the folder called &quot;Registry&quot;, you will see another folder called &quot;Save_Icon_Layout&quot;. Whenever I install\nnew graphics drivers my icons on my desktop get out of place. This little DLL and Reg Patch will help with saving/restoring your Desktop Icon Layout.\nTo Install It: Extract the &quot;LAYOUT.DLL&quot; filder to &quot;Drive:Windowssystem32&quot; folder. Then double click the Reg Patch to apply it.\nNow it should show up as an option when you right click on your My Computer Icon.\n\nI have removed the original Net Framework that ships with XP. It's super old and outdated.\nYou can still download and use a newer version however. Just download the latest version from Microsoft.com or Windows Update.\n\nThe Following has been Removed From This OS...\n\nApplications:\nBriefcase\nGames\nInternet Games\nPinball\nScreensavers\n\nHardware Support:\nATM Support\nBrother Devices\nGravis Digital GamePort\nIomega Zip drive\nMulti-port serial adapters\nRamdisk\nWindows CE USB Host\n\nMultimedia:\nAOL ART Image Format Support\nImages and Backgrounds\nIntel Indeo codecs\nMedia Center\nMouse Cursors...\n\nNetwork:\nClient for Netware Networks\nCommunication tools\nComtrol Test Terminal Program\nConnection Manager\nFrontPage Extensions...\n\nOperating System Options:\nNET Framework\nBlaster/Nachi removal tool\nColor Schemes\nDesktop Cleanup Wizard\nDocument Templates\nDR Watson...\n\nServices:\nApplication Layer Gateway\nError Reporting\nIndexing Service\nMessenger\nNetwork DDE...\n\nDirectories:\nDOCS\nSUPPORT\nVALUEADD\n\nI have disabled and deleted the Classic Windows XP Install Screens with the info about XP and the blue Background.\nYou will just see a black background now and the install will look similar to 2000. This saves Space and gives more\ninfo while installing.\n\nThe Minimum HD and RAM Requirements have been lifted. You can try and install this on whatever machine you like now.\nHigh ISO Compression has been enabled to save space.\n\nPatches:\nTCP/IP Half-Open Connections = Unlimited (Default 10)\nUXTheme Patch (Allows Unsigned Themes to be applied to XP)\nWindows System File Checker Disabled (SFC)\n\nTweaks:\nBoot and Shutdown-Auto-End tasks immediately\nBoot and Shutdown-Auto-Kill hung applications immediately\nBoot and Shutdown-Auto-Kill hung services immediately\nBoot and Shutdown-Ctrl-Alt-Del at logon-Disabled\nBoot and Shutdown-Logon Page-Classic\nBoot and Shutdown-Setup Prefetch-Cache-Applaunch and Boot enabled\nBoot and Shutdown-Status Messages-Extended...\n\nAdditional Features:\nVLK Serial Number\nFirewall Disabled (Can be re-enabled)\nSystem Restore Service Disabled (Can be re-enabled)\nAutomatic Updates Disabled (Can be re-enabled)\nDefault Theme Set on Classic (Can Change to Luna Which is Still Included)\n\nInstall Notes:\n\n1. Unrar the Archive(s) using WinRAR or 7Zip. This will produce an ISO file.\n2. Burn the ISO using a program such as IMGBurn, Nero, Alcohol 120, Blindwrite, ect... (Burn at a slow Speed to ensure no errors, 1x-4x)\n3. Change Bios Priority settings so it boots from the CD-ROM Drive First. (You may be able to skip this step)\n4. Insert Disc and Reboot PC, Follow the on screen prompts and enjoy.\n\n\nNotes:\nIf you are getting errors while copying files. It's your CD, not the release. Try burning it to different brand of cd/media and try burning at the slowest speed possible.\nI just tested this in VMWare and it works flawless. You should get between 16-19 Processes and under 100mb of ram usage when using the computer initially. Everything you install/use will obviously increase this, however its the leanest XP Copy around.\n\n\n----------------------------------------------------------------------------------\n\n\nPLEASE HELP SEEDING.......\n\nDON'T FORGET TO LEAVE YOUR COMMENTS......","torrent":{"xt":"urn:btih:919db6a04465f4be97fd5e8a4ed810a0b7bf4af9","amp;dn":"Win+XP+Pro+SP3+Performance+Edition+Dec.2009+%7BSanpork%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"919db6a04465f4be97fd5e8a4ed810a0b7bf4af9","infoHashBuffer":{"type":"Buffer","data":[145,157,182,160,68,101,244,190,151,253,94,138,78,216,16,160,183,191,74,249]},"announce":[],"urlList":[]}}