{"title":"Dark Voyage - Alan Furst","uid":8511856,"size":270694562,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:92238f5785ca6e6eb5515abb461301fb99130e80&amp;dn=Dark+Voyage+-+Alan+Furst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"abvault","files":9,"time":1369598830,"description":"A new historical espionage thriller by Alan Furst is always cause for celebration, and in his eighth novel, the talented writer who's made a particular time and place his own--Europe on the eve of World War II--takes his fortunate readers aboard the tramp ship Noordendam. Its captain, E.M. DeHaan, is recruited by Dutch Naval Intelligence to smuggle arms and spies past the watchful eyes of the German Navy. Like most of Furst's protagonists, DeHaan is at first a reluctant hero, certain that disguising the Noordendam as a Spanish freighter flying the flag of a neutral nation that won't attract the attention of the Nazi authorities will never work. The plot takes DeHaan, his crew and a handful of passengers that include a refugee family, a beautiful woman, and a mysterious Russian through the dangerous waters of the Mediterranean, the North Sea, and the Baltic. Putting DeHaan ashore in the exotic port cities affords Furst an opportunity to evoke the sights, smells and atmosphere of Alexandria's waterfront alleys, Lisbon's intrigue-filled cafes, and Tangier's shadowy souks, which he does with consummate skill. Maintaining a measured but never lagging pace, Furst takes the Noordendam on its final dangerous voyage past the Baltic Fleet in a tour de force by a writer who's inherited the mantle of Eric Ambler and Graham Greene and wears it as if it had been custom tailored for him. \nUnabridged.\nRead by George Guidall.\n\n------------------------------\nVisit us for this and more. Book requests can also be made through the site:\n\nwww.audiobookvault.ws\n------------------------------\n\n","torrent":{"xt":"urn:btih:92238f5785ca6e6eb5515abb461301fb99130e80","amp;dn":"Dark+Voyage+-+Alan+Furst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92238f5785ca6e6eb5515abb461301fb99130e80","infoHashBuffer":{"type":"Buffer","data":[146,35,143,87,133,202,110,110,181,81,90,187,70,19,1,251,153,19,14,128]},"announce":[],"urlList":[]}}