{"title":"Stealing The Network - How To Own A Shadow.pdf Gooner","uid":11676260,"size":9570109,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9316f86d338f5809a7cf295fb2a4e248dfd06686&amp;dn=Stealing+The+Network+-+How+To+Own+A+Shadow.pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1422888036,"description":"Publisher: Syngress (1 Jan. 2007)\nLanguage: English\nISBN-10: 1597490814\nISBN-13: 978-1597490818\n\nThe best-selling Stealing the Network series reaches its climactic conclusion as law enforcement and organized crime form a high-tech web in an attempt to bring down the shadowy hacker-villain known as Knuth in the most technically sophisticated Stealing book yet. Stealing the Network: How to Own a Shadow is the final book in Syngress' ground breaking, best-selling, Stealing the Network series. As with previous title, How to Own a Shadow is a fictional story that demonstrates accurate, highly detailed scenarios of computer intrusions and counter-strikes. In How to Own a Thief, Knuth, the master-mind, shadowy figure from previous books, is tracked across the world and the Web by cyber adversaries with skill to match his own. Readers will be amazed at how Knuth, Law Enforcement, and Organized crime twist and torque everything from game stations, printers and fax machines to service provider class switches and routers steal, deceive, and obfuscate. From physical security to open source information gathering, Stealing the Network: How to Own a Shadow will entertain and educate the reader on every page. The book's companion Web site will also provide special, behind-the-scenes details and hacks for the reader to join in the chase for Knuth.\n\nAbout the Author\n\nJohnny Long is a Christian by grace, a professional hacker by trade, a pirate by blood, a ninja in training, a security researcher and author. He can be found lurking at his website (http://johnny.ihackstuff.com). He is the founder of Hackers For Charity(http://ihackcharities.org), an organization that provides hackers with job experience while leveraging their skills for charities that need those skills","torrent":{"xt":"urn:btih:9316f86d338f5809a7cf295fb2a4e248dfd06686","amp;dn":"Stealing+The+Network+-+How+To+Own+A+Shadow.pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9316f86d338f5809a7cf295fb2a4e248dfd06686","infoHashBuffer":{"type":"Buffer","data":[147,22,248,109,51,143,88,9,167,207,41,95,178,164,226,72,223,208,102,134]},"announce":[],"urlList":[]}}