{"title":"NHL 07","uid":3523687,"size":2056605244,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:9399a08627ae7939980989942dfeae38600cb7d9&amp;dn=NHL+07&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Sunblock","files":44,"time":1158181642,"description":"The  golden era of hockey videogames is back with NHL 07 brought to you by EA\n SPORTS  brand of the best-selling hockey videogame. Console hockey now rivals\n its  counterpart  on  the  ice  with  an unmatched level freedom and control.\n              \n NHL  07  puts  you  in  total  command  with  a revolutionary new Skill Stick\n system.  Never  take  your  hands  off the analog sticks as you take complete\n control  of  all  skating  on  the left, and - for the first time in a hockey\n videogame  -  passing  will use an intuitive motion on the right analog stick\n to execute with precision.\n              \n Feel  like  a  part  of the team with a level of passing fluidity that allows\n you  to  implement a realistic team strategy. Look to your teammates and know\n how  to best use their strengths with New Player-Specific Behaviors. Play the\n game  like  you  do on the ice: Be the Playmaker and find your Sniper open in\n the   slot,   or   let   your   Dangler  make  pylons  out  of  the  defense.\n              \n Off  the  ice,  act  as  the  General Manager in an enhanced Dynasty Mode. Do\n whatever  it  takes  to  meet  an  owner&amp;#039;s  expectations by properly managing\n rosters  and  using your creativity to fit player salaries under the new cap.\n Whether  you&amp;#039;re  running  the  front office or dominating the rink, NHL 07 is\n the   most   intuitive   and   realistic   hockey  experience  ever  created.","torrent":{"xt":"urn:btih:9399a08627ae7939980989942dfeae38600cb7d9","amp;dn":"NHL+07","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9399a08627ae7939980989942dfeae38600cb7d9","infoHashBuffer":{"type":"Buffer","data":[147,153,160,134,39,174,121,57,152,9,137,148,45,254,174,56,96,12,183,217]},"announce":[],"urlList":[]}}