{"title":"Renaissance - The Mix Collection (With Sasha and John Digweed) (","uid":4218491,"size":542436032,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93ace21bcb67387d186e83eaba214a5465384412&amp;dn=Renaissance+-+The+Mix+Collection+%28With+Sasha+and+John+Digweed%29+%28&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":7,"uploader":"bigsimon","files":57,"time":1212472344,"description":"Music : Dance / Disco : MP3/Over 256Kbps\n\n\n\n\n\n\n\n\nRenaissance - The Mix Collection (With Sasha and John Digweed) (1994) (MP3-EAC-320 kBs)\n\n\n\n\n\n\n\n\nSasha and John Digweed biography\n\n\n\nBiography by Jason Birchmeier\n\nBy the end of the 1990s, Sasha and John Digweed had become two of the most recognized DJs in the world. A widespread interest in a style of up-tempo electronic music laden in synth melodies and pumping beats known as trance (or less frequently as progressive trance) propelled the British DJs to worldwide fame along with peers such as Paul Van Dyk and Paul Oakenfold. As trance began to hit its peak, both DJs began to diversify their track selection in an effort to avoid being pigeonholed as specifically trance DJs. Whereas their early mix CDs defined the sound of trance for the mid-&amp;#039;90s, they soon took the position as two of the genre&amp;#039;s leaders, continually focusing on the latest records and evolving sounds of producers such as Breeder while staying true to their musical roots.\n\nBefore they became pinups for the trance generation, the two had already been successful DJs and -- to a lesser degree -- producers. Their famed partnership began in 1993 while both were spinning at the Manchester club Renaissance. As the two DJs began to hone their mixing and improve their track selections, increasing numbers of clubbers began to spread the word about the duo&amp;#039;s music. Sasha + Digweed released a mix album titled Renaissance in 1994 and began their steady rise to fame. It wasn&amp;#039;t until the 1996 release of Northern Exposure that Sasha + Digweed began to truly be acknowledged as superstar DJs. The album&amp;#039;s success led to several increasingly successful sequels (Expeditions, Communicate) that defined the sound of trance in the late &amp;#039;90s, paralleling the Global Underground and Tranceport series in terms of popularity.\n\nIn the late &amp;#039;90s, the two DJs began their invasion of the U.S. with a high-profile monthly residency at Twilo in New York City, along with more mix CDs as individuals. In addition to the residency, the duo sporadically toured the U.S. and found themselves the topic of many articles and cover stories in magazines such as Urb and Mixer. An extensive tour of the U.S. in 2000 to support Communicate only solidified their status as two of the most loved (and despised) DJs in the world.\n\nAs if their reputation as the world&amp;#039;s most famous tag-teaming DJs wasn&amp;#039;t enough, Sasha + Digweed also produce their own music and are recognized as prized remixers. Sasha&amp;#039;s Xpander EP showcased his knack for creating some of the best trance epics the genre has ever seen, while his remix of the Chemical Brothers&amp;#039; &quot;Out of Control&quot; re-established his role as a talented remixer. Similarly, Digweed occasionally produces music as Bedrock, scoring an enormous hit with his anthem &quot;Heaven Scent.&quot;\n\nWhile the two DJs increasingly focused on production and retaining their status as superstars, they slowly began to drift apart, appearing less frequently as a duo. Sasha continued work on a long-awaited solo album, and Digweed focused on his Bedrock club night in the U.K.\n\n\n\n\n\n\nAlbum reviews and comments from discog.com\n\n\n\n\n\nmanchester - 18-Sep-05 02:43 PM\n\nTHE seminal DJ mix compilation that thousands of imitators have tried to copy but never came close. For me this was when Progressive House peaked. It was music that rocked and was banging but at the same time it had funk, it had soul and it had a great musical variation. Sadly in my opinion these two DJs never matched these heights again and went more and more up their own arses, along with the scene that spawned them. Infact Progressive house became so dull it needed exterminating, full of epic/sweeping/tribal nonsense. But let&amp;#039;s not forget what a great mix CD this is and it definitely will go down as one of the greatest compilations in dance music. It&amp;#039;s that good that it can convert the unconvertable &amp; it still rocks and moves people today. A tremendous, diverse and not obvious choice of tunes, beautifully &amp; seamless mixed. Infact the thought and preparation that went into this whole package was incredible and it deserves all the accolades it receives. Mixmag even included it in their top 50 dance albums of all time along with greats such as Massive Attack, Leftfield, Public Enemy, Bjork etc, even though strictly speaking it&amp;#039;s not an album at all. This compilation proves more than anything that banging, pumping dance/club music can be as interesting and varied as any other musical genre &amp; still sound so beautiful in a living room as it does in a club.\n\n\nTheGlynja - 10-Feb-06 02:32 AM\n\nProbably the best mix CD I&amp;#039;ve ever heard. Three mixes of Leftfield&amp;#039;s &quot;Song of Life&quot; in a row? Inspired. It also includes one of my favourite tracks of all time (Moonchild&amp;#039;s &quot;Variations on a Theme&quot;). If house music ever had to be represented by one album alone, I would choose this as the ambassador. Sublime stuff. Get it, buy it, steal it, rip it if you don&amp;#039;t have it already.\n\n\nbell-end - 03-May-06 02:32 PM\n\nAn important point to be made about this release...\nWhilst I am well and truly in agreement that this was a ground-breaking compilation,it is perhaps hasty to praise the mixing as so many do.Yes - the sequencing of the tracks featured within should be praised and Sasha &amp; Digweed credited accordingly,but the mixing was all done digitally.\nThis was discovered by a friend of mine who,like many (myself included prior to that point),pondered the question of which DJ mixed which cd.When questioned in the toilets of the Rhumba club in Perth,John Digweed replied that nobody did a particular mix, IT WAS ALL DONE DIGITALLY.\n\n\nborris78 - 19-Oct-06 11:30 PM\n\nAs another poster stated, this is the definitive dance music DJ mix CD. It must also rank within the top 5-10 dance music albums of all time. It has everything: rhythm, soul, energy, and beautifully programmed by Sasha and Digweed. It really is a special album, legendry even, and it kick-started the DJ mix series and none have truly matched this since. One of my friends borrowed this off me and subsequently lost it, forcing mew to buy it again for three times the original price off eBay!!\n\n\nsy1975 - 21-Dec-06 12:33 AM\n\nThe album that got me into house music. Seminal track listing, amazing programming and mixing, excellent tunes. The true sound of Renaissance, the true sound of Sasha &amp; Digweed. What struck me about this legendary mix was that the tracks used, were the tracks on the bootleg mixtapes from the era, Sasha &amp; Digweed did not compromise at all musically or professionally. Not only that it was well presented and packaged, if I remember the original CD&amp;#039;s were over Â£20, so at the time it was quite expensive but worth every penny. I will be listening to this mix in 20 years time, it really is and was a defining moment in what we call house music.\n\n\n\n\n\n\nCD Pressing Information\n\n\n\nLabel: Renaissance\nCatalog#: RENMIX1CD\nFormat: 3 x CD, Mixed\nCountry: UK\nReleased: 14 Oct 1994\nGenre: Electronic\nStyle: Progressive House, Progressive Trance\n\n\nCredits:\n\nDJ Mix - Sasha &amp; John Digweed\n\n\nNotes:\n\n3-05 was originally credited to artist Sublime, which is an alias of Havana. The track was called &quot;The Theme.&quot; This is verifiable throughout the database.\n\n\n\n\n\n\n\nTrack List\n\n\n\n\nSasha &amp; John Digweed - Renaissance: The Mix Collection - CD1 (1994)\n\n\n01. Leftfield - Song For Life (Lemon Interupt Mix) 05:26\n02. Leftfield - Song For Life (Dub For Life Mix) 04:02\n03. Leftfield - Song For Life (Steppin Razor Mix) 02:16\n04. Bedrock - For What You Dream (Full On Renaissance Mix) 06:19\n05. Rhythm Invention - Chronoclasm 02:37\n06. Disco Evangelists - De Niro (Spaceflight Remix) 06:06\n07. Memphisto - State Of Mind (Quite Mix) 01:43\n08. Moonchild - V.O.A.T. (Original Mix) 05:28\n09. Sunscreem - Perfect Motion (Boys Own Mix) 10:09\n10. River Ocean - Love &amp; Happiness (Junior Boys Own Super Dub) 04:27\n11. That Kid Chris - Keep On Pressin&amp;#039; On (Didn&amp;#039;t I Show You Luv Mix) 05:48\n12. Remake Inner City - Bladerunner &amp;#039;Til We Meet Again (Brothers In Rhythm Perkappella) 04:24\n13. Bump - House Stompin&amp;#039; (Big Bump Mix) 07:02\n14. F.Machine - Child Bride (Feedback Mad Mix) 04:28\n15. M-People - Rennaissance (John Digweeds Full On Mix) 07:41\n\n\n\n\n\n\nSasha &amp; John Digweed - Renaissance: The Mix Collection - CD2 (1994)\n\n\n01. Fluke - Slide (PDF Mix) 04:43\n02. Funk Machine - Lets Get This Party Started (Party Mix) 05:20\n03. Fluke - Slide (Scat &amp; Frenzy) 05:01\n04. Corrado - Trust (Pink Mix) 05:03\n05. DjMBG - Trance 1 (Oriental Psycho Estmix) 02:01\n06. Hysterix - Talk To Me (Sasha`s Full Master Mix) 06:59\n07. Annadin - Angel 07:23\n08. Virtualmismo - Mismoplastico (Dirtysyncomix) 03:29\n09. Virtualmismo - Mismoplastico (Original Remix) 05:31\n10. Fishbone Beat - Always (Psychedelic Martini Mix) 03:39\n11. State Of Grace - Not Over Yet (Perfecto Mix) 05:48\n12. Secret Life - She Holds The Key (HALE I`m a Believer Mix) 04:15\n13. Funtopia - Do You Wanna Know (Drum Cut Mix) 05:07\n14. V.F.R. - Trancellusion (Original Mix) 03:16\n15. Kym Mazelle - Was That All It Was (Def Mix) 07:07\n\n\n\n\n\n\nSasha &amp; John Digweed - Renaissance: The Mix Collection - CD3 (1994)\n\n\n01. M-People - How Can I Love You More (QAT Mix) 07:20\n02. Moby - Go (Nightime Mix) 05:19\n03. Jaco - Show Some Love (Original Dub) 06:38\n04. Spooky - Little Bullet (High Velocity Mix) 06:20\n05. Havana - Sublime Theme (Dub) 03:48\n06. Shawn Christopher - Another Sleepless Night (Bassman Mix) 04:17\n07. Unity 3 - Age Of Love (Trance Dub &amp; Fantasy Mix) 04:48\n08. EMF - They&amp;#039;re Here (D-Ream Dream) 06:10\n09. Solar Plexus - Solar Plexus 03:31\n10. Havana - Ethic Prayer (Euro Mix) 05:32\n11. 2 Bad Mice - Bombscare 03:32\n12. Age Of Love - Age Of Love (Watch Out For Stella Mix) 06:14\n13. My Friend Sam Feat. Viola Wills - It&amp;#039;s My Pleasure (Club Mix) 05:24\n14. Lemon Interupt - Dirty 04:03\n\n\n\n\n\n\n\n\nENJOY .......................................................................... \n\n\n\n","torrent":{"xt":"urn:btih:93ace21bcb67387d186e83eaba214a5465384412","amp;dn":"Renaissance+-+The+Mix+Collection+%28With+Sasha+and+John+Digweed%29+%28","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ace21bcb67387d186e83eaba214a5465384412","infoHashBuffer":{"type":"Buffer","data":[147,172,226,27,203,103,56,125,24,110,131,234,186,33,74,84,101,56,68,18]},"announce":[],"urlList":[]}}