{"title":"Korn - Untouchables (2002) WMA320","uid":6264464,"size":162694836,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:93ed839e740f8abb52d93aa9cd298abc7db217c1&amp;dn=Korn+-+Untouchables+%282002%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300862480,"description":"Is it possible for a C.D. to be over-hyped and underrated? \n\nFollowing a three year break with no new material from Korn, &quot;Untouchables&quot; became one of the most highly anticipated releases of 2002. Plus, the band members couldn't keep their mouths shut about the new album, saying it was one of the best things they've ever done. But, after hearing Korn's fifth album, I still prefer their self-titled debut and &quot;Follow the Leader&quot; over this. So, &quot;Untouchables&quot; was a bit over-hyped, but it was also simultaneously underrated, because the general response to it was disappointment. Plus, even though it sold 700,000 copies in its first week of being on the shelves, &quot;Untouchables&quot; just barely managed to gain platinum certification. Many fans thought it sounded over-produced and was too &quot;poppy.&quot; Why must a new sound always mean the band sold out? \n\nI have a different word for this album: creative. Michael Beinhorn, a virtuoso producer, makes &quot;Untouchables&quot; have *gasp* a new sound. This C.D. sounds robust, and it sometimes seems like it was recorded in a ten pound drum. Korn have been criticized for making the same album again and again, so they change their sound for their fifth album, and what happens? Some people STILL criticize them. Another problem with this album is that it didn't translate well live. That's why Korn quickly followed up this album with 2003's &quot;Take A Look in the Mirror.&quot; \n\nAnd even though it has some big choruses, well thought-out songs, and even a soft song (&quot;Alone I Break&quot; is the closest thing to a ballad Korn have ever written; Jonathan Davis sings clearly and properly over a digitized beat and Blue Man Group-esque drums,) the majority of this album is very heavy. In addition to this album's production making it have a harder edge, &quot;Untouchables&quot; has heavier songwriting and a rhythm section which pounds harder and more profusely. Upon first time listening to the opening track, &quot;Here to Stay&quot; seems super heavy, especially for a Korn song. It begins with grinding guitars, which, for the first ten seconds, are only audible in one headphone. Then, after the song explodes with thunderous guitars and drums, Jonathan begins his heartfelt and tortured lyrics-lyrics which have become typical of him. This, the only song from this album that Korn would play on tour, is a personal favorite also because of the mosh-worthy bridge (&quot;Bring it on down!&quot;) Next, an onslaught of extra crunchy guitars and almost death metal vocals (with an echo effect) make &quot;Embrace&quot; one of the heaviest songs Korn have ever written. Other highlights include the grinding, churning guitar noise on &quot;Bottled Up Inside,&quot; the third and final single, &quot;Thoughtless&quot; (which features a guitar that could be a vacuum cleaner, making a &quot;vroom&quot; sound run through it), the vocal harmonizer on &quot;Beat it Upright&quot; (a song about an explicit sexual fantasy, involving the rumor that Jonathan was gay), and &quot;Wake Up Hate&quot; (another exciting, mosh-ready song which is speedy, bouncy and flows very well). \n\nIt may take some Korn fans a while to fully appreciate this album. Listeners should immediately notice the pounding rhythms and the hip-hop free vocals, but it may take most listeners a while to hear and absorb the subtle creativeness (such as the vocal synthesizer). Also, some fans might not think &quot;Untouchables&quot; sounds at all different from any of their past albums. This is clearly a Korn album; aside from no hip-hop stylings, all of the patented Korn ingredients are here (mainly downtuned guitar rumbles and pained poetry.) But if you listen to Korn's raw debut, then come back to this, you'll realize the two albums sound like completely different bands. \n\nTo conclude, &quot;Untouchables&quot; was a bit over-hyped (because it is not Korn's best album), but it was also underrated (because some fans were disappointed with it). This C.D. is a must buy for all Korn and nu-metal fans, and, even if you're not a Korn fan, I recommend you check it out (because these songs are, as aforementioned, heavier than most Korn tunes.) The truth is that this is Korn's heaviest and most creative disc to date, and it has my vote for the best hard rock and alt metal album of 2002.\n\nby A. Stutheit &quot;Teyad&quot;\n\nTRACKLIST:\n\n01 - Here To Stay.wma                                            \n02 - Make Believe.wma                                            \n03 - Blame.wma                                                   \n04 - Hollow Life.wma                                             \n05 - Bottled Up Inside.wma                                       \n06 - Thoughtless.wma                                             \n07 - Hating.wma                                                  \n08 - One More Time.wma                                           \n09 - Alone I Break.wma                                           \n10 - Embrace.wma                                                 \n11 - Beat It Upright.wma                                         \n12 - Wake Up Hate.wma                                            \n13 - I'm Hiding.wma                                              \n14 - No One's There.wma                                          \n15 - Here To Stay (T Ray's Mix).wma \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:93ed839e740f8abb52d93aa9cd298abc7db217c1","amp;dn":"Korn+-+Untouchables+%282002%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ed839e740f8abb52d93aa9cd298abc7db217c1","infoHashBuffer":{"type":"Buffer","data":[147,237,131,158,116,15,138,187,82,217,58,169,205,41,138,188,125,178,23,193]},"announce":[],"urlList":[]}}