{"title":"The Jackson 5 - I Want You Back","uid":4983917,"size":108638212,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:93ffa233b1217f07fef4c8cd96177d6ce52c41c2&amp;dn=The+Jackson+5+-+I+Want+You+Back&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"2nafish","files":-1,"time":1246515749,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 Kb/s\nAudio: Dolby Digital, 48000 Hz, Stereo, 256 kbps\n\n\n&quot;I Want You Back&quot; is a 1969 number-one single recorded by The Jackson 5 for the Motown label. The song, backed with a cover of Smokey Robinson &amp; the Miracles' &quot;Who's Lovin' You,&quot; was the only single from the first Jackson 5 album, Diana Ross Presents the Jackson 5. It held the number-one position on the Billboard Hot 100 singles chart for the week of January 31, 1970. It has sold 6 million copies worldwide. In 1999, &quot;I Want You Back&quot; was also inducted in Grammy Hall of Fame.\n\n&quot;I Want You Back&quot; ranks number 120 on Rolling Stone's list of the '500 Greatest Songs of All Time'. It also ranks ninth on Rolling Stone's list of the '100 Greatest Pop Songs since 1963'. In 2006, Pitchfork Media named it the second best song of the 1960s, adding that the chorus contains &quot;possibly the best chord progression in pop music history.&quot; A June 2009 article by The Daily Telegraph called it arguably the best pop music single of all time.\n\nOriginally considered for Gladys Knight &amp; the Pips and later for Diana Ross, as &quot;I Wanna Be Free,&quot; &quot;I Want You Back&quot; explores the theme of a lover who decides that he was too hasty in dropping his partner. An unusual aspect about &quot;I Want You Back&quot; was that its main lead vocal was performed by a preteen, Michael Jackson.\n\nThe single was a notable first in many respects: it was the first Jackson 5 single to be released on Motown, the first of four Jackson 5 number-ones released in a row (the others are &quot;ABC&quot;, &quot;The Love You Save&quot;, and &quot;I'll Be There&quot;), and the first song written and produced by The Corporation, a team comprising Motown chief Berry Gordy, Freddie Perren, Alphonzo Mizell, and Deke Richards.\n\n&quot;I Want You Back&quot; was also the first Jackson 5 song recorded in Los Angeles, California; the quintet had previously been recording Bobby Taylor-produced covers, including &quot;Who's Lovin' You&quot;, the b-side to &quot;I Want You Back&quot;, at Hitsville U.S.A. in Detroit, Michigan.\n\nAlthough Gladys Knight and Bobby Taylor of the Vancouvers had been the ones to bring the Jackson brothers to Motown, Motown credited Ross with discovering them, not only to help promote the Jackson 5, but also to help ease Ross' transition into a solo career. A career began soon after the Jackson 5 became a success.\n\nThe Jackson 5 performed &quot;I Want You Back,&quot; along with Sly &amp; the Family Stone's &quot;Sing a Simple Song,&quot; The Delfonics' &quot;Can You Remember,&quot; and James Brown's &quot;There Was a Time&quot; during their first television appearance on The Hollywood Palace in an episode hosted by Diana Ross &amp; the Supremes.\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:93ffa233b1217f07fef4c8cd96177d6ce52c41c2","amp;dn":"The+Jackson+5+-+I+Want+You+Back","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93ffa233b1217f07fef4c8cd96177d6ce52c41c2","infoHashBuffer":{"type":"Buffer","data":[147,255,162,51,177,33,127,7,254,244,200,205,150,23,125,108,229,44,65,194]},"announce":[],"urlList":[]}}