{"title":"Sander L. Gilman - Franz Kafka (Critical Lives, 2005)","uid":8706462,"size":832528,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:947f2d3dd6f5c93815aa86ca5972aaed86151638&amp;dn=Sander+L.+Gilman+-+Franz+Kafka+%28Critical+Lives%2C+2005%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"workerbee","files":-1,"time":1374157301,"description":"Sander L. Gilman - Franz Kafka (Critical Lives Series) (Reaktion, 2005).\n\nISBN: 9781861892546 | 160 pages | PDF\n\n\nThe conflation of reality and the fantastic, ambiguity, the relentless confrontation with horror, the fractured sense of identity: Franz Kafka created a wholly unique and enduring worldview through his literature and life, and he remains one of the central intellectual and cultural figures of our time. Sander L. Gilman brings together Kafka's literary works, personal writings, and biography to create a compelling and wholly accessible narrative of the literary master's life.\n\nGilman focuses on the relationship between Kafka's life and work, reconstructing both Kafka's cultural environment and the writer's conceptual understanding of his own body. Kafka's letters, diaries, and writings emerge in Gilman's analysis as windows into his ongoing attempt to create an identity in a world where being a Central European Jew dictated an uneasy fate. \n\nThe volume emphasizesÂ in particular the image and role of the Jew in Kafka's modern world and how Kafka responded to prevailing attitudes, repressive actions, and stereotypes in society at large. Gilman also examines the influence of psychoanalytic ideas on Kafka and his works, exploring how Kafka wove such psychoanalytic experiences into his literature. Gilman concludes with consideration of the &quot;Kafka-myth&quot; and the wealth of material emerging from it over the past eighty years, including work by such illustrious minds as Walter Benjamin and Ted Hughes.\n\nFranz Kafka features illuminating archival photographs and illustrations as well as a comprehensive bibliography and filmography of work by and about Kafka. This succinct yet penetrating volume offers valuable and original insight into how Kafka's life and work shaped how we perceive our modern society and how,Â indeed,Â some aspect of the world is always &quot;Kafkaesque.&quot;\n","torrent":{"xt":"urn:btih:947f2d3dd6f5c93815aa86ca5972aaed86151638","amp;dn":"Sander+L.+Gilman+-+Franz+Kafka+%28Critical+Lives%2C+2005%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"947f2d3dd6f5c93815aa86ca5972aaed86151638","infoHashBuffer":{"type":"Buffer","data":[148,127,45,61,214,245,201,56,21,170,134,202,89,114,170,237,134,21,22,56]},"announce":[],"urlList":[]}}