{"title":"[FSX/P3D] Bear Studios MiG-15 SP5","uid":10787707,"size":89689186,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:94a6e34242e79c08b7c23289d72f8ff6e440bffd&amp;dn=%5BFSX%2FP3D%5D+Bear+Studios+MiG-15+SP5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"leopard87","files":1,"time":1408222545,"description":"This is Bear Studios MiG-15 SP5 for you pirates, which is the newest version of this aircraft.\n\nAccording to Bear Studios, this works in both FSX and P3D. When they say P3D, they probably mean P3D v1 as P3D v2 was not even present when this update was released. While the aircraft works just fine in FSX, I haven't been able to test in P3D, so I can't give you any guarantee for P3D compatibility. Try the P3D modes in my installer at your own risk.\n\nUnfortunately, I haven't been able to find the FS9 version of this aircraft anywhere on the internet. Sorry for that, guys.\n\nDo NOT forget to uninstall ANY other version of Bear Studios MiG-15 installed in FSX/P3D on your computer BEFORE installing this package.\n\nI'm NOT interested in this aircraft. I'm just sharing it for those who have been looking for the most up-to-date version of this aircraft. Please SEED if you like this package.\n\n\nNOTE: The gauges DO work, but only after toggling some switches (Hint: Check the switches on the right side of the cockpit). Refer to the manual for more information.\n\nEnjoy!","torrent":{"xt":"urn:btih:94a6e34242e79c08b7c23289d72f8ff6e440bffd","amp;dn":"%5BFSX%2FP3D%5D+Bear+Studios+MiG-15+SP5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94a6e34242e79c08b7c23289d72f8ff6e440bffd","infoHashBuffer":{"type":"Buffer","data":[148,166,227,66,66,231,156,8,183,194,50,137,215,47,143,246,228,64,191,253]},"announce":[],"urlList":[]}}