{"title":"Lonely Planet Kyoto City Guide (pdf)","uid":4288407,"size":84402353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94bd18c9857fef189e6e5564f0b6da4de2c99a05&amp;dn=Lonely+Planet+Kyoto+City+Guide+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"phr3d0m2gr0","files":1,"time":1215816913,"description":"Lonely Planet Kyoto City Guide\n\nAmazon Rating: 2.5 stars\n\nReview:\n\n&quot;The major highlights of this book include:\n- Great walking tours\n- Fun listings of out of the way places\n- Interesting history and background\n- Good tips and recommendations for everything from getting around on the subway (complete with a handy map), to reliable restaurant recommendations.\n- Restaurant &amp; place names written in Japanese in the book. Even if you don't read Japanese, this was very handy for doing symbol comparison to make sure you were in the right place.\n\nLonely Planet guides are really excellent for helping you see the sights that not everyone else is seeing, and to help you get more out of the culture you are visiting. The authors have a good sense of humor and seem to aim towards a slightly more liberal and adventurous audience.\n\nOn their own, I found both the guide and the maps very helpful (although I do agree with the other reviewers that the varied orientation and scaling of the maps could occasionally be disorienting). However, when attempting to cross reference these I often got frustrated. Many of the references to maps in the guide were just wrong (wrong map listed), and many things just weren't on the maps. Similarly, many things on the maps were difficult or impossible to locate in the guide. Example: &quot;We need to find a restaurant near were we are right now. Oh look, here's one a block away. I wonder what type of food they have?....&lt;begin leafing through the guide to find the restaurant listed&gt;... Hmmm...I can't find it....&quot; I know Lonely Planet knows how to do this effectively (see the Condensed guide to Tokyo as an example), it was just frustrating that they did not apply that knowledge to this book. &quot;\n\nThis is the second book torrent for me. I might have one more tokyo city guide and then I'll be done for now, unless anyone has a request.\n\n-Phr3\n\nMore torrents at:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/phr3d0m2gr0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/phr3d0m2gr0&lt;/a&gt;","torrent":{"xt":"urn:btih:94bd18c9857fef189e6e5564f0b6da4de2c99a05","amp;dn":"Lonely+Planet+Kyoto+City+Guide+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94bd18c9857fef189e6e5564f0b6da4de2c99a05","infoHashBuffer":{"type":"Buffer","data":[148,189,24,201,133,127,239,24,158,110,85,100,240,182,218,77,226,201,154,5]},"announce":[],"urlList":[]}}