{"title":"International Classification of Diseases for Oncology, 3E Rev. [","uid":10892646,"size":3667370,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:94edca6abba995e8b0feb0401c601c9be18a7fc6&amp;dn=International+Classification+of+Diseases+for+Oncology%2C+3E+Rev.+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":2,"time":1409099038,"description":"Author: World Health Organization \nSeries: Nonserial Publications\nPaperback: 250 pages\nPublisher: World Health Organization; 2012 Revision edition (March 2014)\nLanguage: English\nISBN-10: 9241548495\nISBN-13: 978-9241548496\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n__________________________________________________________________________________\n\n\nThe International Classification of Diseases for Oncology (ICD-O) has been used for nearly 25 years as the standard tool for coding diagnoses of neoplasms in tumor and cancer registrars and in pathology laboratories. ICD-O is a dual classification with coding systems for both topography and morphology. The topography code describes the site of origin of the neoplasm and uses the same 3-character and 4-character categories as in the neoplasm section of Chapter II, ICD-10. The morphology code describes the characteristics of the tumor itself, including its cell type and biologic activity.\n\nIn preparing this revised edition, the editors have made a special effort to change as few terms as possible, to add new terms at empty spaces, and to avoid reuse of previously assigned codes. While all topography codes remain the same as in the previous edition, morphology codes have been thoroughly reviewed and, where necessary, revised to increase their diagnostic precision and prognostic value.","torrent":{"xt":"urn:btih:94edca6abba995e8b0feb0401c601c9be18a7fc6","amp;dn":"International+Classification+of+Diseases+for+Oncology%2C+3E+Rev.+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94edca6abba995e8b0feb0401c601c9be18a7fc6","infoHashBuffer":{"type":"Buffer","data":[148,237,202,106,187,169,149,232,176,254,176,64,28,96,28,155,225,138,127,198]},"announce":[],"urlList":[]}}