{"title":"The Speed Of Dark by Elizabeth Moon eBook Mobi Kindle Palm","uid":5053814,"size":491625,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:951c25af074221f10ccdb5358b5f9cd77034ae7d&amp;dn=The+Speed+Of+Dark+by+Elizabeth+Moon+eBook+Mobi+Kindle+Palm&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"phxphun1","files":1,"time":1250299297,"description":"eBook of The Speed Of Dark by Elizabeth Moon in MOBI format for Kindle, Palm, and others.\n\n&quot;If I had not been what I am, what would I have been?&quot; wonders Lou Arrendale, the autistic hero of Moon's compelling exploration of the concept of &quot;normalcy&quot; and what might happen when medical science attains the knowledge to &quot;cure&quot; adult autism. Arrendale narrates most of this book in a poignant earnestness that verges on the philosophical and showcases Moon's gift for characterization. The occasional third-person interjections from supporting characters are almost intrusive, although they supply needed data regarding subplots. At 35, Arrendale is a bioinformatics specialist who has a gift for pattern analysis and an ability to function well in both &quot;normal&quot; and &quot;autistic&quot; worlds. When the pharmaceutical company he works for recommends that all the autistic employees on staff undergo an experimental procedure that will basically alter their brains, his neatly ordered world shatters. All his life he has been taught &quot;act normal, and you will be normal enough&quot;-something that has enabled him to survive, but as he struggles to decide what to do, the violent behavior of a &quot;normal friend&quot; puts him in danger and rocks his faith in the normal world. He struggles to decide whether the treatment will help or destroy his sense of self. Is autism a disease or just another way of being? He is haunted by the &quot;speed of dark&quot; as he proceeds with his mesmerizing quest for self-&quot;Not knowing arrives before knowing; the future arrives before the present. From this moment, past and future are the same in different directions, but I am going that way and not this way.... When I get there, the speed of light and the speed of dark will be the same.&quot; His decision will touch even the most jaded &quot;normal.&quot;","torrent":{"xt":"urn:btih:951c25af074221f10ccdb5358b5f9cd77034ae7d","amp;dn":"The+Speed+Of+Dark+by+Elizabeth+Moon+eBook+Mobi+Kindle+Palm","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"951c25af074221f10ccdb5358b5f9cd77034ae7d","infoHashBuffer":{"type":"Buffer","data":[149,28,37,175,7,66,33,241,12,205,181,53,139,95,156,215,112,52,174,125]},"announce":[],"urlList":[]}}