{"title":"THE BEATLES - Vidthology NEW UPGRADE! 171 Vintage STEREO Videos","uid":9770595,"size":4254057965,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9521b6d6bd412147ef8a6e13cb33ae234797dbdf&amp;dn=THE+BEATLES+-+Vidthology+NEW+UPGRADE%21+171+Vintage+STEREO+Videos&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"grp777","files":174,"time":1394944322,"description":"For those who have already downloaded this epic video collection 4 days ago, please download this NEW UPGRADED collection here in which I REPLACED all the mono videos with REMASTERED STEREO audio tracks from the original recordings! There are only about 2 or 3 videos in mono, the rest are all in STEREO! I replaced 107 out of 171 total videos. I spent 16 hours a day for many days with a friend of mine who is a master at video and audio editing. We went through each video to make sure we had the absolute best there is! We removed all the live audio from my previous torrent that had screaming and terrible sound in mono and replaced them all with remastered stereo recordings from the original recordings. We were able to line up the lip synced videos to the new remastered audio tracks! We also removed any videos that didn't line up with the singing. We replaced many moving picture videos with some AWESOME professional video editing, as good as any video producer can create. We even added some very cool and exciting psychedelic videos to songs like Blue Jay Way, I Want You, Everybody's Got Something To Hide, Glass Onion, Tomorrow Never Knows, Lucy In The Sky With Diamonds and much more! By watching these videos, you think Apple produced them, but they didn't. I even took this epic collection of videos to a serious Beatle collector who was very impressed and said it was &quot;THE BEST&quot; Beatle collection he had ever seen!!!! I think you will agree after viewing this NEW UPGRADED collection. You can delete the previous torrent collection I offered 4 days ago as it don't even compare to this masterpiece! \n \nI laid out all the videos in chronological order taken from the albums, so you get a look at history from start to finish of The Beatles careers! The entire video collection is less than 4 GB's! All 171 videos were made in Flash Video format (FLV). They are small in size in that format and play easily through Real Player! No more searching or downloading different apps to play each video. Just load the videos into Real Player and then burn them on a DVD through your computer for the ultimate collection! EVERY video song is included in this collection from The Beatles first album, &quot;Please Please Me&quot; through &quot;Yesterday And Today.&quot; Starting with &quot;Revolver&quot; through &quot;Let It Be&quot; their final album, most of those popular songs were made into video songs. Some videos have Spanish Subtitles. Some have lyrics to them. Some are moving picture videos. Some also have a storyline to them. Some have the Beatles girlfriends or wives with them in these videos! This is a MUST collection for The Beatle fan! This is truly a very rare incredible once in a lifetime collection to have. Don't miss out!!!! Tell your family and friends about it. You will be amazed as Paul McCartney once said. I want everyone out there to have this great collection of videos. \n\nI know this torrent will be flooded with over 300 people trying to get it at once! It will take a few days of downloading to get this epic collection, but I guarantee you, it will be well worth it's value in gold. I will seed 24 hours a day for about 3 to 4 days so everyone can get this. Please everyone SEED, for a while before leaving so everyone can download this collection. Please don't hit and run! Why is there only 2 seeders from my previous torrent for this collection? There should be at least 20 seeders. Otherwise, people won't be able to download and get this collection. So please be considerate and not selfish and SEED once you get the collection. I'm doing my part and generously offering you a unique piece of history here. So make it available also to everyone else by SEEDING once you get it. I will SEED to get the leechers going until the seeders start to multiple, but I want to see double digit numbers in seeders and leechers once this collection takes over.\n\nYour comments are much appreciated, so please leave a comment once you view the collection. It will also encourage others to want to download this collection also. If you have any questions, just leave them here? I apologize for not getting it right the first time, but now it's totally complete, upgraded and ready for your   entertaiment! Play it through your stereo system speakers and a huge flat panel tv screen for the ultimate Beatle experience! I'm loving it and so will you. Enjoy the show! Thanks for viewing.\nGRP ","torrent":{"xt":"urn:btih:9521b6d6bd412147ef8a6e13cb33ae234797dbdf","amp;dn":"THE+BEATLES+-+Vidthology+NEW+UPGRADE%21+171+Vintage+STEREO+Videos","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9521b6d6bd412147ef8a6e13cb33ae234797dbdf","infoHashBuffer":{"type":"Buffer","data":[149,33,182,214,189,65,33,71,239,138,110,19,203,51,174,35,71,151,219,223]},"announce":[],"urlList":[]}}