{"title":"Cara Dillon...Hill of Thieves(2009)[FLAC]","uid":6056838,"size":266593394,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9523da1e3b449bd07daba4f05b1ea1ffad01d7d3&amp;dn=Cara+Dillon...Hill+of+Thieves%282009%29%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":17,"time":1292942785,"description":"2009 Hill of Thieves    CD  Charcoal CHARCD002 \n \n1 The Hill of Thieves   4:30 \n2 Johnny, Lovely Johnny   3:21 \n3 The Parting Glass   3:20 \n4 Spencer the Rover   4:05 \n5 False, False   4:09 \n6 Jimmy Mo MhÃƒÂ­le StÃƒÂ³r   3:58 \n7 She Moved Through the Fair   5:37 \n8 P Stands for Paddy (Lament For Johnny)   6:13 \n9 The Verdant Braes of Skreen   3:49 \n10 The Lass of Glenshee   3:36 \n11 Fil, Fil a Run O   2:33 \n\nHill of Thieves is the fourth solo album by Irish folk singer Cara Dillon. It is her first full-length release on Charcoal Records, her own record label, formed in 2008. The album was recorded in 2008 and first became available in October 2008 at her live concerts. It is also the first release since she gave birth to twin boys Noah and Colm at 26 weeks, after going into labour onstage at the Swindon Arts Centre, UK. It has been the most successful of her first four albums in relation to chart performance, entering at No. 7 in the UK Indie Album Charts (see below for more.)\n\nThe album marks a return to a purer traditional production and arrangement style, with a significant absence of drums, electric guitar and bass, backing vocals &amp; harmonies, and notably only one original composition. It features a range of guest musicians from the folk music scene, including Seth Lakeman and brother Sean, Brian Finnegan of Flook, Zoe Conway, Eamon Murray of Beoga, and John Smith. The album also features Dillon's core live band, comprising Sam Lakeman, Ed Boyd, and James O'Grady.\n\nMany of the tracks released on this album had already become part of Dillon's live setlist between 2006 and 2008. &quot;She Moved Through The Fair&quot; first was performed on Dillon's After The Morning Tour (2006), and following the change in the live band line-up in 2007, &quot;P Stands For Paddy&quot; became another constant of the live sets. As well as this, &quot;Spencer The Rover&quot; and &quot;False, False&quot; were familiar songs from Dillon's 2001/2002 live set, which included Seth Lakeman on tenor guitar, violin, and backing vocals. Dillon first performed the title track, &quot;The Hill of Thieves&quot; in Brian Finnegan's The Singing Tree at the Old Fruitmarket, Glasgow, as part of Celtic Connections 2008.\n\n\n cd ripped by dBpoweramp\n\nplease seed\n &lt;a href=&quot;\nhttp://dickthespic.org/2010/11/27/cara-dillon/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://dickthespic.org/2010/11/27/cara-dillon/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:9523da1e3b449bd07daba4f05b1ea1ffad01d7d3","amp;dn":"Cara+Dillon...Hill+of+Thieves%282009%29%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9523da1e3b449bd07daba4f05b1ea1ffad01d7d3","infoHashBuffer":{"type":"Buffer","data":[149,35,218,30,59,68,155,208,125,171,164,240,91,30,161,255,173,1,215,211]},"announce":[],"urlList":[]}}