{"title":"WWE 24 S01E02 Booker T Sentenced to Greatness 720p H264 AVCHD-SC","uid":11732072,"size":1088317597,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:952c2251e72679e411dc5ab3c8ead28118f4b4ac&amp;dn=WWE+24+S01E02+Booker+T+Sentenced+to+Greatness+720p+H264+AVCHD-SC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SCSA420","files":4,"time":1425420550,"description":"StoneCold420 presents another High Quality 720p H264 release for the wrestling fans around the world here exclusively on KickAss Torrents and The Pirate Bay.\n\n\nWWE 24 S01E02 Booker T Sentenced to Greatness 720p H264 AVCHD-SC-SDH\n\n\n\n\nWWE 24 \nS01E02\nBooker T Sentenced to Greatness \nMarch 2, 2015\n\n\nThis is Season 01 Episode 02 of WWE 24 originally shown at 11:00 pm on March 2, 2015\n\n\nFeaturing Booker T Sentenced to Greatness \n\n\n&quot;The 2nd episode of the original series, WWE24, the Hall of Famer reflects on his life.&quot;\n\n\nThe idea of the show is to give an inside look at some of WWE's milestone events and larger-than-life Superstars. WWE will use personal archives, interviews and behind-the-scenes footage to present current and former talents or events in a different way than they usually do.\n\nWWE 24 will air on Monday night on the WWE Network after RAW ends.\n\n\nThis is SDH release #1,678 for the wrestling fans from a wrestling fan. First aired and captured from HDMI in H264 AVCHD at 8,000 kbps from the 16:9 widescreen 1280 x 720p resolution HD source on 03/02/2015 on PS4 WWE Network. Framerate is 29.970 with an average Video Bitrate of 4,500 kbps in a High Quality 1.01 GB 720p H264 AVCHD MP4 release with 48khz 320 kbps AAC 2 channel stereo audio show runtime 30:07\n\nThis is my 948th official 720p H264 AVCHD-SC-SDH release. Enjoy the WWE 24 show WWE fans. \n\nMy releases are in MP4 format with AAC 2 channel stereo audio so that they are playable with VLC player as well as Media Player Classic, Windows Media Player, Sony Playstation 3, Xbox 360, Samsung Galaxy S III smartphones, iPhone, iPad, and any other devices capable of playing 720p HD MP4 video files. \n\nTo ensure that you can get proper playback be sure you have installed the K-lite codec pack full version or mega version both of which comes with Media Player Classic Home Cinema and configure it properly for .mkv and .mp4 playback. If you do not have it you can get it here below: \n &lt;a href=&quot;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.free-codecs.com/download/K_Lite_Codec_Pack.htm&lt;/a&gt; \n\nOnce installed you can playback the .mp4 file with the following players:\n\nMedia Player Classic, or Windows Media Player. \n\n\nEnjoy the WWE 24 show wrestling fans and thanks for downloading my WWE 24 S01E02 Booker T Sentenced to Greatness 720p H264 AVCHD-SC-SDH release.\n\n\nUploaded by SCSA420 on KickAss Torrents and The Pirate Bay\n\n\nATTENTION: PLEASE FEEL FREE TO UPLOAD MY RELEASES ANYWHERE BUT DON'T ADD YOUR NAME TO MY HARD WORK and IF this show is uploaded on XWT then please keep the folder and files as they are and DO NOT RENAME the files or retag them with another name!!! Thank You!!!\n\nI work on my own so that I get all the credit for my hard work each and every week!!! \n\nBest Played With Media Player Classic or VLC Player \n\n\nStoneCold420 \nSmackDownHotel\nMarch 2, 2015\n\n\n@SCSA420 on Twitter\n\n\nFor SC-SDH releases find me on KAT at","torrent":{"xt":"urn:btih:952c2251e72679e411dc5ab3c8ead28118f4b4ac","amp;dn":"WWE+24+S01E02+Booker+T+Sentenced+to+Greatness+720p+H264+AVCHD-SC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"952c2251e72679e411dc5ab3c8ead28118f4b4ac","infoHashBuffer":{"type":"Buffer","data":[149,44,34,81,231,38,121,228,17,220,90,179,200,234,210,129,24,244,180,172]},"announce":[],"urlList":[]}}