{"title":"The Design Way, 2E (Nelson, Stolterman) [PDF] [StormRG]","uid":9979257,"size":7131627,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:95a081e28674a947e520a0c7d865cba2d5f9fe7f&amp;dn=The+Design+Way%2C+2E+%28Nelson%2C+Stolterman%29+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"steelballz","files":-1,"time":1397714486,"description":"Description\nThe Design Way, Second Edition\nAuthor:Harold G. Nelson &amp; Erik Stolterman\nPublished:July 27, 2012\nPublisher:The MIT Press\nISBN-10:0262018179\nISBN-13:9780262018173\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\n\nTested on the above readers with no problems on laptop and Android tablet.\nDon't hesitate to PM me if you have any questions or problem with the download, as comments on the torrent are easy to miss. Please allow a couple\nseconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\nIt should also be noted that any reference to any dvd, cd, or any other dlc or extra content in this, or any other torrent I upload, is not available in the torrent unless I state otherwise. If you want the extras, buy the product\nThis PDF is encrypted! This encryption will NOT interfere with opening, printing, or copying the PDF. It will only prevent editing of the PDF. I have my reasons for it. If you have questions pm me through my acct on KAT\n\n\n\nimage\nCover from actual book file\n\n\nProduct Description\n\n\nHumans did not discover fire--they designed it. Design is not defined by software programs, blueprints, or font choice. When we create new things--technologies, organizations, processes, systems, environments, ways of thinking--we engage in design. With this expansive view of design as their premise, in The Design Way, Harold Nelson and Erik Stolterman make the case for design as its own culture of inquiry and action. They offer not a recipe for design practice or theorizing but a formulation of design culture''s fundamental core of ideas. These ideas--which form &quot;the design way&quot;--are applicable to an infinite variety of design domains, from such traditional fields as architecture and graphic design to such nontraditional design areas as organizational, educational, interaction, and health care design. Nelson and Stolterman present design culture in terms of foundations (first principles), fundamentals (core concepts), and metaphysics, and then discuss these issues from both learner''s and practitioner''s perspectives. The text of this second edition is accompanied by new detailed images, &quot;schemas&quot; that visualize, conceptualize, and structure the authors'' understanding of design inquiry. This text itself has been revised and expanded throughout, in part in response to reader feedback.\n\n\n\nimage\nScientia est potentia","torrent":{"xt":"urn:btih:95a081e28674a947e520a0c7d865cba2d5f9fe7f","amp;dn":"The+Design+Way%2C+2E+%28Nelson%2C+Stolterman%29+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95a081e28674a947e520a0c7d865cba2d5f9fe7f","infoHashBuffer":{"type":"Buffer","data":[149,160,129,226,134,116,169,71,229,32,160,199,216,101,203,162,213,249,254,127]},"announce":[],"urlList":[]}}