{"title":"Handbook of Herbs and Spices Vol. 2 - K. V. Peter","uid":15318420,"size":2855454,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:960e571e6ac576e2415bb5610ba7499668e5571b&amp;dn=Handbook+of+Herbs+and+Spices+Vol.+2+-+K.+V.+Peter&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468624622,"description":"Handbook of Herbs and Spices Vol. 2 - K. V. Peter (WP, 2004).pdf\r\n\r\nISBN 1 85573 721 3\r\n\r\nIntroduction: Introduction to herbs and spices; Uses of herbs and spices; Active plant constituents; The structure of this book; References; The functional role of herbal spices: Introduction; Classification; Production, comsumption and processing; Functional properties; Sources of further information; Herbs and spices and antimicrobials: Introduction; Barriers to the use of herbs and spices essential oils as microbials in food; Measuring antimicrobial activity; Studies in vitro; Applications in food systems; Mode of action and development of resistance; Legislation; Future prospects and multifactotial preservation; References; Screening for health effects of herbs: Introduction; Types of assays; Assay quality; Screening bio-active e compounds; Screening experiments for anti-inflammatory properties; Futute trends; Sources of further information; References; Unde-utilized herbs and spices: Introduction; Sweet flag; Greater galangal; Angelica; Horseradish; Black caraway; Capers; Asafoetida; Hyssop; Galangal; Betel vine; Pomegranate; Summer savory; Winter savory; Other; References; Particular herbs and spices: Introduction and description; Production; Cultivation; Chemical structure; Main uses in food processing; Funciotonal propierties and toxicity; Quality issue; References; Allspice: Introduction and description; Production and trade; Chemical composition; Cultivation; Uses; Functional properties; Quality issues and adulteration; References; Chervil: Introduction and descrition; Cultivation and production technology; Uses; Sources of further information; Coriander: Introduction and description; Chemical composition; Cultivation and post-harvest practicides; Quality issues; Value addition; Future research trends; References; Geranium: Introduction; Chemical composition; Production and cultivation; Main uses in food processing and perfumery; Functional properties; Quality issues and adulteration; References; Lavender: Introduction; Chemical composition; Production; Uses in food processing, perfumery and paramedical spheres; Functional properties and toxicity; Quality issues and adulteration; References; Mustard: Introduction and description; Chemical composiion; Production and cultivation; Uses; Properties; Quality specifications; References; Nigella: Introduction and description; Chemical Structure; Cultivation; Main uses in foof processing; Functional properties; Quality specifications and adulteration; References; Oregano: Introduction and description; Chemical composition; Production and cultivation; Main uses in food processing and medicine; Functional properties; Quality specifications and commercial issues; References; Parsley: Introduction and description; Chemical composition; Production and cultivation; Organic farming; General uses; Essential oils and their physicochemical properties; References; Rosemary: Introduction and description; Chemical composition; Production and cultivation; Post-harvest technology; Uses; Toxicology and disease; Conclusion; References; Sesame: Introduction; Chemical composition; Production; Processing; Uses; Future research needs; References; Star anise: Introduction. morphology and related species; Histology; Production and cultivation; Main uses; References; Thyme: Introduction; Chemical structure; Production; Main uses in food processing; Functional properties and toxicology; Quality specifications and issues; References; Vanilla: Introduction and description; Production and trade; Cultivation; Harvesting, yield and post-production activities; Uses; Vanilla products; Functional properties; Quality issues and adulteration; Improving production of natural vinilin; Future outlook; References","torrent":{"xt":"urn:btih:960e571e6ac576e2415bb5610ba7499668e5571b","amp;dn":"Handbook+of+Herbs+and+Spices+Vol.+2+-+K.+V.+Peter","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"960e571e6ac576e2415bb5610ba7499668e5571b","infoHashBuffer":{"type":"Buffer","data":[150,14,87,30,106,197,118,226,65,91,181,97,11,167,73,150,104,229,87,27]},"announce":[],"urlList":[]}}