{"title":"Straight Answers To Tough Questions - John Morris","uid":11753323,"size":3792799,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:964401a813d4fe64841e45aa763c6be2e870860b&amp;dn=Straight+Answers+To+Tough+Questions+-+John+Morris&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1426280001,"description":"Creation thinking has been around for a long time, yet it is strangely obscure in many Christian circles today. Intimidated by scientists claiming more knowledge than they really have, many Christians have retreated on this foundational issue.\nMany of our leading evangelical liberal arts colleges and seminaries teach theistic evolution, billions of years of history, local flood, an allegorical Genesis, or some other accommodation to the naturalistic worldview.\nUnfortunately, the issue does not stop with the various ideas about history. The false worldview of evolution (and its evangelical stepsisters) has led millions into wrong life-style decisions reeking untold havoc worldwide. Evolution, as the basis for Marxism, Fascism, Freudian psychology, racism, etc., has been well documented, but modern ills such as homosexual behavior, abortion, promiscuity, radical feminism, and many others, likewise look to evolution for intellectual justification. Wrong thinking always begets wrong behavior. Thus there is the need for a &quot;Back to Genesis&quot; way of thinking. Christians need to base all their thinking, in every area, on the teachings of scripture and the foundation of scripture is Genesis.\n\nLaid out in question and answer format, this work provides answers to some of the most common questions and ideas for implementation of these answers. Most importantly, it provides examples of how to think?how to recognize error, discern truth, and apply right thinking in our lives.\n\n\nAbout the author:\nDr. John Morris, perhaps best known for leading expeditions to Mt. Ararat in search of Noah's Ark, received his Doctorate in Geological Engineering at the University of Oklahoma in 1980. He served on the University of Oklahoma faculty before joining the Institute for Creation Research in 1984. Dr. Morris held the position of Professor of Geology and was appointed President in 1996. He continues to serve ICR as President Emeritus. He traveled widely around the world speaking at churches, conferences, schools, and scientific meetings. Dr. Morris has written numerous books and articles on the scientific evidence that supports the Bible. Dr. Morris is the author or co-author of such books as The Young Earth, The Modern Creation Trilogy, The Fossil Record: Unearthing Nature's History of Life, The Global Flood: Unlocking Earth's Geologic History, and Noah's Ark: Adventures on Ararat. He is also a contributor to Guide to Creation Basics and Creation Basics &amp; Beyond","torrent":{"xt":"urn:btih:964401a813d4fe64841e45aa763c6be2e870860b","amp;dn":"Straight+Answers+To+Tough+Questions+-+John+Morris","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"964401a813d4fe64841e45aa763c6be2e870860b","infoHashBuffer":{"type":"Buffer","data":[150,68,1,168,19,212,254,100,132,30,69,170,118,60,107,226,232,112,134,11]},"announce":[],"urlList":[]}}