{"title":"Neuroanatomy An Illustrated Colour Text 5th Ed [PDF][tahir99] VR","uid":10736490,"size":56075812,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:968d665c7fbf90ec839ddb49ae4c817f25c22cb7&amp;dn=Neuroanatomy+An+Illustrated+Colour+Text+5th+Ed+%5BPDF%5D%5Btahir99%5D+VR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tahir99","files":1,"time":1407697871,"description":"Neuroanatomy: an Illustrated Colour Text, 5e\n\nby Alan R. Crossman PhD DSc (Author), David Neary MD FRCP (Author)\n\nPDF (Not a True PDF, But A Good One), Bookmarked\n\nimage\n\nISBN-13: 978-0702054051 ISBN-10: 0702054054 Edition: 5th | May 26, 2014\n\n\nNow fully revised and updated, this leading ICT series volume offers concise, superbly illustrated coverage of neuroanatomy that throughout makes clear the relevance of the anatomy to the practice of modern clinical neurology. Building on the huge success of previous editions, Neuroanatomy ICT, fifth edition is designed and written primarily with the medical student in mind, although it will again be valued by the range of other students and professionals who need a clear, current understanding of this important area. Minimum assumptions are made of existing knowledge of the subject.\n\nThis edition now comes with an enhanced electronic version - hosted on the new, improved Student Consult platform - providing an even richer learning experience and rapid reference anytime, anywhere!\n\nNotoriously difficult concepts made clear in straightforward and concise text\n\nLevel of detail carefully judged to facilitate understanding of the fundamental neuroanatomical principles and the workings of the nervous system, providing a sound basis for the diagnosis and treatment of contemporary neurological disorders\n\nAll new line drawings and photographs incorporated throughout to further improve clarity and reflect the latest imaging techniques\n\nClinical material and topic summaries fully updated and highlighted in succinct boxes within the text\n\nClinical syndromes/symptoms index provided with cross-referencing to relevant text\n\nMemorable pictorial summaries of symptoms associated with the main clinical syndromes\n\nNew added value electronic content - including self-assessment material to aid revision and check your understanding - is incorporated within the superb, complimentary enhanced eBook\n\nimage","torrent":{"xt":"urn:btih:968d665c7fbf90ec839ddb49ae4c817f25c22cb7","amp;dn":"Neuroanatomy+An+Illustrated+Colour+Text+5th+Ed+%5BPDF%5D%5Btahir99%5D+VR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"968d665c7fbf90ec839ddb49ae4c817f25c22cb7","infoHashBuffer":{"type":"Buffer","data":[150,141,102,92,127,191,144,236,131,157,219,73,174,76,129,127,37,194,44,183]},"announce":[],"urlList":[]}}