{"title":"Patrick D'Orazio - The Dark Trilogy (Audiobooks)","uid":8802970,"size":2551783537,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:96b29351cbe5f4821b9d8ae96b578cf4eeb7f8d4&amp;dn=Patrick+D%27Orazio+-+The+Dark+Trilogy+%28Audiobooks%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jimi88","files":-1,"time":1376256249,"description":"Patrick D'Orazio - The Dark Trilogy (Audiobooks):\n-------------------------------------------------\n\n1) Comes the Dark:\n------------------\nFirst time novelist, Patrick D'Orazio, takes us on a journey that follows the path of the everyman, Jeff Blaine, in the days after the end of the world. Six weeks have passed since the virus ravaged the world's population and in that time most of humanity has passed into shadow, turning into corrupt, rotting flesh eaters that known only pain and hunger as they attempt to destroy the remaining members of the human race. Jeff has lost everything, including much of his desire to continue surviving in this hell on earth. The idea of lashing out at the monsters who took his life away is the only remaining pleasure left, so Jeff decides to leave his house and destroy as many of the creatures as he can before he is annihilated by them. It doesn't take long for Jeff to discover that he is not alone. Other survivors like Megan, George, and Jason that he finds along his path of self-destruction force him to rethink his plan. They aren't willing to give up just yet-they not only want to survive, they want to live. So as the darkness threatens to consume him, Jeff has to decide if he is willing to keep fighting for himself and the others, or let the bitterness wrapped around his soul destroy him.\n----------------------------------------------------------------------\nNarrator: Jim Cooper\nListening Length: 6 hours and 34 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Frontiers\nAudible.com Release Date: February 26, 2013\nLanguage: English\nASIN: B00AU5SKDY\n----------------\n\n2) Into the Dark:\n-----------------\nSix weeks ago, the mysterious virus came out of nowhere and engulfed the world. Everyone infected seemed to die...then rise again. Jeff Blaine did his best to hold his family together and to protect them from the horrors scratching at their door, but in the end, they were ripped away from him like everything else that ever mattered. Lost and alone, Jeff decided his only option was to destroy as many of the monsters that stole his life away before they destroy him as well. But when he discovers Megan, George, and Jason, three other survivors not interested in giving up just yet, he reluctantly accepts that there might still be a reason to fight and live to see another day.\n\nTraveling through the blasted landscape their world has become, the quartet discovers that the living dead aren't the only danger with which they must cope. Even other survivors who promise safety and security from the hordes of ghouls roaming the wastelands will test loyalties and their faith in humankind. Jeff and his small band of newfound friends must forge a semblance of life in the newly blighted world. And they will have only the light of their own humanity by which to navigate as everything around them descends into the dark.\n----------------------------------------------------------\nNarrator: Jim Cooper\nListening Length: 6 hours and 4 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Frontiers\nAudible.com Release Date: March 26, 2013\nLanguage: English\nASIN: B00B3I77JU\n----------------\n\n3) Beyond the Dark:\n-------------------\nThe dead have risen, and their hunger for the flesh of the living is insatiable....\n\nIt has been six weeks since the virus engulfed the world. Everyone who was infected died, and then rose again. Governments collapsed, armies fell, and civilizations turned to dust as the human race tore itself to pieces. The living are in danger of becoming extinct....\n\nJeff Blaine has witnessed the annihilation of his family and everything that mattered to him. When he steps outside his home for the first time since the world died, he meets Megan, George, and Jason, three other survivors who force him to accept that there may still be a reason to fight and live to see another day. It doesn't take long for the quartet to stumble into a trap set by a group led by the charismatic Michael. While he promises a safe haven from the undead behind the walls of his makeshift fortress, the loyalty he and his cronies demand may be too high a price for Jeff and the others to pay.\n\nDaylight is fading for humanity....\n\nWhen a routine supply run to a nearby town turns deadly and the ghouls walking the street track the living back to their hideout, the mettle of the meager band of survivors will be tested as they are forced to face the onslaught of the undead. Even as they flee, and their world falls deeper into despair, Jeff and the others must find a way to defeat not only the undead, but the hatred that threatens to cripple their souls. Because the only way anyone will survive is if they can find their way beyond the dark.\n--------------------------\nNarrator: Jim Cooper\nListening Length: 6 hours and 22 minutes\nProgram Type: Audiobook\nVersion: Unabridged\nPublisher: Audible Frontiers\nAudible.com Release Date: April 30, 2013\nLanguage: English\nASIN: B00B2BYQGU\n----------------\n\nGive this zombie trilogy a 7.5/10.\nHave Fun and if you love the audiobook buy the paper! \n\nGreetingz Jimi88\t\t","torrent":{"xt":"urn:btih:96b29351cbe5f4821b9d8ae96b578cf4eeb7f8d4","amp;dn":"Patrick+D%27Orazio+-+The+Dark+Trilogy+%28Audiobooks%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96b29351cbe5f4821b9d8ae96b578cf4eeb7f8d4","infoHashBuffer":{"type":"Buffer","data":[150,178,147,81,203,229,244,130,27,157,138,233,107,87,140,244,238,183,248,212]},"announce":[],"urlList":[]}}