{"title":"Blue Oyster Cult - Secret Treaties [1974][EAC,log,cue. FLAC]","uid":8866963,"size":385818272,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:96c84663d7ec6d4c8f89bcf0511bc4576082b148&amp;dn=Blue+Oyster+Cult+-+Secret+Treaties+%5B1974%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":17,"time":1377942924,"description":"Artist: Blue Ã–yster Cult\nRelease: Secret Treaties\nReleased: 1974\nLabel: Sony Music Distribution 2007 - Legacy Edition\nCatalog#: 1353\nFormat: FLAC / Lossless / Log (100%) / Cue\n[color=blue]Country: USA\nStyle: rock\n\n1\tCareer of Evil\t3:54\n2\tSubhuman\t4:37\n3\tDominance and Submission\t5:22\n4\tME 262\t4:45\n5\tCagey Cretins\t3:15\n6\tHarvester of Eyes\t4:40\n7\tFlaming Telepaths\t5:18\n8\tAstronomy\t6:23\n9\tBoorman the Chauffer\t3:12\n10\tMommy\t3:32\n11\tMes Dames Sarat\t4:06\n12\tBorn to be Wild [Single B-Side]\t3:40\n13\tCareer of Evil [Single Version]\t3:00\n\nWhile the speed-freak adrenaline heaviness and shrouded occult mystery of Tyranny and Mutation is the watermark for Blue Ã–yster Cult's creative invention, it is Secret Treaties that is widely and critically regarded as the band's classic. Issued in 1974, Secret Treaties is the purest distillation of all of BÃ–C's strengths. Here the songs are expansive, and lush in their textures. The flamboyance is all here, and so are the overdriven guitar riffs provided by Buck Dharma and Eric Bloom. But there is something else, texturally, that moves these songs out from the blackness and into the shadows. Perhaps it's the bottom-heavy mix by producer and lyricist Sandy Pearlman, with Allen Lanier's electric piano and Joe Bouchard's bass coming to rest in an uneasy balance with the twin-guitar attack. Perhaps it's in the tautness of songwriting and instrumental architectures created by drummer Albert Bouchard, Bloom, and Don Roeser (Buck Dharma). Whatever it is, it offers the Cult a new depth and breadth. While elements of psychedelia have always been a part of the band's sound, it was always enfolded in proto-metal heaviness and biker boogie. Here, BÃ–C created their own brand of heavy psychedelic noir to diversify their considerably aggressive attack. Listen to &quot;Subhuman&quot; or &quot;Dominance and Submission.&quot; Their minor chord flourishes and multi-tracked layered guitars and Bouchard's constantly shimmering cymbals and snare work (he is the most underrated drummer in rock history) and elliptical lyrics -- that Pearlman put out in front of the mix for a change -- added to the fathomless dread and mystery at the heart of the music. Elsewhere, on &quot;Cagey Cretins&quot; and &quot;Harvester of Eyes&quot; (both with lyrics by critic Richard Meltzer), the razor-wire guitar riffs were underscored by Lanier's organ, and their sci-fi urgency heightened by vocal harmonies. But it is on &quot;Flaming Telepaths,&quot; with its single-chord hypnotic piano line that brings the lyric &quot;Well, I've opened up my veins too many times/And the poison's in my heart in my heart and in my mind/Poison's in my bloodstream/Poison's in my pride/I'm after rebellion/I'll settle for lives/Is it any wonder that my mind is on fire?&quot; down into the maelstrom and wreaks havoc on the listener. It's a stunner, full of crossing guitar lines and an insistent, demanding rhythmic throb. The set closes with the quark strangeness of &quot;Astronomy,&quot; full of melancholy, dread, and loss that leaves the listener unsettled and in an entirely new terrain, having traveled a long way from the boasting rockery of &quot;Career of Evil&quot; that began the journey. It's a breathless rock monolith that is all dark delight and sinister pleasure. While the Cult went on to well-deserved commercial success with Agents of Fortune an album later, the freaky inspiration that was offered on their debut, and brought to shine like a black jewel on Tyranny and Mutation, was fully articulated as visionary on Secret Treaties.","torrent":{"xt":"urn:btih:96c84663d7ec6d4c8f89bcf0511bc4576082b148","amp;dn":"Blue+Oyster+Cult+-+Secret+Treaties+%5B1974%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96c84663d7ec6d4c8f89bcf0511bc4576082b148","infoHashBuffer":{"type":"Buffer","data":[150,200,70,99,215,236,109,76,143,137,188,240,81,27,196,87,96,130,177,72]},"announce":[],"urlList":[]}}