{"title":"The Critters - Anthology, The Complete Kapp Recordings; 1965-196","uid":8627835,"size":310387082,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:973f85f7373826b71346713456a4fd55fd32849a&amp;dn=The+Critters+-+Anthology%2C+The+Complete+Kapp+Recordings%3B+1965-196&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LochDhueDude","files":29,"time":1372556842,"description":"This is the same torrent that was uploaded to Demonoid in July 2008.\n\n\nThe Critters - Anthology, The Complete Kapp Recordings: 1965-1967 (1994)\n &lt;a href=&quot;\nhttp://content.answers.com/main/content/img/amg/pop_albums/8/5/r/c853934t6ro.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://content.answers.com/main/content/img/amg/pop_albums/8/5/r/c853934t6ro.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio from All Music:\n\nIn 1966, this New York group came off very much like a Lovin' Spoonful Jr., scoring a minor hit with a cover of John Sebastian's &quot;Younger Girl&quot; and then chalking up their only Top 20 single with the very Spoonful-esque original &quot;Mr. Dieingly Sad.&quot; The group's soft harmonies and pop folk-rock were in a considerably lighter vein than their Kama Sutra labelmates, though. Much of their material was self-penned, though they also benefited from compositions by Jackie DeShannon and Brill Building tunesmiths Pete Anders, Vinnie Poncia, and Doc Pomus. Recording quite a few singles and an LP for Kama Sutra from 1965 to 1967, their gentle pop/rock was rather lightweight, with the exception of their best singles. After a final Top 40 hit in 1967 (&quot;Don't Let the Rain Fall Down on Me&quot;), principal songwriter Don Ciccone was drafted, and the group struggled on with a couple albums for the Project 3 label before splitting.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:g9fwxqt5ldde&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:g9fwxqt5ldde&lt;/a&gt;\n\nAll Music Album Review:\n\nNew Jersey's Critters have earned a reputation as a bubblegum pop group, but they really had a lot more going for them than that. For starters, founding members Jim Ryan and Don Ciccone were both gifted songwriters, singers, and arrangers, and if they had a sort of soft, sunshine approach to things, well, they did it as well as anyone. This anthology collects their Kapp recordings (which essentially means their one album for Kama Sutra and a handful of singles and B-sides) from 1965 to 1967, and it shows a versatile band that was much more than a sort of precursor to Bread. Their first single, a folk-rock cover of Jackie DeShannon's &quot;Children and Flowers,&quot; leads things off here, and yes, it's sappy, but wonderfully so, and once you accept the lyrics, it emerges as a bit of a lost treasure. The next two tracks are also striking, the Beatlesque &quot;He'll Make You Cry&quot; and the equally impressive &quot;Little Girl,&quot; both of which could have -- and should have -- been AM radio hits. &quot;Mr. Dieingly Sad,&quot; a group original that out-associates the Association, is another highlight, and the set closes with a surprisingly bright, joyous, and breezy version of the Motown classic &quot;Dancing in the Street.&quot; Leaving Kama Sutra at the end of 1967, the band recorded a second album on the Project 3 label before calling it quits. The Critters, like Chicago's Cryan' Shames, might have gone on to bigger and better things if the military draft, label snafus, and public perception hadn't short-circuited the creative life span of the group. As it is, they'll make you smile on a rainy day. There's something really valuable in that.\n\nTrack List:\n\n01. Children And Flowers\n02. He'll Make You Cry\n03. Little Girl\n04. Heart Of Love, Head Of Stone\n05. Mr. Dieingly Sad\n06. Gone For Awhile\n07. Younger Girl\n08. It Just Won't Be That Way\n09. Come Back On A Rainy Day\n10. Best Love You'll Ever Have\n11. Forever Or No More\n12. I Wear A Silly Grin\n13. Blow My Mind\n14. Everything But Time\n15. Bad Misunderstanding\n16. Marryin' Kind Of Love\n17. New York Bound\n18. Don't Let The Rain Fall Down On Me\n19. Walk Like A Man Again\n20. Dancing In The Street\n\nMore album detail at: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:wifyxqehldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:wifyxqehldhe&lt;/a&gt;\n","torrent":{"xt":"urn:btih:973f85f7373826b71346713456a4fd55fd32849a","amp;dn":"The+Critters+-+Anthology%2C+The+Complete+Kapp+Recordings%3B+1965-196","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"973f85f7373826b71346713456a4fd55fd32849a","infoHashBuffer":{"type":"Buffer","data":[151,63,133,247,55,56,38,183,19,70,113,52,86,164,253,85,253,50,132,154]},"announce":[],"urlList":[]}}