{"title":"Judith Palmer Harik - Hezbollah. The Changing Face of Terrorism ","uid":10158952,"size":2118469,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:974f9f301cfb17bc6fb70e4b3c96a713c66d4357&amp;dn=Judith+Palmer+Harik+-+Hezbollah.+The+Changing+Face+of+Terrorism+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anette14","files":-1,"time":1400212343,"description":"Description\nProduct Details\nBook Title: Hezbollah: The Changing Face of Terrorism\t\nBook Author: Judith Palmer Harik (Author)\nHardcover: 224 pages\nPublisher: I. B. Tauris; First Edition edition (April 3, 2004)\nLanguage: English\nISBN-10: 1860648932\nISBN-13: 978-1860648939\n\n===================================================================================\nBook Description\nPublication Date: April 3, 2004 | ISBN-10: 1860648932 | ISBN-13: 978-1860648939 | Edition: First Edition\nSince the assassination of Rafik Hariri in early 2005, Lebanese politics has been plunged into a new era. Will Syrian withdrawal send the country back into civil war? How will the seismic political shifts underway affect the stability of the region? At the center of the turmoil stands one player that will affect the outcome more than any other: Hezbollah. Hezbollah, or the &quot;Party of God&quot;, is one of the most powerful and the most misunderstood forces in Middle Eastern politics. In this new edition of her acclaimed book, Judith Harik explains what it actually believes in, what its real relationship with other regional players is, and in what direction it is heading.\nHezbollah arose amidst the chaos of the Lebanese civil war to resist the Israeli invasion of 1982. Based amongst the poor Shi'ite population, it takes its inspiration from the Iranian revolution and the teachings of Ayatollah Khomeini. Today Hezbollah's military wing controls the major fault-line of the Middle East: the Lebanese-Israeli border. To the US, Hezbollah represents one of the most dangerous terrorist networks in the world. In Lebanon, it is a democratically elected party within the Lebanese parliament, backed not just by Shi'ites, but by Christians and secular Muslims. To the wider Arab world, Hezbollah is a legend: the only Arab fighting force to have defeated Israel, forcing its withdrawal from south Lebanon in 2000.\nHarik draws on her considerable first-hand experience of the movement to tell the story of how a clandestine, radical militia transformed itself into a seemingly moderate and mainstream player in the Lebanese political arena. She looks at key questions: why do so many non-Shiites support them? Who controls the movement--the Mullahs, or the grassroots? Harik's penetrating analysis helps us make sense of fast-moving events as the future of Lebanon--and the region--hangs in the balance.\n\n===================================================================================\nReview\n&quot;This is an articulate and cogently argued book, dealing with a very important issue, which the September 11 events have given potentially grave policy consequences.&quot;--Ray Hinnebusch, University of St. Andrews\n\n===================================================================================\nAbout the Author\nJudith Palmer Harik is American Professor of Political Science, American University of Beirut.\n===================================================================================","torrent":{"xt":"urn:btih:974f9f301cfb17bc6fb70e4b3c96a713c66d4357","amp;dn":"Judith+Palmer+Harik+-+Hezbollah.+The+Changing+Face+of+Terrorism+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"974f9f301cfb17bc6fb70e4b3c96a713c66d4357","infoHashBuffer":{"type":"Buffer","data":[151,79,159,48,28,251,23,188,111,183,14,75,60,150,167,19,198,109,67,87]},"announce":[],"urlList":[]}}