{"title":"Iris Johansen_ 5 novels of Drama and Suspense _ mp3","uid":11767176,"size":1823122203,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:97b1702f4744356412010ed3ab03d24d47416dea&amp;dn=Iris+Johansen_+5+novels+of+Drama+and+Suspense+_+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"metheguy","files":18,"time":1426887349,"description":"Written by Iris Johansen\nRead by Joyce Bean, Richard Poe, others\nFormat: MP3\nBitrate: Variable\nUnabridged\n\nAnd Then You Die\nThis has a complicated plot. Bess Grady is used to the horrors of war. She is an international photojournalist who thought she saw worst when she photographed the aftermath of a massacre while on assignment in Croatia. Now working for a travel magazine She takes her sister along with her on a jaunt down to a small out-of-the-way Mexican village. As they wander the empty streets, it becomes apparent that the human beings in Tenajo has died suddenly. There is one lone survivor, a baby they name Josie But her sister also dies and she and Josie end-up depending on a mercenary called Kaldak to survive. But can she trust him? Bess slowly begins to learn the secrets of what may have been a truly evil experiment upon the population of Tenajo, and to find out the real reason she is still alive. This will set her on a path of terror that will take her back to the United States, and to the darkest moments of her life.\n\nDark Summer\nDevon Brady is a devoted veterinarian working in a makeshift hospital at an island search and rescue site. When Jude Marrok arrives with his wounded black lab Ned, she has no idea that she is about to be plunged into a whirlwind of terror, destruction, and passion. The last thing Devon needs is to be drawn into Marrok's high-stakes game. And while she feels increasingly drawn to him and his extraordinary dog, she doesn't trust him. Then the bullets start flying and she has nowhere else to run. The body counts gets higher while a mortal mystery swirls around a pack of gifted canines called the 'Dogs of Summer.' Is Jude her salvation or her damnation? Are the secrets he's protecting worth dying for?\n\nNo One to Trust\nIn the heart of Columbia the US DEA and Columbian drug barons have for years been engaged in a war with no rules... Rico Chavez is the most terrifying of killers: ruthless, cunning, charismatic. A man who always gets what he wants. And what he wants now is Elena Kyler. He wants her alive long enough to see him destroy every reason she has for living. He wants her to turn against everything and everyone she ever believed in. And then he wants her to commit the ultimate act of betrayal. But Elena herself is an assassin trained by the military, and a loner. Now she finds herself on the run from one dangerous man and turning to another for help.\n\nOn the Run\nThe picture was a warning: they'd found her. For eight years Grace Archer hoped this day wouldn't come-and knew in her heart that it would. A woman with a highly classified past, Grace had never run from anything in her life. But as a mother, she'd do anything to keep eight-year-old Frankie safe. Now that safe world has been shattered, and a ferocious hunter has been unleashed. Suddenly the agency that owed Grace its gratitude and protection has abandoned her and only one ally remains: a man even more dangerous than her worst enemy She hasn't set eyes on Jake Kilmer since the catastrophic events of eight years ago. Now he's asking Grace to trust him with the one thing more precious to her than life itself.\n\nThe Ugly Duckling\nThe wife of a high-stakes international financier, Nell Calder finds her life shattered when her husband and child are killed and she is disfigured, events that transform her from a quiet, unassuming wife to a determined woman bent on revenge","torrent":{"xt":"urn:btih:97b1702f4744356412010ed3ab03d24d47416dea","amp;dn":"Iris+Johansen_+5+novels+of+Drama+and+Suspense+_+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97b1702f4744356412010ed3ab03d24d47416dea","infoHashBuffer":{"type":"Buffer","data":[151,177,112,47,71,68,53,100,18,1,14,211,171,3,210,77,71,65,109,234]},"announce":[],"urlList":[]}}