{"title":"Сlips4sale - Miss Brat (Mom, This is America) HD","uid":15179122,"size":1559648410,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:97ff6ee4227872baed4bf00b6cd5fc1b54fca880&amp;dn=%D0%A1lips4sale+-+Miss+Brat+%28Mom%2C+This+is+America%29+HD+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"SudoSu","files":3,"time":1467437190,"description":"http://youpornbook.com\r\n\r\n―――――――――――――――――――――――――\r\n ... : Screenshots : ... \r\n――――――――――――――――――――――――― \nhttp://imgkiss.com/image/0kLHU \nhttp://imgkiss.com/image/0ks6K\r\n\r\nI'm so happy to be home with my baby boy again!!! It's been ages since we've been together, but the past is over and I just want to make the most of the present with my son. I almost can't believe that I actually found him again. I met his Father while he was on a business trip in Rio and we instantly fell in love and were married soon after, but a few years later all we did was fight. Then one night he left without saying a word and took our son with him back to the states... But I'm with my beautiful boy again and that's all that matters to me now. I'm so proud of him, he's so successful, and handsome too. And he's so generous, paying for my flight and letting me move into his house. I just wish he could learn to relax a little, maybe spend some time catching up with his Mother by the pool. Oh well... I know it won't take to long to loosen him up...\r\n\r\nPart 2: Slut's Reward\r\n\r\nTo be honest I'm not very proud of what I did, she forced me into a corner, I had to do something... I love my Mom, but it was too much. I told her I didn't want to do it again. I told her this wasn't Brazil and a person just can't fuck their Mother like it's cool here. Yeah I mean, I think my Mom's hot, and it did feel really good, but I'm not going to become some freak who fucks his Mother all the time... So I figured the only way to make my Mom stop was to give her what she was asking for. I love my Mom way to much to let her act like a slut...\r\n\r\nSail to another one at:  https://thepiratebay.se/user/SudoSu/","torrent":{"xt":"urn:btih:97ff6ee4227872baed4bf00b6cd5fc1b54fca880","amp;dn":"%D0%A1lips4sale+-+Miss+Brat+%28Mom%2C+This+is+America%29+HD+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"97ff6ee4227872baed4bf00b6cd5fc1b54fca880","infoHashBuffer":{"type":"Buffer","data":[151,255,110,228,34,120,114,186,237,75,240,11,108,213,252,27,84,252,168,128]},"announce":[],"urlList":[]}}