{"title":"Mathematical Game Theory and Applications - Vladimir Mazalov","uid":12813419,"size":2730739,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9833b3d8ac94977ebffcb019c07b3004bea884de&amp;dn=Mathematical+Game+Theory+and+Applications+-+Vladimir+Mazalov&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1448206976,"description":"An authoritative and quantitative approach to modern game theory with applications from economics, political science, military science, and finance\r\n\r\nMathematical Game Theory combines both the theoretical and mathematical foundations of game theory with a series of complex applications along with topics presented in a logical progression to achieve a unified presentation of research results.  This book covers topics such as two-person games in strategic form, zero-sum games, N-person non-cooperative games in strategic form, two-person games in extensive form, parlor and sport games, bargaining theory, best-choice games, cooperative games and dynamic games. Several classical models used in economics are presented which include Cournot, Bertrand, Hotelling, and Stackelberg as well as coverage of modern branches of game theory such as negotiation models, potential games, parlor games, and best choice games.\r\n\r\nMathematical Game Theory:\r\n\r\n • Presents a good balance of both theoretical foundations and complex applications of game theory.\r\n • Features an in-depth analysis of parlor and sport games, networking games, and bargaining models.\r\n • Provides fundamental results in new branches of game theory, best choice games, network games, and dynamic games.\r\n • Presents numerous examples and exercises along with detailed solutions at the end of each chapter.\r\n • Is supported by an accompanying website featuring course slides and lecture content.\r\n\r\nCovering a host of important topics, this book provides a research springboard for graduate students and a reference for researchers who might be working in the areas of applied mathematics, operations research, computer science, or economical cybernetics","torrent":{"xt":"urn:btih:9833b3d8ac94977ebffcb019c07b3004bea884de","amp;dn":"Mathematical+Game+Theory+and+Applications+-+Vladimir+Mazalov","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9833b3d8ac94977ebffcb019c07b3004bea884de","infoHashBuffer":{"type":"Buffer","data":[152,51,179,216,172,148,151,126,191,252,176,25,192,123,48,4,190,168,132,222]},"announce":[],"urlList":[]}}