{"title":"Yellow Birds by Kevin Powers","uid":7838587,"size":2719277,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:99374c9a0e3e17e344db288f9a7b880eb7450acb&amp;dn=Yellow+Birds+by+Kevin+Powers&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"acidr0p","files":5,"time":1353266363,"description":"&quot;The war tried to kill us in the spring,&quot; begins this breathtaking account of friendship and loss. In Al Tafar, Iraq, twenty-one-year old Private Bartle and eighteen-year-old Private Murphy cling to life as their platoon launches a bloody battle for the city. In the endless days that follow, the two young soldiers do everything to protect each other from the forces that press in on every side: the insurgents, physical fatigue, and the mental stress that comes from constant danger.\n\nBound together since basic training when their tough-as-nails Sergeant ordered Bartle to watch over Murphy, the two have been dropped into a war neither is prepared for. As reality begins to blur into a hazy nightmare, Murphy becomes increasingly unmoored from the world around him and Bartle takes impossible actions.\n\nWith profound emotional insight, especially into the effects of a hidden war on mothers and families at home, THE YELLOW BIRDS is a groundbreaking novel about the costs of war that is destined to become a classic.","torrent":{"xt":"urn:btih:99374c9a0e3e17e344db288f9a7b880eb7450acb","amp;dn":"Yellow+Birds+by+Kevin+Powers","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99374c9a0e3e17e344db288f9a7b880eb7450acb","infoHashBuffer":{"type":"Buffer","data":[153,55,76,154,14,62,23,227,68,219,40,143,154,123,136,14,183,69,10,203]},"announce":[],"urlList":[]}}