{"title":"Synanthesia - Synanthesia [1969]  [EAC/FLAC]","uid":10566518,"size":273698945,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:99f716131f568c7785f411e8ecb850f9a3e3f9fe&amp;dn=Synanthesia+-+Synanthesia+%5B1969%5D++%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":-1,"time":1405526221,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Sunbeam Records #SBRCD 5007\nCountry: UK\nYear: February 21, 2006\nGenre: Acid Folk,British Folk-Rock\nFormat: CD,Album\n\n\n1 Minerva \n2 Peek Strangely And Worried Evening \n3 Morpheus \n4 Trafalgar Square \n5 Fates \n6 The Tale Of The Spider And The Fly \n7 Vesta \n8 Rolling And Tumbling \n9 Mnemosyne \n10 Aurora \n11 Just As The Curtain Finally Falls \n\nBonus 2006 CD track\n\n12 Shifting Sands\n\n\n\n\nThough recorded quickly over two days -- and indeed, literally recorded live in the studio with no overdubs -- Synanthesia's sole album from 1969 is a gentle treat for anyone interested in the obscurer realms of late-'60s U.K. folk and its descendants. It's always a pleasure to hear something that did not deservedly go out of print -- and therefore get an unnecessary reputation. Instead, the combination of bandleader Dennis Homes' gentle vocals and delicate guitar work, Leslie Cook's equally strong talents, and the ace-in-the-hole performing of sax and flute player Jim Fraser is often quite magical. That the band openly has a debt to the Incredible String Band and Bert Jansch practically goes without saying, but there's a difference between mere aping and finding a particular spin on a sound, and Synanthesia firmly comes down on the side of the latter. For such a rushed and in-the-moment album, the sound is often quite rich -- credit not only to Vic Gamm's inspired engineering, but to the band's clear abilities as a solid live act. Hearing Homes' gentle vibes work on &quot;Peek Strangely and Worried Evening&quot; or Cook's flourishes on mandolin for &quot;Fates&quot; shows how well each complements the other songwriter's work. Yet Fraser in many ways is the key throughout -- clearly picking up on jazz influences as much as folk ones, much like his bandmates, and the result is a detailed, fluid series of performances on his chosen instruments, ranging from the restrained then strutting sax parts on &quot;Morpheus&quot; to gentle background flute on &quot;Rolling and Tumbling.&quot; The band's weakest element might be the lyrics, but nothing is outright bad, just sometimes awkward. Sunbeam's 2006 re-release, in keeping with the label's similar work, features not only excellent sound but winning, retrospective liner notes from Homes and a slew of rare pictures, plus a bonus track, &quot;Shifting Sands,&quot; that originally appeared on an obscure compilation album from 1970.\n","torrent":{"xt":"urn:btih:99f716131f568c7785f411e8ecb850f9a3e3f9fe","amp;dn":"Synanthesia+-+Synanthesia+%5B1969%5D++%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"99f716131f568c7785f411e8ecb850f9a3e3f9fe","infoHashBuffer":{"type":"Buffer","data":[153,247,22,19,31,86,140,119,133,244,17,232,236,184,80,249,163,227,249,254]},"announce":[],"urlList":[]}}