{"title":"Historical Dictionary of Irish Cinema (Historical Dictionaries o","uid":11331217,"size":11757160,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a013af8911f53d89db5923ee0d2672a2d217ff0&amp;dn=Historical+Dictionary+of+Irish+Cinema+%28Historical+Dictionaries+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1414682428,"description":"Historical Dictionary of Irish Cinema (Historical Dictionaries of Literature and the Arts)\n\n\n\nn 1898, documentary footage of a yacht race was shot by Robert A. Mitchell, making him the first Irishman to shoot a film within Ireland. Despite early exposure to the filmmaking process, Ireland did not develop a regular film industry until the late 1910s when James Mark Sullivan established the Film Company of Ireland. Since that time, Ireland has played host to many famous films about the country-Man of Aran, The Quiet Man, The Crying Game, My Left Foot, and Bloody Sunday-as well as others not about the country-Braveheart and Saving Private Ryan. It has also produced great directors such as Neil Jordan and Jim Sheridan, as well as throngs of exceptional actors and actresses: Colin Farrel, Colm Meaney, Cillian Murphy, Liam Neeson, Maureen O'Hara, and Peter O'Toole. The Historical Dictionary of Irish Cinema provides essential facts on the history of Irish cinema through a list of acronyms and abbreviation; a chronology; an introduction; a bibliography; and hundreds of cross-referenced dictionary entries on the pioneers and current leaders in the industry, the actors, directors, distributors, exhibitors, schools, arts centers, the government bodies and some of the legislation they passed, and the films.\n\nReview\n...the book serves as an excellent starting point as well as an ongoing reference for further study. American Reference Books Annual, March 2008 ...I take my hat off to Roddy Flynn and Pat Brereton of DCU for coming up with a new database of facts about Irish film...This is a quirky publication that will assuredly find itself nestling in the stocking of fact-hunters and hibernophiles this Christmas... Film Ireland This reference is much more than just a dictionary...a valuable resource...The book is well laid out and it presents the information in a clear and concise way. Reference Reviews, November 2008 Flynn and Brereton (both communications, Dublin City U.) provide all the essential information about Ireland's rather impressive output, considering, while maintaining the commitment to quality in articles about directors, actors, films, themes, history, the place of cinema in Irish culture, considerations of politics and society and the promises of the future. Reference and Research Book News, November 2007\nAbout the Author\nRoderick Flynn is a permanent member of the faculty at the School of Communications, Dublin City University. He has published extensively on various aspects of Irish media and communications policy and is a noted commentator on these issues. Patrick Brereton is a senior lecturer and chairs the degree in Multimedia at the School of Communications, Dublin City University. He has also published Media Education (2001) and several papers on film and new media in various journals. \n\nPublisher: Scarecrow Press (30 July 2007)\nLanguage: English\nISBN-10: 0810855577\nISBN-13: 978-0810855571","torrent":{"xt":"urn:btih:9a013af8911f53d89db5923ee0d2672a2d217ff0","amp;dn":"Historical+Dictionary+of+Irish+Cinema+%28Historical+Dictionaries+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a013af8911f53d89db5923ee0d2672a2d217ff0","infoHashBuffer":{"type":"Buffer","data":[154,1,58,248,145,31,83,216,157,181,146,62,224,210,103,42,45,33,127,240]},"announce":[],"urlList":[]}}