{"title":"The Wars of the Roses - Dan Jones","uid":14319494,"size":330582198,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9a2d4d24614ecc049345b1300d8b7aca814f96b5&amp;dn=The+Wars+of+the+Roses+-+Dan+Jones&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Beanhh123","files":25,"time":1460596422,"description":"The crown of England changed hands five times over the course of the fifteenth century, as two branches of the Plantagenet dynasty fought to the death for the right to rule. In this riveting follow-up to The Plantagenets, celebrated historian Dan Jones describes how the longest-reigning British royal family tore itself apart until it was finally replaced by the Tudors.\r\n\r\nSome of the greatest heroes and villains of history were thrown together in these turbulent times, from Joan of Arc to Henry V, whose victory at Agincourt marked the high point of the medieval monarchy, and Richard III, who murdered his own nephews in a desperate bid to secure his stolen crown. This was a period when headstrong queens and consorts seized power and bent men to their will. With vivid descriptions of the battles of Towton and Bosworth, where the last Plantagenet king was slain, this dramatic narrative history revels in bedlam and intrigue. It also offers a long-overdue corrective to Tudor propaganda, dismantling their self-serving account of what they called the Wars of the Roses","torrent":{"xt":"urn:btih:9a2d4d24614ecc049345b1300d8b7aca814f96b5","amp;dn":"The+Wars+of+the+Roses+-+Dan+Jones","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a2d4d24614ecc049345b1300d8b7aca814f96b5","infoHashBuffer":{"type":"Buffer","data":[154,45,77,36,97,78,204,4,147,69,177,48,13,139,122,202,129,79,150,181]},"announce":[],"urlList":[]}}