{"title":"Sharon Lee, Steve Miller - Dragon in Exile (Liaden Universe #18)","uid":12403292,"size":234883217,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:9adfd2cff733fccbe3cf17a934498f7cfda1f35a&amp;dn=Sharon+Lee%2C+Steve+Miller+-+Dragon+in+Exile+%28Liaden+Universe+%2318%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Cybotage","files":1,"time":1442055406,"description":"\nStar-trading Clan Korval - known to Terrans as the Tree-and-Dragon Family and to the locals simply as the Dragon - has been convicted of crimes against the homeworld. No matter that one of the &quot;crimes&quot; consisted of saving the elitist planet of Liad from very real internal threats, the Council of Clans wanted Korval heads to roll. Unfortunately for the council, the Dragon's allies conspired to impose a milder punishment for saving the world: banishment rather than execution.\n\nNow relocated to the free-for-all world of Surebleak, the Dragon is under contract to keep the Port Road open to all traffic and to back the New Bosses in imposing law and order on a society originally based on larceny and assassination. This modest rustication is going surprisingly well until Korval discovers that the enemy they'd sought to destroy wasn't quite destroyed. And is more determined than ever to eradicate Korval.\n\nWhile the banishment killed no one initially, many of Korval's trading allies are spooked. Some are reneging on ancient agreements, leaving the Dragon to make its own way. The clan's efforts to stealthily recruit new allies is going haywire, and a secret death toll is rising even as the clan's adherents endure increasing exposure to danger and deceit off world.\n\nTo make matters worse, an active portion of Surebleak's native population liked the Old Ways just fine and are conspiring to take the New Bosses - and the Dragon - down and are sure they have the firepower and people to do it.\n\nThe exiled Dragon has to make an urgent choice: accept an alliance with criminals or face down each and every enemy in person, one by one. \n\n\nNarrated by: Kevin T. Collins\nLength: 15 hrs and 45 mins \nFormat: M4A\nBitrate: 32 Kbps\nUnabridged Audiobook\nRelease Date:06-02-15\nPublisher: Audible Studios","torrent":{"xt":"urn:btih:9adfd2cff733fccbe3cf17a934498f7cfda1f35a","amp;dn":"Sharon+Lee%2C+Steve+Miller+-+Dragon+in+Exile+%28Liaden+Universe+%2318%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9adfd2cff733fccbe3cf17a934498f7cfda1f35a","infoHashBuffer":{"type":"Buffer","data":[154,223,210,207,247,51,252,203,227,207,23,169,52,73,143,124,253,161,243,90]},"announce":[],"urlList":[]}}