{"title":"Electrical Power Equipment Maintenance and Testing, 2nd Ed - (Ma","uid":4849820,"size":12665275,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9b602e01115f452c5dd0b4d8f50cb630b77ae5c2&amp;dn=Electrical+Power+Equipment+Maintenance+and+Testing%2C+2nd+Ed+-+%28Ma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"malestrom_HH","files":1,"time":1239828058,"description":" &lt;a href=&quot;http://www.image-upload.net/images/gsowjr97w5i27box8haf.jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.image-upload.net/images/gsowjr97w5i27box8haf.jpeg&lt;/a&gt;\n\nPaul Gill, &quot;Electrical Power Equipment Maintenance and Testing, Second Edition (Power Engineering)&quot;\nCRC | 2008 | ISBN: 1574446568 | 1000 pages | PDF \n\nNew trends toward preventive and predicative maintenance are giving rise to advanced techniques for obtaining maximum life from electrical equipment, maintaining its reliability, and minimizing the repair costs. Following in the tradition of its best selling predecessor, Electric Power Equipment Maintenance and Testing, Second Edition consolidates and coordinates the latest developments in the field of testing and maintenance into one comprehensive text.\n\nInsights and Recommendations based on Sound Engineering Principles\n\nIntegrating basic principles, theory and practice, the book discusses routine (field) and commissioning testing and maintenance procedures for assessing equipment insulation integrity and operational dependability. The book shows how to inspect and test equipment for apparatus insulation integrity and other operating characteristics that affect performance and reliability. The author evaluates and interprets results for each category of testing and elucidates equipment degradation mechanisms and their impact on reliability and efficiency by detailing failure modes and effects.\n\nContaining numerous references, equations, illustrations, and photographs, this valuable resource is a one-stop guide for implementing an effective for maintenance and testing plan for electric power equipment. ","torrent":{"xt":"urn:btih:9b602e01115f452c5dd0b4d8f50cb630b77ae5c2","amp;dn":"Electrical+Power+Equipment+Maintenance+and+Testing%2C+2nd+Ed+-+%28Ma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9b602e01115f452c5dd0b4d8f50cb630b77ae5c2","infoHashBuffer":{"type":"Buffer","data":[155,96,46,1,17,95,69,44,93,208,180,216,245,12,182,48,183,122,229,194]},"announce":[],"urlList":[]}}