{"title":"The Gits Movie","uid":5072501,"size":733087744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9be6825e825baafcce875c7270d7b7ffd9393903&amp;dn=The+Gits+Movie&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cexxx","files":1,"time":1251537610,"description":"The first time Matt Dresdner heard Mia Zapata sing, he knew she was destined to front the punk rock group he dreamt of forming. In the fall of 1986, at Ohio's Antioch College, Dresdner, Andrew Kessler, Steve Moriarty, and Zapata became The Gits. In 1989, they relocated to Seattle, WA, in search of a new life and a larger audience. The Gits quickly gained popularity in the Seattle music scene of the early 1990s, distinguishing themselves with their soulful street punk at a time when &quot;grunge&quot; was putting Seattle on the map. Characterized by powerful, driving music and Zapata's poetic lyrics, major record labels took notice. But just as The Gits were poised to explode onto the national music scene, an unfathomable tragedy struck. On July 7, 1993, Mia Zapata was raped and murdered in Seattle while walking home one night. Without warning, this promising band faced a horrific end and the fabric that built this tight knit music community began to unravel. In 2003, one year into filming &quot;The Gits&quot; documentary, a swab of saliva DNA left on Zapata's body solved the ten-year mystery which still haunted her friends, family, and fans since the day of her death so long ago. This film celebrates the band's enduring musical legacy while embracing the soul of the legendary Mia Zapata and the love that so many hold in their hearts for a band that continues to touch lives.","torrent":{"xt":"urn:btih:9be6825e825baafcce875c7270d7b7ffd9393903","amp;dn":"The+Gits+Movie","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9be6825e825baafcce875c7270d7b7ffd9393903","infoHashBuffer":{"type":"Buffer","data":[155,230,130,94,130,91,170,252,206,135,92,114,112,215,183,255,217,57,57,3]},"announce":[],"urlList":[]}}