{"title":"Furies: War in Europe, 1450-1700","uid":8747372,"size":4099697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9c57172253d134000611c155c5ecc12d419eed73&amp;dn=Furies%3A+War+in+Europe%2C+1450-1700&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Djofullinn","files":1,"time":1374954800,"description":"We think of the Renaissance as a shining era of human achievementa pinnacle of artistic genius and humanist brilliance, the time of Shakespeare, Michelangelo, and Montaigne. Yet it was also an age of constant, harrowing warfare. Armies, not philosophers, shaped the face of Europe as modern nation-states emerged from feudal society. In Furies, one of the leading scholars of Renaissance history captures the dark reality of the period in a gripping narrative mosaic.\n\nAs Lauro Martines shows us, total war was no twentieth-century innovation. These conflicts spared no civilians in their path. A Renaissance army was a mobile city-indeed, a force of 20,000 or 40,000 men was larger than many cities of the day. And it was a monster, devouring food and supplies for miles around. It menaced towns and the countryside-and itself-with famine and disease, often more lethal than combat. Fighting itself was savage, its violence increased by the use of newly invented weapons, from muskets to mortars.\n\nFor centuries, notes Martines, the history of this period has favored diplomacy, high politics, and military tactics. Furies puts us on the front lines of battle, and on the streets of cities under siege, to reveal what Europes wars meant to the men and women who endured them.\n\n\n--------\n\nLook it up at Amazon.","torrent":{"xt":"urn:btih:9c57172253d134000611c155c5ecc12d419eed73","amp;dn":"Furies%3A+War+in+Europe%2C+1450-1700","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9c57172253d134000611c155c5ecc12d419eed73","infoHashBuffer":{"type":"Buffer","data":[156,87,23,34,83,209,52,0,6,17,193,85,197,236,193,45,65,158,237,115]},"announce":[],"urlList":[]}}