{"title":"Rockets and Missiles - The Life Story of a Technology.pdf","uid":10844531,"size":1929324,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9ca0845e405b0d01af17db3adb07a47dfc51b730&amp;dn=Rockets+and+Missiles+-+The+Life+Story+of+a+Technology.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tmcnl","files":-1,"time":1408761416,"description":"Rockets and Missiles: The Life Story of a Technology\n\nBeginning with World War II, missiles transformed the art of war. For the first time, cities of warring nations were vulnerable to sudden, unannounced, long-distance destruction. At the same time, rockets made possible one of the great triumphs of the modern age--the exploration of space. Rockets and Missiles traces the history of the technology that led to both the great fear of global warfare, and the great excitement of the Space Age. Beginning with the origins of rocketry in medieval and early modern Asia, the volume focuses on rocketry in late-20th-century Western Europe, Russia, and the United States, and also covers the spread of rocket technology in East Asia, the Middle East, and elsewhere.\n \nRockets and Missiles covers everything any student or interested layperson would need to understand the history of rocketry. The introduction reviews basic principles of physics and basic elements of chemical rocket technology. Chapters trace the history of rockets from their origins to the present day, with a particular emphasis on the years since World War II. All three principal uses of rocket technology are covered in detail: missiles as long-range strategic weapons and short-range tactical weapons, and rockets as launch vehicles for sending payloads into space The book concludes with a survey of several types of non-chemical rockets now under development for use in outer space. While Rockets and Missiles covers the development of the technology, including how rockets improved in performance, reliability, and versatility. The book also stresses the impact of rocket technology--both military and civilian--on everyday life.\n\n2007\nPDF","torrent":{"xt":"urn:btih:9ca0845e405b0d01af17db3adb07a47dfc51b730","amp;dn":"Rockets+and+Missiles+-+The+Life+Story+of+a+Technology.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ca0845e405b0d01af17db3adb07a47dfc51b730","infoHashBuffer":{"type":"Buffer","data":[156,160,132,94,64,91,13,1,175,23,219,58,219,7,164,125,252,81,183,48]},"announce":[],"urlList":[]}}