{"title":"Fireworks - Discography (2008-2014) [FLAC]","uid":9845632,"size":1015335513,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9cc32785a187a4b15696419bd963df5024ed6eff&amp;dn=Fireworks+-+Discography+%282008-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1396063248,"description":"\n  Fireworks - Discography (2008-2014) [FLAC]\n\n  Genre: Pop/Rock \n  Styles: Pop-Punk, Emo, Alternative\n  Source: CD \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  2008 We Are Everywhere \n  2009 All I Have to Offer Is My Own Confusion\n  2011 Gospel (Japan Bonus Tracks Edition)\n  2014 Oh, Common Life\n\n  Hailing from Detroit, Michigan, Fireworks are a pop-punk band whose music fuses an energetic, guitar-driven attack with tuneful melodies and personal lyrics. Formed in 2005 in Metro Detroit, Fireworks features David Mackinder on lead vocals, Brett Jones on lead guitar, Chris Mojan on rhythm guitar and backing vocals, Kyle O'Neil on bass, and Tymm Rengers on drums. The year they formed, Fireworks cut a demo called Can't Hardly Wait, and in 2006 they made their official recorded debut with a six-song EP, We Are Everywhere, released by the indie label Run for Cover Records. Fireworks hit the road hard in support, sharing stages with the likes of Set Your Goals, Valencia, and Strung Out, as well as appearing at the Vans Warped Tour. In 2009, Fireworks signed with Triple Crown Records and released their first full-length album, All I Have to Offer You Is My Own Confusion. The album was produced by Chad Gilbert of New Found Glory, who would tour with Fireworks, as did Saves the Day, H20, and Four Year Strong. In 2011, Fireworks returned with their second album, Gospel, and lots more touring followed, including visits to Europe and Australia. In March 2014, Fireworks dropped their third full-length, Oh, Common Life, and booked a U.S. tour in support with the Wonder Years, Real Friends, Citizen, and Modern Baseball.","torrent":{"xt":"urn:btih:9cc32785a187a4b15696419bd963df5024ed6eff","amp;dn":"Fireworks+-+Discography+%282008-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9cc32785a187a4b15696419bd963df5024ed6eff","infoHashBuffer":{"type":"Buffer","data":[156,195,39,133,161,135,164,177,86,150,65,155,217,99,223,80,36,237,110,255]},"announce":[],"urlList":[]}}