{"title":"Orchestra Baobab - On Verra Ca! [FLAC] TQMP","uid":5609313,"size":369088831,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ce74748c8b78af565e4039235b727d8db9baa0d&amp;dn=Orchestra+Baobab+-+On+Verra+Ca%21+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"pastafari","files":-1,"time":1275769331,"description":"Orchestra Baobab - On Verra Ca! (The 1978 Paris Sessions)\n2003\n\nI've posted their masterpiece Pirates Choice, the classic Specialist Of All Styles and the amazing come-back album Made In Dakar. I'd say it's time for a rarity you shouldn't miss.\n\nBrought to you by TQMP\nThe Quality Music Project\n\nRecorded in Paris in 1978, On Verra Ca is the first recording by the fully matured Orchestra Baobab. The rumba influence is pronounced on the opening &quot;El Son De Llama,&quot; but mostly the Latin tinge has now been absorbed into a distinctive group sound, with upbeat, sprightly songs like &quot;Africa&quot; built around choppy, syncopated riffs flavored by horns and a galloping rhythm guitar. &quot;Sibam&quot; follows that blueprint, but the tempo is faster and there's a stronger percussion presence than the light norm here. The title track is the masterpiece in this vein -- the vocal blend makes the endlessly repeated riff broken up by brief solos not only bearable, but so totally hypnotic it sticks in your head for days. The slow, mournful &quot;Tante Marie&quot; boasts two-sax horn parts and a moody guitar melody -- the opening to Barthelemy Attisso's solo opening even sounds a little bit like something from the third Velvet Underground album, of all things. &quot;El Fuego&quot; has more of a Latin lilt and exceptionally good voices, while the horns and those vocal harmonies again really cut through on the highly infectious &quot;Digon.&quot; It's hard to pinpoint precisely what makes Orchestra Baobab's vocal squad sound so special -- probably a combination of the quality of the different voices and the unforced naturalness and sincerity of the singing. The highly compressed sound that prevents the music from punching hard probably keeps On Verra Ca from being a great album, but it's a highly enjoyable one and certainly put Orchestra Baobab on the road to the Bamba bomb.\n-- AllMusic.com\n\nTracks\n01- El son te llama\n02- On verra ca!\n03- Tante Marie\n04- Africa\n05- El fuego\n06- Sibam\n07- Wane ma maguiss\n08- Thioisanne\n09- Mi son\n10- Digon Gama\n\nArtwork, EAC log and CUE sheet included.\n\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari Cubensis &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:9ce74748c8b78af565e4039235b727d8db9baa0d","amp;dn":"Orchestra+Baobab+-+On+Verra+Ca%21+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ce74748c8b78af565e4039235b727d8db9baa0d","infoHashBuffer":{"type":"Buffer","data":[156,231,71,72,200,183,138,245,101,228,3,146,53,183,39,216,219,155,170,13]},"announce":[],"urlList":[]}}