{"title":"Coast To Coast AM 11-01-2014 - Ghost Encounters - Exopolitics","uid":11355531,"size":56302750,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:9d01d1cd69e1ae8ee5dec99ba7b4d20dd0b6bc48&amp;dn=Coast+To+Coast+AM+11-01-2014+-+Ghost+Encounters+-+Exopolitics&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Isaac09","files":-1,"time":1414936118,"description":"Ghost Encounters/ Exopolitics\n\n\nDate:\t11-01-14\nHost:\tDave Schrader\nGuests:\tRob MacGregor, Michael E. Salla\n\n\nAudio\nFormat                                   : MPEG Audio\nFormat version                           : Version 1\nFormat profile                           : Layer 3\nDuration                                 : 2h 36mn\nBit rate mode                            : Constant\nBit rate                                 : 48.0 Kbps\nChannel(s)                               : 1 channel\nSampling rate                            : 44.1 KHz\nCompression mode                         : Lossy\nStream size                              : 53.4 MiB (99%)\n\n\n\nIn the first half, host Dave Schrader (email) welcomed author Rob MacGregor for an exploration into the realm of ghosts, spirits and entity encounters as well as celebrities and the supernatural. MacGregor differentiated ghosts from spirits by explaining that &quot;ghosts haunt&quot; while &quot;a spirit guides.&quot; To that end, he indicated that ghosts are often either seen repeating some function from their previous life, seemingly unaware of observers, or acting as if they hadn't died at all and are perturbed by witnesses. &quot;In fact,&quot; he mused, &quot;they may think that you're the one who is the ghost.&quot; Spirits, he said, are usually family members or friends who have passed away and appear via a dream, vision, or session with a medium.\n\nRegarding celebrities and apparitions, MacGregor noted that, while living at the Dakota Apartments, John Lennon once witnessed the ghost of a crying woman walking down the hallway. Eerily, his own ghost was later reportedly seen by Yoko Ono in the very same building. MacGregor also shared the story of how actor Telly Savales once ran out of gas and got a ride from a stranger who loaned him a dollar. Promising to pay the man back, Savales had him write his phone number on the bill. When he called the number, the man's wife answered the phone and told Savales that her husband had been dead for three years. The actor would eventually meet the woman to show her writing on the bill and she was certain that it was that of her late husband. MacGregor also recounted tales of ghostly interactions involving Marilyn Monroe, Keanu Reeves, and Lucille Ball.\n\n--------------------------------------\nIn the latter half, Dr. Michael Salla, a pioneer in the development of exopolitics, discussed the significance of the Pope's endorsement of ET life as part of universal evolution and how it relates to UFO disclosure. He contended that the pontiff's statements are particularly noteworthy because they mark the first time a Pope has talked about intelligent extraterrestrial life being a part of evolution. Salla suggested that the Pope's actions are part of a larger agenda by the Catholic Church aimed at insuring that it remains a trusted institution when the truth about ETs is revealed. Moreover, he speculated that the Pope may ultimately be laying the groundwork for a more nuanced definition of God in the event that it is shown that ETs played a role in creating the human race.\n\nSalla theorized that the Pope's statements on ETs were fueled by the emergence of footage which showed UFOs hovering near the ISS since both occurred within the last month. &quot;I think there is a definite pattern here,&quot; he argued. On what these craft may have been doing near the ISS, Salla put forward a pair of possible motives. One reason, he said, may be that &quot;the extraterrestrials are maintaining a very close scrutiny of the space station&quot; and have an interest in human activities there. Additionally, Salla surmised that, since the ETs likely know that the ISS has high definition cameras which capture their presence, they could be using this opportunity to make their presence known and more easily reveal themselves to the denizens of Earth.\n\nWebsite(s):\nrobmacgregor.buzz\nexopolitics.org\n\nBook(s):\nBump in the Night - Ghosts, Spirits and Alien Encounters\nExopolitics: Political Implications Of The Extraterrestrial Presence","torrent":{"xt":"urn:btih:9d01d1cd69e1ae8ee5dec99ba7b4d20dd0b6bc48","amp;dn":"Coast+To+Coast+AM+11-01-2014+-+Ghost+Encounters+-+Exopolitics","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d01d1cd69e1ae8ee5dec99ba7b4d20dd0b6bc48","infoHashBuffer":{"type":"Buffer","data":[157,1,209,205,105,225,174,142,229,222,201,155,167,180,210,13,208,182,188,72]},"announce":[],"urlList":[]}}