{"title":"Peter Hitchens The War We Never Fought","uid":11546775,"size":3279317,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d3bbee344e83c173a1c02cfb4c0692e9218e6b2&amp;dn=Peter+Hitchens+The+War+We+Never+Fought&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1416741867,"description":"Again and again British politicians, commentators and celebrities intone that 'The War on Drugs has failed'. They then say that this is an argument for abandoning all attempts to reduce drug use through the criminal law. Peter Hitchens shows that in Britain there has been no serious 'war on drugs' since 1971, when a Tory government adopted a Labour plan to implement the revolutionary Wootton report. This gave cannabis, the most widely used illegal substance, a special legal status as a supposedly 'soft' drug (in fact, Hitchens argues, it is at least as dangerous as heroin and cocaine because of the threat it poses to mental health). It began a progressive reduction of penalties for possession, and effectively disarmed the police. This process still continues, behind a screen of falsely 'tough' rhetoric from politicians. Far from there being a 'war on drugs', there has been a covert surrender to drugs, concealed behind an official obeisance to international treaty obligations. To all intents and purposes, cannabis is legal in Britain, and other major drugs are not far behind. In The War We Never Fought, Hitchens uncovers the secret history of the government's true attitude, and the increasing recruitment of the police and courts to covert decriminalisation initiatives, and contrasts it with the rhetoric. Whatever and whoever is to blame for the undoubted mess of Britain's drug policy, it is not 'prohibition' or a 'war on drugs', for neither exists.\n\nPublisher: Bloomsbury Continuum (27 Sep 2012)\nLanguage: English\nISBN-10: 1441173315\nISBN-13: 978-1441173317","torrent":{"xt":"urn:btih:9d3bbee344e83c173a1c02cfb4c0692e9218e6b2","amp;dn":"Peter+Hitchens+The+War+We+Never+Fought","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d3bbee344e83c173a1c02cfb4c0692e9218e6b2","infoHashBuffer":{"type":"Buffer","data":[157,59,190,227,68,232,60,23,58,28,2,207,180,192,105,46,146,24,230,178]},"announce":[],"urlList":[]}}