{"title":"The Bottom Billion: Why the Poorest Countries are Failing and Wh","uid":8520067,"size":2143314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9d77a04a8c1a7284e2b432a0f8ade17008da82b6&amp;dn=The+Bottom+Billion%3A+Why+the+Poorest+Countries+are+Failing+and+Wh&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1369888938,"description":"Paul Collier, &quot;The Bottom Billion: Why the Poorest Countries are Failing and What Can Be Done About It&quot;\nISBN: 0195311450, 0195373383 | 2007 | EPUB/MOBI | 224 pages | 2 MB/829 KB\n\nIn the universally acclaimed and award-winning The Bottom Billion, Paul Collier reveals that fifty failed states--home to the poorest one billion people on Earth--pose the central challenge of the developing world in the twenty-first century. The book shines much-needed light on this group of small nations, largely unnoticed by the industrialized West, that are dropping further and further behind the majority of the world's people, often falling into an absolute decline in living standards. A struggle rages within each of these nations between reformers and corrupt leaders--and the corrupt are winning. Collier analyzes the causes of failure, pointing to a set of traps that ensnare these countries, including civil war, a dependence on the extraction and export of natural resources, and bad governance. Standard solutions do not work, he writes; aid is often ineffective, and globalization can actually make matters worse, driving development to more stable nations. What the bottom billion need, Collier argues, is a bold new plan supported by the Group of Eight industrialized nations. If failed states are ever to be helped, the G8 will have to adopt preferential trade policies, new laws against corruption, new international charters, and even conduct carefully calibrated military interventions. Collier has spent a lifetime working to end global poverty. In The Bottom Billion, he offers real hope for solving one of the great humanitarian crises facing the world today.\n","torrent":{"xt":"urn:btih:9d77a04a8c1a7284e2b432a0f8ade17008da82b6","amp;dn":"The+Bottom+Billion%3A+Why+the+Poorest+Countries+are+Failing+and+Wh","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d77a04a8c1a7284e2b432a0f8ade17008da82b6","infoHashBuffer":{"type":"Buffer","data":[157,119,160,74,140,26,114,132,226,180,50,160,248,173,225,112,8,218,130,182]},"announce":[],"urlList":[]}}