{"title":"The Man Who Sold America - The Amazing Story of Creation of the","uid":7989869,"size":694898,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9dd131710b12e889e0fa5804101579b312caba89&amp;dn=The+Man+Who+Sold+America+-+The+Amazing+Story+of+Creation+of+the+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KatQwerty","files":3,"time":1357345096,"description":"[b]Publication Date: August 12, 2010      |      EPUB [/b]\n \n \n \nThe Man Who Sold America is a riveting account of a man larger than life, who shaped not only an industry but also a century\n\nWe're living in the Age of Persuasion. Leaders and organizations of all kinds--public and private, large and small--fulfill their missions only by competing in the marketplace of images and messages. To win in that marketplace, they need advertising. This has been true since the advent of mass media, from mass-circulation magazines and radio through the age of television and the Internet.\n \n\nYet even as they use advertising to capture consumers' imaginations and build their brands, few people know of the ingenious and tormented man who built the modern advertising industry and shaped a new consumer sensibility as the twentieth century unfolded: Albert D. Lasker.\n \n\nDrawing on a recently uncovered trove of Lasker's papers, Jeffrey Cruikshank and Arthur Schultz have written a fascinating biography of one of the past century's most influential, intriguing, troubled, and instructive figures. Lasker's creative and powerful use of &quot;reason-why&quot; advertising to inject ideas and arguments into ad campaigns had a profound impact on modern advertising, foreshadowing the consumer-centered &quot;unique selling proposition&quot; approach that dominates the industry today. His tactics helped launch or revitalize companies and brands that remain household names--including Palmolive, Goodyear, and Quaker Oats.\n \n\nAs Lasker rose in prominence, he went beyond consumer products to apply his brilliance to presidential politics, government service, and professional sports, changing the game wherever he went, and building a vast fortune along the way. But his intensity had a price--he was felled by mental breakdowns throughout his life. This book also tells the story of how he fought back with determination and with support from family and friends in an age when lack of effective treatment doomed most mentally ill people.\n \n\n ","torrent":{"xt":"urn:btih:9dd131710b12e889e0fa5804101579b312caba89","amp;dn":"The+Man+Who+Sold+America+-+The+Amazing+Story+of+Creation+of+the+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9dd131710b12e889e0fa5804101579b312caba89","infoHashBuffer":{"type":"Buffer","data":[157,209,49,113,11,18,232,137,224,250,88,4,16,21,121,179,18,202,186,137]},"announce":[],"urlList":[]}}