{"title":"Joe Bonamassa - An Acoustic Evening at the Vienna Opera House  1","uid":8305556,"size":1990573881,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:9e87da64eaf01c6a49817b451ebde8348fedffd8&amp;dn=Joe+Bonamassa+-+An+Acoustic+Evening+at+the+Vienna+Opera+House++1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"L4F","files":1,"time":1364362907,"description":"Joe Bonamassa - An Acoustic Evening at the Vienna Opera House\n\n\nAmerican blues and rock guitarist Joe Bonamassa showcases a one-of-a-kind performance on stage at the Vienna Opera House where he plays songs from his recent albums, which includes &quot;Arrival,&quot; &quot;Jerry Roll,&quot; &quot;Slow Train&quot; and &quot;Richmond&quot;. Varying from his predominantly electric blues shows, this presentation was an all-acoustic concert performance, making it a unique and very special show fans had been waiting years to experience.\n\nThis hour and a half program spotlights Bonamassa's special and exclusive concert at the Vienna Opera House from July 2012, which he played to a limited audience over seven exclusive European shows during a two week unplugged tour. Also featured is an eclectic assortment of music craftsmen from around the globe. They include: Gerry O'Connor, a music historian and traditional Irish fiddler from many generations of Irish music, who will play mandolin and Irish banjo; Swedish instrumentalist Mats Wester on the Nyckelharpa, a Swedish keyed-fiddle which will inject a traditional and unique &quot;world&quot; feel into a set of original and iconic songs; Los Angeles keyboard maestro Arlan Schierbaum, whose extensive recording career focuses on organic instruments, will add all manner of musical textures with accordions, celeste, toy pianos, and more; and legendary Puerto Rican percussionist Lenny Castro, whose works spans genres and reads like a who's who of artists, including the Rolling Stones, Sir Elton John, Eric Clapton, Boz Scaggs, Toto, Steely Dan, Christopher Cross, Stevie Wonder, David Sanborn, Avenged Sevenfold, Little Feat, Tom Petty, the Red Hot Chili Peppers and hundreds of others.\n\n\nVideo:    MPEG-4 AVC, H.264, 1920x1080, 1080p (16:9), 5000kbps at 29.97fps\nAudio:    AC-3 6-channel Dolby 5.1, 384Kbp,s 16bits, 48KHz \nDuration: 56 minutes\n\n\nEnjoy!\n","torrent":{"xt":"urn:btih:9e87da64eaf01c6a49817b451ebde8348fedffd8","amp;dn":"Joe+Bonamassa+-+An+Acoustic+Evening+at+the+Vienna+Opera+House++1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e87da64eaf01c6a49817b451ebde8348fedffd8","infoHashBuffer":{"type":"Buffer","data":[158,135,218,100,234,240,28,106,73,129,123,69,30,189,232,52,143,237,255,216]},"announce":[],"urlList":[]}}