{"title":"13th Floor Elevators-Easter Everywhere(1967)(2003 Charly Rem.)[E","uid":4736407,"size":469795677,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9f5c992eb61b7c998bea979cdb81d7acee386c82&amp;dn=13th+Floor+Elevators-Easter+Everywhere%281967%29%282003+Charly+Rem.%29%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thewall68","files":35,"time":1235310511,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp.\n\n\nTexas psyche-rock legends the 13th Floor Elevators released their second studio album, EASTER EVERYWHERE, in 1967. Continuing in the tradition established by their debut, EASTER EVERYWHERE is built on garage-band R&amp;B and swirling acid-rock, ...    Full Descriptionwith lead singer Roky Erickson's haunting wail and Tommy Hall's percolating electric jug lines front and center. While rave-ups like &quot;Earthquake,&quot; &quot;She Lives (In A Time of Her Own),&quot; and &quot;Nobody to Love&quot; find the Elevators at their beguiling best, the album's centerpiece is a sprawling, pastoral, and achingly restrained take on Bob Dylan's &quot;It's All Over Now Baby Blue&quot; (here titled simply &quot;Baby Blue&quot; ) in which Erickson snakes his away around the lyrics showing off the sweetly damaged croon that made him an underground icon. While they'll never get the acclaim garnered by the Grateful Dead or Jefferson Airplane, the Elevators made truly psychedelic music, fueled as much by chemicals and the spirit of the times as the beautifully strange journeys Roky Erickson took through his troubled mind. EASTER EVERYWHERE is an excellent place to join Roky's trip.\n\nHow could the The 13th Floor Elevators surpass their first explosive album? Well, listen. From the egg into the flower: The haunting whoop of Tommy Hall's jug, and Danny Galindo's intertwining bass guitar... EASTER EVERYWHERE! The Beatles, upon returning from the USA, were asked which American group made the greatest impression on them. George said &quot;The Elevators&quot;; the other Beatles nodded respectfully. The Elevators' transcendence from RAW ROCK to a profoundly spiritual masterpiece of psychedelia harkens to the Beatles' emergence in Sgt Pepper's. The deep lyrics of Slip Inside this House. The strong guitar in She Lives, the beauty of Dust, and for those who weren't ready to drop the acid rock torch of the previous blockbuster Elevators' album... I've Got Levitation. One of those presses where EVERY song is GREAT! Incidentally, International Artists (label) had extensive problems with 'bubbles' in their vinyl pressings, so this CD offering is a gift from above! Do listen to Postures! (Leave Your Body Behind). Play on, Stacy Southerland! All in all, a most timeless release. Your collection is incomplete without this CD! Excellent recording!\n\n\n\nTrack listing\n\n   1. &quot;Slip Inside This House&quot;\n   2. &quot;Slide Machine&quot;\n   3. &quot;She Lives (in a Time of Her Own)&quot;\n   4. &quot;Nobody to Love&quot;\n   5. &quot;Baby Blue&quot;\n   6. &quot;Earthquake&quot;\n   7. &quot;Dust&quot;\n   8. &quot;Levitation&quot;\n   9. &quot;I Had to Tell You&quot;\n  10. &quot;Pictures (Leave Your Body Behind)&quot;\n\nIn 2003, Charly reissued the CD, with additional tracks:\n\n  11. &quot;Splash 1&quot;\n  12. &quot;Kingdom of Heaven&quot;\n  13. &quot;You're Gonna Miss Me&quot;\n  14. &quot;Reverbation (Doubt)&quot;\n  15. &quot;You Don't Know&quot;\n  16. &quot;Fire Engine&quot;\n  17. &quot;Monkey Island&quot;\n  18. &quot;Roller Coaster&quot;\n  19. &quot;Levitation&quot; (Instrumental)\n  20. &quot;I Don't Ever Want to Come Down&quot;\n\nTracks 11-14 were recorded live in Texas, 1967. Tracks 15-18 were recorded in San Francisco, 1966.\n\n\n\nPersonnel \t\n\nRoky Erickson\nDanny Thomas\nStacy Sutherland\nTommy Hall\nDan Galindo\n\n\nVISIT US AT THE COLOMBO-RELOADED.ORG","torrent":{"xt":"urn:btih:9f5c992eb61b7c998bea979cdb81d7acee386c82","amp;dn":"13th+Floor+Elevators-Easter+Everywhere%281967%29%282003+Charly+Rem.%29%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9f5c992eb61b7c998bea979cdb81d7acee386c82","infoHashBuffer":{"type":"Buffer","data":[159,92,153,46,182,27,124,153,139,234,151,156,219,129,215,172,238,56,108,130]},"announce":[],"urlList":[]}}