{"title":"CBT Nuggets Citrix Presentation Server 4 DRM -REMOVED","uid":4658070,"size":168491008,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a00b6c4015f91dd90813ee934739ff9ba8f0d08f&amp;dn=CBT+Nuggets+Citrix+Presentation+Server+4+DRM+-REMOVED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Znupper","files":1,"time":1232238215,"description":"Dont worry about DRM, it gone...\n\n\n\n\nProvide easy, secure access to applications and documents from anywhere - no VPN required. That's what you can do with Citrix Presentation Server. Plus, maintain central control over user experience. No dealing with the hassle of installing software on every computer in the company. Less headaches from botched settings on locally-installed client software. The list of Citrix's benefits goes on.\nIn this training, CBT Nuggets Instructor Greg Shields teaches you how to administer Citrix Presentation Server, including setup, policy control, program deployment, enabling client access, catering the user experience, and much more.\n\nHere's what you learn in this series:\n\nUnderstand how Citrix functions as a business solution, plus makes your life in IT easier.\nDefine the components of a Citrix Presentation Server farm, plus learn how they interact with each other and with clients.\nPrepare your server for installing Citrix (sounds simple - but it's very important!), then install Citrix Presentation Server and Citrix licensing.\nManage licensing both when you set Citrix up initially, then when you add licenses later.\nConfigure farm settings using the Citrix Metaframe Console - and learn when it's better to configure settings at the farm level, and when it's better to configure settings at the server level.\nUse policies for granular control over the user experience - create, filter, and prioritize policies, plus create policy exceptions.\nAdjust protocol settings for both ICA and RDP protocols, including timeouts, security settings, and mapping overrides.\nInstall and configure each of the four types of Citrix client - plus understand when each client type should be deployed.\nAdd programs to your server, including both Citrix-friendly applications and applications that don't automatically work well in a Citrix environment - plus create isolation environments to prevent applications from conflicting with each other.\nPublish applications and desktops for client use - and know when it's better to make applications available for users versus making the entire desktop available.\nPackage software for quick deployment to multiple Citrix servers - and use Installation Manager to only go through the installation process once, no matter how many servers you're deploying the software to.\nManage traffic load and perform load balancing across the servers in your farm - learn how and when to use the default and advanced load evaluators, plus create and assign custom load balancers for more advanced load balancing needs.\nUse Resource Manager to track usage of servers in your server farm - including both real-time and historical data.\nConfigure Citrix printing (a historical problem spot), including using client, local, and network printing, interfacing with network print servers, plus managing drivers and printers.\nEnable web access to the applications installed on your Citrix servers - then configure a web interface site, paying attention to authentication, workspace control, setting up client proxies, and the different interfaces clients can use to access your web-enabled applications.\nSecure communication to and from your Citrix servers by using more secure architectures, ICA encryption, SSL relay technology, and Citrix's Web Interface with Secure Gateway.\nLearn which Citrix command line tools are really important to know for the exam and for using Citrix on the job - plus which tools probably won't show up on the exam but will make your life as a Citrix admin easier.\nUnderstand how everything you learn in this training applies to taking the Citrix CCA exam.\nReal world skills plus exam prep\n\nThe Citrix CCA for Presentation Server 4 video series goes in detail with all this information and more, teaching you how to implement Citrix servers and server farms. In addition to giving you real world skills and implementation strategies, it maps to exam objectives for Citrix Exam 256 - Citrix Presentation Server 4: Administration.\n\nPrerequisites\n\nA basic understanding of Windows networking such as a MCSA or MCSE certification or equivalent knowledge is recommended before viewing these videos.\n\n\nCitrix CCA for Presentation Server 4 contains:\n\n- Introduction to Citrix and the CCA\n- Applied and Architectural Concepts for Presentation Server\n- Installing Presentation Server\n- Configuring Licensing &amp; Farm Settings\n- Configuring Policies &amp; Citrix Connection Configuration\n- Installing &amp; Configuring the Citrix Client\n- Installing Applications to Presentation Server\n- Publishing Applications and Content (free video!)\n- Deploying Applications with Installation Manager\n- Managing Loads and Load Balancing\n- Managing Resources with Resource Manager\n- Configuring Printing\n- Enabling Web Access\n- Securing Citrix Communication\n- Command Line Tools &amp; Exam Review\n\n","torrent":{"xt":"urn:btih:a00b6c4015f91dd90813ee934739ff9ba8f0d08f","amp;dn":"CBT+Nuggets+Citrix+Presentation+Server+4+DRM+-REMOVED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a00b6c4015f91dd90813ee934739ff9ba8f0d08f","infoHashBuffer":{"type":"Buffer","data":[160,11,108,64,21,249,29,217,8,19,238,147,71,57,255,155,168,240,208,143]},"announce":[],"urlList":[]}}