{"title":"Principles of Transaction Processing 2nd","uid":4980376,"size":6073424,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0726f9327e5e1367e6731bdae5808eb44babf8b&amp;dn=Principles+of+Transaction+Processing+2nd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VasiaZozulia","files":-1,"time":1246267836,"description":"What do reserving a seat on an airplane, buying a movie ticket over the Internet, and launching a missile all have in common? Principles of Transaction Processing for the Systems Professional explains that these and many other computerized tasks require the use of transaction processing (TP). Authors Philip Bernstein and Eric Newcomer demonstrate that this previously specialized area of systems design is becoming more important with the growth of Internet commerce. This theoretically astute and practical-minded book begins with a description of the principles of successful transaction management. (The so-called &quot;ACID&quot; test requires that transactions be atomistic, consistent, isolated, and durable.) The authors illustrate the principles with real-world examples of transactions in everyday life, such as ATM systems and the stock market. Bernstein and Newcomer then outline how transaction processing monitors work and discuss some of the details, such as interface definition languages, which let disparate computers communicate, and remote procedure calls.\n\nThe text also explores some real-world TP monitor products, from IBM's CICS to Tuxedo to Microsoft Transaction Server. While transaction processing has been a part of mainframe system design for decades, it has recently become relevant for commerce and everyday database access on the Web. The authors look at today's Web servers--Microsoft Internet Information Server and Netscape's FastTrack Server--and show how they manage transactions. Additional chapters move back into the theoretical, with descriptions of database transactions and strategies for replicating data. The text finishes up with some predictions on where this vital and established technology is headed. This book is a must for any developer who is designing a Web site that connects users to data in a distributed environment. It's also a definitive guide to an intriguing area of computing. ","torrent":{"xt":"urn:btih:a0726f9327e5e1367e6731bdae5808eb44babf8b","amp;dn":"Principles+of+Transaction+Processing+2nd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0726f9327e5e1367e6731bdae5808eb44babf8b","infoHashBuffer":{"type":"Buffer","data":[160,114,111,147,39,229,225,54,126,103,49,189,174,88,8,235,68,186,191,139]},"announce":[],"urlList":[]}}