{"title":"Microsoft Office Standard 2016 v15.22","uid":14619271,"size":1510130638,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:a086395cf616844ca13995ec02da7f748ce5d7a1&amp;dn=Microsoft+Office+Standard+2016+v15.22&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":6,"time":1463248037,"description":"Microsoft Office Standard 2016 v15.22\r\n \r\n\r\n OS X Software\r\nThe release took place: may 10, 2016\r\nSupported OS: OS X 10.10 +\r\nDeveloper: Microsoft\r\nOfficial site: link\r\nInterface language: Russian, English, German etc.\r\nTreatment: complete\r\nType of medicine: licensor\r\nSystem requirements:\r\n• Mac computer with an Intel processor\r\n• Mac OS X version 10.10\r\n• Recommended: 1 GB of RAM\r\n• 6.45 GB of free hard disk space\r\n• Hard disk formatting type HFS+ (also known as Mac OS Extended or HFS Plus)\r\n• A monitor with 1280x800 resolution or higher\r\n• Recommended Safari 7\r\n\r\nDescription:\r\nUnmistakably Office, designed for Mac\r\nQuickly get to work with modern versions of Word, Excel, PowerPoint, Outlook and OneNote, which combines the familiar Office interface and unique capabilities of the Mac, who managed to catch the fancy of you. Support full screen mode-optimized for Retina displays was a pleasant and appropriate innovation.\r\n\r\nwhat's new\r\n\r\nMS16-054: Description of the security update for Office 2016 for Mac: May 10, 2016\r\nAdresse de messagerie\r\nMicrosoft Security Bulletin MS16-054. Microsoft Office 2016 for Mac includes versions of Word, Excel, PowerPoint, OneNote, and Outlook that are designed for the Mac and yet are unmistakably Office. The May 10, 2016, update provides fixes for issues in the Office 2016 for Mac Suite that affect Word, Excel, PowerPoint, and OneNote.\r\nNotes\r\nTo install this update, you must be running OS X Yosemite 10.10 or a later version, and you must have a valid Microsoft Office 365 subscription. Additionally, see more information about Office 365 subscription options.\r\nIf you already have Office for Mac 2011 installed, you can run Office for Mac 2011 and Office 2016 for Mac side-by-side. If you want to remove Office for Mac 2011, see Uninstall Office 2011 for Mac.\r\nIf you are prompted for a password when you install this update, enter the administrator password on Mac OS X. For more information, see Mac OS X: Software installations require administrator password.\r\nFor a complete list of affected versions of Microsoft Office software, see KB3155544.\r\nImprovements and fixes\r\nThis update provides the following fixes and improvements.\r\n\r\nOutlook\r\n Outlook now fully supports Arabic and Hebrew, including right-to-left layout and editing.\r\n Select from more fonts and colors, more styles for bulleted and numbered lists, and better hyperlinks. Use Autocorrect. Resize and format pictures while composing.\r\n\r\n PowerPoint\r\n You can now save your PowerPoint deck as a PDF by using the Save As command.\r\n If a slide contains a video that has closed captions or multiple audio tracks, you can now play these tracks in your slideshow.\r\n\r\n Microsoft Auto Update for Mac version 3.5.0\r\n Fixes an issue that causes the app to crash after downloading updates.\r\nAdds support for Slow and Fast levels for the Office Insider program. Both levels provide earlier access to Office 2016 for Mac with the Fast level getting more frequent updates.\r\n\r\n Installation procedure:\r\n!!!! \r\n* Can be installed as an upgrade or as a install from &quot;0&quot;\r\nInstallation\r\nStart Microsoft_Office_2016_15.22.0_160506_Installer.pkg and follow the instructions. (requires administrator rights)\r\nNote:\r\n• Don't miss the selection of components (programs) to install/update\r\n• Office is installed on the default operating system language (interface language selection is missing as a point in principle)\r\n• After installation, you can remove unused apps\r\n• Included in the distribution 3.5.0 Microsoft AutoUpdate Updater.pkg - install, if programs are not updated automatically\r\nWho sets the first time:\r\n• After installing close all Microsoft Office applications (shut down completely)\r\n• Start Microsoft_Office_2016_VL_Serializer_2.0.pkg and follow the instructions in the installer (will set VL license) * you will need administrator rights","torrent":{"xt":"urn:btih:a086395cf616844ca13995ec02da7f748ce5d7a1","amp;dn":"Microsoft+Office+Standard+2016+v15.22","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a086395cf616844ca13995ec02da7f748ce5d7a1","infoHashBuffer":{"type":"Buffer","data":[160,134,57,92,246,22,132,76,161,57,149,236,2,218,127,116,140,229,215,161]},"announce":[],"urlList":[]}}