{"title":"Lynd Ward - Gods' Man (A Novel In Woodcuts) (Restored)","uid":7670689,"size":128027036,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a0bfe796bc3f508f5a408a5436ea09a6eb1be084&amp;dn=Lynd+Ward+-+Gods%27+Man+%28A+Novel+In+Woodcuts%29+%28Restored%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1348562197,"description":"Lynd Ward - Gods' Man (A Novel In Woodcuts) (Restored)\n\nDover Publications, 2004 (This version. The original was released the week of the stock market crash in 1929.)\n\nThe major American artist invented the concept of a wordless novel with this evocative, text-free &quot;woodcut&quot; narrative. Autobiographical in nature, the novel recounts Ward's struggles with his craft and with life in the 1920s. The intricate woodcuts transcend all barriers of language, and fresh details reward the eye with every review. 139 black-and-white illustrations.\n\nFrom the author: &quot;The woodblock, whether cut with a knife or engraved, develops its image by bringing details out of darkness into the light. This seems to give it an advantage over ways of working that start with an empty white area. In a sense, what is happening is already there in the darkness, and cutting the block involves letting only enough light into the field of vision to reveal what is going on. The measuring stick, if anyone is making a list of what is or is not a pictorial narrative, is whether the communication of what is and what is happening is accomplished entirely or predominantly in visual terms. It has always been a matter of some surprise to me that this process can go on for a considerable period and all take place silently. I hear no sound; there is never a word spoken.&quot; \n\nLynd Ward was born in Chicago in 1905. Following his graduation as a fine arts major, from Columbia University, he travelled in Europe and studied at the National Academy for Graphic Arts in Leipzig, Germany. A most versatile artist, Lynd Ward worked in a variety of media, including pen and ink, brush drawing, watercolour, wash, oil, lithography, and mezzotint. An illustrator of over 100 books in both adult and juvenile editions, Lynd Ward is represented in the permanent collections of the Library of Congress and the Smithsonian Institution. An outstanding illustrator and graphic artist, Lynd Ward has received numerous awards, including the Library of Congress Award for Wood Engraving, the John Taylor Arms Memorial Prize, and the Caldecott Medal.","torrent":{"xt":"urn:btih:a0bfe796bc3f508f5a408a5436ea09a6eb1be084","amp;dn":"Lynd+Ward+-+Gods%27+Man+%28A+Novel+In+Woodcuts%29+%28Restored%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0bfe796bc3f508f5a408a5436ea09a6eb1be084","infoHashBuffer":{"type":"Buffer","data":[160,191,231,150,188,63,80,143,90,64,138,84,54,234,9,166,235,27,224,132]},"announce":[],"urlList":[]}}