{"title":"Jackie McLean-Destination...Out![FLAC - LOSSLESS]","uid":4153709,"size":239177386,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a134497607d52dc48e00b7e8fdaad9a38d0132a3&amp;dn=Jackie+McLean-Destination...Out%21%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"99AM","files":5,"time":1209058905,"description":"FLAC files\nReleased in 1963.\nPersonnel: Jackie McLean - alto saxophone , Grachan Moncur III - trombone , Bobby Hutcherson - vibraphone , Larry Ridley - bass , Roy Haynes - drums\n\n\nTrack Listing:\n1. Love And Hate\n2. Esoteric\n3. Kahil The Prophet\n4. Riff Raff\n\n\nIs this a Jackie McLean album the way Somethin? Else is a Cannonball Adderley album? On the latter, Cannon?s ?sideman? Miles Davis seems to be calling the shots. On Destination...Out!, trombonist Grachan Moncur III wrote three of the four tracks and is heard first after the head on the opening number. So was Jackie giving his name to the project to boost sales and get his pal some notice? Another piece of evidence is that this album is almost nothing like other Jackie McLean albums of the period, including One Step Beyond, where Moncur is also present. And as excellent as are such non-Moncur McLean albums as It?s Time and Action, Destination...Out! was a great day for everyone involved (McLean, alto sax; Moncur, trombone; Bobby Hutcherson, vibes; Larry Ridley, bass, and Roy Haynes, drums).\n\nThe album opens deep in Moncur?s chambers of darkness. ?Love and Hate,? a stalking, foreboding piece characteristic of Moncur?s composing at this time, draws from McLean a solo of tremendous depth and subtlety. This is McLean at his most moving. While he cannot entirely repress his native exultation, here he fits it into a larger picture that lives up to the title of the piece. Moncur?s solo provides something of a contrast; is he playing ?hate? to Jackie?s ?love?? Whatever, this track alone makes the album.\n\n?Esoteric? is slightly more upbeat Moncur, with the two horn men and Hutcherson exploring a rich palette of moods. The lightest piece on the album is (of course!) the one number penned by McLean, ?Kahlil the Prophet,? and Moncur?s closer, ?Riff Raff,? is relatively conventional compared to his other compositions. But however upbeat anything on this album gets, there is nothing here that matches the magnificent jubilation reached by McLean and Lee Morgan on some of their collaborations. McLean?s destination here seems to be a vein of thoughtful music with a greater breadth of communicative power than was common in much of the music of the time.\n\nOf course, the search for the same destination motivated the ?outside? explorations of John Coltrane and a host of others in the same years. McLean, for all the self-advertising of his own adventurousness in the titles of his early Sixties albums ( Let Freedom Ring, One Step Beyond, and this one), actually never went as far over the line into ?free? playing as did Trane or Ornette. Destination...Out! never approaches the startling unconventionality of those masters, but it succeeds in integrating ?out? elements into the overall musical framework, and is richly satisfying on its own terms.\n\n(review from AllAboutJazz.com by Robert Spencer)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:a134497607d52dc48e00b7e8fdaad9a38d0132a3","amp;dn":"Jackie+McLean-Destination...Out%21%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a134497607d52dc48e00b7e8fdaad9a38d0132a3","infoHashBuffer":{"type":"Buffer","data":[161,52,73,118,7,213,45,196,142,0,183,232,253,170,217,163,141,1,50,163]},"announce":[],"urlList":[]}}