{"title":"GIF Movie Gear 4.2.2-serial incl","uid":5060733,"size":989105,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a16ad8456aa0872565d4eb584561703a0931675d&amp;dn=GIF+Movie+Gear+4.2.2-serial+incl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"jmb2012","files":2,"time":1250695345,"description":"GIF Movie Gear 4.2.2\n\n\n\n\n\n\nGIF Movie Gear is going to change the way you create GIF animations. Building on an intuitive user interface, GIF Movie Gear adds powerful tools to help you get your animations in gear. This is a professional level tool for the web designer or anyone who works with animations.\n\nAmong its many features, GIF Movie Gear offers:\n\n* Easy-to-use intuitive interface that lets you see all the frames at once and to use the mouse to interact directly with the frames (view screen shot).\n* Multiple selection of frames for easy manipulation of more than one frame at a time. And because of the superior interface, you can see which frames you have selected.\n* Control of all aspects of animation from delays to removal methods to palette management directly from the toolbar (view screen shot).\n* Edit Timing quickly and easily directly in the preview window, either frame by frame or using relative or absolute global changes (view screen shot).\n* LiveEdit lets you edit a frame or the whole animation (as layers in Photoshop) directly in the image editor of your choice. Changes saved in the editor appear automatically in GMG.\n* 24-Bit Color support to let you build animations (AVI) without losing any color data. Also useful for icon files and for PSD, PNG, BMP, and JPEG manipulation.\n* Palette reduction with a before-and-after animated view to help get your file size down while maintaining the animation's image quality (see example).\n* Inter-frame optimization to shrink the file size even more (see example).\n* Blend Two Animations frame by frame to easily generate a composite animation. It's never been easier to put two animations side by side or a new background behind a sprite animation.\n\nDownload Trial\n\n* Continually updated file size information.\n* Animation preview window that keeps running even as you edit the animation (view screen shot). Preview image is zoomable.\n* Manipulation of individual frames by moving, cropping, rotating, and flipping.\n* Easy visual cropping of entire animation.\n* Undo/Redo with infinite levels.\n* Transparency editing with support for multiple transparent colors.\n* Automated generation of HTML code to place your animations in your Web pages.\n* Importing of GIF, JPEG, AVI, ANI, ICO, PNG, and BMP frames and animations.\n* Importing of Photoshop PSD files either as an animation based on Photoshop layers or as a single image.\n* Resizing of animation or individual frames, with or without re-sampling.\n* Automated reversal of frame order. Also automated &quot;ping-pong&quot; of animation.\n* Automated &quot;thinning&quot; of animation to remove every nth frame.\n* Editing of individual palette colors.\n* Exporting of compressed and non-compressed AVI, layered Photoshop PSD, GIF, BMP, PNG, JPEG, ICO (Windows icon files), ANI (Windows animated icons), and CUR (Windows cursor files).\n* Multi-threaded 32-bit application designed for Windows 7/95/98/NT/2000/ME/XP/Vista.\n* Tutorial to get you started (also available online).\n\n","torrent":{"xt":"urn:btih:a16ad8456aa0872565d4eb584561703a0931675d","amp;dn":"GIF+Movie+Gear+4.2.2-serial+incl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a16ad8456aa0872565d4eb584561703a0931675d","infoHashBuffer":{"type":"Buffer","data":[161,106,216,69,106,160,135,37,101,212,235,88,69,97,112,58,9,49,103,93]},"announce":[],"urlList":[]}}