{"title":"Core J2EE Patterns: Best Practices and Design Strategies","uid":4976284,"size":3249483,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a18e6e7bb06f77118bdc809d9e80a29cf1dfb890&amp;dn=Core+J2EE+Patterns%3A+Best+Practices+and+Design+Strategies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VasiaZozulia","files":-1,"time":1245976479,"description":"Sun Microsystems' Java 2 Platform, Enterprise Edition (J2EE) has become the platform of choice for Web-centric distributed enterprise application development. Expert consultants from the Sun Java Center have been helping customers build J2EE-based solutions since the earliest days of the technology, focusing primarily on up-front design and architecture. Along the way, they've identified powerful J2EE design patterns that lead to applications with superior performance, scalability, and robustness. This book brings those design patterns together, sharing Sun's best practices for development with Java Server Pages (JSP), Servlets, EJB, and other J2EE technologies. It presents a complete catalog of J2EE patterns encapsulating proven and recommended designs for common J2EE-related problems, organized into presentation tier, business tier and integration tier solutions. Presentation tier patterns describe solutions involving JSP and servlets; business tier patterns describe solutions involving EJB; and integration tier patterns describe solutions involving JDBC and Java Messaging Service (JMS). The book also identifies bad practices to be avoided. Finally, it presents an end-to-end multi-tier case study covering every stage of enterprise development.\n","torrent":{"xt":"urn:btih:a18e6e7bb06f77118bdc809d9e80a29cf1dfb890","amp;dn":"Core+J2EE+Patterns%3A+Best+Practices+and+Design+Strategies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a18e6e7bb06f77118bdc809d9e80a29cf1dfb890","infoHashBuffer":{"type":"Buffer","data":[161,142,110,123,176,111,119,17,139,220,128,157,158,128,162,156,241,223,184,144]},"announce":[],"urlList":[]}}