{"title":"The Chocolate Watchband-No Way Out...Plus(1967)(1993 Ace Rem.)[E","uid":4982118,"size":162962421,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a1b915e4487344f85ad933ca2a9b2fde63d3af76&amp;dn=The+Chocolate+Watchband-No+Way+Out...Plus%281967%29%281993+Ace+Rem.%29%5BE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"thewall68","files":32,"time":1246384195,"description":"Releaser: thewall\n\nExtractor: EAC 0.99 prebeta 4  \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD \nArtwork:  Full Scans 300dp \n\n\nNo Way Out is a prime example of late sixties psychedelic. Tracks like In the Midnight Hour and Misty Lane are simply `poptastic', a wonderful listen if you're into retro kitch. But you get the feeling that such songs are concessions to the contemporary market. The band themselves would most likely rather be playing blues-influenced, Stones-esque numbers like Let's Talk about Girls and Sweet Young Thing. They do both styles very well and the combination would be enough to satisfy most listeners, but there's more. The title track and the infamous Are You Gonna be There (at the Love In), to name but a couple, nudge the album toward the genre in which it most happily sits: garage psych. And that, for most, is the end of the story: the Chocolate Watch Band were a talented but under-appreciated psych band that started off as Stones emulators and went on to record a first-rate underground album, marred only by a few `sell-out' tracks. I disagree! The pop tunes are excellent in their own right. And there's an aspect to No Way Out that is totally ignored by such received wisdom. There's another weirder, and altogether darker side to the album, present in experimental pieces like Gossamer Wings, Expo 2000 and - best of all - Dark Side of the Mushroom. This for me, and for many now just discovering the Chocolate Watch Band, is the interesting stuff. Apparently it was notoriously difficult to reproduce live and thus was considered by the fans to be `not really the Watch Band' but rather some unholy, studio-born evil twin. I say, nonsense to that. No Way Out is a psychedelic classic. No matter what species of that particular musical genre you prefer, it's well worth a purchase.\n\n\n\nTrack Listings\n\n1. Let's Talk About Girls\n2. In The Midnight Hour\n3. Come On\n4. Dark Side Of The Mushroom\n5. Hot Dusty Road\n6. Are You Gonna Be There (At The Love In)\n7. Gone And Passes By\n8. No Way Out\n9. Expo 2000\n10. Gossamer Wings\n11. Sweet Young Thing\n12. Baby Blue\n13. Misty Lane\n14. She Weaves A Tender Trap\n15. Milk Cow Blues\n16. Don't Let The Sun Catch You Cryin'\n17. Since You Broke My Heart\n18. Misty Lane (Alternative Take) \n\n","torrent":{"xt":"urn:btih:a1b915e4487344f85ad933ca2a9b2fde63d3af76","amp;dn":"The+Chocolate+Watchband-No+Way+Out...Plus%281967%29%281993+Ace+Rem.%29%5BE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1b915e4487344f85ad933ca2a9b2fde63d3af76","infoHashBuffer":{"type":"Buffer","data":[161,185,21,228,72,115,68,248,90,217,51,202,42,155,47,222,99,211,175,118]},"announce":[],"urlList":[]}}