{"title":"Thumbnail viewer for eps files &amp; lots other graphic","uid":4476009,"size":21236796,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a26cadb830150bf9cbdc609d8659574cfbcca75d&amp;dn=Thumbnail+viewer+for+eps+files+%26+lots+other+graphic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"journeywoman","files":1,"time":1225345013,"description":"Someone loaded a clipart group called clipart explosion.  Although it contained a great collection of clipart it did, indeed, explode.  As you did the extraction it repeated itself until you ended up with gigabytes of repeats.\n\nI cleaned up the files to a single group.  They are zipped with winrar to a self-extracting file.  \n\nAs they are all eps files, they did not show thumbnails in Windows, which is a pain.  \n\nI found a program called Ifranview that, together with a plug-in and another program called Ghostscript, combined to make a working thumbnail viewer.\n\nThis group is put into a self extracting .rar file \n\nYes, you can gather all by hunting around and it is all free, but here it is in one place.\n\nI will upload the cleaned up clipart zip next.\n\nThis is the Ifranview version I used:\n\nVersion 4.20\t\t(Release date: 2008-07-16)\n- Basic Unicode support added (Properties-&gt;Misc 1, thanks to Christophe Paris!)\n- New zoom options; improved relative zoom (Properties-&gt;Viewing)\n- Thumbnails can be sorted manually using drag/drop\n- GIF animations can be played in fullscreen/slideshow mode\n- New Advanced batch options: Fine rotation, Blur, Median ...\n- Option to show TIF Annotations created by Kodak Imaging (Properties-&gt;Viewing)\n- New JPG save option: Set file size (PlugIn: thanks to Lucian Sabo)\n- New save menu: Save for Web (PlugIn: thanks to Lucian Sabo)\n- New thumbnails options to disable or configure info text on mouse over\n- New edit menu: Auto crop borders (remove outside lines/rows of same color)\n- New feature in Canvas dialog: negative border sizes are allowed (border crop)\n- New option in Capture dialog: Capture desktop on current monitor only\n- New options in Custom selection dialog: Set custom ratio; Save values\n- New slideshow option (window mode): Set window position\n- New Fullscreen display options: Fit to screen width/height (Hotkeys: 5/6)\n- IPTC data in TIF files can be showed (no editing yet)\n- Fixed Thumbnails crash on multi core CPUs\n- New command line option for EXE Slideshow: /window=(x,y,width,height)\n- Option to set Status bar text using placeholders (Properties-&gt;Misc 3)\n- Option for proportional paste into selection (Properties-&gt;Misc 3)\n- Support for EXR format (PlugIn)\n- Support for MAG format (MAKI, Formats PlugIn)\n- Default display option is now: Fit only big images to desktop\n- Expanded Copy/Move dialog (4 more folders)\n- New Edit menu: Maximize and center selection (hold CTRL to center only)\n- New option in Edit Palette dialog: Click on image to find color index\n- New Thumbnails menu: Remove selected thumbs from list, Hotkey: Ctrl+Del\n- New Thumbnails menu: Save selected files names as TXT\n- New Thumbnails menu: Start Panorama dialog with selected files\n- The Enhance/Correct colors dialog can be resized/maximized\n- Enhanced TIF-LZW saving with 24 BPP images (smaller files are created)\n- New command line option: /jpg_rotate=(...values...)\n  JPG lossless rotation, see i_options.txt for examples\n- New command line option: /transpcolor=(r,g,b)\n  Set transparent color: can be used for GIF/PNG/ICO saving\n- New Hotkey: SHIFT + F = Fit only big images to desktop\n- New Hotkey: SHIFT + W = Fit images to window\n- New Hotkey: NUM-PAD 5 = Scroll to image center\n- New Hotkey/Menu: CTRL + N = Open current file in another IrfanView window\n- New Thumbnails option: Auto scroll during creation\n- New option in JPG IPTC/Comment dialog: Append text to old text\n- Scan dialog: &amp;#039;Skip existing files&amp;#039; works also for multipage TIF files\n- Several PlugIns are changed/updated, please install the newest versions:\n  Download from: http://www.irfanview.com/plugins.htm\n- Some minor bugs/features fixed/added (scrolling)\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:a26cadb830150bf9cbdc609d8659574cfbcca75d","amp;dn":"Thumbnail+viewer+for+eps+files+%26+lots+other+graphic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a26cadb830150bf9cbdc609d8659574cfbcca75d","infoHashBuffer":{"type":"Buffer","data":[162,108,173,184,48,21,11,249,203,220,96,157,134,89,87,76,251,204,167,93]},"announce":[],"urlList":[]}}