{"title":"Ray Brown - 1996 - Some of My Best Friends are... the Sax Player","uid":8618605,"size":455453176,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a2ff557fb4741de0d8823b5d5fdf9adc53492889&amp;dn=Ray+Brown+-+1996+-+Some+of+My+Best+Friends+are...+the+Sax+Player&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"eika256","files":-1,"time":1372313429,"description":"Ray Brown - 1996 - Some of My Best Friends are... the Sax Players\n\nAs a follow-up to bassist Ray Brown's previous record in which he collaborated with several of his favorite pianists, Some of My Best Friends Are...The Sax Players features six major saxophonists (tenors Joe Lovano, Ralph Moore, Joshua Redman and Stanley Turrentine plus altoists Benny Carter and Jesse Davis) on two songs apiece with his regular trio. Although more than 60 years separate the ageless Carter from Redman, each of the saxes originally developed their own voice in the straight-ahead jazz tradition. Highlights of the colorful set include Benny Carter's playful rendition of &quot;Love Walked In,&quot; Moore's cooking solo on &quot;Crazeology&quot; (a Benny Harris bop classic which the record mistakenly lists as written by Bud Freeman), Davis ripping through &quot;Moose the Mooche&quot; and Turrentine's romp on the blues &quot;Port of Rico.&quot; Pianist Benny Green and drummer Gregory Hutchinson provide suitable accompaniment (Green's solos are consistently excellent) and all dozen of the songs are successful and swinging. As an extra bonus, on the latter part of the CD each of the saxophonists has a brief chat (between 26 seconds and a minute apiece) with Brown about their early influences. There is so much good feeling and obvious mutual respect shown that one wishes these talks were at least twice as long; the Benny Carter segment is most memorable. This well-conceived project is easily recommended. (AllMusic)\n\nTrack list:\n01 - How High the Moon (with Joe Lovano)\n02 - Love Walked In (with Benny Carter)\n03 - Polka Dots and Moonbeams (with Joshua Redman)\n04 - Crazeology (with Ralph Moore)\n05 - Port of Rico (with Stanley Turrentine)\n06 - Moose the Mooche (with Jesse Davis)\n07 - Easy Living (with Joe Lovano)\n08 - Just You, Just Me (with Joshua Redman)\n09 - Fly Me to the Moon (with Benny Carter)\n10 - (When It''s) Sleepy Time Down South (with Ralph Moore)\n11 - These Foolish Things (with Jesse Davis)\n12 - God Bless the Child (with Stanley Turrentine)\n13 - Ray Brown in Conversation with Joe Lovano\n14 - Ray Brown in Conversation with Benny Carter\n15 - Ray Brown in Conversation with Stanley Turrentine\n16 - Ray Brown in Conversation with Jesse Davis\n17 - Ray Brown in Conversation with Joshua Redman\n18 - Ray Brown in Conversation with Ralph Moore\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:a2ff557fb4741de0d8823b5d5fdf9adc53492889","amp;dn":"Ray+Brown+-+1996+-+Some+of+My+Best+Friends+are...+the+Sax+Player","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a2ff557fb4741de0d8823b5d5fdf9adc53492889","infoHashBuffer":{"type":"Buffer","data":[162,255,85,127,180,116,29,224,216,130,59,93,95,223,154,220,83,73,40,137]},"announce":[],"urlList":[]}}