{"title":"Warmachine.Tactics-RELOADED","uid":11535766,"size":4076803230,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:a42e4a8ed35a258c3dbabf45cf9577f2b14ad323&amp;dn=Warmachine.Tactics-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Taker009","files":-1,"time":1416623858,"description":"  WARMACHINE: Tactics (c) Privateer Press Interactive\n   \n        11/2014 :..... RELEASE.DATE .. PROTECTION .......: Steam\n              1 :.......... DISC(S) .. GAME.TYPE ........: Indie, Strategy\n   \n\n  About This Game In WARMACHINE, the very earth shakes during fierce\n  confrontations where six-ton constructs of iron and steel slam into each\n  other with the devastating force of a locomotive, where lead-spewing cannons\n  chew through armor plating as easily as flesh, and where bold heroes set the\n  battlefield ablaze with a tempest of arcane magic as they forge the fates of\n  their unyielding nations in the fires of destruction. \n\n  Take control of an elite battle mage known as a warcaster and his army of\n  unstoppable warjacks and deadly soldiers in this intense and aggressive\n  turn-based tactical combat game set in the award-winning, steam-powered world\n  of the Iron Kingdoms. \n\n  WARMACHINE: Tactics is a next-generation turn-based tactical game developed\n  with the Unreal 4 engine. Cutting-edge visuals, an immersive world setting,\n  and squad customization features offer a rich multiplayer experience along\n  with an extensive single-player campaign that will appeal to fans of revered\n  tactical games like X-Com: Enemy Unknown and The Valkyria Chronicles. \n\n  Learn more about the WARMACHINE: Tactics and the Iron Kingdoms at:\n &lt;a href=&quot; http://warmachinetactics.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://warmachinetactics.com&lt;/a&gt;\n  Features:\n  ONLINE MULTIPLAYER\n  Four armies representing the four core factions of the Iron Kingdoms. Each\n  army contains three warcasters, multiple warjacks, and multiple warrior units\n  A point-based squad customization system that allows you to decide exactly\n  what units and strategies you take into battle.\n  Three multiplayer maps: Forest Ruins, Trenches At the Border, and Snowy\n  Valley. New Multiplayer maps will release regularly, always for free!\n  An epic single-player campaign featuring 21 missions and an engaging\n  storyline that will immerse you in the world of the Iron Kingdoms.\n   AI Skirmish Mode \n\n  Join the fight, now! \n\n  1. Unrar.\n  2. Burn or mount the image.\n  3. Install the game.\n  4. Copy over the cracked content from the /Crack directory on the image to\n     your game install directory.\n  5. Play the game.\n  6. Support the software developers. If you like this game, BUY IT!","torrent":{"xt":"urn:btih:a42e4a8ed35a258c3dbabf45cf9577f2b14ad323","amp;dn":"Warmachine.Tactics-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a42e4a8ed35a258c3dbabf45cf9577f2b14ad323","infoHashBuffer":{"type":"Buffer","data":[164,46,74,142,211,90,37,140,61,186,191,69,207,149,119,242,177,74,211,35]},"announce":[],"urlList":[]}}