{"title":"The Anthony Cumia Show 2015-04-06 Walking on Greggshells MP4 MP3","uid":11800995,"size":339584648,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a4a41b6e7def815d4f537f6fefd894eb3d4edc90&amp;dn=The+Anthony+Cumia+Show+2015-04-06+Walking+on+Greggshells+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mothergoose58","files":2,"time":1428381434,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nEpisode 140 &quot;Walking on Greggshells&quot; - On today's (free) TACS, Anthony gets right into discussing the explosion of words he and Opie had over the weekend, gives his thoughts regarding re-signing SiriusXM contracts, management's lack of knowledge, and what he believes really happened after his firing. He also tackles shifting of blame, lack of communication, gets into his off-air friendship over the years with Opie, walking on &quot;Greggshells&quot;, and how often he'd bite his tongue. He then addresses behind the scenes problems, the thought of underlying superiority, how &quot;Opie the destroyer&quot; carried over off-air, gets into how self-deprecation both hurt and helped the dynamic, and admits they all got a bit lazy on the Opie and Anthony show. KtC tells us a story about briefly filling in for Club Soda Kenny, Ant reminisces about WNEW, talks about his enjoyment of the fans, his feelings of resentment, and Jimmy being the glue that held them together. Ant talks about the fans shitting on Opie for not publicly fighting after his firing, comments on Opie saying them talking on-air is a &quot;bit&quot;, explains in detail why he wants to do it that way, and briefly covers the anxiety he felt when they talked contract negotiations. The callers chime in with their own questions which leads to more contract chat, the possibility of a book deal, the vibe around the office during negotiation time, underlying tensions, adhering to rules and their firing, and maintaining self-awareness. KtC steps in to explain the backstory of &quot;The Ron and Anthony Show&quot; tweet, we hear from a few more callers, Ant admits how lucky they've been in the industry, squashes rumors that he tried to wrangle Jimmy over to TACS, and waxes about the old days at WAAF.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:a4a41b6e7def815d4f537f6fefd894eb3d4edc90","amp;dn":"The+Anthony+Cumia+Show+2015-04-06+Walking+on+Greggshells+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4a41b6e7def815d4f537f6fefd894eb3d4edc90","infoHashBuffer":{"type":"Buffer","data":[164,164,27,110,125,239,129,93,79,83,127,111,239,216,148,235,61,78,220,144]},"announce":[],"urlList":[]}}