{"title":"Dinosaur Island (1994)","uid":7100529,"size":3802642432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4b0fea57e349e279fa5934100890d571e1d4863&amp;dn=Dinosaur+Island+%281994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Odin1066","files":-1,"time":1331679060,"description":"Three army misfits are being flown to their court martials, in the care of a captain, when the plane has engine trouble, goes down in the ocean and they end up on an island. Soon they know there are other people on this island because they are quickly taken prisoner. It turns out there are only bikini clad women on this island and.....dinosaurs! One dinosaur in particular, The Great One, is really bad news and has been getting temporarily bought off repeatedly with sacrifices of a virgin woman. Well the Queen gives these guys the choice of death by execution or possible freedom if they kill The Great One. The special effects wouldn't win any awards but the dinosaurs, regardless of their realism, do give an excuse for the natives to run and jiggle and are sort of important to the plot. These women know nothing about men, not even what a kiss is. This movie gets bad reviews by some while others like it a lot. Compared to the sexploitation movies of the 60s and 70s Dinosaur Island is better than most of them. It is funny and several of the ladies are stunning. \n\nDirected by Fred Olen Ray and Jim Wynorski, Jim was also the Producer\nWritten by Bob Sheridan and Christopher Wooden\nStarring: Ross Hagen, Richard Gabai, Peter Spellos, Tom Shell, Antonia Dorian, Griffen Drew,\nToni Naples, Michelle Bauer, Becky LeBeau, Robin Chaney, Wendy Griffen, Deborah Dutch\n\nThis is a VHS transfer with a line across the bottom that wouldn't track out. I chose not to crop it out because 3 or 4 times the width of the line would be lost from the bottom of the picture if I did that. The snapshot shown here shows it and gorgeous Griffen Drew. \n\nPG-14: nudity, sexual situations \nVideo:  720x480 MPEG2 NTSC 29fps\nAudio:  2 channel Stereo 48 kHz\nLength:  1:20:03","torrent":{"xt":"urn:btih:a4b0fea57e349e279fa5934100890d571e1d4863","amp;dn":"Dinosaur+Island+%281994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4b0fea57e349e279fa5934100890d571e1d4863","infoHashBuffer":{"type":"Buffer","data":[164,176,254,165,126,52,158,39,159,165,147,65,0,137,13,87,30,29,72,99]},"announce":[],"urlList":[]}}