{"title":"Super Anal Cougars 2 (Chubby Rain, West Coast Productions / 720p","uid":10020212,"size":5012224470,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:a4c79dd0950f73d8c40df5b53e4f3a3bd6446284&amp;dn=Super+Anal+Cougars+2+%28Chubby+Rain%2C+West+Coast+Productions+%2F+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"2.No.2","files":1,"time":1398195328,"description":"Super Anal Cougars 2 (Chubby Rain, West Coast Productions / 720p / 2014)\n\nSuper models that are cougars and that love anal, what's better than that? NOTHING! The nice thing about a cougar is that someone else already broke them in, they come loaded and loaded with some skills that are out of this world! Part one was a tough act to follow, but our all-star anal queen cast is a sure fire bestseller you'll have in your collection for years!\nFrancesca Le seduces a new delivery boy, he's just what she likes. He helps her with her bags but she needs him to unload something else! She's sweet and seductive and takes it like a pro, but she's a little out of her depth with her man- he's a little too big for her tiny holes. She's got a jaw like a snake, it has to unhinge somehow to get that whole dick in there and down that throat! She's not scared, but she can't walk right afterwards! You won't be the same after you see her crawl up those stairs!\nAlexandra Silk gets double teamed with some double digits in all three holes. If you've never seen a cougar get &quot;dick drunk&quot;, you'll have to take a look at this foxy female getting double stuffed!\nJulia Ann is another all star, but she's a seriously bad girl here with her devilish and delicious ways! She is a tasty piece and her may knows it!\nPhoenix Marie has an angels' smile and a devils booty! With nice big tits, they can't help but beg for some attention. That attention is some oil and some hands all over her curvy body! She can't help but think she's being spread out, it's a fat stack she gets to take from her man. She's a little more rough and tough than she looks, and she sure takes a pounding in this scene!\nSee our girl's shake and quake, squirm and quiver. Nothing but real orgasms here, you can't fake the kind of noises these girls can make!\n\nJulia Ann, Phoenix Marie, Francesca Le, Alexandra Silk\n\nAnal, MILF / Cougar, Star-Power, Interracial, Hardcore, All Sex\n\nScreens:\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=uza8zxlvgveh.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=uza8zxlvgveh.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.244pix.com/viewer.php?file=5kyt7phy97qo.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.244pix.com/viewer.php?file=5kyt7phy97qo.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:a4c79dd0950f73d8c40df5b53e4f3a3bd6446284","amp;dn":"Super+Anal+Cougars+2+%28Chubby+Rain%2C+West+Coast+Productions+%2F+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4c79dd0950f73d8c40df5b53e4f3a3bd6446284","infoHashBuffer":{"type":"Buffer","data":[164,199,157,208,149,15,115,216,196,13,245,181,62,79,58,59,214,68,98,132]},"announce":[],"urlList":[]}}