{"title":"The Path to Power","uid":8355422,"size":3821287,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a541464350b13e5c192253abd1d3a6d066977f75&amp;dn=The+Path+to+Power&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mdusanjay","files":-1,"time":1365480401,"description":"Margaret Thatcher, &quot;The Path to Power&quot;\nISBN: 0060172703 | 1995 | EPUB\n\nThe extraordinary account of Margaret Thatcher's life up to her dramatic election as the first woman Prime Minister of England in 1979. Margaret Thatcher is the towering figure of late-twentieth-century British politics. No other prime minister of modern times has sought to change Britain and its place in the world as radically as she did. This is the story of her remarkable life in her own words. In this second volume of her memoirs, following 'The Downing Street Years', she writes candidly about the formation of her character and values, and the experiences that propelled her to the very top in a man's world. Beginning with a touching account of her upbringing in Grantham, Lincolnshire, she goes on to describe her Oxford years, marriage to Denis, and entry into Parliament at a time when there were no more than a handful of women MPs. Rising through the ranks to Education Secretary and then Leader of the Opposition, she led the Conservative Party to a historic victory in the 1979 general election, becoming Britain's first female prime minister. Margaret Thatcher's compelling account stands as a powerful testament to her extraordinary legacy.\n","torrent":{"xt":"urn:btih:a541464350b13e5c192253abd1d3a6d066977f75","amp;dn":"The+Path+to+Power","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a541464350b13e5c192253abd1d3a6d066977f75","infoHashBuffer":{"type":"Buffer","data":[165,65,70,67,80,177,62,92,25,34,83,171,209,211,166,208,102,151,127,117]},"announce":[],"urlList":[]}}