{"title":"Mathematics Training Courses - USN","uid":6312606,"size":41210836,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a56029eab1b060596aa488458abe7e028912d08c&amp;dn=Mathematics+Training+Courses+-+USN&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"actionace","files":5,"time":1302591442,"description":"Mathematics Self Study Courses - USN\n\nMath, Basic &amp; Algebra\nCOURSE OVERVIEW:  This course provides a review of basic arithmetic and continues through some of \nthe early stages of algebra. Emphasis is placed on decimals, percentages and measurements, exponents, \nradicals and logarithms. Exercises are provided in factoring polynomials, linear equations, ratio, proportion \nand variation, complex numbers, and quadratic equations. The final assignment affords the student an \nopportunity to demonstrate what he or she has learned concerning plane figures, geometric construction and \nsolid figures, and slightly touches on numerical trigonometry\n\nMath, Intro to Stats\nCOURSE OVERVIEW: In completing this nonresident training course, you demonstrate an understanding \nof the following subjects: numbering systems used in digital computers and computer programming; \nBoolean algebra: binomial theorem; statistics, statistical inference, matrices, and determinants; and calculus.\n\nMath, Per-Calc and Probability\nCOURSE OVERVIEW: The objective of this course is to enable the student to identify and perform\ncalculations involving the equations to the various conic sections; recognize and work with concepts in\ncalculus (limits, differentiation, and integration); and recognize the elements of introductory probability\ntheory.\n\nMath, Trig\nCOURSE OVERVIEW: The objective of this course is to enable the student to:\na. Apply logarithms to the solution of problems encountered in mathematics and the sciences.\nb. Apply trigonometric techniques as tools in the analysis of mathematical, physical, and scientific\nproblems.","torrent":{"xt":"urn:btih:a56029eab1b060596aa488458abe7e028912d08c","amp;dn":"Mathematics+Training+Courses+-+USN","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a56029eab1b060596aa488458abe7e028912d08c","infoHashBuffer":{"type":"Buffer","data":[165,96,41,234,177,176,96,89,106,164,136,69,138,190,126,2,137,18,208,140]},"announce":[],"urlList":[]}}