{"title":"Native Paths - American Indian Art from the Collection of Charle","uid":9056138,"size":53106216,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a6101ad850bf3a6558fbb1f0e91b508f97b3bb42&amp;dn=Native+Paths+-+American+Indian+Art+from+the+Collection+of+Charle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1381957279,"description":"Native Paths: American Indian Art from the Collection of Charles and Valerie Diker\nPublisher: Metropolitan | 1999 | ISBN: 0870998579/0300086415 | English | PDF | 128 pages | 50.65 Mb\n\nPublished to accompany an exhibition at The Metropolitan Museum of Art, this handsome catalogue brings together well over one hundred Native North American works of art from the collection of Charles and Valerie Diker. Representing many different peoples and traditions, a wide variety of materials and functions, these superb objects reflect the great cultural and artistic diversity of the Native peoples of the western hemisphere.\n\nIncluded in the exhibition are quilled and beaded works of the Plains Indians, pottery and basketry vessels of the Southwest and California, and wood sculpture of the Pacific Northwest, among many other forms and traditions. Often viewed in ethnographic terms, these works are presented here for their aesthetic rather than their anthropological value. As W. Richard West, director of the National Museum of the American Indian, Smithsonian Institution, points out in his introduction to this book, &quot;these objects created by American Indians constitute a body of remarkable art by any aesthetic measure.&quot;\n\nEach chapter, contributed by an expert in the field, serves to introduce the reader to aspects of American Indian art. Janet Catherine Berlo, Professor of Art History and Susan B. Anthony Professor of Gender and Women's Studies at the University of Rochester, discusses the so-called ledger drawings, images of Plains Indian life that record historic and mythic events of the late nineteenth and the early twentieth century. T. J. Brasser, renowned Plains Indian ethnologist and author of many books and articles on aspects of Native American art and culture, describes the bead and quillwork of the peoples of the Great Plains and the Eastern Woodlands. Bruce Bernstein, Assistant Director of Cultural Resources at the National Museum of the American Indian, Washington, D.C., reviews elements of the multifaceted art of the Southwest. Allen Wardwell, specialist in the art of the Pacific Northwest and curator of many exhibitions, served as general editor of this project and also contributed the chapter on American Indian sculpture in both the Northwest and the Northeast. Color photographs taken especially for this book demonstrate the high quality of these exciting and evocative pieces.","torrent":{"xt":"urn:btih:a6101ad850bf3a6558fbb1f0e91b508f97b3bb42","amp;dn":"Native+Paths+-+American+Indian+Art+from+the+Collection+of+Charle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6101ad850bf3a6558fbb1f0e91b508f97b3bb42","infoHashBuffer":{"type":"Buffer","data":[166,16,26,216,80,191,58,101,88,251,177,240,233,27,80,143,151,179,187,66]},"announce":[],"urlList":[]}}