{"title":"World of Warcraft","uid":5323369,"size":1294738085,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a63003aba94612af8f2cba9b74d44761a523c628&amp;dn=World+of+Warcraft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ParrowJack","files":39,"time":1264942821,"description":"Collection of all the currently scanned comics published by Tokyopop and DC Comics Wildstorm imprint based on Blizzard Entertainment's Warcraft universe.\n\n\nWarcraft: The Sunwell Trilogy\nThree volume Korean/English manhwa (Korean comics), written by Richard Knaak, illustrated by Kim Jae-hwan, that follows the adventures of Kalec, a blue dragon who takes the form of a human to investigate a mysterious power, and Anveena, a beautiful young maiden with an enchanting secret.\n\n\nWarcraft: Legends\nFive-part graphic novel series that continues on from Warcraft: The Sunwell Trilogy.  Only volumes 1, 2 and 5 are currently scanned in English.  \n\n\nWarcraft: Death Knight is currently unscanned.\n\n\nWorld of Warcraft\nA human is found unconscious on the shores of Kalimdor, with no memory of who he is or how he arrived there. Enslaved by the Orc Shaman Rehgar Earthfury, this man must fight for survival against members of both the Alliance and the Horde, striking uneasy relationships with other races in his quest to find the secrets of his past!\nWritten by Walt and Louise Simonson World of Warcraft was originally set for two story arcs, both six issues each, but was later expanded to last 25 issues.  In December 2009, WildStorm stated that the the publication of the World of Warcraft comic series had been changed from monthly issues to original graphic novels to be released in 2010.  The World of Warcraft Special, World of Warcraft: Beginnings and Ends, would be the last issue released and both the original comic (planned to be renamed to Alliance from issue 26) and the future Horde title had been canceled.\n\n\nWorld of Warcraft: Ashbringer\nA four-issue mini-series written by Micky Neilson, with pencils by Ludo Lullabi that recounts the story of the Ashbringer and Alexandros Mograine.\n\n\n\nReleased on http://ComicPirates.info","torrent":{"xt":"urn:btih:a63003aba94612af8f2cba9b74d44761a523c628","amp;dn":"World+of+Warcraft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a63003aba94612af8f2cba9b74d44761a523c628","infoHashBuffer":{"type":"Buffer","data":[166,48,3,171,169,70,18,175,143,44,186,155,116,212,71,97,165,35,198,40]},"announce":[],"urlList":[]}}