{"title":"GTA San Andreas Real v3 BETA [OSD]","uid":5732470,"size":4855122343,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:a65a6bef394cef8a86f99355885e8a09a6060be0&amp;dn=GTA+San+Andreas+Real+v3+BETA+%5BOSD%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Lil_LeX","files":50,"time":1280707712,"description":"=======GTA San Andreas Real v3=======\nBETA\n\nAugust 1st 2010\nwww.ovisebdan.com\n\n\n20 months. It's been 20 months since I started working on this thing. This is my last mod. Ever.\nI think it's pretty obvious why. I've lost interest in making these things. It's been 5 years since I first started, \nI'm not 13 anymore and quite simply put, I've got much better things to do than making these mods.\nThis was going to be my last and best mod. It certainly is my last and I think it comes pretty close to being my best, \neven though it is UNFINISHED and UNTESTED. Yeah, that being said, don't expect everything to work the way it should. \nI had a lot of great things in plan for GTA SA Real v3, but unfortunately, I don't care that much about it anymore. Still, \nI am very sorry I never managed to finish it, because it would have been an amazing mod.\n\nConsider this my &quot;retirement.&quot; I've come a long way and I feel it's time to go. This last year I've felt quite appreciated, \nas a lot (I mean A LOT) of people kept pressuring me about this game, some being total idiots though. It feels nice to see \nthat my work means something to so many people. I've made 8 trailers and together they've all got 93.000 total views. \nAdd that to the views the videos for the other mods got, and there are a total of over 430.000 views. That's pretty cool.\n\nOk, now a little something about some trouble I've had with the game. If the game won't start (you double click on it and nothing \nhappens), just create of copy of vorbisFile.dll and then go to the 'backup' folder and copy the one in there over the original. Now try \nrunning the game. If it runs, exit the game and use the original vorbisFile.dll again. This way you can enjoy the new and improved graphics.\nIf it doesn't work the first time, repeat these steps until it does. Or if you just don't want to use the new graphics then do whatever you want, \nbut it's a damn shame, trust me. Oh, yeah, almost forgot. Press Shift + F12 to activate the graphics.\nUhm... I just realized this file might not have anything to do with the graphics and if I'm right, it's even more important. So try and play the game \nwith the original file, not the one from the 'backup' folder.\n\nUhm... ok, what else is there? Yeah, thanks to all the authors of all the mods I've used, this wouldn't have been possible without you guys.\n\nIt still feels like something's missing here, but fuck it. Actually there's a lot missing, but I'm just not in the mood to write everthing \nthere is to write. So here it is, have fun.","torrent":{"xt":"urn:btih:a65a6bef394cef8a86f99355885e8a09a6060be0","amp;dn":"GTA+San+Andreas+Real+v3+BETA+%5BOSD%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a65a6bef394cef8a86f99355885e8a09a6060be0","infoHashBuffer":{"type":"Buffer","data":[166,90,107,239,57,76,239,138,134,249,147,85,136,94,138,9,166,6,11,224]},"announce":[],"urlList":[]}}