{"title":"Joe Abercrombie's The First Law - The Blade Itself 001 (2013)","uid":8375440,"size":76747024,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:a6974d6bafe701680f87feb8f0220a81954a178a&amp;dn=Joe+Abercrombie%27s+The+First+Law+-+The+Blade+Itself+001+%282013%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"thc-1138","files":1,"time":1366041730,"description":"Joe Abercrombie's &quot;First Law&quot; series of fantasy novels have been translated into 26 languages worldwide and sold over two million copies, garnering a ton of acclaim along the way. Come find out why with the first issue of The Blade Itself... Logen Ninefingers, infamous barbarian, has finally run out of luck. Caught up in one feud too many, he's on the verge of becoming a dead barbarian, leaving nothing behind but some bad songs, a few dead friends, and a lot of happy enemies. Captain Jezal dan Luthar has nothing more dangerous in mind than fleecing his friends at cards and dreaming of glory in the fencing circle. But war is brewing, and on the battlefields of the frozen North they fight by altogether bloodier rules. Inquisitor Glokta, cripple turned torturer, is cutting treason out of the Union one confession at a time. His latest trail of corpses may lead him right to the rotten heart of government ... if he can stay alive long enough to follow it. Murderous conspiracies rise to the surface, old scores are ready to be settled, and the line between hero and villain is sharp enough to draw blood. Unpredictable, wickedly funny, and packed with unforgettable characters, The Blade Itself is fantasy with a real cutting edge. &quot;It's funny, violent, and brilliant. Imagine if Quentin Tarantino wrote a sword &amp; sorcery novel.&quot;","torrent":{"xt":"urn:btih:a6974d6bafe701680f87feb8f0220a81954a178a","amp;dn":"Joe+Abercrombie%27s+The+First+Law+-+The+Blade+Itself+001+%282013%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6974d6bafe701680f87feb8f0220a81954a178a","infoHashBuffer":{"type":"Buffer","data":[166,151,77,107,175,231,1,104,15,135,254,184,240,34,10,129,149,74,23,138]},"announce":[],"urlList":[]}}