{"title":"Misquoting Jesus: The Story Behind Who Changed the Bible and Why","uid":4150144,"size":32002453,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7302c2567ffc4c167a18deb205a70738b8d0b07&amp;dn=Misquoting+Jesus%3A+The+Story+Behind+Who+Changed+the+Bible+and+Why&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"XeperDamien","files":1,"time":1208899542,"description":"Misquoting Jesus: The Story Behind Who Changed the Bible and Why is a book by Bart D. Ehrman, a New Testament scholar. The book introduces lay readers to the field of textual criticism of the bible. Ehrman provides an overview of the 5,700 known New Testament manuscript fragments, from which scholars have cataloged 200,000 differences. When ancient manuscripts differ from each other, such as whether they include the Comma Johanneum, textual critics use clues to conclude which version is the original. Ehrman discusses many textual variations that resulted from intentional or accidental manuscript changes during the scriptorium era.\n\nEhrman recounts his personal experience with the study of the Bible and textual criticism. He summarizes the history of textual criticism, from the works of Desiderius Erasmus to the present. The book describes an early Christian environment in which the books that would later compose the New Testament were copied by hand, mostly by Christian amateurs. Ehrman concludes that various early scribes altered the New Testament texts in order to deemphasize the role of women in the early church, to unify and harmonize the different portrayals of Jesus in the four gospels, and to oppose certain heresies (such as Adoptionism). Ehrman contends that certain widely-held Christian beliefs, such about the divinity of Jesus, are associated not with the original words of scripture but with these later alterations.\n","torrent":{"xt":"urn:btih:a7302c2567ffc4c167a18deb205a70738b8d0b07","amp;dn":"Misquoting+Jesus%3A+The+Story+Behind+Who+Changed+the+Bible+and+Why","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7302c2567ffc4c167a18deb205a70738b8d0b07","infoHashBuffer":{"type":"Buffer","data":[167,48,44,37,103,255,196,193,103,161,141,235,32,90,112,115,139,141,11,7]},"announce":[],"urlList":[]}}