{"title":"Star Trek The Menagerie fanedit TOS s01e11-s01e12 47min 900p 6ch","uid":10283132,"size":850304866,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a7a56fdbb92392b69681cc6b80911ac293323daa&amp;dn=Star+Trek+The+Menagerie+fanedit+TOS+s01e11-s01e12+47min+900p+6ch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bsg4you","files":3,"time":1401737365,"description":"Star.Trek.TheMenagerie.fanedit.TOS.s01e11e12.47m25s.v2.900p.6ch.mkv\n\nTHE CAGE MATERIAL IS MOSTLY REMOVED IN THIS FANEDIT\nTHIS IS THE SAME CONTENT AS VERSION1 JUST SMALLER WITH THE SAME QUALITY\n\nStar Trek The Menagerie fanedit TOS s01e11-s01e12 v2\nversion2 Handbrake0.9.9\n1200x900 47min25sec  850,242,647bytes\nV: 2-Pass Encoding (Turbo first pass) Preset = 09 (very slow) 2000Kbps AVC\nA: 5.1 384Kbps AAC\n\nThis is a FANEDIT of Star Trek The Original Series episodes s01e11 and s01e12: The Menagerie. This fanedit's main change is removing most of The Cage portions of the two videos. If a viewer is watching the series in order, The Cage would come first and shortly after The Menagerie would repeat most of material from The Cage. If a viewer just wanted to watch the new material in The Menagerie, this fanedit should work nicely. The source was from the remastered Blu-Rays, 1200x900 DTS. This is the version with the much nicer special effects and generally looks very good.\n\nCHANGES:\n- Almost all of The Cage material is removed except when zooming in and out of the hearing view screen, when someone is doing voice over or for a few seconds to make a smooth edit\n- Establishing shots were retained since they contain the remastered special effects\n- The opening music/credits for s01e12 part2 were removed\n- The s01e12 part2 opening that summarizes s01e11 part1 with Kirk's narration was retained since it has some new footage and Kirk's voice over is new but the end of the summary was was removed since it lacks new footage or dialogue\n- Both end credit sequences were retained but placed at the end of the fanedit with s01e11 part1 first and s01e12 part2 second\n- Commercial breaks/fades were mostly removed except for the pause after the opening credits and a couple of fade ins\n- Note, the source volume level is fairly low but was unchanged during the editing so it's consistent with the other episodes\n- Note, the source has a very slight audio anomaly (a tiny skip or pop) when Uhura says ComSol in her line &quot;Message signed ComSol, Starfleet Command&quot;\n\nPlease check out other releases of Star Trek Enterprise, Battlestar Galactica, Rifftrax, DC Comics, documentaries and more at:\n &lt;a href=&quot; https://thepiratebay.se/user/bsg4you/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; https://thepiratebay.se/user/bsg4you/&lt;/a&gt;  \nand leave any corrections, criticism, comments and requests.\n\nThanks, bsg4you","torrent":{"xt":"urn:btih:a7a56fdbb92392b69681cc6b80911ac293323daa","amp;dn":"Star+Trek+The+Menagerie+fanedit+TOS+s01e11-s01e12+47min+900p+6ch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7a56fdbb92392b69681cc6b80911ac293323daa","infoHashBuffer":{"type":"Buffer","data":[167,165,111,219,185,35,146,182,150,129,204,107,128,145,26,194,147,50,61,170]},"announce":[],"urlList":[]}}