{"title":"The Oxford Companion to the Year: An Exploration of Calendar Cus","uid":6282846,"size":10914350,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7ad10f25c728af9270d61240666fa88b4aa67a6&amp;dn=The+Oxford+Companion+to+the+Year%3A+An+Exploration+of+Calendar+Cus&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Djofullinn","files":1,"time":1301505540,"description":"Amazon.com Review\nThe Oxford Companion to the Year is one of those splendid volumes that should have a permanent place in every personal reference library, next to a well-thumbed Brewer's.\n\nThe main body of the book gives a huge amount of historical and folkloric information on every day of the year (including, yes, February 30, which has happened three times); the days of the week, months and seasons; and the major feast days and festivals in a wide variety of different cultures. This is the section that most readers will find the most fascinating; its 658 pages provide endless browsing.\n\nThe second part concentrates on the making of calendars over the centuries: how our own complex calendar evolved with its irregular month lengths and its rules for when leap years occur, plus details of the calendars of many other cultures--Chinese, Hindu, Muslim, and many more--all trying to find a regular system that can cope with the fact that the roughly 29-and-one-half-day lunar month and the roughly 365-and-one-quarter-day solar year simply can't be meshed.\n\nBonnie Blackburn and Leofranc Holford-Strevens must be congratulated on the huge amount of work this book must have taken, and on such splendid results. --David V. Barrett, Amazon.co.uk\nFrom Library Journal\nBlackburn (Music, Oxford Univ.) and Holford-Strevens (Aulus Gellius) have produced an interesting reference work that can be seen as a modern version of the medieval Book of Days. Recognizing the significance that the recording of time has had for almost all known cultures, they set out to explain the origins of calendar construction, taking care to examine the significance of each day of the year. The book is divided into two parts. &quot;Part I: Calendar Customs&quot; is a day-by-day guide to the year as organized by the Western calendar. Here, the authors explicate the peculiar attributes each day of the year has acquired. &quot;Part II: Calendars and Chronology&quot; is an in-depth study of how time has been organized over the ages. The authors explain more than 18 calendar systems from Anglo-Saxon to Zoroastrian and also include tables for converting dates from one calendar system to another. This work should appeal to browsers and researchers alike and would be a useful resource for academic as well as public libraries. Recommended for both.\n-Robert James Andrews, Duluth P.L., MN\nCopyright 2000 Reed Business Information, Inc. \n &lt;a href=&quot;\nhttp://www.amazon.com/Oxford-Companion-Year-Exploration-Time-Reckoning/dp/0192142313/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1301498031&amp;sr=8-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Oxford-Companion-Year-Exploration-Time-Reckoning/dp/0192142313/ref=sr_1_1?ie=UTF8&amp;s=books&amp;qid=1301498031&amp;sr=8-1&lt;/a&gt;","torrent":{"xt":"urn:btih:a7ad10f25c728af9270d61240666fa88b4aa67a6","amp;dn":"The+Oxford+Companion+to+the+Year%3A+An+Exploration+of+Calendar+Cus","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7ad10f25c728af9270d61240666fa88b4aa67a6","infoHashBuffer":{"type":"Buffer","data":[167,173,16,242,92,114,138,249,39,13,97,36,6,102,250,136,180,170,103,166]},"announce":[],"urlList":[]}}