{"title":"[PDF] [2000] A General Theory of Love","uid":6397846,"size":7715697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a7f39fe41bd52f3c615a6a2c785cc1b913002721&amp;dn=%5BPDF%5D+%5B2000%5D+A+General+Theory+of+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lyndavilla","files":2,"time":1305571218,"description":"DOWNLOAD MORE EBOOKS, MAGAZINES, &amp; PDFS:\n &lt;a href=&quot;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://buyabook.ws/download-ebooks-magazines-pdfs-more/&lt;/a&gt;\n\nBOOK INFO:\n\nDrawing on new scientific discoveries and seventy years of collective clinical experience, three psychiatrists unravel life's most elemental mystery: the nature of love. A primordial area of the brain, far older than reason or thinking, creates both the capacity and the need for emotional intimacy that all humans share. A General Theory Of Love describes the workings of this ancient, pivotal bond and reveals that our nervous systems are not self-contained. Instead, our brains link together with those of the people close to us, in a silent rhythm that makes up the very life force of the body. These wordless and powerful ties determine our moods, stabilize and maintain our health and well-being, and change the structure of our brains. In consequence: who we are and who we become depend, in great part, on whom we love. A GENERAL THEORY OF LOVE applies these and other extraordinary insights to some of the most crucial issues we face in our lives. Its authors explain how relationships function and where love goes wrong, how parents shape a child's developing self, how psychotherapy really works, what curbs and what fosters violent aggression in our children, and how modern society regularly courts disaster by flouting emotional laws it does not yet recognize. A work of rare originality, passion and eloquence, A GENERAL THEORY OF LOVE will forever change the way you think about human intimacy.\n\nPoor, poor science--it gets blamed for everything. While it might be true that some of our alienation and unhappiness stem from a too-rational misunderstanding of emotion, it's also true that science is its own remedy. A General Theory of Love, by San Francisco psychiatrists Thomas Lewis, Fari Amini, and Richard Lannon, is a powerfully humanistic look at the natural history of our deepest feelings, and why a simple hug is often more important than a portfolio full of stock options. Their grasp of neural science is topnotch, but the book is more about humans as social animals and how we relate to others--for once, the brain plays second fiddle to the heart. Though some of their social analysis is less than fully thought out--surely e-mail isn't a truly unique form of communication, as they suggest--the work as a whole is strong and merits attention. Science, it turns out, does have much to say about our messy feelings and relationships. While much of it could be filed under &quot;common sense,&quot; it's nice to know that common sense is replicable. Hard-science types will probably be exasperated with the constant shifts between data and appeals to emotional truths, but the rest of us will see in A General Theory of Love a new synthesis of research and poetry. --Rob Lightner","torrent":{"xt":"urn:btih:a7f39fe41bd52f3c615a6a2c785cc1b913002721","amp;dn":"%5BPDF%5D+%5B2000%5D+A+General+Theory+of+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a7f39fe41bd52f3c615a6a2c785cc1b913002721","infoHashBuffer":{"type":"Buffer","data":[167,243,159,228,27,213,47,60,97,90,106,44,120,92,193,185,19,0,39,33]},"announce":[],"urlList":[]}}