{"title":"The Museum Of Everything - S01 to 03 - MP3 - Slimoo","uid":10108065,"size":481944094,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a8141cfd253aba88b562103989981c1f44ebec3b&amp;dn=The+Museum+Of+Everything+-+S01+to+03+-+MP3+-+Slimoo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"_Slimoo_","files":18,"time":1399484080,"description":"The Museum Of Everything - Audio Comedy - 128K - Mp3 - Slimoo\n \n\n\n\n\n===================== NOTE =====================\n \n\n \n\n\n\n[b]\n\n\nI try to post a torrent &quot;Every&quot; day.\n\nI use my upload to post new torrents,\nI do not re-seed any torrents \n(Unless I know you via commenting)\n\nOnce 5 people complete I stop seeding\nI need to move on to the new torrent\n \n\n[/b]\n\n\n================================================= \n\n&quot;Welcome to the Museum of Everything; feel free to wander round our many galleries and experience the history of everything. \n Children are welcome, but please keep them in the bags provided.&quot; \n\n The critically acclaimed comedy sketch show written and performed by Danny Robins, Dan Tetsell and Marcus Brigstocke - the team behind BBC 2's We Are History. Based on their successful Edinburgh Festival show, it's a sketch show in disguise; themed around the world of museums, galleries, guided tours, stately homes, historical re-enactors and obsessive collectors and set in the vaguely mystical and apparently infinite environs of\n The Museum of Everything. \n\n &quot;The exhibit on superstitions in on the 13th floor&quot; \n\n\n Our guides are a pair of long-suffering underpaid West Country museum attendants, who pop up to remind us of museum rules, announce forthcoming attractions and reassure us that it's never far to the promised land of the gift shop, where you can buy leather bookmarks, novelty pencil sharpeners and fudge in the shape of Jane Austen. \n\n\n\n Cast:\n Danny Robins \n Dan Tesell \n Marcus Brigstocke \n Lucy Montgomery \n\n The Museum Of Everything - S01 - E01 - Welcome To The Museum Of Everything\n The Museum Of Everything - S01 - E02 - A Very Important Visitor\n The Museum Of Everything - S01 - E03 - School Parties Welcome\n The Museum Of Everything - S01 - E04 - To Infinity And Beyond\n The Museum Of Everything - S01 - E05 - Ancient Worlds The History Of Everything\n The Museum Of Everything - S01 - E06 - The History Of The Future\n\n The Museum Of Everything - S02 - E01 - Thomas Queezly\n The Museum Of Everything - S02 - E02 - The Dig\n The Museum Of Everything - S02 - E03 - Under New Management\n The Museum Of Everything - S02 - E04 - The Coach Trip\n The Museum Of Everything - S02 - E05 - By Royal Appointment\n The Museum Of Everything - S02 - E06 - Behind The Magic\n\n The Museum Of Everything - S03 - E01 - The William Shakespearance\n The Museum Of Everything - S03 - E02 - The Human Body Experience\n The Museum Of Everything - S03 - E03 - The Museum's Most Precious Object\n The Museum Of Everything - S03 - E04 - The Museum Of The Year Awards\n The Museum Of Everything - S03 - E05 - The Expo\n The Museum Of Everything - S03 - E06 - How Things Work\n .\n\n Audio Format : MP3\n Duration : 28mn 1s\n Bit rate mode : Constant\n Bit rate : 128 Kbps\n Channel(s) : 2 channels\n Sampling rate : 44.1 KHz\n Resolution : 16 bits\n \n \n\n\n","torrent":{"xt":"urn:btih:a8141cfd253aba88b562103989981c1f44ebec3b","amp;dn":"The+Museum+Of+Everything+-+S01+to+03+-+MP3+-+Slimoo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8141cfd253aba88b562103989981c1f44ebec3b","infoHashBuffer":{"type":"Buffer","data":[168,20,28,253,37,58,186,136,181,98,16,57,137,152,28,31,68,235,236,59]},"announce":[],"urlList":[]}}