{"title":"Pleasure and the Arts - Enjoying Literature, Painting, and Music","uid":9854593,"size":4610933,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a83001a7ab226f52a12f7d3466aa63b4eb96fa67&amp;dn=Pleasure+and+the+Arts+-+Enjoying+Literature%2C+Painting%2C+and+Music&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1396209520,"description":"Christopher Butler, &quot;Pleasure and the Arts: Enjoying Literature, Painting, and Music&quot; \nOxford University Press, USA | 2004 | ISBN: 0199288720, 0199272484 | 256 pages | PDF | 4 MB\n\nHow do the arts give us pleasure? Covering a very wide range of artistic works, from Auden to David Lynch, Rembrandt to Edward Weston, and Richard Strauss to Keith Jarrett, Pleasure and the Arts offers us an explanation of our enjoyable emotional engagements with literature, music, and painting. The arts direct us to intimate and particularized relationships, with the people represented in the works, or with those we imagine produced them. When we listen to music, look at a purely abstract painting, or drink a glass of wine, can we enjoy the experience without verbalizing our response? Do our interpretative assumptions, our awareness of technique, and our attitudes to fantasy, get in the way of our appreciation of art, or enhance it? Examining these questions and more, we discover how curiosity drives us to enjoy narratives, ordinary jokes, metaphors, and modernist epiphanies, and how narrative in all the arts can order and provoke intense enjoyment. Pleasurable in its own right, Pleasure and the Arts presents a sparkling explanation of the enduring interest of artistic expression.","torrent":{"xt":"urn:btih:a83001a7ab226f52a12f7d3466aa63b4eb96fa67","amp;dn":"Pleasure+and+the+Arts+-+Enjoying+Literature%2C+Painting%2C+and+Music","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a83001a7ab226f52a12f7d3466aa63b4eb96fa67","infoHashBuffer":{"type":"Buffer","data":[168,48,1,167,171,34,111,82,161,47,125,52,102,170,99,180,235,150,250,103]},"announce":[],"urlList":[]}}