{"title":"Grateful Dead - From The Mars Hotel (1974) 2013 HDTracks-24-96-F","uid":11152245,"size":822370567,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a850d3d9fcf677fad630a0a4df2595a9ed181962&amp;dn=Grateful+Dead+-+From+The+Mars+Hotel+%281974%29+2013+HDTracks-24-96-F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"hal4000","files":-1,"time":1412362316,"description":"The Grateful Dead was an American rock band formed in 1965 in Palo Alto, California. The band was known for its unique and eclectic style, which fused elements of rock, folk, bluegrass, blues, reggae, country, improvisational jazz, psychedelia, and space rock, and for live performances of long musical improvisation. &quot;Their music,&quot; writes Lenny Kaye, &quot;touches on ground that most other groups don't even know exists.&quot; These various influences were distilled into a diverse and psychedelic whole that made the Grateful Dead &quot;the pioneering Godfathers of the jam band world&quot;. They were ranked 57th in the issue The Greatest Artists of all Time by Rolling Stone magazine. They were inducted into the Rock and Roll Hall of Fame in 1994 and their Barton Hall Concert at Cornell University (May 8, 1977) was added to the Library of Congress's National Recording Registry. The Grateful Dead have sold more than 35 million albums worldwide.\n\nThe Grateful Dead made their reputation on the road with their live shows, and they always struggled to capture that magic in the studio. From the Mars Hotel, while not a classic, represents one of their better studio albums. Jerry Garcia sounds engaged throughout and takes the vocal reigns for most of the songs on the album -- although he's not the most gifted vocalist, he proves himself able and versatile. He sings the rollicking opener, &quot;U.S. Blues,&quot; with a tongue-in-cheek seriousness that gives the political song an edge, and he lends emotional sincerity to the atmospheric ballad &quot;China Doll.&quot; Garcia shines on guitar during the funk workout &quot;Scarlet Begonias,&quot; but the ensemble work is best displayed on the album's centerpiece, &quot;Unbroken Chain.&quot; During this song, all the musicians are allowed to shine: Phil Lesh, the bassist and songwriter, provides tender vocals over a piano-based arrangement while the bridge allows the guitars and drums to stretch out in classic Grateful Dead style. This album is highly recommended for fans, but casual listeners should start with American Beauty or Workingman's Dead.\n\nHDTracks PCM-24Bit-96Khz-FLAC.\n","torrent":{"xt":"urn:btih:a850d3d9fcf677fad630a0a4df2595a9ed181962","amp;dn":"Grateful+Dead+-+From+The+Mars+Hotel+%281974%29+2013+HDTracks-24-96-F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a850d3d9fcf677fad630a0a4df2595a9ed181962","infoHashBuffer":{"type":"Buffer","data":[168,80,211,217,252,246,119,250,214,48,160,164,223,37,149,169,237,24,25,98]},"announce":[],"urlList":[]}}