{"title":"The Killing - 01 - The Killing - David Hewson.epub","uid":8923037,"size":620697,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a851c826bee527b08cc4ad79c02b49990f7fc75f&amp;dn=The+Killing+-+01+-+The+Killing+-+David+Hewson.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1379302205,"description":"A pageturning adaptation of the first season of the original Danish television series The Killing, from the author of the Nic Costa series\nThrough the dark wood where the dead trees give no shelter Nanna Birk Larsen runs . . . There is a bright monocular eye that follows, like a hunter after a wounded deer. It moves in a slow approaching zigzag, marching through the Pineseskoven wasteland, through the Pentecost Forest. The chill water, the fear, his presence not so far away . . . There is one torchlight on her now, the single blazing eye. And it is here.\nSarah Lund is looking forward to her last day as a detective with the Copenhagen Police department before moving to Sweden. But everything changes when 19-year-old student Nanna Birk Larsen is found raped and brutally murdered in the woods outside the city. Lund's plans to relocate are put on hold as she leads the investigation along with fellow detective Jan Meyer. While Nanna's family struggles to cope with their loss, local politician Troels Hartmann is in the middle of an election campaign to become the new mayor of Copenhagen. When links between City Hall and the murder suddenly come to light, the case takes an entirely different turn. Over the course of 20 days, suspect upon suspect emerges as violence and political intrigue cast their shadows over the hunt for the killer.\nGenre: Thriller","torrent":{"xt":"urn:btih:a851c826bee527b08cc4ad79c02b49990f7fc75f","amp;dn":"The+Killing+-+01+-+The+Killing+-+David+Hewson.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a851c826bee527b08cc4ad79c02b49990f7fc75f","infoHashBuffer":{"type":"Buffer","data":[168,81,200,38,190,229,39,176,140,196,173,121,192,43,73,153,15,127,199,95]},"announce":[],"urlList":[]}}