{"title":"Ondskan (eng subs) [2003] Mikael Hafstrom","uid":5980511,"size":1464740818,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a8b4ccc152e4140508dc1d986236dd1a4d3b6a6a&amp;dn=Ondskan+%28eng+subs%29+%5B2003%5D+Mikael+Hafstrom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ThorntonWilde","files":-1,"time":1290578673,"description":" &lt;a href=&quot;http://bayimg.com/PAAhGAAdn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://bayimg.com/PAAhGAAdn&lt;/a&gt;\n\nEvil (2003) \n\nOndskan (original title) \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0338309/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0338309/&lt;/a&gt;\n\nEvil (Swedish: Ondskan) is a 2003 Swedish drama film directed by Mikael HÃƒÂ¥fstrÃƒÂ¶m, based on Jan Guillou's semi-autobiographical novel Ondskan from 1981. The film is set in a private boarding school in the year 1959 with institutional violence as its theme. The film stars Andreas Wilson as Erik, the main character. Other actors include Gustaf SkarsgÃƒÂ¥rd, Kjell Bergqvist and BjÃƒÂ¶rn Granath.\n\n  Andreas Wilson  ...  Erik Ponti  \n  Henrik LundstrÃƒÂ¶m  ...  Pierre Tanguy  \n  Gustaf SkarsgÃƒÂ¥rd  ...  Otto Silverhielm  \n  Linda Zilliacus  ...  Marja  \n  Jesper SalÃƒÂ©n  ...  DahlÃƒÂ©n  \n  Filip Berg  ...  Johan  \n  Fredrik af Trampe  ...  von Schenken  \n  Richard Danielsson  ...  Karlberg  \n  Martin Svane  ...  Leffler  \n  Rustan Blomqvist  ...  Bergvall  \n  Peter Eggers  ...  Von Rosen  \n  Per Westergren  ...  Lewenheusen  \n  Henrik Linnros  ...  Beijer  \n  Theodor Hoffsten  ...  Lagerros  \n  Sanna Mari Patjas  ...  Stina (as Sannamari Patjas)  \n\nThe film was nominated for the Academy Award for Best Foreign Language Film at the 76th Academy Awards. It won three Swedish Guldbagge Awards including Best Film.\n\nBeing based on one of the best selling Swedish books in modern times, there had been discussions about a film adaptions for many years, including several failed attempts, before Mikael HÃƒÂ¥fstrÃƒÂ¶m was offered to direct the material. It was originally conceived as a television series, but HÃƒÂ¥fstrÃƒÂ¶m felt he was not ready for such an extensive production. Instead he waited a few years and eventually convinced the producers to make it a feature film. HÃƒÂ¥fstrÃƒÂ¶m brought in Hans Gunnarsson, with whom he had worked before, as a co-writer, and the writing process as well as the financing went ahead quickly. The budget was 20 million Swedish kronor.\n\nThe casting of the supporting actors proceeded without any significant difficulties, but despite auditions for over 120 applicants, a lead actor had still not been found when only two weeks remained before filming was intended to begin. Finally the director recalled Andreas Wilson, a young male model with very limited acting experience whom he had previously met briefly at a birthday party. HÃƒÂ¥fstrÃƒÂ¶m contacted people he knew had been at the party to get Wilson's phone number, after which he called him and asked him to come over. HÃƒÂ¥fstrÃƒÂ¶m was immediately sure that he had found the right person, and after a few physical tests, Wilson was given the role. Before filming started Wilson had swimming training to learn how to crawl the way swimmers did in the 1950s.\n \nGÃƒÂ¶rvÃƒÂ¤lns slott north of Stockholm served as the school building's exterior.Filming took 30 days to finish, from early October to November 2002. The school StjÃƒÂ¤rnsberg in the film is based on Solbacka boarding school, a real school attended by the author of the novel. The school was closed in 1973. The original building of Solbacka still exists as a recreation centre for golfers, but had been renovated to such a degree that the director felt it could not be used as a believable filming location. Instead most exterior shots were made around GÃƒÂ¶rvÃƒÂ¤lns slott in Jakobsberg, north of Stockholm. The dining area in the film was built in a studio as a replica of the original school's dining hall, based on photographs from the time. The pool scenes were shot at the school GubbÃƒÂ¤ngsskolan in southern Stockholm.\n\nSongs heard in the film includes Stupid Cupid by Neil Sedaka, The Great Pretender by The Platters, Weisser Halunder by Inger Berggren, and Peggy Sue by Buddy Holly &amp; The Crickets.\n\nOndskan is a personal story, revealing tensions in a closed 1950's era society where suppression of personal expression  is normal.  The air of nobility and wealth supersedes all, and there is a tinge of racial classification and scale of acceptable Nordic traits, demonstrated by an anthropology lesson given to Erik, Pierre and their classmates by a teacher, who the students whisper may have Nazi background. \n\nCinematographer Peter Mokrosinski lenses this movie in well staged shots. StjÃƒÂ¤rnsberg is replete with beautiful landscaping, rock walls encrusted with lichens, polished patina wood with warm golden light juxtaposing its inhabitant's lack of discernible kindness. \n\nCostume Designer Kersti Vitali expertly dresses the cast in vintage 1950's clothing, and Anna Asp does a great turn as the production designer, dressing the story in such a lovely, serene setting, it is hard to believe what we are watching unfold for Erik. \n \nErik's initial refusal to fight back at StjÃƒÂ¤rnsberg is frustrating.  You desperately want to see him not take the abuse from the upper-classmen. But Erik has bought in to his mother's argument that StjÃƒÂ¤rnsberg represents his last hope for a future, and this fact keeps him from any action.  The ending twists, and through some well-timed legal help and a final confrontation with his step-father, Erik triumphs, and prevails.  \n\nAn interesting side-note, author Jan Guillou continuously fought against social wrongs in his home country, most famously through his disclosure of the IB-affair in 1973.   He suffered for this, after revealing that the Swedish government deployed a CIA-like information bureau to send agents to Eastern Europe and third world countries that were 'hostile to the West'. Author Guillou and another journalist, Peter Bratt were sentenced to 10 months in prison for espionage. \n\n","torrent":{"xt":"urn:btih:a8b4ccc152e4140508dc1d986236dd1a4d3b6a6a","amp;dn":"Ondskan+%28eng+subs%29+%5B2003%5D+Mikael+Hafstrom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8b4ccc152e4140508dc1d986236dd1a4d3b6a6a","infoHashBuffer":{"type":"Buffer","data":[168,180,204,193,82,228,20,5,8,220,29,152,98,54,221,26,77,59,106,106]},"announce":[],"urlList":[]}}