{"title":"Bones S10E01-E04 720p HDTV NL Subs DutchReleaseTeam","uid":11318633,"size":5688090506,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:a8d97fedc0dfa59d90f6f690820459291c939357&amp;dn=Bones+S10E01-E04+720p+HDTV+NL+Subs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Boobin16","files":-1,"time":1414578761,"description":"Plot:\nTemperance Brennan is als forensisch antropologe werkzaam op het Jeffersonian Instituut. Samen met haar team van uitermate getalenteerde wetenschappers helpt ze de FBI om moordzaken op te lossen. Niet alleen oude, onopgeloste moordzaken worden opgelost, maar ook recente moordzaken. Tijdens haar werk voor de FBI werkt ze samen met Seeley Booth (David Boreanaz). Tussen de FBI en het Jeffersonian Instituut bestaan soms onenigheden, zoals die ook tussen Brennan (en haar team) en Booth bestaan. Maar uiteindelijk lossen de twee partijen de zaken altijd weer op.\n\nVertaling: vdbke en Sedatus\n\nSeizoen 10 Aflevering 1: The Conspiracy in the Corpse\n\nBrennan and the Jeffersonian team are desperately working to get Booth out of jail, clear his name and absolve him of crimes he did not commit. The remains of a man who has been dead 16 years could be the point of origin in the entire government conspiracy that ultimately put Booth in jail. Meanwhile, Booth is faced with a challenge from a new and politically ambitious FBI agent. As he awaits trial, Booth also realizes that many of the convicts with whom he is locked up are criminals he put in there, and Daisy and Sweets have a surprise for the rest of the Jeffersonian team.\n\nSeizoen 10 Aflevering 2: The Lance to the Heart\n\nTo find out who framed Booth for murder, the Jeffersonian team, with the help Special Agent James Aubrey, continues to investigate who is behind a conspiracy within the Federal Government that dates all the way back to J. Edgar Hoover. Then, when foreign DNA is found in a previous victim linked to the scandal, the team is able to narrow down the number of suspects, leading them closer to cracking the case.\n\n\nSeizoen 10 Aflevering 3: The Purging of the Pundit\n\nWith the help of &quot;squintern&quot; Rodolfo Fuentes , the Jeffersonian team investigates the murder of a controversial conservative radio host whose remains were found in a storm drain. When the team discovers some of his extracurricular activities, they come across shocking evidence that narrows down the suspects. Meanwhile, Special Agent James Aubrey is desperate to gain the trust of Booth, and Brennan is worried about Booth's psychological well-being after recent events.\n\nSeizoen 10 Aflevering 4: The Geek in the Guck\n\nThe Jeffersonian team, with the help Special Agent James Aubrey, investigate the murder of a video game designer whose remains were found washed up in a river. When the team uncovers more about the fortune the victim had acquired throughout his career, everyone who was close to him becomes a suspect. However, the investigation takes a turn when they discover that the victim was playing his own games on people. Meanwhile, &quot;squintern&quot; Jessica Warren enlightens the team about the educational cooperative with which she has been involved and Brennan and Booth discuss Christine's future.\n\nDeze serie wordt u aangeboden door het DutchReleaseTeam.\nVoor de reviews van de nieuwste films, muziek, series, games etc\nKom eens langs op &lt;a href=&quot; http://www.hetmultimediacafe.nl/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.hetmultimediacafe.nl/&lt;/a&gt;\n\nDutchReleaseTeam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:a8d97fedc0dfa59d90f6f690820459291c939357","amp;dn":"Bones+S10E01-E04+720p+HDTV+NL+Subs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d97fedc0dfa59d90f6f690820459291c939357","infoHashBuffer":{"type":"Buffer","data":[168,217,127,237,192,223,165,157,144,246,246,144,130,4,89,41,28,147,147,87]},"announce":[],"urlList":[]}}