{"title":"Vintage Modern Knits: Contemporary Designs Using Classic Techniq","uid":9254238,"size":114223841,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a94e1390ef6e23527360084d9603ac3001bfe98a&amp;dn=Vintage+Modern+Knits%3A+Contemporary+Designs+Using+Classic+Techniq&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1385524347,"description":"Looking for classic and romantic knits with current style?Inspired by traditional knits, up-and-coming designers Courtney Kelley and Kate Gagnon Osborn put their own contemporary spin on knitting in Vintage Modern Knits, offering designs that you will simply want to wear! From classic designs with fashion-forward color combinations to funky cable sweaters for weekend living, each pattern takes its inspiration from classic silhouettes and adds a a modern spin for an irresistible combination.Vintage Modern Knits features several different traditional techniques?cables, Fair Isle, lace, colorwork, and more? all showcased in modern, luxurious projects that are fun to knit and lovely to wear. Divided into three sections (Vintage Feminine, Rustic Weekend, and Winter Harbor), Vintage Modern Knits features pieces with tailored lines, close fit, and easy-to-wear, stylish classics. Projects range from quick accessories to garments in a variety of knitting techniques. Packed with perfect weekend wear, Vintage Modern Knits puts a contemporary twist on classic knits youÂ’ll love wearing!","torrent":{"xt":"urn:btih:a94e1390ef6e23527360084d9603ac3001bfe98a","amp;dn":"Vintage+Modern+Knits%3A+Contemporary+Designs+Using+Classic+Techniq","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a94e1390ef6e23527360084d9603ac3001bfe98a","infoHashBuffer":{"type":"Buffer","data":[169,78,19,144,239,110,35,82,115,96,8,77,150,3,172,48,1,191,233,138]},"announce":[],"urlList":[]}}