{"title":"Debbie Epstein - Writing for Publication [2007] [A]","uid":9922694,"size":2338455,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a95b1508353c6657fbd8f513aba9b6f14699f73a&amp;dn=Debbie+Epstein+-+Writing+for+Publication+%5B2007%5D+%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Anette14","files":-1,"time":1397017078,"description":"Description\nProduct Details\nBook Title: Writing for Publication (Academic's Support Kit)\t\nBook Author: Debbie Epstein (Author), Jane Kenway (Author), Rebecca Boden (Author)\nSeries: Academic's Support Kit\nPaperback: 136 pages\nPublisher: Sage Publications UK (January 1, 2007)\nLanguage: English\nISBN-10: 1412906970\nISBN-13: 978-1412906975\n\n&quot;Writing for Publication&quot; deals with a number of generic issues around academic writing (including intellectual property rights) and then considers writing refereed journal articles, books and book chapters in detail as well as other, less common, forms of publication for academics. The aim is to demystify the process and to help you to become a confident, competent, successful and published writer.\n\nAbout the Author\nI work at the nexus of sociology and cultural studies and my research interests comprise childhood and youth studies, particularly sexuality, gender and race in education and in popular culture, and the cultural politics of education. Overall, my focus is on the dominant and how it is held in place, though this often involves investigating the experiences of those in subordinated, marginalised and/or stigmatised groups. I am especially concerned with how children negotiate these 'differences that make a difference' and their agency in the context of institutional settings such as schools and families. Research interests Education policy particularly in relation to globalisation and socio-cultural change Socio-cultural studies of diverse youthful identities and education Education, media and consumer cultures Elite Schools around the world and the formation of transnational elites Fields of Research (FOR) Higher Education Gender, Sexuality and Education Education Policy Sociology of Education.\n","torrent":{"xt":"urn:btih:a95b1508353c6657fbd8f513aba9b6f14699f73a","amp;dn":"Debbie+Epstein+-+Writing+for+Publication+%5B2007%5D+%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a95b1508353c6657fbd8f513aba9b6f14699f73a","infoHashBuffer":{"type":"Buffer","data":[169,91,21,8,53,60,102,87,251,216,245,19,171,169,182,241,70,153,247,58]},"announce":[],"urlList":[]}}