{"title":"The Reverend Peyton's Big Damn Band - Between The Ditches [2012]","uid":8350098,"size":348125138,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:a970a117c48baff27a649ca08fda2de3d5713122&amp;dn=The+Reverend+Peyton%27s+Big+Damn+Band+-+Between+The+Ditches+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":17,"time":1365314615,"description":"Artist: The Reverend Peyton's Big Damn Band\nRelease: Between The Ditches\nDiscogs: 3792303\nReleased: 2012 / 2012-08-07\nLabel: SideOneDummy Records\nCatalog#: SD1487-1\nFormat:  FLAC / Lossless / Log (100%) / Cue / CD\nCountry: US\nStyle: Blues, \n\nTracklisting:\n\n1. Devils Look Like Angels\n2. Something for Nothing\n3. We'll Get Through\n4. Big Blue Chevy '72\n5. Shut the Screen\n6. Shake 'Em Off Like Fleas\n7. Easy Come Easy Go\n8. I Don't Know\n9. Don't Grind It Down\n10. The Money Goes\n11. Move Along Mister\n12. Between the Ditches\n13. Brokedown Everywhere\n14. Brown County Bound\n\n\nThe Reverend Peyton's Big Damn Band is a hillbilly country blues trio (Josh Peyton on guitar and roaring vocals, his wife Breezy on washboard, and cousin Aaron Persinger on percussion and drums) out of Indiana with a wonderfully ragged and swampy deep Delta sound that kicks like a mule, and the trio thankfully doesn't deviate much from that core sound on Between the Ditches, produced by Peyton and Paul Mahern and recorded at White Arc Studio in Bloomington, Indiana. Unlike the band's previous albums, though, Between the Ditches wasn't recorded whirlwind live in four or five hours, and represents a sort of refinement for the Big Damn Band in the studio. These guys are a hillbilly blues throwback ensemble, though, and no amount of refinement can really push them off their mark. Peyton's voice still croaks, shouts, and roars, and his unique, kinetic slide guitar playing, whether it's a '30s National guitar, a cigar-box guitar, a Gibson flattop 1929 L2, or an Airline Map electric guitar, still drives and churns like a runaway train. He just sounds clearer, but no less powerful. The songs are shambling, wise, and real, and often deceptively simple, sounding somehow like they come from the century before, even as they are very much a part of this one. Peyton has developed a direct but clever lyrical writing style, wearily proclaiming &quot;It's hard to tell when devils look like angels and angels look like hell&quot; in the fine opening track, &quot;Devils Look Like Angels,&quot; and in &quot;Shut the Screen,&quot; a breakneck slide guitar romp, he shouts &quot;Shut the screen, it's too damn hot, and them bugs are too damn mean,&quot; as his slide lines bounce and blister over Breezy's washboard and Persinger's bucket drum rhythms. This is an American band in the truest sense, hailing from Indiana, singing about life driving and living on the everyday back roads of Indiana in the 21st century, but sounding like they came out of the bayous of Louisiana or the Mississippi Delta the century before. It's a potent and timeless sound, and thankfully studio refinement doesn't hinder it at all.","torrent":{"xt":"urn:btih:a970a117c48baff27a649ca08fda2de3d5713122","amp;dn":"The+Reverend+Peyton%27s+Big+Damn+Band+-+Between+The+Ditches+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a970a117c48baff27a649ca08fda2de3d5713122","infoHashBuffer":{"type":"Buffer","data":[169,112,161,23,196,139,175,242,122,100,156,160,143,218,45,227,213,113,49,34]},"announce":[],"urlList":[]}}