{"title":"The Anthony Cumia Show 2015-05-13 Gun Debate MP4 MP3","uid":11920762,"size":375042842,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:aa55ee7072d9818d72611b4579515559784262ee&amp;dn=The+Anthony+Cumia+Show+2015-05-13+Gun+Debate+MP4+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mothergoose58","files":2,"time":1431626009,"description":"*** CAUTION: 100% UNCENSORED CONTENT!!! ***\n\n-NOT FOR VIEWING BY CHILDREN OR THE FAINT OF HEART-\n\nFresh off his &quot;separation&quot; from SiriusXM, Anthony Cumia, formerly of The Opie and Anthony Show launches his live, uncensored HD video webcast at AnthonyCumia.com Monday-Thursday 4pm-6pm EST. Current events, politics, news and anything can and will be discussed with celebrity guests and comedians stopping by as well. This show is not for those who are inclined to be &quot;politically correct&quot; and will contain boundary-pushing language and topics. Proceed with caution...\n\nGuest: Ladd Everitt\n\nEpisode 162 - Wednesday's TACS begins with a vocally challenged Ant telling us about the after show taping with Stuttering John, we watch a video of Beavis opening a door, and briefly go through the derailed train news story. We see a reporters &quot;outrage&quot; over &quot;fuck her right in the pussy&quot;. Ant talks about equality with consequences, a woman fired over deleting an app, the legality of employee tracking, Al Franken, and we revisit a &quot;debate&quot; with Jim Norton and Lindy West. We learn that former congressman Patrick Murphy kicked out a window and was not kicked out of one, a caller plays a trivia game, we get a Bobo Fan Duel update, and Anthony moves out to the poker table to meet up with Ladd Everitt. The guys discuss Ladd's work with the Coalition to Stop Gun Violence, the interpretation of the second amendment, the government's role in firearms, radical solutions, background checks, responsibility of gun ownership, and trafficking firearms. They also have heated chat about assault weapons, regulations, trusting gun owners vs. laws, infringements for gun owners, ever changing legislature, registering and licensing, gun violence varying by country, guns for ranges vs. battlefields, criminals screwing it up for law abiding gun owners, going around the law to purchase guns, legalizing the black market, advancements in firearms, and they debate the &quot;SAFE Act&quot;.\n\n\nIncludes an MP4 video file and an MP3 audio file; download both or only what you need and please seed!\n\nNew ups at: http://thepiratebay.se/user/mothergoose58/\n\nSubscribe at AnthonyCumia.com!!!","torrent":{"xt":"urn:btih:aa55ee7072d9818d72611b4579515559784262ee","amp;dn":"The+Anthony+Cumia+Show+2015-05-13+Gun+Debate+MP4+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa55ee7072d9818d72611b4579515559784262ee","infoHashBuffer":{"type":"Buffer","data":[170,85,238,112,114,217,129,141,114,97,27,69,121,81,85,89,120,66,98,238]},"announce":[],"urlList":[]}}