{"title":"Whoopi Goldberg HBO Specials - 1985 &amp; 2005","uid":6028151,"size":1607106460,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ab09dc41b41fadf32c629e6d01f79f1a8235872e&amp;dn=Whoopi+Goldberg+HBO+Specials+-+1985+%26+2005&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":30,"time":1291986001,"description":"Whoopi Goldberg: Direct from Broadway (1985)\n \nBetween 1980 and 1984, Whoopi Gooldberg developed a one-woman show &quot;The Spook Show&quot;, which was first presented in 1982 and later toured successfully around the USA and Europe. After opening at New York's Dance Theatre Workshop in 1983, the show became an immediate critical success and was seen by director Mike Nichols, who moved it to Broadway the following year in a revised form simply titled &quot;Whoopi Goldberg&quot;.\n\nIn 1985, Whoopi played to sold out audiences at the Lyceum Theatre, winning a Theater World Award and a Drama Desk Award for Best Solo Performance. The performance was taped by HBO and broadcast as &quot;Whoopi Goldberg: Direct From Broadway&quot;, and an album of the show, &quot;Original Broadway Show Recording&quot; won the Grammy Award for Best Comedy Recording of the Year in 1985. \n\nThe show brought her to the attention of Steven Spielberg, who cast her as the star of his version Alice Walker's acclaimed novel, The Color Purple, a role which jump-started her film career and earned her an Academy Award Nomination and a Golden Globe win for Best Actress.\n\nSubtitles: English, Dutch, French, German, Greek\n\n\n\nWhoopi Goldberg: Back to Broadway - The 20th Anniversary (2005)\n\nSmart, savvy and sassy, Whoopi Goldberg exploded onto the show-biz scene in 1985, when her one-woman Broadway show wowed live audiences and, later, HBO subscribers. One of the worlds most beloved and honored acting and comedy stars -- the multiple award-winning Goldberg performs in her first solo HBO special in over 13 years. Taped before a live audience at the Lyceum Theatre in New York City (the same venue for her historic 1985 inaugural HBO special). The 20th anniversary features a refreshing mix of familiar and new Goldberg creations.\n\nSubtitles: English, Dutch, French, German, Greek\n\nSpecial Features:\n1) Whoopi Bloopers\n2) Whoopi on Whoopi\n3) In the Can with Whoopi","torrent":{"xt":"urn:btih:ab09dc41b41fadf32c629e6d01f79f1a8235872e","amp;dn":"Whoopi+Goldberg+HBO+Specials+-+1985+%26+2005","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab09dc41b41fadf32c629e6d01f79f1a8235872e","infoHashBuffer":{"type":"Buffer","data":[171,9,220,65,180,31,173,243,44,98,158,109,1,247,159,26,130,53,135,46]},"announce":[],"urlList":[]}}