{"title":"Mick Jagger - She's The Boss (1985) WMA320","uid":6163557,"size":117247670,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ab9ee2e03e90b4b663e5c94cba580ccca2c0718a&amp;dn=Mick+Jagger+-+She%5C%27s+The+Boss+%281985%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1297304178,"description":"Before the Stones' Dirty Work hit the shelves in 1986, Mick Jagger released his first solo album a year before. Like Phil Collins doing a different sound to distinguish his solo material from Genesis, so too does Mick to differentiate She's The Boss from another Rolling Stones album with guitar chores from Jeff Beck and Pete Townshend and some keyboard work by jazz great Herbie Hancock. It has a smoother sound yet manages to rock with a pop polish. Most of the songs are produced by Bill Laswell, but Nile Rodgers of Chic does his hand on three of the tracks. \n\nThose are &quot;Ã‚Â½ a Loaf&quot;, which features a sound one might recognize on Like A Virgin, also helmed by Rodgers, who also does guitar here, with former bandmate Bernard Edwards on bass. Having a clandestine affair is deemed &quot;half a glass, half a dream, half a life&quot; and in the bridge, a frustrated Mick just says to heck with it and let it all hang out. He then calls upon some overprotective guardian to &quot;Turn The Girl Loose.&quot; Featuring a strong bass, Mick really belts it out when he yells &quot;let her out of jail.&quot; It even has Alfa Anderson doing a sassy rap declaring her independence and free will at the end. &quot;Secrets&quot; shows that a respectable wife isn't that respectable but has been really out on the town. \n\nEven though not produced by Rodgers, the sound on the first danceable single &quot;Just Another Night&quot; is a disguised cousin of &quot;Material Girl&quot; in terms of sound. It hit #12 on the singles chart, somewhat low considering his long history with the Stones, but it was a #1 mainstream rock hit. Jagger seems to be shucking off the bad boy persona of the Stones: &quot;Can't you see that I'm human&quot; and &quot;I get hungry, I get thirsty, I get moody, I need attention.&quot; Some great percussive effects by Sly Dunbar here. \n\nThe closest thing to the Stones comes from Keith Richards' co-penning of the energetic rocker &quot;Lonely At The Top&quot; a warning on how fame, the thing &quot;that leads young girls astray&quot; eventually strips away one's soul once one reaches that pinnacle. One might indulge Jagger, as his band is considered one of the greatest bands in the rock and roll pantheons. \n\nAnother lively track, &quot;Running Out of Luck&quot; has Mick on harmonica. This also spawned an extended concept video of the same name, and which I presume had the videos for &quot;Just Another Night&quot; and &quot;Lucky In Love&quot; on it. \n\nWhere the Stones were chauvinistic on some of their previous albums, a few songs champion the woman. Other than &quot;Turn The Girl Loose,&quot; there's &quot;Hard Woman,&quot; a tender and melodic ballad with some strings that's actually one of my favourites tracks and could've been a single. Lots of famed players are here, Tony Thompson of Chic and the Power Station on drums, Jan Hammer on piano, and Beck and Townshend on guitars. Despite the woman being materialistic, cruel and unfaithful, he has no regrets of the time spent: &quot;Alone at last, I could've loved in vain for a thousand years, I have to let her go.&quot; The tongue-in-cheek title track, this time is a humorous role reversal, with Mick as the submissive half: &quot;she's the boss in the office, she's the boss in the kitchen, she's the boss in bed, she's the boss in my head.&quot; In a spoken bedroom banter later in the song, he says stuff like &quot;I got a headache,&quot; &quot;I gotta wash my hair&quot; and that old favourite, &quot;it's my time of the month.&quot; OK, Mick, I don't think we needed to know that. \n\n&quot;Lucky In Love,&quot; the other single, is a humorous tale of someone who doesn't come up trumps in gambling but when it comes to the ladies... Well, Mick is one with the ladies, to be sure. And the challenging rap at the end, with Mick betting and raising with the full house he's been set up with is amusing. I like this better than the first single, so why it managed a #38 showing is beyond me. Top Ten for sure! \n\nHardcore Stones fans may not take too kindly to this smoother pop/rock sound. The solid and consistent She's the Boss showed Mick could successfully break away and do his own thing without his bandmates. \n\nby Daniel J. Hamlow\n\nTRACKLIST:\n\n01 - Lonely At The Top.wma                                       \n02 - 1-2 A Loaf.wma                                              \n03 - Running Out Of Luck.wma                                     \n04 - Turn The Girl Loose.wma                                     \n05 - Hard Woman.wma                                              \n06 - Just Another Night.wma                                      \n07 - Lucky In Love.wma                                           \n08 - Secrets.wma                                                 \n09 - She's The Boss.wma \n\nWMA 320Kbps 44100Hz STEREO\n\nMARCELODRGZ\n\n ","torrent":{"xt":"urn:btih:ab9ee2e03e90b4b663e5c94cba580ccca2c0718a","amp;dn":"Mick+Jagger+-+She%5C%27s+The+Boss+%281985%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab9ee2e03e90b4b663e5c94cba580ccca2c0718a","infoHashBuffer":{"type":"Buffer","data":[171,158,226,224,62,144,180,182,99,229,201,76,186,88,12,204,162,192,113,138]},"announce":[],"urlList":[]}}