{"title":"Slumdog Millionaire (2008)(ENG)(NL SUBS) 2Lions-Team","uid":5080957,"size":4638314671,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ac2c27d2037fa1cdf5e9f418fcee9e2fc3b7f8eb&amp;dn=Slumdog+Millionaire+%282008%29%28ENG%29%28NL+SUBS%29+2Lions-Team&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JStotde106","files":-1,"time":1252284082,"description":"Slumdog Millionaire (2008) PAL       \n\n\n\nHet verhaal van Jamal Malik, een jong weeskind dat besluit deel te nemen aan de Hindi versie van het programma 'Who Wants to be a Millionaire'. Het hele land kijkt toe terwijl Jamal nog maar ÃƒÆ’Ã‚Â©ÃƒÆ’Ã‚Â©n vraag verwijderd is van de hoofdprijs. Tijdens de pauze van het programma gebeurt er echter iets waar Jamal niet op had gerekend; hij wordt gearresteerd, omdat de politie zeker weet dat hij de boel aan het oplichten is. Ze kunnen het niet geloven dat een straatjongen zoals hij zoveel kennis heeft. Vastberaden zijn onschuld te bewijzen vertelt Jamal verhalen over de krottenwijk waar hij samen met zijn broer opgroeide, de avonturen die ze beleefden, ontmoetingen met bende's en hij vertelt over zijn vroegere liefde. Elk hoofdstuk in zijn verhaal is een wonderbaarlijke sleutel naar het antwoord op elk van de vragen. Verwonderd over zijn verhalen vraagt de politie zich af wat een jongen als hij - zonder een schijnbaar verlangen naar rijkdom - op zo'n spelvertoning doet. Als de laatste vraag beantwoord moet worden krijgen ze, samen met ongeveer negentig miljoen kijkers antwoord op deze vraag...\n\nEnglish\n\nThe story of Jamal Malik, an 18 year-old orphan from the slums of Mumbai, who is about to experience the biggest day of his life. With the whole nation watching, he is just one question away from winning a staggering 20 million rupees on India's &quot;Kaun Banega Crorepati?&quot; (2000) (Who Wants To Be A Millionaire?) But when the show breaks for the night, police arrest him on suspicion of cheating; how could a street kid know so much? Desperate to prove his innocence, Jamal tells the story of his life in the slum where he and his brother grew up, of their adventures together on the road, of vicious encounters with local gangs, and of Latika, the girl he loved and lost. Each chapter of his story reveals the key to the answer to one of the game show's questions. Each chapter of Jamal's increasingly layered story reveals where he learned the answers to the show's seemingly impossible quizzes. But one question remains a mystery: what is this young man with no apparent desire for riches really doing on the game show? When the new day dawns and Jamal returns to answer the final question, the Inspector and sixty million viewers are about to find out. At the heart of its storytelling lies the question of how anyone comes to know the things they know about life and love\n\n\n\nFilmgegevens\n-------- Regie: Danny Boyle en Loveleen Tandan\n-------- Acteurs: Dev Patel, Freida Pinto en Anil Kapoor\n-------- Genre: Drama / Misdaad\n-------- Audio: Engels 5.1 Dolby digital\n-------- Subtitels: Originele Nederlandse ondertiteling!\n-------- Beeld: 16:9 PAL\n-------- Menu/Extra's: Menu aanwezig, Extra's afwezig\n-------- Speelduur: 120 minuten\n-------- Land: Verenigd Koninkrijk\n-------- IMDB Beoordeling: IMDb (8,5 / 135325) |\n\n\nBelangrijke info\n\n-------- Formaat: DVD5 (ISO FILE) \n-------- Versie: Rental versie\n\n\nProgramma's die zijn gebruikt\n-------- Dvddecrypter ( ISO FILE ) \n-------- Winrar\n-------- Quickpar\n\nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\n \nOndertitels : Nederlands (instelbaar)\n \nGenre : Drama\nMusical\n \nWeblink : http://www.moviemeter.nl/film/50507\nWeblijk : http://www.imdb.com/title/tt1010048 \t \n\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.  \n","torrent":{"xt":"urn:btih:ac2c27d2037fa1cdf5e9f418fcee9e2fc3b7f8eb","amp;dn":"Slumdog+Millionaire+%282008%29%28ENG%29%28NL+SUBS%29+2Lions-Team","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac2c27d2037fa1cdf5e9f418fcee9e2fc3b7f8eb","infoHashBuffer":{"type":"Buffer","data":[172,44,39,210,3,127,161,205,245,233,244,24,252,238,158,47,195,183,248,235]},"announce":[],"urlList":[]}}