{"title":"It's Only a Movie Alfred Hitchcock, A Personal Biography(pdf){Zz","uid":11499138,"size":2194681,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ac8191f70c9c27ab588c63569c5ff971be9514d7&amp;dn=It%27s+Only+a+Movie+Alfred+Hitchcock%2C+A+Personal+Biography%28pdf%29%7BZz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"zombie_rox","files":1,"time":1416319787,"description":"In his films, Alfred Hitchcock found the perfect expression for his fantasies, and he shared those fantasies with the world in such classics as &quot;The 39 Steps, The Lady Vanishes, Rebecca, Shadow of a Doubt, Notorious, Strangers on a Train, Rear Window, The Man Who Knew Too Much, To Catch a Thief, North by Northwest, Vertigo, Psycho,&quot; and &quot;The Birds.&quot; In &quot;It's Only a Movie,&quot; Charlotte Chandler draws from her extensive conversations with Hitchcock, frequently revealing unknown facts and unexpected insights into the man, the director, and his films. Author of acclaimed biographies of Groucho Marx, Federico Fellini, and Billy Wilder, Charlotte Chandler spent several years with Hitchcock discussing his life and his amazing career. She also talked with his wife, Alma, and daughter, Pat, as well as many of the screen legends who appeared in his films, including Cary Grant, Ingrid Bergman, James Stewart, Grace Kelly, Joan Fontaine, Laurence Olivier, Michael Redgrave, John Gielgud, Gregory Peck, Henry Fonda, Tippi Hedren, James Mason, Eva Marie Saint, Kim Novak, Anthony Perkins, Janet Leigh, and others. The result is an intimate yet expansive portrait of a unique artist who, from the 1920s through the 1970s, created many of history's most memorable films. A quarter-century after his death, Hitchcock's distinctive profile remains an instantly recognizable icon to millions, while his films continue to grow in popular appeal and critical esteem. Chandler introduces us to the real Hitchcock: a devoted family man, practical joker, and Englishman of Edwardian sensibilities who was one of the great masters of cinematic art.\n\nAbout the Author\nCharlotte Chandler is the author of several biographies of actors and directors, including Groucho Marx, Federico Fellini, Billy Wilder, Alfred Hitchcock, Bette Davis, Ingrid Bergman, Joan Crawford, and Mae West, all of whom she interviewed extensively. She is a member of the board of the Film Society of Lincoln Center and lives in New York City.\n\nPublisher: Simon &amp; Schuster; New title edition (22 February 2005)\nLanguage: English\nISBN-10: 0743245083\nISBN-13: 978-0743245081","torrent":{"xt":"urn:btih:ac8191f70c9c27ab588c63569c5ff971be9514d7","amp;dn":"It%27s+Only+a+Movie+Alfred+Hitchcock%2C+A+Personal+Biography%28pdf%29%7BZz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac8191f70c9c27ab588c63569c5ff971be9514d7","infoHashBuffer":{"type":"Buffer","data":[172,129,145,247,12,156,39,171,88,140,99,86,156,95,249,113,190,149,20,215]},"announce":[],"urlList":[]}}