{"title":"Allister McCleans E-Books(12 X )(Dutch)(TBS)","uid":5976712,"size":2933055,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:aceec17b43e7ec3017b51dcc094d002fb1c427c9&amp;dn=Allister+McCleans+E-Books%2812+X+%29%28Dutch%29%28TBS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mad_Parrot","files":-1,"time":1290464249,"description":"[IMG]http://i626.photobucket.com/albums/tt345/rocco64/Film%20poster/alistairmcclean.jpg[/IMG]\n\n12 Ebooks van Alistair MacLean. \n\nVeel plezier er mee.\n\n\n\n\n\n\nAlistair MacLean - Karavaan naar Vaccares       \n\n \nEen ogenschijnlijk onschuldig evenement als de jaarlijkse pelgrimage van zigeuners naar Zuid-Frankrijk lijkt een faÃƒÂ§ade waarachter sinistere geheimen schuilgaan.\n\nWaarom wekt de nieuwsgierigheid van de jongeNeil Bowman de woede van de zigeuners op, zozeer zelfs dat ze op alle mogelijke manieren proberen hem van het leven te beroven? \nEn is de hertog van Croytor werkelijk zo geÃƒÂ¯nteresseerd in folklore of heeft hij andere bedoelingen? Wie zijn de twee knappe vrouwen die zich aan Bowman en Croytor opdringen? \n\n\n********************************************************************************************************************\n\nAlistair MacLean - Ondergang om middernacht       \n\nDe Schotse eilanden zijn een paradijs voor watersportliefhebbers. Maar sinds kort verdwijnen hier op raadselachtige wijze regelmatig schepen, \nen steeds bestaat hun lading o.a. uit een grote hoeveelheid ongemunt goud.\n\nGeheim agent Calvert moet de zaak oplossen, maar al spoedig blijkt dat dit het moeilijkste karwei van zijn carriÃƒÂ¨re is. \nHij staat tegenover een bende doortrapte schurken, voor wie de vele miljoenen heel wat zwaarder wegen dan mensenlevens.\n\nBoven en onder de zeespiegel, en zelfs in de lucht, moet hij slag leveren om het komplot te ontwarren. \nAlleen vertrouwend op eigen vernuft slaagt hij er in een weergaloos spannende ontknoping in de bende te ontmaskeren. \n \n \n \n \n********************************************************************************************************************\n\nAlistair MacLean - De laatste grens       \n\nDe laatste grens speelt in het Hongarije van na de bloederige oktoberopstand van 1956. Michael Reynolds, agent van degeheime dienst, staat voor een schier onuitvoerbare opdracht. \nHij moet een Engelse geleerde die onder dwang naar Boedapest is gelokt, hoe dan ook terugbrengen. Daarbij ontvangt hij steun van een klein groepje Hongaarse patriotten.\n\nHard, bitter en zonder genade is de strijd tegen de meedogenloze AVO, de Hongaarse staatspolitie. \nNiet alleen ondergaat Michael Reynolds een gruwelijke hersenspoeling in de beruchte SarhÃƒÂ zagevangenis, \nmaar tevens leert hij de achtergronden kennen van het politieke gebeuren achter het IJzeren Gordijn en wordt hij met een werkelijkheid geconfronteerd die hij nimmer had vermoed. \n \n \n \n\n \n********************************************************************************************************************\n\n\n\nAlistair MacLean - De zwarte kruisvaarder       \n\nDe advertentie vroeg om raketspecialisten. Het project was in AustraliÃƒÂ«. Acht waren al gegaan... maar niet naar AustraliÃƒÂ«, spoorloos waren zij verdwenen. \nBentall, vermoeid en cynisch agent van kolonel Raine, moest beginnen aan zijn laatste opdracht. Acht mensen waren spoorloos verdwenen. En nu zou Bentall de negende zijn.\n\nDit is het begin van een weergaloze jacht op een Zuidzee-eiland waar John Bentall en de zeer aantrekkelijke Marie Hopeman verzeild raken in een merkwaardig groepje 'archeologen' en\nhun beulsknechten. Een groep die Bentall steeds een slag voor lijkt te zijn en werkt aan een ongelooflijk plan.\n\nAls De Zwarte Kruisvaarder ten tonele verschijnt bereiken de gebeurtenissen een van spanning zinderende climax waarin tot de laatste bladzijde onthulling op onthulling volgt. \n \n \n********************************************************************************************************************\n\n\nAlistair MacLean - Vliegtuig in vlammen       \n \n \nMr. Smith, het misdadige meesterbrein achter de vermetele bezetting van de Eiffeltoren, is ontsnapt en zint op wraak tegen de UNACO, de organisatie die hem in zijn plan heeft gedwarsboomd. \nZijn doelwit: een groep topministers van de OPEC. Zijn wapen: een dubbelganger van de geheim agent die hun vliegtuig moet bewaken.\n\nDe misdaadbestrijders van de UNACO komen bliksemsnel in actie. Daarnaast wordt Smith verrast door de hulp die een jonge Arabische prins de UNACO geeft.\n\nEen kat in het nauw maakt rare sprongen. Smith zet een bom voor de grot waarin de gijzelaars zijn opgesloten en gaat er met een fortuin aan diamanten vandoor. \nDe doodsbange gijzelaars horen de aftelklok tikken en denken dat hun laatste uur geslagen heeft. \n\n \n********************************************************************************************************************\n \n\n\nAlistair MacLean - Valse start       \n\nJohnny Harlow is de beste coureur ter wereld, heeft elf Grand Prix-overwinningen op zijn naam staan en is onverslaanbaar. Totdat hij begint te verliezen...\n\nHet overkomt de beste coureurs: op het toppunt van hun roem wordt de druk te groot en gebeuren er ongelukken. Maar ligt het in dit geval wel aan Harlow zelf? Of is het misschien sabotage? \nDan gebeuren er meer sinistere dingen op de circuits. Wagens blijken plotseling onbestuurbaar en er vallen doden. Of is het moord?\n\nCollega?s, vrienden en het publiek, iedereen keert zich tegen Harlow. En dus gaat hij zelf op onderzoek uit. \nHij stuit op een internationale bende die voor niets terugdeinst en een meedogenloos spoor trekt. \n\n \n \n \n********************************************************************************************************************\n\n\nAlistair MacLean - Hoog water       \n \n \nSchiphol, februari 1983. Een Fokker Friendship wordt op de startbaan opgeblazen; ÃƒÂ©ÃƒÂ©n dode. Een terroristisch commando eist de verantwoordelijkheid voor de aanslag op en het spoor leidt al gauw naar een sinister verbond van de Noordierse Fighters for Freedom, de Rote Armee Fraktion en een Italiaans commando.\n\nPeter van Effen, een Amsterdamse politie-inspecteur, wordt vanwege zijn bekendheid met de internationale terroristische beweging op de zaak gezet. Verrassend snel weet Van Effen te infiltreren in subversieve Amsterdamse kringen en wordt het hem duidelijk dat het gebeurde op Schiphol slechts een waarschuwing was.\n\nTopoverleg en ministeriÃƒÂ«le bemoeienissen ten spijt kan alleen Van Effen het tij keren. Dat hij daarbij zijn eigen leven in de waagschaal stelt valt in het niet bij de prijs die het Nederlandse volk zal moeten betalen: de vernietiging van de Delta-werken en het verlies van duizenden hectaren land. \n \n \n \n\n\n********************************************************************************************************************\n\n\n\nAlistair MacLean - Schipbreuk       \n\nEen zwaarbeladen schoener vergaat even ten noorden van New York in een noodweer dat over de Atlantische Oceaan raast. H\net stuurloze schip wordt tegen de rotsen gesmeten en breekt in tweeÃƒÂ«n. De volgende dag vinden spelende kinderen een deel van de aangespoelde lading: een kist splinternieuwe Armalite-geweren...\n\nVolgens het logboek was het schip op weg van New York naar Dublin. Was het wapentuig bestemd voor het Noord-Ierse verzet?\n\nUNACO-agenten Mike Graham en Sabrina Carver moeten uitzoeken wie de geweren heeft geleverd en voor wie ze bestemd waren. \nHet onderzoek voert hen van New York naar Londen tot in Zwitserland en Ierland, waar zij de strijd aanbinden met wapen- en drugsmokkelaars en verstrikt raken in een internationaal komplot? \n \n \n \n********************************************************************************************************************\n\n\n\nAlistair MacLean - Booreiland X-13       \n \n \nBoven de Caribische Zee vliegt een vliegtuig met bestemming Verenigde Staten. Aan boord bevindt zich 10 miljoen dollar aan goud en edelstenen. \nEigenaar van het toestel is John Talbot. Talbots broer en compagnon zit aan de stuurknuppel, zijn vrouw en zoontje zijn de enige passagiers.\n\nEen geslaagde opdracht lijkt bijna ten einde... totdat uit de wolken een jachtvliegtuig neerduikt dat het toestel aan stukken schiet. \nIn ÃƒÂ©ÃƒÂ©n klap is Talbot niet alleen de kostbare vracht, maar ook zijn complete familie kwijt. Talbot zweert de misdaad te zullen wreken.\n\nOp het booreiland X-13 van een schatrijke oliemagnaat leiden schokkende gebeurtenissen tot een onverwachte ontknoping.  \n \n \n\n********************************************************************************************************************\n\n\n\nAlistair MacLean - Poolbasis Zebra       \n\n \nEr worden noodsignalen opgevangen van Poolbasis Zebra, een Engels weerstation op de Noordpool. \nDe Amerikaanse marine zet de atoomonderzeeÃƒÂ«r Dolfijn in om hulp te bieden, maar is dit wel een gewone reddingsoperatie? Wat is er werkelijk aan de hand met de eenzame Poolbasis Zebra?\n\nAls de Dolfijn de basis eenmaal heeft bereikt, volgen de gebeurtenissen elkaar in snel tempo op en wordt de lezer meegesleurd in een draaikolk van gruwelijke en raadselachtige verwikkelingen.... \n\n \n \n \n********************************************************************************************************************\n\n\n\nAlistair MacLean - Toren gegijzeld       \n  \n \nParijs. Iedereen die ook maar ÃƒÂ­ÃƒÂ©ts voorstelt in de internationale criminaliteit is in Parijs bijeen. \nAls de moeder van de president van de Verenigde Staten, op bezoek in de lichtstad, het restaurant van de Eiffeltoren betreedt, komen de gangsters tevoorschijn en wordt de oude dame gegijzeld...\n\nDe Eiffeltoren wordt door gewapende mannen bezet en met een gloednieuw laserwapen voor de politie en het leger onneembaar gemaakt. \nHet geÃƒÂ«iste losgeld, 30 miljoen dollar, is al onderweg.\n\nMaar dan komt Malcolm Philpott van de antimisdaadbrigade van de Verenigde Naties in actie... \n \n \n \n\n\n \n********************************************************************************************************************\n\n\n\nAlistair MacLeans - Bloedkoraal       \n \n \nTrent - voormalig employÃƒÂ© van demilitaire inlichtingendienst, schipper van de catamaran de Golden Girl - werkt nu op de Bahama's voor een firma die is gespecialiseerd in het opsporen van verzekeringsfraude.\n\nWanneer er in het koraal van een rif een jongen wordt aangetroffen die niet alleen verdronken blijkt te zijn, maar ook nog ernstig mishandeld, roept het hoofd van de plaatselijke politie Trents hulp in. \nTrent, ervaren in het uitzoeken van hachelijke en gevaarlijke zaken, belooft de moord op de jonge Vic uit te zoeken. \nNa enig speurwerk komt Trent tot de ontdekking dat er een vergissing in het spel is geweest: niet Vic, maar een ander had het doelwit van de moordenaar moeten zijn.\n\nGaande het onderzoek wordt Trent geconfronteerd met een verdwenen lading cocaÃƒÂ¯ne, een neergestort vliegtuigje, een zoekgeraakt koffertje en een grimmige delegatie uit Colombia...\n\n \n \n \n\n\n\n\n","torrent":{"xt":"urn:btih:aceec17b43e7ec3017b51dcc094d002fb1c427c9","amp;dn":"Allister+McCleans+E-Books%2812+X+%29%28Dutch%29%28TBS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aceec17b43e7ec3017b51dcc094d002fb1c427c9","infoHashBuffer":{"type":"Buffer","data":[172,238,193,123,67,231,236,48,23,181,29,204,9,77,0,47,177,196,39,201]},"announce":[],"urlList":[]}}