{"title":"Blackberry Pie Murder by Joanne Fluke","uid":9630603,"size":638926,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad122548375a9b84df03c7c6d60b6a16c0dfa5f5&amp;dn=Blackberry+Pie+Murder+by+Joanne+Fluke&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":1,"time":1392781538,"description":"\nNote: This is an uncorrected Advanced Reader's Copy.\nIt's been a sleepy summer for the folks of Lake Eden, Minnesota. In fact, it's been a whole four months since anyone in the Swensen family has come across a dead body--a detail that just made the front page of the local paper. And that means Hannah Swensen can finally focus on her bakery. . .or can she?\n\nLife is never really quiet for Hannah. After all, her mother's wedding is a little over a month away and guess who Delores put in charge of the planning? Yet just when Hannah believes her biggest challenge will be whether to use buttercream or fondant for the wedding cake, she accidentally hits a stranger with her cookie truck while driving down a winding country road in a raging thunderstorm. Hannah is wracked with guilt, and things get even worse when she's arrested. . .for murder! \n\nBut an autopsy soon reveals the mystery man, his shirt covered in stains from blackberry pie, would have died even if Hannah hadn't hit him. Now, to clear her name, Hannah will have to follow a trail of pie crumbs to track down the identity of the deceased, find a baker who knows more about murder than how to roll out a perfect pie crust--and get herself to the church on time. . .\n\nGenre: Mystery","torrent":{"xt":"urn:btih:ad122548375a9b84df03c7c6d60b6a16c0dfa5f5","amp;dn":"Blackberry+Pie+Murder+by+Joanne+Fluke","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad122548375a9b84df03c7c6d60b6a16c0dfa5f5","infoHashBuffer":{"type":"Buffer","data":[173,18,37,72,55,90,155,132,223,3,199,198,214,11,106,22,192,223,165,245]},"announce":[],"urlList":[]}}