{"title":"Travis - Where You Stand (2013) [FLAC]","uid":8819299,"size":320708254,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad1d326c66b5094465fc9cd16f805e657a80c519&amp;dn=Travis+-+Where+You+Stand+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1376661185,"description":"\n  Travis - Where You Stand (2013) (Deluxe) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Indie Rock, Britpop, Alternative\n  Source: CD (log + cue)\n  Codec: FLAC\n  Bit Rate: ~ 800 kbps\n  Bit Depth: 16\n  Sampling Rate: 44,100 Hz\n\n  01 Mother\n  02 Moving\n  03 Reminder\n  04 Where You Stand\n  05 Warning Sign\n  06 Another Guy\n  07 A Different Room\n  08 New Shoes\n  09 On My Wall\n  10 Boxes\n  11 The Big Screen\n\n  Bonus:\n\n  12 Anniversary\n  13 Parallel Lines\n\n  Along with Cast, Ocean Colour Scene, Kula Shaker, and Embrace, Travis were one of the most prominent British trad rock bands in the mid- to late '90s. Following Oasis' lead of crafting down-to-earth, heartfelt songs in the vein of classic British bands from the '60s, Travis were more successful and enduring than some of their peers due to their lively, impassioned songwriting and performances. The group formed in Glasgow around 1990 as something of a lark for its members, singer/songwriter Francis Healy, guitarist Andy Dunlop, drummer Neil Primrose, and bassist Dougie Payne. After finishing their studies at art school a few years later, the foursome became more serious about Travis' potential and moved to London in 1996. Their self-released debut EP, All I Wanna Do Is Rock, came out in the fall of that year; with its earnest vocals and soaring guitars, it captured the spirit of British rock at the time, which was retreating from some of Brit-pop's artiness to a back-to-basics sound. Their second single, 1997's &quot;U16 Girls,&quot; was released by Independiente Records, the new label headed by former Go! Discs director Andy MacDonald; a few months later, their critically acclaimed full-length debut, Good Feeling, arrived. Recorded in a matter of days with top producer Steve Lillywhite, the album included hit singles like &quot;Happy&quot; and &quot;Tied to the '90s&quot; and immediately entered the Top Ten of the U.K. charts.\n\n  The following year, Travis began sessions with star producer Nigel Godrich for the follow-up to Good Feeling, recording in six studios in as many months. Though it was a slower, darker affair, when The Man Who appeared in 1999 it eclipsed Travis' previous successes, going platinum six times in the U.K. and spawning more hit singles such as &quot;Why Does It Always Rain on Me?&quot; and &quot;Writing to Reach You.&quot; Nominated Select Magazine's Album of the Year (and finishing in the Top Ten of many other publication's year-end lists), The Man Who appeared on U.S. shores in early 2000, just in time for a tour with their musical big brothers, Oasis. Debuting at the number one spot on the U.K. album chart, The Invisible Band was issued in June 2001 just prior to stateside summer gigs with Dido. Two years later, the band issued 12 Memories, which was followed in late 2004 with the singles collection Singles. Travis finally returned with an album of all-new material in the spring of 2007 entitled The Boy with No Name, whose arrival was announced by the release of the single &quot;Closer.&quot; Travis opted for an edgier sound on Ode to J. Smith, which was released in early fall 2008 in the U.K. and later in the season in the U.S. Their seventh studio album, Where You Stand, was scheduled for release in the summer of 2013, five years after Ode to J. Smith. The record was previewed with &quot;Another Guy,&quot; which displayed a lo-fi, angular side to Travis.","torrent":{"xt":"urn:btih:ad1d326c66b5094465fc9cd16f805e657a80c519","amp;dn":"Travis+-+Where+You+Stand+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad1d326c66b5094465fc9cd16f805e657a80c519","infoHashBuffer":{"type":"Buffer","data":[173,29,50,108,102,181,9,68,101,252,156,209,111,128,94,101,122,128,197,25]},"announce":[],"urlList":[]}}