{"title":"Quick-Fix Vegan.....Robin Robertson.epub","uid":11531884,"size":8180971,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ad87ff3879f1c1fb9a66bfe06fcc1db4fa00c47e&amp;dn=Quick-Fix+Vegan.....Robin+Robertson.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eternalpb","files":-1,"time":1416580044,"description":"ISBN: 1449407854 | \n2011 | \nEPUB | \n224 pages | \n7 MB\n\n150 quick and easy vegan recipes all made in 30 minutes or less from a well-loved, best-selling author in the vegan community.\n&quot;Robertson cuts to the chase and puts together good food simply. If you were thinking of slapping together a sandwich, you may as well make one of hers, full of vibrant veggies and flavors, instead of the same old pb and j. It doesn't really take much more time... &quot;It was a real pleasure making dishes from the book. Like everyone else, I don't have a ton of time, so quick is always good. Reading and cooking from Robertson's recipes, I admire the way her mind works. As a fellow recipe developer, I can appreciate a well-crafted recipe. These recipes are simplified, but still interesting, and follow the shortest path from point A to point B. Simple looks easy, but it takes skill to make it that way. I also appreciate the use of whole foods, like beans, nuts and seeds, and the near absence of mock meats. Just because you are in a hurry doesn't mean you have to go in for vegan bologna or burgers every night, in Robertson's kitchen.&quot;\n\n\nAn experienced chef and consultant, Robin Robertson is a 25-year veteran restaurant chef, caterer, columnist, cooking teacher, food writer, and author of 19 vegan and cookbooks. She writes &quot;The Global Vegan&quot; column for VegNews Magazine and was a contributing editor and columnist for Vegetarian Times. She has also written for Cooking Light, Natural Health, Better Nutrition, Health, Restaurant Business, and other magazines. She lives in Virginia's Shenandoah Valley","torrent":{"xt":"urn:btih:ad87ff3879f1c1fb9a66bfe06fcc1db4fa00c47e","amp;dn":"Quick-Fix+Vegan.....Robin+Robertson.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad87ff3879f1c1fb9a66bfe06fcc1db4fa00c47e","infoHashBuffer":{"type":"Buffer","data":[173,135,255,56,121,241,193,251,154,102,191,224,111,204,29,180,250,0,196,126]},"announce":[],"urlList":[]}}