{"title":"Eastern Magic, Sorcery Techniques","uid":11780449,"size":398738131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae0690fe460b0061bf89789b72a82ec5254823ee&amp;dn=Eastern+Magic%2C+Sorcery+Techniques&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Shinigamizzz","files":13,"time":1427554521,"description":"Here is a small, private collection, containing books on asian magic techniques, as the title, Ma-jutsu, literally translates to and suggests. From ancient Tao philosophy to the Book of Changes (and of the hexagrams, the I Ching), up to Tao te Ching and Zhuangzhi, till a book on detailed taoist sorcery, here you will find a lot of philosophy, wisdom, poems and symbolism, enough to get you inspired and awed for quite some time. The only one i couldn't find in English, is the Dhaozhang, or the great canon of Tao and the Bencao Gangmu, the great treatise of Li Shizen on Traditional Chinese Medicine.\n\nAlso included herein are the Techniques of the Nine Cuts (kuji in), the cutting grid (kuji kiri) and a short book on majutsu techniques and simple talisman making. Those are said to had been utilized by samurai and ninja of old, as well as priests and monks of: Tendai Buddhism, Shingon Mikkyo and Shugendo (mountain asceticism).\n\nUnlike the western magic systems, here things are more practical, intellectual, internal and spiritual, rather than external and physical. Rituals and materials are cheap and easy to find and perform, symbols are easy to use and most of them do not even need to be physical (example the Zai syllable formed with hands VS a physically represented triangle) and the goals are not harmful on either you or others. Your purpose is to know yourself first and foremost and others and proceed to control it and then handle, not negatively affect, others. Also, alchemy here has two branches, the outside one which is mostly associated with medicine and not gold-making-out-of-garbage wank and the internal one, which involves manipulating life force (chi) through various techniques (chi-kung/nei-kung), in order to process it, change it into other types of energy (jin or shen), in order to get stronger, change the way you feel, control your emotions, attract events/trials to solve karmic circles of the past and a plethora of other beneficial acts.\n\nYou need time and patience in order to get into it, besides simply reading, if you are interested in such a thing. Progress is slow and borderline noticeable. People without patience or strong integrity of character, discipline and self-control will not feel anything, however hard they try to meditate or visualize things. Those techniques are real and they work (kuji in/kuji kiri). Although not in a supernatural sense and extent.\n\nI personally mixed paradigms, because i am unfamiliar with kanji, for the kuji kiri cutting grid, with futhark runes. Strangely enough, those different systems mix very well, runes have also the concept of visualization, vocalization, hidden meaning, strong effect and hand/body stance (mudra). But i won't contain books about runes here, maybe in another torrent. Plus runes are associated with nazis, barbarians (goths) and both as symbols of a magic system and as an extinct alphabet, they are heavily hated by many people","torrent":{"xt":"urn:btih:ae0690fe460b0061bf89789b72a82ec5254823ee","amp;dn":"Eastern+Magic%2C+Sorcery+Techniques","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae0690fe460b0061bf89789b72a82ec5254823ee","infoHashBuffer":{"type":"Buffer","data":[174,6,144,254,70,11,0,97,191,137,120,155,114,168,46,197,37,72,35,238]},"announce":[],"urlList":[]}}