{"title":"Imperium - Keith Laumer.epub","uid":9089142,"size":494655,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae0cd97b1a4e8594f0e2869347985e6882e80a30&amp;dn=Imperium+-+Keith+Laumer.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1382556203,"description":"Three complete novels of cross-time action and suspense by Keith Laumer, grand master of science fiction adventure. Brion Bayard was an American diplomat . . . until he was kidnapped on the streets of Stockholm, and thrust into what he thought was a truck. At first, he was relieved to find that his abductors were very apologetic, and very British. Then they began speaking about nations and leaders which Bayard had never heard of. That was understandable, they told him, because they were from Earth, but not his Earth. There are millions or more parallel Earths, each different in some slight way from the other, where history has taken every possible turn, where the heirs of Napoleon rule Europe, where King John tore the Magna Carta to shreds and executed those who had presented him with it, even one where the ancestors of Homo sapiens lost the evolutionary struggle to another upright ape, who became the dominant intelligent lifeform. But mostly there are uninhabitable worlds, destroyed by the discovery of the technology to travel from one parallel Earth to another and the misuse of it. The Earth of the Imperium is at war with another parallel Earth and Bayard can stop the war by killing the ruler of the aggressor Earth and replacing him-because the ruler is a parallel version of Bayard. But when Bayard goes on his mission to the alternate Earth, things don't turn out to be quite that simple. And that was only the beginning of Bayard's adventures as he defends his new homeworld, both from internal enemies and invaders from the other side of time, becoming the staunchest and most resourceful defender of the Imperium Publisher's Note: Imperium has previously appeared in parts as Worlds ofthe Imperium, Assignment in Nowhere and The Other Side of Time. This is the first unitary edition.","torrent":{"xt":"urn:btih:ae0cd97b1a4e8594f0e2869347985e6882e80a30","amp;dn":"Imperium+-+Keith+Laumer.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae0cd97b1a4e8594f0e2869347985e6882e80a30","infoHashBuffer":{"type":"Buffer","data":[174,12,217,123,26,78,133,148,240,226,134,147,71,152,94,104,130,232,10,48]},"announce":[],"urlList":[]}}