{"title":"Noah (2014) - English HD Bluray Rip X264 - AC3 Audio","uid":10692734,"size":4201877457,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ae2597cf47ee05841eae5151e5ad3df275b9766f&amp;dn=Noah+%282014%29+-+English+HD+Bluray+Rip+X264+-+AC3+Audio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KidAtomic","files":-1,"time":1407140514,"description":"Noah (2014) English HD Bluray Rip X264 - AC3 Audio\n\nA man is chosen by his world's creator to undertake a momentous mission before an apocalyptic flood cleanses the world.\n\nCast: Russell Crowe, Jennifer Connelly, Douglas Booth, Logan Lerman, Emma Watson, Ray Winstone, Anthony Hopkins, Marton Csokas, Dakota Goyo, Barry Sloane\n\n\n********SPOILER ALERT********\n\nAs a young boy, Noah (Russell Crowe) witnesses his father, Lamech (Marton Csokas), killed by Tubal-cain (Ray Winstone). Many years later, Noah is living with his wife Naameh (Jennifer Connelly) and their sons Shem (Douglas Booth), Ham (Logan Lerman), and Japheth (Leo McHugh Carroll), but after seeing a flower grow instantly from the ground and haunted by vivid dreams of a great flood, Noah takes them to visit his grandfather, Methuselah (Anthony Hopkins).\n\nOn the way, they come upon a group of people recently killed, and adopt the lone survivor, a girl named Ila (Emma Watson). Noah and his family are chased by Tubal-Cain's men, but seek refuge with the fallen angels known as the 'Watchers', confined on Earth as stone golems (nephilim) for helping humans banished from the Garden of Eden. Methuselah gives Noah a seed derived from Eden and tells Noah that he was chosen for a reason. Returning to his tent that night, Noah plants the seed into the ground. The Watchers arrive the next morning and angrily discuss how they shouldn't help Noah until they see water spouting up from spot that Noah planted the seed. An entire forest grows quickly and the Watchers state that they will help Noah do the Creator's bidding. These trees are cut by the Watchers to build Noah's Ark with the help of Noah's family.\n\nAfter the arrival of birds to the Ark, Tubal-Cain arrives with his followers and confronts Noah about his purpose for building the Ark. Noah defies Tubal-Cain and remarks that there is no escape for the line of Cain. Tubal-Cain retreats and decides to build weapons to defeat the Watchers when the rain starts and the Ark must be taken. As the Ark nears completion, animals of various species enter the ark and are put to sleep by incense.\n\nWith Ila having become enamored of Shem, Noah goes to a nearby settlement to find wives for Ham and Japheth, but upon witnessing cannibalism by a starving mob, he abandons his effort. Thereafter Methuselah cures Ila of sterility. Ham, searching for a wife on his own behalf, acquires the refugee Na'el (Madison Davenport).\n\nThe rain starts falling and Tubal-Cain becomes angry that he wasn't chosen to be rescued. The followers of Tubal-Cain make a run for the Ark. In the meantime, Noah finds Ham in the forest and forces Ham to save himself and leave Na'el to die when she is caught in a metal trap set for an animal. All of Noah's family enter the Ark except Methuselah, who remains behind purposely in the forest awaiting the flood to deliver him from the Earth. As the deluge begins, the Watchers hold off Tubal-Cain and his followers as long as possible but in the end, sacrifice themselves to protect the Ark from the mob. Upon doing so, they ascend to Heaven after leaving their mortal stone form. As the flood drowns the remaining humans, an injured Tubal-Cain climbs onto the Ark and solicits Ham, playing on anger toward Noah for allowing Na'el to die. Ila becomes pregnant as rains stop, but Noah, against his wife's dissuasions, resolves that if the child is a girl, he will kill her to satisfy the Creator's wish to destroy humanity.\n\nMonths pass, and Ila and Shem build a small raft to escape Noah's resolve, but Noah burns it after discovering it. Afterwards, Ila gives birth to twin girls. Meanwhile, Tubal-Cain convinces Ham to help kill Noah, who is therefore attacked by Tubal-Cain, Ham, and Shem. As they fight, the Ark hits a mountain, and Ham kills Tubal-Cain. Noah seizes Ila's twins, but he spares them upon perceiving innocence. Upon exiting the ark, Noah goes into isolation in a nearby cave and starts to drink wine. His sons discover him, without clothes and in a drunken stupor. Afterwards, having reconciled, at the behest of Ila, with all but Ham (who departs alone), Noah blesses the family as the beginning of a new human race, and all witness an immense rainbow.","torrent":{"xt":"urn:btih:ae2597cf47ee05841eae5151e5ad3df275b9766f","amp;dn":"Noah+%282014%29+-+English+HD+Bluray+Rip+X264+-+AC3+Audio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae2597cf47ee05841eae5151e5ad3df275b9766f","infoHashBuffer":{"type":"Buffer","data":[174,37,151,207,71,238,5,132,30,174,81,81,229,173,61,242,117,185,118,111]},"announce":[],"urlList":[]}}