{"title":"Packtpub - WordPress 3.7 Complete (3rd Edition) - 2013","uid":11270803,"size":36737782,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ae9457aaf3f2deebc643662b4be5bc7a3dfd9bb3&amp;dn=Packtpub+-+WordPress+3.7+Complete+%283rd+Edition%29+-+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"diypromo","files":-1,"time":1414080301,"description":"WordPress 3.7 Complete, 3rd edition\n====================================\n\nYear: 2013\nAuthors: Karol Krol, Aaron Hodge Silver\nPublisher: Packt Publishing\nISBN: 978-1-78216-240-7\nFile formats: PDF, EPUB\n\nDescription\n============\n\n\tWordPress 3.7 Complete Third Edition will take you through the complete process of building a fully functional WordPress site from scratch. The journey goes all the way from teaching you how to install WordPress, to the most advanced topics such as creating your own themes, writing plugins, and even building non-blog websites. The best part is that you can do all this without losing your shirt along the way. Moreover, once you get some practice, you will be able to launch new WordPress sites within minutes (not a metaphor, by the way; this is as true as it gets). This book guides you along the way in a step-by-step manner to explain everything there is to know about WordPress. We'll start with downloading and installing the core of WordPress, where you will learn how to choose the correct settings in order to guarantee a smooth experience for yourself and for your visitors. After that, the book will teach you all about content management functionality for your site from posts and pages to categories and tags, all the way to links, media, menus, images, galleries, administration, user profiles, and more. Next, you will find out what plugins and themes are and how to use them effectively. Finally, you'll learn how to create your own themes and plugins to enhance the overall functionality of your website. Once you're done with reading WordPress 3.7 Complete Third Edition, you will have all the knowledge required to build a professional WordPress site from scratch","torrent":{"xt":"urn:btih:ae9457aaf3f2deebc643662b4be5bc7a3dfd9bb3","amp;dn":"Packtpub+-+WordPress+3.7+Complete+%283rd+Edition%29+-+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae9457aaf3f2deebc643662b4be5bc7a3dfd9bb3","infoHashBuffer":{"type":"Buffer","data":[174,148,87,170,243,242,222,235,198,67,102,43,75,229,188,122,61,253,155,179]},"announce":[],"urlList":[]}}