{"title":"Angry Birds Go! v2.1.6 (Mega Mod) APK + OBB [SadeemPC]","uid":15506804,"size":127751788,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:afbe38dc9caf3ccc5cdb32049cbe0681143692bc&amp;dn=Angry+Birds+Go%21+v2.1.6+%28Mega+Mod%29+APK+%2B+OBB+%5BSadeemPC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SadeemPC","files":1,"time":1470598662,"description":"Angry Birds Go! v2.1.6 (Mega Mod)\r\nRequirements: Android 2.3.3+\r\n\r\nWelcome to downhill racing on Piggy Island! Feel the rush as you fling those freewheeling birds and piggies down the track at breakneck speed – with plenty of twists and turns in a thrilling race to the finish line!\t\r\n\r\nDescription\r\nBut beware! Look out for hazardous roads, mischievous opponents riding your tail and special powers to put the race leader behind the pack. Plus, go from soapbox car to supercar by upgrading your ride! Ready…Set…Angry Birds Go!\r\n\r\n- FIRST-EVER 3D ANGRY BIRDS WORLD! See the birds and pigs from every angle as Piggy Island comes alive in this rich and colorful 3D world!\r\n- RACE AS THE BIRDS OR PIGS! Choose from furious fowl or mischievous pigs – Red, Chuck, Stella, King Pig, Moustache Pig and many more!\r\n- MASTER THE TRACKS! Plenty of racetracks, stunt roads, air courses and off-road races – each throwing big and unexpected challenges your way!\r\n- AWESOME SPECIAL POWERS! Smash your opponents off the road and take that winning position thanks to unique special powers for each character!\r\n- MANY GAME MODES! Test your skills with super-fun and surprising game modes: Race, Time Boom, Fruit Splat, Champion Chase and Versus Mode!\r\n- UPGRADE YOUR RIDE! Have a need for speed? Go from a homemade soapbox car to a super-fly supercar, with tons of karts and awesome ways to upgrade – yours to earn or purchase!\r\n- TEAM MULTIPLAYER! Play with friends in teams of five, and compete against other teams in 3-on-3 races!\r\n- MUCH MORE TO COME! The race has only just begun – so look out for many more fun things coming your way!\r\n- TELEPODS! A groundbreaking new way to play! Now teleport your favorite characters into the race by placing your Angry Birds Go! TELEPODS* figures on your device’s camera!\r\n- ToonsTV READY TO GO! The home of the hugely popular Angry Birds Toons animated series, plus many other top-quality videos!\r\n\r\n*Availability varies by country. Angry Birds Go! Telepods sold separately and are compatible with select mobile devices. See the full list of supported devices from Hasbro: http://www.hasbro.com/angrybirds/ \r\n\r\nThis application may require internet connectivity and subsequent data transfer charges may apply. After the initial download, additional content will be downloaded and this may lead to further data transfer charges. This game includes paid commercial content from select partners. Important Message for Parents.\r\n\r\nThis game may include:\r\n- Direct links to social networking websites that are intended for an audience over the age of 13.\r\n- Direct links to the internet that can take players away from the game with the potential to browse any web page.\r\n- Advertising of Rovio products and also products from select partners.\r\n- The option to make in-app purchases. The bill payer should always be consulted beforehand.\r\n\r\nWhat's new:\r\nWe’ve listened to your feedback, and after a quick pit stop, we're happy to introduce Angry Birds GO 2.0!\r\n- IMPROVED CAMPAIGN MODE! The campaign gets a total overhaul.\r\n- NEW UPGRADE SYSTEM! Collect parts and upgrade your karts.\r\n- LIMITED-TIME TOURNAMENTS! Compete to win prizes!\r\n- DAILY RACES! Enter a new race every day and find a hidden gift box.\r\n- NEW HANDLING SYSTEM! We’ve tuned every kart for better handling.\r\n\r\nHomepage \nhttps://play.google.com/store/apps/details?id=com.rovio.angrybirdsgo\r\n\r\nOBB: copy to SDCradAndroidobb.\r\n\r\nMod by symos:\r\n- Unlimited Gems (increase instead of decrease)\r\n- Unlimited Coins (increase instead of decrease)\r\n- Unlocked/Owned All Karts\r\n- Ad-Free","torrent":{"xt":"urn:btih:afbe38dc9caf3ccc5cdb32049cbe0681143692bc","amp;dn":"Angry+Birds+Go%21+v2.1.6+%28Mega+Mod%29+APK+%2B+OBB+%5BSadeemPC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afbe38dc9caf3ccc5cdb32049cbe0681143692bc","infoHashBuffer":{"type":"Buffer","data":[175,190,56,220,156,175,60,204,92,219,50,4,156,190,6,129,20,54,146,188]},"announce":[],"urlList":[]}}