{"title":"[Ebook-Ita-Pdf-Avventura]Marco Buticchi - Profezia[survivalofmis","uid":5135720,"size":1086915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b00a3df9ca495d36ef1662e15e528496dd45b8d8&amp;dn=%5BEbook-Ita-Pdf-Avventura%5DMarco+Buticchi+-+Profezia%5Bsurvivalofmis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mitimex","files":1,"time":1256467680,"description":"\n\n13 ottobre 1307. In Francia, un feroce rastrellamento conduce in carcere, alla tortura e al rogo migliaia di uomini: sono i Templari, una casta di potentissimi monaci guerrieri. Quello stesso giorno, diciassette navi templari lasciano il porto di La Rochelle, sulla costa atlantica francese, e di esse non si saprÃƒÂ  piÃƒÂ¹ nulla. Di quali segreti erano a conoscenza i Cavalieri del Tempio? Da dove avevano tratto la loro immensa ricchezza? 16 luglio 1918. A Ekaterinburg, in Russia, mentre le fiamme della rivoluzione bolscevica dilaniano il Paese, lo zar Nicola II, la zarina Alessandra, i loro cinque figli e altre persone del seguito vengono trucidati. Ma davvero la famiglia imperiale se n'ÃƒÂ¨ andata senza lasciare nulla? 13 maggio 1981. In piazza San Pietro, papa Giovanni Paolo II viene gravemente ferito da due colpi di pistola sparati da un terrorista turco il cui ruolo non ÃƒÂ¨ mai stato del tutto chiarito.\nQuale oscuro legame unisce questi eventi storici, cosÃƒÂ¬ diversi e lontani nel tempo? Estate 1999. La Queen of Atlantis, la piÃƒÂ¹ grande nave da crociera esistente, parte per un viaggio che la condurrÃƒÂ  nei porti piÃƒÂ¹ celebri del mondo. A Venezia vi si imbarcano quattro amici americani; a essi si aggiungono Gerardo di Valnure, uno studioso di storia medievale che vanta illustri antenati fra i Templari, e Josif Drostin, il piÃƒÂ¹ potente mercante d'armi russo. Quali segreti nasconde la nave? Per dare una risposta a questa inquietante domanda interviene Oswald Breil, giÃƒÂ  capo del Mossad e ora vice ministro della Difesa israeliano, con l'aiuto della geniale scienziata Sara Terracini.\nMa persino il potente Servizio di Tel Aviv ignora l'esistenza di una setta occulta i cui membri sono disposti all'estremo sacrificio pur di non tradire la loro causa: ricostruire un mondo nuovo sulle ceneri di quello che intendono distruggere. Proprio come avevano giurato di fare i Templari sopravvissuti al massacro... \n","torrent":{"xt":"urn:btih:b00a3df9ca495d36ef1662e15e528496dd45b8d8","amp;dn":"%5BEbook-Ita-Pdf-Avventura%5DMarco+Buticchi+-+Profezia%5Bsurvivalofmis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b00a3df9ca495d36ef1662e15e528496dd45b8d8","infoHashBuffer":{"type":"Buffer","data":[176,10,61,249,202,73,93,54,239,22,98,225,94,82,132,150,221,69,184,216]},"announce":[],"urlList":[]}}