{"title":"Ice Road Truckers.Season 8.720p.x264","uid":11538047,"size":14772134401,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b0314963bb9feeb4ffd936ddfd53a59e79d53c14&amp;dn=Ice+Road+Truckers.Season+8.720p.x264&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":null,"files":12,"time":1416640308,"description":"Ice Road Truckers, Season 8, 720p, x264, English\n\nS08E01 The Gathering Storm\n  As the season opens, the race begins for VP Express and Polar Industries.\n  This year both companies face a much bigger adversary, the Polar Vortex,\n  bringing with it the worst winter conditions in a century. With the storm\n  only days away, it's a race for loads. Lisa Kelly and Darrell Ward return\n  to lead team Polar to victory, while Art Burke and Todd Dewey both set out\n  to prove to the boss that they can deliver with the best of them. Meanwhile,\n  at VP Express, seasoned pros and former rivals Alex Debogorski and Hugh\n  Rowland join forces and head out into the frozen frontier.\n\nS08E02 Rushin' Roulette\n  It's a race against Mother Nature as the ice road truckers rush to get\n  critical loads delivered while the storm of the century approaches. Lisa\n  and Art face a deadly shutdown on the ice, while a feud between Darrell\n  and Todd threatens to rip team Polar apart. And a heavy pad on thin ice\n  has Alex searching for divine assistance.\n\nS08E03 Into the Vortex\n  A brutal storm descends on the winter roads, and frozen hell comes with it.\n  Blinding winds, driving snow, and bone-chilling cold assault the ice road\n  truckers as they fight their way through the storm of the century to deliver\n  their critical cargo. But even the toughest truckers on the planet are no\n  match for Mother Nature, and losing this battle might cost them their lives.\n\nS08E04 Snow Bound\n  A monster storm brings record breaking snowfall onto the winter roads. Polar\n  drivers Darrell and Todd try to muscle through, while the rest of the team\n  fights to survive, stranded in the wild with no help in sight and no hope\n  on the horizon. Meanwhile, despite frigid temperatures the war between VP\n  Express and Polar reaches a boiling point.\n\nS08E05 The Storm Troopers\n  The battle royal with Mother Nature continues as the Ice Road Truckers fight\n  through the storm of the century. Art, Todd, and Lisa press their luck on ice\n  that is buckling under the weight of heavy snow. As conditions deteriorate,\n  Alex is left running on fumes and in desperate need of a lifeline. Darrell\n  goes toe-to-toe with his boss in a fight that'll be a game changer on the\n  winter roads.\n\nS08E06 The Lone Wolf\n  A defection in the ranks takes the battle for the winter roads to a whole\n  new level. Hugh hatches a plan for VP Express to crush the competition,\n  hauling the most lucrative load to date across treacherous terrain. The\n  pressure is on Todd and Lisa to up their game and push further out into\n  the frozen frontier.\n\nS08E07 Blazing the Trail\n  With temperatures on the rise, conditions on the ice roads quickly\n  deteriorate. The truckers from Polar and VP Express are pushed to the brink,\n  crossing thin ice on their way to deliver critical loads. Lisa and Todd go\n  where no other trucker this season has gone before, tackling a remote road\n  that's completely untouched. After cutting ties with Polar, Darrell races\n  to deliver loads to make up for lost time. Art's mishaps on the ice roads\n  could cost him his job.\n\nS08E08 Highway to Hell\n  Lisa and Todd embark on one of the toughest missions of the season, tackling\n  an untamed trail dubbed the `Highway to Hell'. Darrell Ward steals business\n  out from under his former boss at Polar Industries. A crash could mean the\n  end of Alex's trucking season.\n\nS08E09 Flirtin' with Disaster\n  With Darrell's new company on a roll, he calls in a surprising reinforcement,\n  but can this new team member hack the treacherous ice roads. A brush with\n  near disaster could cut Hugh's season short. And, Lisa and Todd convoy into\n  uncharted territory on a privately built, unmaintained road through the\n  frozen frontier.\n\nS08E10 Icing on the Lake\n  Darrell continues teaching Reno how to drive the ice roads, but Dad's\n  overprotective ways may be too much; Art gets some royal help on a trip far\n  north; faulty wiring could sink Alex's cement load; Lisa and Todd hit a road\n  block in their race to keep Polar in the load count competition.\n\nS08E11 Journey to the End of the Earth\n  With temperatures rising and the winter roads quickly melting away, it's a\n  mad dash to the finish line. VP Express and Polar are neck and neck in a race\n  to end the season on top. Polar drivers Lisa, Art and Todd embark on an epic\n  journey up the longest seasonal winter road in the world. VP stays closer to\n  home, traveling treacherous roads in a late attempt to boost their load count.\n\nS08E12 World's End\n  The end of the line is here. The Polar drivers face the long, difficult\n  journey back down the world's longest seasonal winter road. Lisa has to\n  make a game-changing decisionÂ¿help a competitor push further into the arctic\n  unknown or stick with her teammates and convoy back to Polar headquarters.\n  Her decision could be costly as conditions quickly deteriorate","torrent":{"xt":"urn:btih:b0314963bb9feeb4ffd936ddfd53a59e79d53c14","amp;dn":"Ice+Road+Truckers.Season+8.720p.x264","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0314963bb9feeb4ffd936ddfd53a59e79d53c14","infoHashBuffer":{"type":"Buffer","data":[176,49,73,99,187,159,238,180,255,217,54,221,253,83,165,158,121,213,60,20]},"announce":[],"urlList":[]}}