{"title":"MC Hammer - 4 albums 1988 - 1994 [FLAC] - Kitlope","uid":5692766,"size":1675458458,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b0632c0daac0ebf5c77670abeaa33c6c268c03ef&amp;dn=MC+Hammer+-+4+albums+1988+-+1994+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kitlope","files":62,"time":1279149109,"description":"PC Software: Windows 7 Ultimate Build 7600 \nFile Type: FLAC Compression 6\nCd Hardware: Plextor PX-716SA \nPlextor Firmware: 1.11 (Final)\nCd Software: Exact Audio Copy V0.99 prebeta 5\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tracker.openbittorrent.com/announce;\nTorrent Hash: B0632C0DAAC0EBF5C77670ABEAA33C6C268C03EF\nFile Size: 1.56 Gb\nLabel: Capitol, Death Row, Giant\n\n\nAlbums, Years &amp; Catalog # in this torrent: \n\n\nLets Get it Started 1988 CDP 590924\nPlease Hammer Don't Hurt Em 1990 CDP 7 92857 2\nToo Legit to Quit  1991 CDP 598151\nThe Funky Headhunter 1994 CD 24545\n\n\n\n\n\n\nPlease help seed these FLACs! \n\n\n\n\nFrom Wiki:\n\n\n\nStanley Kirk Burrell (born March 30, 1962), best known by his stage names MC Hammer, Hammer and Hammertime, is a rapper, entertainer and dancer most popular during the late 1980s until the mid-1990s. Remembered for a rapid rise to fame before losing the majority of his fortune, he is also known for his hit records, including &quot;U Can't Touch This&quot;, flamboyant dance techniques and trademark Hammer pants.\n\nHammer became a preacher during the late 1990s, was a television show host and dance judge, is a record label CEO, and as of 2008 works as a co-creator of a dance website called DanceJam, while still performing occasionally at concerts and other social media, ministry and outreach functions. In addition, he is executive producer of his own reality show called Hammertime which airs Sundays at 10 PM EST on the A&amp;E Network.[1][2]\n\nHammer is considered a forefather and innovator[3] of pop rap, and is the first hip hop artist to achieve diamond status for an album.[4][5][6][7] However, due to his mainstream appeal since the late 1980s, Hammer would later be considered a sell-out rapper by many due in part to over-exposure and as a result of his changing to a grittier image as the landscape of rap changed.[8][9][10] Nonetheless, BET ranked Hammer as the #7 &quot;Best Dancer Of All Time&quot;.[11] While his talent may be denied, disputed, and debated, &quot;Vibe Presents The Best Rapper Ever Tournament&quot; declared Hammer the 17th most favorite of all-time during the first round.[12]\n\nWhile giving numerous interviews on radio stations and television channels through the years, Hammer is still questioned about his 1996 bankruptcy.[13][14][15] During one such interview by WKQI-FM (95.5) for the promotion of his &quot;Pioneers Of Hip Hop 2009&quot; gig at the Fox Theatre (Detroit, Michigan) which featured 2 Live Crew, Naughty by Nature, Too Short, Biz Markie &amp; Roxanne ShantÃƒÂ©, Hammer was subject to inquiries about his finances by the &quot;Mojo in the Morning&quot; host which led to a response on Twitter that Mojo was a 'coward', with Hammer threatening to cancel commercials surrounding his show.[16][17][18]\n\nOriginally from Oakland, Hammer currently resides in Tracy, California with his wife (Stephanie) of 23 years, his nephew (Jamaris) and Stephanie and Hammer's five children: three boys (Bobby, Jeremiah, Sammy) and two girls (Sarah, A'keiba).[19][20][21] Throughout his career, MC Hammer has managed his own recording business, Oaktown Records.\n\n\n\n\n\nLet's Get it Started 1988\n\n\nLet's Get It Started is the second album released by pop emcee MC Hammer, whose given name is Stanley Kirk Burrell. The album went double platinum with &quot;Pump It Up&quot;, &quot;Let's Get It Started&quot;, &quot;Turn This Mutha Out&quot; and &quot;They Put Me in the Mix&quot; as the most popular tracks from this album. It topped the R&amp;B charts and peaked at #30 on the Billboard 200.\n\nThe album produced top-5 rap singles. &quot;Turn This Mutha Out&quot; also cracked the top-15 on both the dance and R&amp;B charts. However, none of the singles made much of a dent in the pop charts\n\n\n\nTracks: \n\n\n1.\t&quot;Intro: Turn This Mutha Out&quot;\n2.\t&quot;Let's Get It Started&quot;\n3.\t&quot;Ring 'Em&quot;\n4.\t&quot;Cold Go MC Hammer&quot;\n5.\t&quot;You're Being Served&quot;\n6.\t&quot;It's Gone&quot;\n7.\t&quot;They Put Me in the Mix&quot;\n8.\t&quot;Son of the King&quot;\n9.\t&quot;That's What I Said&quot;\n10.\t&quot;Feel My Power&quot;\n11.\t&quot;Pump It Up (Here's the News)&quot;\n\n\n\n\n\n\n\nPlease Hammer Don't Hurt Them 1990\n\n\nPlease Hammer, Don't Hurt 'Em is the third and most popular album (and second major-label release) by MC Hammer, released between January 1, 1990[1] - February 12, 1990[2] by Capitol Records. It was produced, recorded, and mixed by Felton Pilate and James Earley.\n\nMC Hammer was good friends with Arsenio Hall and was invited to first perform the song &quot;U Can't Touch This&quot;, prior to its release, on The Arsenio Hall Show in late 1989.[3] He also performed &quot;Please Hammer, Don't Hurt 'Em&quot;, a song that didn't make it on this album, but did appear in the same-titled movie.\n\nThe album ranked number one for 21 weeks, due primarily to the success of the single, &quot;U Can't Touch This&quot;.[citation needed] The song has been and continues to be used in many movies and television shows to date, and appears on soundtrack/compilation albums as well.[7] The album was criticized for its sampling of other artists' songs.[8] The album sampled high-profile artists and gave some of these artists a new fanbase. &quot;U Can't Touch This&quot; sampled &quot;Super Freak&quot; by Rick James; &quot;Dancin' Machine&quot; sampled the Jackson 5; &quot;Have You Seen Her&quot; is a semi-cover of The Chi-Lites song; &quot;Help the Children&quot; interpolates Marvin Gaye's &quot;Mercy Mercy Me (The Ecology)&quot;; &quot;Pray&quot; and &quot;She's Soft and Wet&quot; sample the Prince songs &quot;When Doves Cry&quot; and &quot;Soft and Wet&quot; respectively.\n\nThese album songs all proved to be successful on radio and video television, with &quot;U Can't Touch This&quot;, &quot;Pray&quot;, &quot;Have You Seen Her&quot;, &quot;Here Comes the Hammer&quot; and &quot;Yo!! Sweetness&quot; (UK only) all charting. The album raised rap music to a new level of popularity. It was the first hip-hop album certified diamond by the RIAA for sales of over ten million.[9] It remains one of the genre's all-time best-selling albums.[10] To date, the album has sold as many as 18 million units.[11][12][13][14]\n\nAccording to Guinness World Records of hit singles, the album cost just $10,000 to produce.[citation needed] The video for &quot;Here Comes the Hammer&quot; proved to be the most expensive video on this album, Hammer's second most expensive behind &quot;Too Legit to Quit&quot;.[15][16][17][18]\n\nThis album was accompanied by a movie called &quot;Please Hammer, Don't Hurt 'Em: The Movie&quot; (1990) which included some of Hammer's videos.[19]\n\nAdditionally, the album title was often used as a chant by the crowd during live performances. (&quot;Please, Hammer, don't hurt 'em...&quot;!)\n\n\nTracks: \n\n\n1.\t&quot;Here Comes the Hammer&quot;  \n2.\t&quot;U Can't Touch This&quot;  \n3.\t&quot;Have You Seen Her&quot; (The Chi-Lites cover)\n4.\t&quot;Yo!! Sweetness&quot;  \n5.\t&quot;Help the Children&quot;  \n6.\t&quot;On Your Face&quot;  \n7.\t&quot;Dancin' Machine&quot; (The Jackson 5 cover)\n8.\t&quot;Pray&quot;  \n9.\t&quot;Crime Story&quot;  \n10.\t&quot;She's Soft and Wet&quot; (Prince cover)\n11.\t&quot;Black Is Black&quot;  \n12.\t&quot;Let's Go Deeper&quot;  \n13.\t&quot;Work This&quot;  \n\t\n\n\n\n\n\n\n\n\nToo Legit To Quit 1991 \n\n\nToo Legit To Quit is Hammer's third album, released on October 29, 1991. While the album wasn't as successful as Please, Hammer, Don't Hurt 'Em , it nevertheless proved successful, peaking in the Top 5 of the Billboard 200, as well as going triple platinum. A video for the title song was also produced, featuring many celebrity appearances. It was ranked one of the most expensive videos.[1][2][3]\n\nAt the end of the &quot;Too Legit to Quit&quot; music video, after James Brown enlists Hammer to obtain the glove of Michael Jackson, a silver-white sequined glove is shown on the hand of a Jackson look-a-like doing the &quot;2 Legit 2 Quit&quot; hand gesture. It was a reference to Hammer wanting to challenge Jackson to a dance-off for rights to the famous glove, which is also referenced on the album.[4]\n\nMC Hammer appeared on The Wendy Williams Show (July 27th, 2009) and went on to tell an story about a phone call he received from Michael Jackson, regarding the portion of the &quot;Too Legit to Quit&quot; video that included a fake Jackson, giving his approval and inclusion of it. He explained how Jackson had seen the video and liked it, and both expressed they were a fan of each other.[5] Hammer and Jackson would later appear, speak and perform at the funeral service for James Brown in 2006.\n\n\nTracks: \n\n\n\n1.\t&quot;This Is the Way We Roll&quot;  \n2.\t&quot;Brothers Hang On&quot;  \n3.\t&quot;Too Legit to Quit&quot;  \n4.\t&quot;Living in a World Like This&quot;  \n5.\t&quot;Tell Me (Why Can't We Live Together)&quot;  \n6.\t&quot;Releasing Some Pressure&quot;  \n7.\t&quot;Find Yourself a Friend&quot;  \n8.\t&quot;Count It Off&quot;  \n9.\t&quot;Good to Go&quot;  \n10.\t&quot;Lovehold&quot;  \n11.\t&quot;Street Soldiers&quot;  \n12.\t&quot;Do Not Pass Me By&quot;  \n13.\t&quot;Gaining Momentum&quot;  \n14.\t&quot;Addams Groove&quot;  \n\n\n\n\n\n\nThe Funky Headhunter 1994\n\n\nThe Funky Headhunter was the fourth album made by MC Hammer, then known as Hammer, in 1994.\n\nThe album at the time was hailed as MC Hammer's comeback album and was produced by innovative musicians and writers such as Teddy Riley (who had previously produced records for Guy, Blackstreet, and Michael Jackson), The Hines Brothers, and G-Bomb. It also featured Death Row Records head Suge Knight, Whole 9 and Death Row recording artists Tha Dogg Pound. Hammer debuted the album two months before its release on The Arsenio Hall Show and finally released it in March.\n\nThe album eventually reached #12 on the Billboard 200 album chart [1] The album managed to become certified platinum.\n\n&quot;It's All Good&quot; was the second single released on this album, which would become a pop culture phrase as a result. [2] It was also the most successful song by this title, peaking on the record charts as follows: US #46; US R&amp;B #14; US Rap #3; UK #52.\n\nWithin this album, Hammer disses rappers such as A Tribe Called Quest (Q-Tip), Redman and Run DMC. This quite possibly led to a decrease in his popularity after this comeback record responded to his critics.\n\n&quot;Help Lord (Won't You Come)&quot; appeared in Kingdom Come (2001 film)\n\n\nTracks: \n\n\n1.\t&quot;Intro&quot;\n2.\t&quot;Oaktown&quot;\n3.\t&quot;It's All Good&quot;\n4.\t&quot;Somethin' for the O.G's&quot;\n5.\t&quot;Don't Stop&quot;\n6.\t&quot;Pumps and a Bump&quot;\n7.\t&quot;One Mo' Time&quot;\n8.\t&quot;Clap Yo' Hands&quot;\n9.\t&quot;Time For Tubbs To Have A Bath (The Lantashamp Song)&quot;\n10.\t&quot;Break 'Em Off Somethin' Proper&quot;\n11.\t&quot;Don't Fight the Feelin'&quot;\n12.\t&quot;Somethin' Bout the Goldie In Me&quot;\n13.\t&quot;Sleepin' on a Master Plan&quot;\n14.\t&quot;It's All That&quot;\n15.\t&quot;Funky Headhunter&quot;\n16.\t&quot;Pumps and a Bump (Reprise: Bump Teddy Bump)&quot;\n17.\t&quot;Help Lord (Won't You Come)&quot;\n\n\n\n\n\n\nEnjoy Hammer :)\n","torrent":{"xt":"urn:btih:b0632c0daac0ebf5c77670abeaa33c6c268c03ef","amp;dn":"MC+Hammer+-+4+albums+1988+-+1994+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0632c0daac0ebf5c77670abeaa33c6c268c03ef","infoHashBuffer":{"type":"Buffer","data":[176,99,44,13,170,192,235,245,199,118,112,171,234,163,60,108,38,140,3,239]},"announce":[],"urlList":[]}}