{"title":"Mega collection - Knit dolls, toys and Christmas ornaments","uid":9455230,"size":2298853616,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b075588798d238519420cfd82f155153d06283d3&amp;dn=Mega+collection+-+Knit+dolls%2C+toys+and+Christmas+ornaments&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"whitecat2010","files":459,"time":1389255582,"description":"Mega Collection - Knitted dolls, doll clothes, toys, Christmas ornaments \n\nA large collection of books, booklets and standalone patterns divided into three categories folders: Dolls, Toys, Christmas ornaments. Dolls also includes dolls' clothes. \nThey are NOT my own uploads, but gathered here and there over the years. What I did is open or preview them to see what they are and consistently rename them so that the titles reflect the actual title of the book or booklet - this enabled me to immediately remove duplicates. \nIf is was part of a series (Sirdar, Daisy-May etc), the issue number is provided. \nIn very many cases, I've included in brackets what size doll the clothes are for, so that you can easily pick the ones you need. For fashioin dolls, I've put &quot;Fashion doll&quot; on top of the title, so that they are all grouped together. \nSome of them are cleaned up (because of bad scanning), but very few, as it's not a category that interests me a lot. \nHowever, I see there is a demand for it, thus I'm uploading it. \n\nThe files are loose, so that you can pick the ones you want. \n\nPlease note: I share my bandwidth with an all-day gamer, so I am only able to seed at night and early morning. And I live in Europe so my night might be your day. Thus be patient if I am away when you try to download. Just leave it on, and you will be OK. ","torrent":{"xt":"urn:btih:b075588798d238519420cfd82f155153d06283d3","amp;dn":"Mega+collection+-+Knit+dolls%2C+toys+and+Christmas+ornaments","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b075588798d238519420cfd82f155153d06283d3","infoHashBuffer":{"type":"Buffer","data":[176,117,88,135,152,210,56,81,148,32,207,216,47,21,81,83,208,98,131,211]},"announce":[],"urlList":[]}}