{"title":"Nothing but the Tooth: A Dental Odyssey ","uid":8733331,"size":5628115,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b0a32a201cd9dc4a7830dfe22c89f16380f110b0&amp;dn=Nothing+but+the+Tooth%3A+A+Dental+Odyssey+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1374640716,"description":"\nBarry K.B Berkovitz, &quot;Nothing but the Tooth: A Dental Odyssey (Elsevier Insights)&quot;\nEnglish | ISBN: 012397190X | 2012 | EPUB | 264 pages | 5,3 MB\n\nWhile most books on dentistry describe the clinical and medical procedures involved, this book expands the field to examine the role of dentistry and teeth in everything from biology to biography. This book offers facts and figures regarding famous historical figures, such as John Hunter, Dr Crippen, Doc Holliday, and Paul Revere, exploring how their connections to dentistry shaped them, as well as the story of the two young dentists who discovered the principles of general anaesthesia. Other chapters focus on the amazing ranges of teeth in animals, from the teeth in piranhas to the tusks and ivory of elephants and narwhals, looking at their biological and cultural significance. The importance of teeth in understanding the evolution of humans and in revolutionizing the study of archaeology is also evaluated. This book is appropriate for dentists, medical and dentistry students, and non-specialists to introduce the myriad interesting aspects relating to teeth.","torrent":{"xt":"urn:btih:b0a32a201cd9dc4a7830dfe22c89f16380f110b0","amp;dn":"Nothing+but+the+Tooth%3A+A+Dental+Odyssey+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0a32a201cd9dc4a7830dfe22c89f16380f110b0","infoHashBuffer":{"type":"Buffer","data":[176,163,42,32,28,217,220,74,120,48,223,226,44,137,241,99,128,241,16,176]},"announce":[],"urlList":[]}}