{"title":"New Havens Sentinels - The Art and Science of East Rock and West","uid":9985177,"size":22644219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1bd270506baa81287a78ce1234a672c0114cd95&amp;dn=New+Havens+Sentinels+-+The+Art+and+Science+of+East+Rock+and+West&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"STBGD","files":-1,"time":1397781222,"description":"New Haven's Sentinels: The Art and Science of East Rock and West Rock (The Driftless Connecticut Series &amp; Garnet Books) by Jelle Zeilinga de Boer and John Wareham\nEnglish | 2013 | ISBN: 0819573744 | ISBN-13: 9780819573742 | 180 pages | PDF | 21,5 MB\n\nWest Rock and East Rock are bold and beautiful features around New Haven, Connecticut. They resemble monumental gateways (or time-tried sentinels) and represent a moment in geologic time when the North American and African continents began to separate and volcanism affected much of Connecticut. \n\nThe rocks attracted the attention of poets, painters, and naturalists when beliefs rose about the spiritual dimensions of nature in the early 19th century. More than two dozen artists, including Frederick Church, George Durrie, and John Weir, captured their magic and produced an assortment of classic American landscapes. In the same period, the science of geology evolved rapidly, triggered by the controversy between proponents and opponents of biblical explanations for the origin of rocks. Lavishly illustrated, featuring over sixty paintings and prints, this book is a perfect introduction to understanding the relationship of geology and art. It will delight those who appreciate landscape painting, and anyone who has seen the grandeur of East and West Rock.","torrent":{"xt":"urn:btih:b1bd270506baa81287a78ce1234a672c0114cd95","amp;dn":"New+Havens+Sentinels+-+The+Art+and+Science+of+East+Rock+and+West","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1bd270506baa81287a78ce1234a672c0114cd95","infoHashBuffer":{"type":"Buffer","data":[177,189,39,5,6,186,168,18,135,167,140,225,35,74,103,44,1,20,205,149]},"announce":[],"urlList":[]}}