{"title":"POtHS - The Word - 024 - Ravi Zacharias - RZIM - Foundations of ","uid":8367003,"size":11990373221,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b1db453f9afdf525f2676f6eea151d9d4b8901e0&amp;dn=POtHS+-+The+Word+-+024+-+Ravi+Zacharias+-+RZIM+-+Foundations+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"POtHS11","files":-1,"time":1365797006,"description":"PO t HS\n\nPouring Out the Holy Spirit\n\nThe Word\n\nVolume 024\n\nRavi Zacharias - RZIM - Foundations of Apologetics - With  Worrkbooks\n\n\nPOtHS - the Word 024 - Ravi Zacharias - RZIM - Foundations of Apologetics - With  Workbooks\n\n\nPOtHS Comment:   Excellent\n\nDescription\n\nRZIM - Foundations of Apologetics (DivX)\n\nDesigned to introduce a comprehensive range of apologetic arguments and strategies, Foundations of Apologetics features lectures by RZIM's team of apologists including Ravi Zacharias, Michael Ramsden, John Lennox, Stuart McAllister, Alister McGrath, Amy Orr-Ewing, L.T. Jeyachandran, and Joe Boot.\nStudents of this rigorous curriculum will become adept at recognizing the many worldviews influencing our culture and equipped to challenge the assumptions of these worldviews.\n\nIt is our prayer you will find the studies foster no only knowledge but also cultivate the skills to communicate that knowledge in a way that is winsome and effective.\n\nContains All 12 Sessions, Also containing twelve printable PDF booklets.\n\nIn this series:\n\nIntroduction to Apologetics: Conversations That Count\nTruth and Reality\nThe Existence of God\nEstablishing a Worldview\nThe Trustworthiness of the Christian Scriptures\nThe Uniqueness of Christ\nThe Trinity and Apologetics\nPluralism: Do All Religions Lead to the Same Goal?\nFaith, Reason, and Integration\nGod, Evil, and Suffering\nSeeing &amp; Exploring Cultural Connections\nReasoning From The Scriptures\n\nDivX\n640 x 480\n24 Fps\nStereo\n128 Kbps\n\nEnjoy\n\n\nRavi Zacharias (Pack) DivX\n\nRavi Zacharias looks at Biblical authority and the cultural crisis in which we live. This is a 2 DivX set and includes:\n\n1. Cultural Relativism and the Emasculation of Truth\n\nThe 19th century writer George Macdonald once said, 'To give truth to him who loves it not is but to give him plentiful material for misinterpretation.' Indeed, Ravi argues that the ideas of rationalism and agnosticism and the institution of the media have altered our social landscape, such that belief in God's revelation seems wholly implausible for many individuals. Without such an understanding, proclamation is pointless. 49 minutes\n\n2. Creedal Affirmation in Search of Commitment.\n\nLove thy neighbor as thyself is widely believed to be a moral imperative which everyone can accept and try to follow without religious faith - as if it were a belief which came naturally to man. But this is a terrible error. All moral imperatives can only be affirmed if they are rooted in the absolute. Here the authority of the Scriptures is cogently defended and from such authority precepts for life's origin and destiny emerge.  50 minutes\n\n720 x 540  24 Fps  Stereo\n\nAlso:\n\nThe Mystery Of Evil &amp; The Miracle Of Life\n\nIt is ironic that we experience such evil in a society that posits relativism. In this video, Ravi presents a piercing analysis of human wickedness. He traces the origin of evil and particularly the lure of sin before Adam and Eve when Satan made God's truth suspect. Dr. Zacharias examines our hunger for the fulfillment of needs that God alone is big enough to fill and offers a challenge to surrender the human will to Christ's control.\n\n480 x 320  24 Fps  Stereo\n\nEnjoy.\n\n\n      :thankyou:    :thankyou:     Thank You JESUS  \n\n  ","torrent":{"xt":"urn:btih:b1db453f9afdf525f2676f6eea151d9d4b8901e0","amp;dn":"POtHS+-+The+Word+-+024+-+Ravi+Zacharias+-+RZIM+-+Foundations+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1db453f9afdf525f2676f6eea151d9d4b8901e0","infoHashBuffer":{"type":"Buffer","data":[177,219,69,63,154,253,245,37,242,103,111,110,234,21,29,157,75,137,1,224]},"announce":[],"urlList":[]}}