{"title":"William Shakespeare - 3 - The Tempest, bbc 1974","uid":9866086,"size":211498078,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b1e2ab146985a6ed2f331b40baa7990bed4865eb&amp;dn=William+Shakespeare+-+3+-+The+Tempest%2C+bbc+1974&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"wordcity","files":113,"time":1396357602,"description":"\nMusing upon the king my brother's wreck\nAnd on the king my father's death before him...\n\n\n\nFirst reports from the New World, as recorded by Venetian diarists and by Columbus himself, described it in terms of the garden of eden. But if you want to be cynical you can describe the play as telling the story of 'democratic liberators joining up with a cannibal to overthrow those who represent the brutal idiocy of modern civilisation.'\n\nThere are three superior recorded versions of The Tempest and this is one of them. (the others are Redgrave on Caedmon and McKellen on Naxos) This would have been recorded from ABC fm in 1975, as originally first broadcast by the BBC in Dec.1974. Paul Scofield, supported by a fine cast, is in the main role. Listen to Scofield delivering Prospero's set-piece speeches from the last Act of the play. This is the way to speak Shakespearian verse. The sound is excellent and not far from CD quality (originally recorded on high quality equipment by a relative)\n\nAs usual, if you want lossless audio, download the pdf included in 'Current Poetry Torrents' and follow the instructions. And if you have trouble finding seeds for other poetry torrents you should find them 'there' too.","torrent":{"xt":"urn:btih:b1e2ab146985a6ed2f331b40baa7990bed4865eb","amp;dn":"William+Shakespeare+-+3+-+The+Tempest%2C+bbc+1974","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b1e2ab146985a6ed2f331b40baa7990bed4865eb","infoHashBuffer":{"type":"Buffer","data":[177,226,171,20,105,133,166,237,47,51,27,64,186,167,153,11,237,72,101,235]},"announce":[],"urlList":[]}}