{"title":"Naruto Shippuden Ultimate Ninja Storm 3 Full Burst","uid":9170555,"size":7638254816,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b252a76e0275a3c8fe3a093b78ae3f839f4b1f1b&amp;dn=Naruto+Shippuden+Ultimate+Ninja+Storm+3+Full+Burst&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Brightpulse","files":-1,"time":1384058988,"description":"Live the 4th Great Ninja War and its overpowering boss fights or defy your\nfriends in ultra dynamic online and offline ninja confrontations!\n\nOriginally released in March 2013 for Xbox 360 and PlayStation3 to wide\ncritical and fan acclaim, the most epic NARUTO game ever released has been\ngiven a thorough overhaul for its PC debut! Not least among the wealth of\nenhancements contained in NARUTO SHIPPUDEN Ultimate Ninja STORM 3 FULL BURST\nis the addition of the feverishly anticipated chapter in which Sasuke and\nItachi take on Kabuto in a nail-biting confrontation\n\nKey Features\n- Absolutely Epic storyline: Wage the 4th Great Ninja War in the most epic\nNARUTO game ever\n- Extreme Immersion: Confront overpowering bosses including the gargantuan\nTailed Beasts in memorable battles defying time and death\n- Gameplay Excellence: Discover NARUTO Storm ultra dynamic ninja\nconfrontations with the series most extensive roster including the highly\nanticipated Naruto (Tailed Beast mode), Madara or the Jinchurikis\nand Beyond! (Full Burst New Content)\n\n- Additional Chapter: Finally free of Kabuto's control, Itachi intends to\ncrack the Reanimation forbidden technique. Will an unprecedented Uchiha\nalliance with Sasuke be enough to handle it?\n- New playable character: Kabuto reaches the almighty Sage mode and is now\nplayable in versus mode. Unleash his power and defeat your opponents both\noffline and online\n- Director's Cut: Discover completely revamped Storm 3 cinematics and\nexperience the epic conflict consuming the entire ninja world more intensely\nthat ever\n- 100 New Missions: Embark on a whole new series of missions, many with their\nown uniquely challenging objectives\n- 38 Additional Costumes: Outfit characters in a selection of 38 costumes\nfrom the NARUTO SHIPPUDEN Ultimate Ninja STORM 3 DLC packs\n\n1. Burn or mount the image\n2. Install the game\n3. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n4. Play the game\n5. Support the software developers. If you like this game, BUY IT!\n\n\n","torrent":{"xt":"urn:btih:b252a76e0275a3c8fe3a093b78ae3f839f4b1f1b","amp;dn":"Naruto+Shippuden+Ultimate+Ninja+Storm+3+Full+Burst","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b252a76e0275a3c8fe3a093b78ae3f839f4b1f1b","infoHashBuffer":{"type":"Buffer","data":[178,82,167,110,2,117,163,200,254,58,9,59,120,174,63,131,159,75,31,27]},"announce":[],"urlList":[]}}