{"title":"National Museum of American Art (Art Ebook).pdf","uid":10125936,"size":56828398,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b28bd14582d78af81085d93edab67e4632c3510b&amp;dn=National+Museum+of+American+Art+%28Art+Ebook%29.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"STBGD","files":-1,"time":1399762624,"description":"279 pages / English / pdf / Smithsonian / 54 MB / 1995 / ISBN-10: 0821222163\n\nIt began in the mid-19th century as two galleries of the &quot;Smithsonian Castle&quot; in Washington D.C. Over the years the name has changed, but the National Museum's mission has not. Though still part of the Smithsonian, the museum has grown into its own building, which now houses the world's largest collection of American art. This catalog offers a rich visual sample of this collection, ranging from colonial to contemporary. It is divided into nine thematic sections, thus the section &quot;People&quot; focuses on the history of American portraiture from Peale to Man Ray. The reader will find much that is familiar, however, because of this method of grouping, the reader will find nontraditional juxtapositions: folk art mingled with photography and works from Latin, African American, and Native American artists. Supplementing the 375 lush illustrations, very readable texts were culled from exhibition catalogs, critics commentaries, anecdotes, and many times the artist's own words, to provide a solid context for the works featured. Recommended for all collections. Joseph Hewgley, Nashville P.L.","torrent":{"xt":"urn:btih:b28bd14582d78af81085d93edab67e4632c3510b","amp;dn":"National+Museum+of+American+Art+%28Art+Ebook%29.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b28bd14582d78af81085d93edab67e4632c3510b","infoHashBuffer":{"type":"Buffer","data":[178,139,209,69,130,215,138,248,16,133,217,62,218,182,126,70,50,195,81,11]},"announce":[],"urlList":[]}}