{"title":"Akira Kurosawa - Red Beard with English Subtitles","uid":3879327,"size":1206872224,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b2eb54a68d8b492962101308c4c4729d5cff98ab&amp;dn=Akira+Kurosawa+-+Red+Beard+with+English+Subtitles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Leib","files":2,"time":1194577339,"description":"This will create a folder with RedBeard.avi and RedBeard.srt files inside. They both must remain in the same folder in order for the subtitles to work when playing RedBeard.avi.\n\nThe quality of this is to be expected, I think it was originally ripped from a re-enhanced CD. I found the torrent on the web, but without subs and looked all over until I found the sub file and 'glued' them together, so to speak. And Voila!\n\nRed Beard is a 1965 Japanese film directed by Akira Kurosawa about the relationship between a village doctor (Toshiro Mifune) and his new trainee. It is an adaptation of a novel by Shugoro Yamamoto. Fyodor Dostoevsky's novel The Insulted and the Injured provided the source for a subplot about a young girl, Otoyo (Terumi Niki), who is rescued from a brothel.[citation needed] Red Beard looks at the problem of social injustice and explores two of Kurosawa's favourite topics: existential humanism and existentialism.\n\nRed Beard is the last of numerous films in which Kurosawa worked with Mifune.\n\nIt is also Kurosawa's last black-and-white film. According to Prince, this is also the only Kurosawa film to feature nudity (in a scene where doctors suture a large wound on a young woman who was still semi-conscious).\n\n\nCAST:\n    * Toshiro Mifune - Dr. Kyojio Niide, Akahige (&quot;Red Beard&quot;)\n    * Yuzo Kayama - Dr. Noboru Yasumoto\n    * Kyoko Kagawa - &quot;The Mantis&quot; or &quot;Madwoman&quot;\n    * Terumi Niki - Otoyo\n\nThis Edit is adding more description and correcting my original mistake naming this as a Chinese language film (at the time I originally uploaded this I happened to be watching numerous Chinese Kung-Fu flicks and hit the wrong language button - my bad)\n\nEnjoy !","torrent":{"xt":"urn:btih:b2eb54a68d8b492962101308c4c4729d5cff98ab","amp;dn":"Akira+Kurosawa+-+Red+Beard+with+English+Subtitles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2eb54a68d8b492962101308c4c4729d5cff98ab","infoHashBuffer":{"type":"Buffer","data":[178,235,84,166,141,139,73,41,98,16,19,8,196,196,114,157,92,255,152,171]},"announce":[],"urlList":[]}}