{"title":"Managing Cardiovascular Complications in Diabetes [PDF] [StormRG","uid":10383461,"size":5214693,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b3312aaf9ce90f4e937d02dbc2af33043a7b9a8d&amp;dn=Managing+Cardiovascular+Complications+in+Diabetes+%5BPDF%5D+%5BStormRG&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":3,"time":1403110225,"description":"Author: D. John Betteridge, Stephen Nicholls\nPaperback: 334 pages\nPublisher: Wiley-Blackwell; 1 edition (May 12, 2014)\nLanguage: English\nISBN-10: 0470659491\nISBN-13: 978-0470659496\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet.Don't hesitate to PM me if you have any questions or problem with the download,as comments on torrents are easy to miss. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n___________________________________________________________________________________\n\n\nOf all the complications which arise from diabetes, cardiovascular complications are by far the most prevalent and the most deadly.\n\n\nAuthored by some of the world's leading names in this area, this outstanding book provides all those managing diabetic patients with clinical, practical and succinct guidance to the diagnosis and management of cardiovascular complications in diabetes.\n\n\nWith a joint endocrinology and cardiology focus, and with the very latest in clinical guidelines from the ADA, EASD, AHA, ASC and ESC, selected highlights include:\n\n- The role of new biomarkers of cardiovascular disease in diabetes\n- The latest on diagnosis of cardiovascular problems via vascular imaging\n- Hypertension and cardiovascular disease in the diabetic patient\n- Dyslipidaemia and its management in type 2 diabetes \n- Management of thrombosis, acute coronary syndrome and peripheral arterial disease in diabetes\n\n\n\nKey points, case studies and self-assessment questions allow for rapid-reference, quick understanding of all topics, thus ensuring that this is perfect reading for endocrinologists, diabetes specialists and cardiologists of all levels managing patients with diabetes and associated cardiovascular problems.","torrent":{"xt":"urn:btih:b3312aaf9ce90f4e937d02dbc2af33043a7b9a8d","amp;dn":"Managing+Cardiovascular+Complications+in+Diabetes+%5BPDF%5D+%5BStormRG","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3312aaf9ce90f4e937d02dbc2af33043a7b9a8d","infoHashBuffer":{"type":"Buffer","data":[179,49,42,175,156,233,15,78,147,125,2,219,194,175,51,4,58,123,154,141]},"announce":[],"urlList":[]}}