{"title":"True Romance - Special Edition [DVD + Bonus]","uid":6569372,"size":10650288128,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b370eda30740773357230dc2d32a9c1079533f5a&amp;dn=True+Romance+-+Special+Edition+%5BDVD+%2B+Bonus%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Hoofdkussen","files":-1,"time":1311874678,"description":"www. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents!\n\nActors: Christian Slater, Patricia Arquette, Dennis Hopper, Val Kilmer, Gary Oldman\nDirectors: Tony Scott\nWriters: Quentin Tarantino, Roger Avary\nProducers: Bill Unger, Bob Weinstein, Don Edmonds, Gary Barber, Gregory Manson\nFormat: PAL\nLanguage English\nRegion: Region 2 (This DVD may not be viewable outside Europe. Read more about DVD formats.)\nNumber of discs: 2\nClassification: 18\nStudio: Warner Home Video\nDVD Release Date: 24 Feb 2003\nRun Time: 120 minutes\nAverage Customer Review: 4.7 out of 5 stars  See all reviews (28 customer reviews)\nASIN: B00006L9X8\nAmazon Bestsellers Rank: 4,570 in Film &amp; TV (See Top 100 in Film &amp; TV)\n#96 in Film &amp; TV &gt; Action &amp; Adventure &gt; Comedy\n\nAmazon.co.uk Review\n\nWritten by Quentin Tarantino and directed by Tony Scott, True Romance is hilarious, violent and strangely moving. It\\\\\\\\\\\\\\'s part homage to Terence Malick\\\\\\\\\\\\\\'s Badlands, part autobiography, part nerdy male fantasy--and it\\\\\\\\\\\\\\'s Tarantino\\\\\\\\\\\\\\'s first and, some say, finest work. Although it fared poorly at the box office at the time it soon became an established cult classic, with a supporting cast that beggars belief: Brad Pitt, Christopher Walken, James Gandolfini, Val Kilmer, Dennis Hopper, Samuel L Jackson and Gary Oldman all play minor roles, all to devastating effect.\nChristian Slater stars as Clarence, the video-store clerk who\\\\\\\\\\\\\\'s set up with Patricia Arquette\\\\\\\\\\\\\\'s hooker Alabama on his birthday. They fall in love for real but have to hit the road when Clarence, egged on by the ghost of Elvis, kills Alabama\\\\\\\\\\\\\\'s pimp Drexl (Oldman) and makes off with a consignment of neat cocaine, mistaking it for a suitcase of Alabama\\\\\\\\\\\\\\'s clothes. Now both the police and the mafia are after them. Two among many great sequences stand out. The first is when cop Dennis Hopper, refusing to give up son Clarence to Christopher Walken\\\\\\\\\\\\\\'s mafiosi, makes his famous \\\\\\\\\\\\\\&quot;The Sicilians were spawned by niggers\\\\\\\\\\\\\\&quot; speech. In context, it\\\\\\\\\\\\\\'s actually not racist--it\\\\\\\\\\\\\\'s a gesture of great courage and love from dad to son, while also calculated to mock the uptight racial sensibilities of the mafia. The second is when Alabama turns the tables on James Gandolfini\\\\\\\\\\\\\\'s mafia henchman at the motel in a prolonged and brutal sequence which nonetheless emphasises the glowing, pink heart-shaped message at the centre of the film--that true love conquers all, albeit here in a hail of bullets that leaves practically everyone dead.\n\nOn the DVD: True Romance is excellently reproduced on disc and there is an abundance of extras for this Special Edition. These include a number of mostly superfluous deleted and extended scenes, though the one in which Samuel L Jackson offers his views on the merits of \\\\\\\\\\\\\\&quot;pussy-eating\\\\\\\\\\\\\\&quot; is worth catching, as is the \\\\\\\\\\\\\\&quot;alternate ending\\\\\\\\\\\\\\&quot;, which Tarantino had intended in his script. There is also access to the director\\\\\\\\\\\\\\'s storyboards as well as commentaries from many of the cast, director Scott and from Tarantino himself, who, given his usual reluctance to provide such commentaries, is informative and chatty here. This is a superb package, although this \\\\\\\\\\\\\\&quot;director\\\\\\\\\\\\\\'s cut\\\\\\\\\\\\\\&quot; is identical to the previous DVD edition. --David Stubbs\n\nSpecial Features\n3 Commentaries including Quentin Tarantino, Christian Slater, Patricia Arquette &amp; Director Tony Scott \n30 mins of Deleted Scenes \nTrailer, Photo Gallery \nSelective commentaries with Brad Pitt and Dennis Hopper \nAlternative Ending \nVintage featurette\n\nwww. Norskbits .com - Last ned Filmer, TV-serier, Spill, Program og Musikk http://www.norskbits.com\n\nCheck :: http://www.norskbits.com :: for more of my torrents!","torrent":{"xt":"urn:btih:b370eda30740773357230dc2d32a9c1079533f5a","amp;dn":"True+Romance+-+Special+Edition+%5BDVD+%2B+Bonus%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b370eda30740773357230dc2d32a9c1079533f5a","infoHashBuffer":{"type":"Buffer","data":[179,112,237,163,7,64,119,51,87,35,13,194,211,42,156,16,121,83,63,90]},"announce":[],"urlList":[]}}