{"title":"ABC of Cancer Care  [PDF] [StormRG]","uid":11036279,"size":3421097,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b49e5a807b4f10845e5ef919640ca759a502e658&amp;dn=ABC+of+Cancer+Care++%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":2,"time":1410800195,"description":"Author: Carlo Palmieri (Editor), Esther Bird (Editor), Richard Simcock (Editor)\nPaperback: 102 pages\nPublisher: BMJ Books; 1 edition (August 19, 2013)\nLanguage: English\nISBN-10: 0470674407\nISBN-13: 978-0470674406\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media,website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n________________________________________________________________________________\n\n\nABC of Cancer Care is a practical primary care guide to help health professionals better inform their patients, manage and recognize the common complications of cancers and their treatment, and understand the rationale and implications of decisions made in secondary and tertiary care.\n\nIt provides coverage of the diagnosis, management, treatment and on-going surveillance of common cancers within the multidisciplinary context of primary care. Individual chapters assess the different treatment options, including surgery, radiotherapy and chemotherapy, and examine their possible side effects. The contribution of clinical trials and new advances in cancer treatment including biological and targeted therapies, robotic surgery and advanced radiotherapy techniques are all described. Other aspects of cancer care, from nursing support and nutrition to psychological care and survivorship, are also covered.\n\nEdited by a specialist and general practitioner team, with multidisciplinary contributors, ABC of Cancer Care is ideal for general practitioners, practice nurses, cancer care nurses, medical students, and all healthcare professionals treating and supporting cancer patients.","torrent":{"xt":"urn:btih:b49e5a807b4f10845e5ef919640ca759a502e658","amp;dn":"ABC+of+Cancer+Care++%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b49e5a807b4f10845e5ef919640ca759a502e658","infoHashBuffer":{"type":"Buffer","data":[180,158,90,128,123,79,16,132,94,94,249,25,100,12,167,89,165,2,230,88]},"announce":[],"urlList":[]}}