{"title":"Sheldon H. Danziger - Understanding Poverty [2002][A]","uid":10462325,"size":1802335,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b4bf07e5d6024aa44a1ed7d0313b64d342ca89ab&amp;dn=Sheldon+H.+Danziger+-+Understanding+Poverty+%5B2002%5D%5BA%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Anette14","files":-1,"time":1404146788,"description":"Description\nProduct Details\nBook Title: Understanding Poverty\t\nBook Author: Sheldon H. Danziger (Editor), Robert H. Haveman (Editor)\nPaperback: 576 pages\nPublisher: Harvard University Press (May 1, 2002)\nLanguage: English\nISBN-10: 0674008766\nISBN-13: 978-0674008762\n\n===================================================================================\nBook Description\nRelease date: May 1, 2002 | ISBN-10: 0674008766 | ISBN-13: 978-0674008762\nIn spite of an unprecedented period of growth and prosperity, the poverty rate in the United States remains high relative to the levels of the early 1970s and relative to those in many industrialized countries today. Understanding Poverty brings the problem of poverty in America to the fore, focusing on its nature and extent at the dawn of the twenty-first century.\nLooking back over the four decades since the nation declared war on poverty, the authors ask how the poor have fared in the market economy, what government programs have and have not accomplished, and what remains to be done. They help us understand how changes in the way the labor market operates, in family structure, and in social welfare, health, and education policies have affected trends in poverty. Most significantly, they offer suggestions for changes in programs and policies that hold real promise for reducing poverty and income inequality.\n\n===================================================================================\nReviews\nUnderstanding Poverty provides a first-rate overview of key topics relating to poverty and policy. The chapters provide a useful synthesis of the research findings over the past decade, and of the evolving policy discussion. The book should be widely appreciated and used by policy analysts, by researchers, and by teachers. (Rebecca Blank, Dean, Gerald R. Ford School of Public Policy, and Professor of Economics, University of Michigan)\n\nUnderstanding Poverty is the best available source for current social science thought on US poverty and social policy. Anyone who wants to gain new insight into the nature of economic inequality in the second half of the 20th century should read it. Anyone who wants to influence or comment on social policy in the 21st century--especially welfare reform--should be required to read it. Understanding Poverty is destined to become the leading text in an increasingly crowded field. (Sanders Korenman, Professor, School of Public Affairs, Baruch College, CUNY)\n\nAuthored by a virtual who's who of leaders in the field, papers in this collection summarize the state of learning in a wide variety of areas of poverty research...[T]he volume...could bring anyone up to date on the state of mainstream thought regarding poverty research. (R. S. Rycroft Choice 2002-06-01)\n\nTeachers, scholars, policy analysts have all for 25 years depended on the Institute for Research on Poverty, in general, and Sheldon Danziger and Bob Haveman in particular to keep us up to date on the changing face of poverty in the U.S., what we are doing about it, or failing to do. This volume continues and enhances that tradition. An excellent introductory essay by the co-editors not only provides an overview of the volume but traces succinctly the trends in poverty in the U.S. and the evolution of public policies which impinge, in one way or another, upon it. The array of contributing scholars is impressive and they provide facts, analytic perspectice, assessments of policy effectiveness and proposals for new policies over a wide range of key topics. The landmark welfare reform act of 1996 receives considerable attention, as do the Earned Income Tax Credit and Social Security. But health, education, job training and even Empowerment Zones are also covered intelligently. If you, your students or colleagues need to deepen your understanding of poverty or just to catch up with the state of knowledge or the state of action, this is surely the place to start. (Robinson Hollister, Professor of Economics, Swarthmore College)\n\n===================================================================================\nAbout the Author\nSheldon Danziger is Professor of Social Work and Public Policy, University of Michigan, Ann Arbor.\nRobert H. Haveman is John Bascom Professor of Economics and Public Affairs, University of Wisconsin at Madison.\n===================================================================================","torrent":{"xt":"urn:btih:b4bf07e5d6024aa44a1ed7d0313b64d342ca89ab","amp;dn":"Sheldon+H.+Danziger+-+Understanding+Poverty+%5B2002%5D%5BA%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4bf07e5d6024aa44a1ed7d0313b64d342ca89ab","infoHashBuffer":{"type":"Buffer","data":[180,191,7,229,214,2,74,164,74,30,215,208,49,59,100,211,66,202,137,171]},"announce":[],"urlList":[]}}