{"title":"Walter (Wendy) Carlos - Clockwork Orange (complete original) mp3","uid":8909670,"size":113881557,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b4d7e259a320fed249302fc56c2e3e974d1cc7f7&amp;dn=Walter+%28Wendy%29+Carlos+-+Clockwork+Orange+%28complete+original%29+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"glngwl","files":13,"time":1378946036,"description":"Walter Carlos - &quot;Walter Carlos's Clockwork Orange&quot; (1972) (mp3) (320 kbps) (cover scans)\n  (originally released 1972; this is a CD reissue from 2000) \n\n\n[Note: This is not the soundtrack album &quot;Stanley Kubrick's Clockwork Orange&quot;, which was released as the film's official soundtrack, and contains most (but not all) of the various music used in the film.]\n\nInstead, this is the complete set of music that Walter Carlos wrote for the film.  It includes:\n# all of his music that was used in the film,\n# the rest of his music that had been intended to be used in the film (but which wasn't completed in time),\n# the full 14-minute version of 'Timesteps' (of which only a 4-minute excerpt had been included on the soundtrack),\n# two bonus tracks which were not included on the original 1972 vinyl LP release.\n\n\nThe film &quot;A Clockwork Orange&quot; was released in December 1971 in the USA, and four weeks later in January 1972 in the UK.  This album was originally released by Columbia Records in early 1972, three months after the film's release.\n\nThis CD reissue dates from 2000, and includes two extra tracks (nos. 8 and 9) which had not been included on the original LP in 1972.\n\nThis torrent contains the following scans:\n#  the front and back covers of the original 1972 LP (which was deliberately designed differently to the film's already-iconic poster image),\n#  the cover of the 2000 CD reissue (which does bear a design clearly inspired by, and intended to look like, the original film poster).\n\n\n[Note also, this album was released in early 1972, before Walter Carlos's sex-change operation, and his consequent name-change to Wendy Carlos.  Carlos had begun hormone treatments in 1968, and soon began living full-time as a woman.  He underwent his sex-reassignment surgery in May 1972 - after this album was released.  This album was credited at the time to Walter Carlos, not Wendy Carlos.  He did not announce himself publicly as a woman for another 7 years, until May 1979.  The first music therefore correctly credited to Wendy Carlos was the music that he (or by then, she) wrote for Stanley Kubrick's &quot;The Shining&quot; in 1980.]","torrent":{"xt":"urn:btih:b4d7e259a320fed249302fc56c2e3e974d1cc7f7","amp;dn":"Walter+%28Wendy%29+Carlos+-+Clockwork+Orange+%28complete+original%29+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4d7e259a320fed249302fc56c2e3e974d1cc7f7","infoHashBuffer":{"type":"Buffer","data":[180,215,226,89,163,32,254,210,73,48,47,197,108,46,62,151,77,28,199,247]},"announce":[],"urlList":[]}}