{"title":"Retro City Rampage (PC)","uid":7711588,"size":16628837,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b535646ffe2819b23ed2729561f224eeb72cb070&amp;dn=Retro+City+Rampage+%28PC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"girtas_123","files":-1,"time":1349818646,"description":"Retro City Rampage\n\nThe entire open-world is in danger.\n\nTHE PLAYER is out for a friendly frolic of CRIME CAPERS when suddenly ambushed by EVIL GOOD GUYS. They will stop at nothing to end his RAMPAGE OF DOOM threatening the citizens of Theftropolis City. Are YOU bad enough to defeat the EVIL GOOD GUYS?\n\nRETRO CITY RAMPAGE lets you play as THE PLAYER. Take the wheel with five-finger discounts on over 30 vehicles and wield over 20 weapons that will make you say &quot;WHOA&quot;! Run down innocent pedestrians to hear the magnificent monophonic modulated sounds. Order a pint of &quot;SOUR MILK&quot; from the barkeep to make yourself sick and avoid taking responsibility for your actions. At some point, defeat the EVIL GOOD GUYS then relax and go do it, when you want an ICED TEA.\n\nWait, what...?\n\nA parody of the open-world action genre, Retro City Rampage takes modern game mechanics and mashes them into an authentic 8-bit experience.\n\nEqual parts fast paced arcade action and an epic mission based story mode, it's all the driving and shooting you'd expect and a whole lot more! With missions that twist pages straight from classic game experiences, you get to re-live and rewrite history in a way only a modern anti-hero could!\n\nWhen it comes to enemies, weapons are only the beginning! Put on your boots and jump on their heads! Toss 'em around to knock the rest down! Become truly unstoppable with awesome power-ups!\n\nThrough its world, characters and missions, Retro City Rampage lampoons the entire 8-bit era --from its games to the TV, movies and pop culture!\n\n***********************************************************************************\n\nIf you enjoyed the game, be sure to buy it!","torrent":{"xt":"urn:btih:b535646ffe2819b23ed2729561f224eeb72cb070","amp;dn":"Retro+City+Rampage+%28PC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b535646ffe2819b23ed2729561f224eeb72cb070","infoHashBuffer":{"type":"Buffer","data":[181,53,100,111,254,40,25,178,62,210,114,149,97,242,36,238,183,44,176,112]},"announce":[],"urlList":[]}}