{"title":"Anonymous - The Way of a PIlgrim (pdf)","uid":8639126,"size":4007069,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b57d8816530f0b91081230e2a99753ca42f3aeb7&amp;dn=Anonymous+-+The+Way+of+a+PIlgrim+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1372837006,"description":"Anonymous (Helen Bacovcin, trans.) - The Way of a PIlgrim, and The Pilgrim Continues His Way (Image, 1978). 196 pages.\n\nNew scan. Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. \n\n\nRussian spiritual classic that teaches the method of the Jesus Prayer.\n\ndescription:\n\nThis enduring work of Russian spirituality has charmed countless people with its tale of a nineteenth-century peasant's quest for the secret of prayer. Readers follow this anonymous pilgrim as he treks over the Steppes in search of the answer to the one compelling question: How does one pray constantly? Through his journeys, and under the tutelage of a spiritual father, he becomes gradually more open to the promptings of God, and sees joy and plenty wherever he goes. Ultimately, he discovers the different meanings and methods of prayer as he travels to his ultimate destination, Jerusalem.\n\nThe Way of a Pilgrim is a humble story ripe for renewed appreciation today. The recent changes in Russia have revealed the great religious traditions of that land, and this work, freshly translated for modern times, is among the finest examples of those centuries-old traditions.\n\n----\n\nThis book references some classic writings from the Philokalia; they are included in a volume called Writings from the Philokalia on Prayer of the Heart. I plan to upload it soon.\n\nFor a modern examination of the mysticism of the Jesus Prayer, see this:\n &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/8283416&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/8283416&lt;/a&gt;","torrent":{"xt":"urn:btih:b57d8816530f0b91081230e2a99753ca42f3aeb7","amp;dn":"Anonymous+-+The+Way+of+a+PIlgrim+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b57d8816530f0b91081230e2a99753ca42f3aeb7","infoHashBuffer":{"type":"Buffer","data":[181,125,136,22,83,15,11,145,8,18,48,226,169,151,83,202,66,243,174,183]},"announce":[],"urlList":[]}}