{"title":"Encapsulation Nanotechnologies - Vikas Mittal","uid":15417741,"size":13219554,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b5e41d1ee52775b5b1b40424cbab1ffceda0e268&amp;dn=Encapsulation+Nanotechnologies+-+Vikas+Mittal&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1469602766,"description":"Encapsulation Nanotechnologies - Vikas Mittal (Wiley-Scrivener, 2013).pdf\r\n\r\nThis unique and comprehensive book covers all the recent physical, chemical, and mechanical advancements in encapsulation nanotechnologies.\r\n\r\nEncapsulation is prevalent in the evolutionary processes of nature, where nature protects the materials from the environment by engulfing them in a suitable shell. These natural processes are well known and have been adopted and applied in the pharmaceutical, food, agricultural, and cosmetics industries.\r\n\r\nIn recent years, because of the increased understanding of the material properties and behaviors at nanoscale, research in the encapsulation field has also moved to the generation of nanocapsules, nanocontainers, and other nano devices. One such example is the generation of self-healing nanocontainers holding corrosion inhibitors that can be used in anti-corrosion coatings. The processes used to generate such capsules have also undergone significant developments. Various technologies based on chemical, physical, and physico-chemical synthesis methods have been developed and applied successfully to generate encapsulated materials.\r\n\r\nBecause of the increasing potential and value of the new nanotechnologies and products being used in a large number of commercial processes, the need for compiling one comprehensive volume comprising the recent technological advancements is also correspondingly timely and significant. This volume not only introduces the subject of encapsulation and nanotechnologies to scientists new to the field, but also serves as a reference for experts already working in this area.\r\n\r\nEncapsulation Nanotechnologies details in part:\r\n\r\nThe copper encapsulation of carbon nanotubes\r\nVarious aspects of the application of fluid-bed technology for the coating and encapsulation processes\r\nThe use of the electrospinning technique for encapsulation\r\nThe concept of microencapsulation by interfacial polymerization\r\nOverviews of encapsulation technologies for organic thin-film transistors (OTFTs), polymer capsule technology, the use of supercritical fluids (such as carbon dioxide), iCVD process for large-scale applications in hybrid gas barriers\r\nReadership\r\nEncapsulation Nanotechnologiesis of prime interest to a wide range of materials scientists and engineers, both in industry and academia","torrent":{"xt":"urn:btih:b5e41d1ee52775b5b1b40424cbab1ffceda0e268","amp;dn":"Encapsulation+Nanotechnologies+-+Vikas+Mittal","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b5e41d1ee52775b5b1b40424cbab1ffceda0e268","infoHashBuffer":{"type":"Buffer","data":[181,228,29,30,229,39,117,181,177,180,4,36,203,171,31,252,237,160,226,104]},"announce":[],"urlList":[]}}