{"title":"Alternative Medicine The Evidence: Acupuncture","uid":4170363,"size":495808559,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b602a1c6be757b96c73b1b9262ffca7cba41bd3c&amp;dn=Alternative+Medicine+The+Evidence%3A+Acupuncture&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"thuvn205","files":2,"time":1209830714,"description":"THIS UPLOAD ONLY INCLUDING THE ACUPUNCTURE CHAPTER.\n\n\nAlternative Medicine The Evidence: Acupuncture\n\nProfessor Kathy Sykes from Bristol University - shows acupuncture has a powerful and measurable effect on the human brain.\n\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51Q0HzXHN6L._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51Q0HzXHN6L._SS500_.jpg&lt;/a&gt;\n\n &lt;a href=&quot;\nhttp://www.zavvi.co.uk/images/731/731397_DV_L_B.JPG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.zavvi.co.uk/images/731/731397_DV_L_B.JPG&lt;/a&gt;\n\n\nComplementary and Alternative Medicine (CAM), as it is now known, was for thousands of years the only medicine available to us. However these traditional cures are now being treated with a whole new respect by the medical profession.\n\nPresented by Professor Kathy Sykes, this series produced by the BBC in conjunction with the Open University explores just how successful a range of Alternative therapies can actually be why science is starting to respond to these ancient remedies.\n\nACUPUNCTURE: \nA patient in Shanghai has open heart surgery (not administered by general anaesthetic but by a acupuncture needles) and remains conscious throughout the whole procedure. Amazed by this, Kathy recruits a team of top scientists in the UK to evaluate the possible reasons behind this success. The conclusions challenge current understanding of the working of the brain and throws new light on the ancient practice of Acupuncture.\n\nHEALING:\nIn the second episodes, Kathy investigates the effectiveness of a range of Healers both in the UK and the USA. She discovers that although there is no evidence that healers have any measurable \\\\\\\\\\\\\\&amp;#039;special powers\\\\\\\\\\\\\\&amp;#039;, some patients undoubtedly do make remarkable recoveries. It\\\\\\\\\\\\\\&amp;#039;s a mystery Kathy only finally solves on a trip to America when she discovers that each of us has a powerful self healing mechanism which can be triggered by a range of healers.\n\nHERBS:\nWe travel to South Africa and Germany to investigate the remedial power of herbal remedies where kathy finds a group of scientists who have identified at least eight \\\\\\\\\\\\\\&amp;#039;super herbs\\\\\\\\\\\\\\&amp;#039;. It appears that the plants from where the herbs originate from have enormously complex chemical structure containing medicinal properties modern pharmaceuticals simply cannot produce.\n","torrent":{"xt":"urn:btih:b602a1c6be757b96c73b1b9262ffca7cba41bd3c","amp;dn":"Alternative+Medicine+The+Evidence%3A+Acupuncture","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b602a1c6be757b96c73b1b9262ffca7cba41bd3c","infoHashBuffer":{"type":"Buffer","data":[182,2,161,198,190,117,123,150,199,59,27,146,98,255,202,124,186,65,189,60]},"announce":[],"urlList":[]}}