{"title":"Textbook of Psychoanalysis,2nd Ed {BBS}","uid":7462811,"size":47251123,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b7e05e1c829644502887e837dffae8de50eb26e3&amp;dn=Textbook+of+Psychoanalysis%2C2nd+Ed+%7BBBS%7D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bigbluesea","files":-1,"time":1342882421,"description":"The only comprehensive textbook of psychoanalysis available in the United States, the Textbook of Psychoanalysis was written with both the beginning student in the mental health care professions and the practicing analyst in mind. In a single volume, the editors have compiled contributions that cover the history of psychoanalysis, the major theoretical models, and all facets of treatment and technique. This pluralistic approach is consistent with the conceptual and clinical diversity of contemporary American psychoanalysis, the focus of this newly revised work. The book also reflects the exponential increase in research activity within psychoanalysis, and the section on research is both up to date and substantive. Also current and extensive is the coverage of the interface between psychoanalysis and other disciplines, such as neuroscience. This interdisciplinary emphasis is one of the many strengths of this new edition. The editors have created a format that logically and painlessly educates and engages. No other volume offers the range of topics, the depth of coverage, or the accessible writing style of this groundbreaking text.\n\n\n# Hardcover: 636 pages\n# Publisher: American Psychiatric Publishing, Inc.; 2 edition (October 8, 2011)\n# Language: English\n# ISBN-10: 1585624101\n# ISBN-13: 978-1585624102","torrent":{"xt":"urn:btih:b7e05e1c829644502887e837dffae8de50eb26e3","amp;dn":"Textbook+of+Psychoanalysis%2C2nd+Ed+%7BBBS%7D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7e05e1c829644502887e837dffae8de50eb26e3","infoHashBuffer":{"type":"Buffer","data":[183,224,94,28,130,150,68,80,40,135,232,55,223,250,232,222,80,235,38,227]},"announce":[],"urlList":[]}}