{"title":"The Heretic Queen (2009) by Michelle Moran (epub - mobi)","uid":9421677,"size":1090642,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b857c57cdbcbdb2c168342732c5b367ede8f88b4&amp;dn=The+Heretic+Queen+%282009%29+by+Michelle+Moran+%28epub+-+mobi%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"7","files":-1,"time":1388602380,"description":"Overview:\n\nIn ancient Egypt, a forgotten princess must overcome her familyG??s past and remake history. The winds of change are blowing through Thebes. A devastating palace fire has killed the Eighteenth DynastyG??s royal family-all with the exception of Nefertari, the niece of the reviled former queen, Nefertiti. The girlG??s deceased family has been branded as heretical, and no one in Egypt will speak their names. A relic of a previous reign, Nefertari is pushed aside, an unimportant princess left to run wild in the palace. But this changes when she is taken under the wing of the PharaohG??s aunt, then brought to the Temple of Hathor, where she is educated in a manner befitting a future queen. Soon Nefertari catches the eye of the Crown Prince, and despite her familyG??s history, they fall in love and wish to marry. Yet all of Egypt opposes this union between the rising star of a new dynasty and the fading star of an old, heretical one. While political adversity sets the country on edge, Nefertari becomes the wife of Ramesses the Great. Destined to be the most powerful Pharaoh in Egypt, he is also the man who must confront the most famous exodus in history. Sweeping in scope and meticulous in detail, The Heretic Queen is a novel of passion and power, heartbreak and redemption.\n\nGenre :  Fiction, General\n\n","torrent":{"xt":"urn:btih:b857c57cdbcbdb2c168342732c5b367ede8f88b4","amp;dn":"The+Heretic+Queen+%282009%29+by+Michelle+Moran+%28epub+-+mobi%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b857c57cdbcbdb2c168342732c5b367ede8f88b4","infoHashBuffer":{"type":"Buffer","data":[184,87,197,124,219,203,219,44,22,131,66,115,44,91,54,126,222,143,136,180]},"announce":[],"urlList":[]}}