{"title":"The Duchess of Duke Street  (BBC - Season 2 - Part 3)","uid":6746761,"size":1472018550,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8700786ee3f3923ce99dcf2b8212751c873c9cc&amp;dn=The+Duchess+of+Duke+Street++%28BBC+-+Season+2+-+Part+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rosie1966","files":2,"time":1318720763,"description":"213: Lottie (3 December 1977)\nWhile a few of the staff know of Lottie's origins, others have set their tongues wagging about just why this young girls seems to be staying at the Bentinck. Louisa wont put up with it and sets out to end the gossip. Mary meanwhile takes an interest in her and invites her to tea with her friend Brian, the violin player. He immediately takes an interest in Lottie and grates at the constant stream of orders from Mary. When he decides to leave London, he gets Lottie to tell a heartbroken Mary of the reasons why. Louisa decides that the time has come to send Lottie to finishing school and make a lady of her.\n\n214: Blossom Time (10 December 1977)\nLottie returns to the Bentinck from finishing school in Switzerland for a bit of a holiday and has her art teacher, Miss Olive Bradford, in tow. Lottie has become quite the young lady, having learned the rules of high society and losing her Yorkshire accent. The Major takes quite an interest in Miss Bradford but Louisa warns him that she is an old maid who may be out to get her hooks into him. Lottie also finds a beau, hotel guest Howard Blenkiron who takes an interest in her from their first meeting. She may have made a mistake however when she tells Howard of her parentage.\n\n215: Poor Little Rich Girl (17 December 1977)\nLouisa and Lottie are at loggerheads -- Louisa wants her daughter to be a proper lady, as befits the daughter of a Viscount. Lottie is confident that she has the talent and the looks to become a major musical star of the London stage.\n\n216: Ain't We Got Fun (24 December 1977)\nChange is in the air at the hotel and in the lives of its many residents. An American writer, Sophie Applegate, would like to pen a book about Louisa's life, successes and failures. Louise isn't all that keen on the venture but eventually rises to the occasion and opens up about her past. It's not obvious that she'll ever let the book see the light of day however. Merriman wins Ã‚Â£500 in a contest and decides the time has come to engage in other pursuits, for a short time, at any rate. Mr. Starr and Mary have a surprise announcement that sends Louisa reeling and forces her to reconsider some of her rules about staff conduct. Major Smith-Barton returns for a short visit when his wife visits the continent. He too has a revelation for Louisa.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:b8700786ee3f3923ce99dcf2b8212751c873c9cc","amp;dn":"The+Duchess+of+Duke+Street++%28BBC+-+Season+2+-+Part+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8700786ee3f3923ce99dcf2b8212751c873c9cc","infoHashBuffer":{"type":"Buffer","data":[184,112,7,134,238,63,57,35,206,153,220,242,184,33,39,81,200,115,201,204]},"announce":[],"urlList":[]}}