{"title":"Darker Than Black - Complete Series (1280x720, HD Anime) ~ Nine-","uid":6530719,"size":12484823319,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:b90bab91f6e21d00b218cf7bb0b4355190db3504&amp;dn=Darker+Than+Black+-+Complete+Series+%281280x720%2C+HD+Anime%29+%7E+Nine-&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Nine-T","files":-1,"time":1310333290,"description":"DARKER THAN BLACK (Season 1, 1.5 and 2)\n\nTen years ago, an inscrutable and abnormal territory known as Hell's Gate appeared in Tokyo, altering the sky and wreaking havoc on the landscape. The real stars disappeared, replaced by false stars. During this time, people possessing various special abilities emerged, each capable of different supernatural feats - these are known as Contractors. Each fake star has a corresponding Contractor, which reacts to their activities. As such, Contractors are usually identified by their star's Messier catalogue number. Kept secret from the masses, these individuals are known to murder in cold blood, smothering unnecessary emotions with logic and rationale. Their incredible abilities, however, are gained at the cost of their humanity - Contractors are thus named because of an involuntary compulsion to &quot;pay the price&quot; each time their power is used, which can range from eating particular foods and completing meaningless tasks, to self-harm and having their bodies change in peculiar ways. Various nations and organizations around the world train and utilize Contractors as spies and assassins, resulting in violent battles for valuable objects and information. Following the disastrous Heaven's War, the United States lost its dominant position as a superpower to a mysterious organization named the Syndicate. The story revolves around a Chinese contractor codenamed Hei as he undertakes various espionage and assassination missions in Tokyo under the direction of the aforementioned Syndicate.\n\nThe source of Season 1 sub is unknown. The rest is a BSS sub.\n\nHave fun,\nNine-T\n\n\n\nThis is a link to English Dubbed version:\n\n&lt;a href=&quot;http://thepiratebay.se/torrent/5238654/Darker_Than_Black_English_Dubbed&quot; target=&quot;_blank&quot;&gt;Darker Than Black - Season 1 (English Dubbed)&lt;/a&gt;\n\nSeason 1.5 and 2 are not released in English Dub yet!\n\n\n\n","torrent":{"xt":"urn:btih:b90bab91f6e21d00b218cf7bb0b4355190db3504","amp;dn":"Darker+Than+Black+-+Complete+Series+%281280x720%2C+HD+Anime%29+%7E+Nine-","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b90bab91f6e21d00b218cf7bb0b4355190db3504","infoHashBuffer":{"type":"Buffer","data":[185,11,171,145,246,226,29,0,178,24,207,123,176,180,53,81,144,219,53,4]},"announce":[],"urlList":[]}}