{"title":"Learning the vi and Vim Editors, 7th Edition - [UA-07]","uid":7982754,"size":7261622,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b969f5ae00929552d3ccd7640a393006537d095e&amp;dn=Learning+the+vi+and+Vim+Editors%2C+7th+Edition+-+%5BUA-07%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"UA-07","files":-1,"time":1357218035,"description":"There's nothing that hard-core Unix and Linux users are more fanatical about than their text editor. Editors are the subject of adoration and worship, or of scorn and ridicule, depending upon whether the topic of discussion is your editor or someone else's. \n\nvi has been the standard editor for close to 30 years. Popular on Unix and Linux, it has a growing following on Windows systems, too. Most experienced system administrators cite vi as their tool of choice. And since 1986, this book has been the guide for vi. \n\nHowever, Unix systems are not what they were 30 years ago, and neither is this book. While retaining all the valuable features of previous editions, the 7th edition of Learning the vi and vim Editors has been expanded to include detailed information on vim, the leading vi clone. vim is the default version of vi on most Linux systems and on Mac OS X, and is available for many other operating systems too.\n\nWith this guide, you learn text editing basics and advanced tools for both editors, such as multi-window editing, how to write both interactive macros and scripts to extend the editor, and power tools for programmers -- all in the easy-to-follow style that has made this book a classic.\n\nLearning the vi and vim Editors includes:\n\nA complete introduction to text editing with vi:\n\nHow to move around vi in a hurry\nBeyond the basics, such as using buffers\nvi's global search and replacement\nAdvanced editing, including customizing vi and executing Unix commands\n\n\nHow to make full use of vim:\nExtended text objects and more powerful regular expressions\nMulti-window editing and powerful vim scripts\nHow to make full use of the GUI version of vim, called gvim\nvim's enhancements for programmers, such as syntax highlighting, folding and extended tags\n\n\nCoverage of three other popular vi clones -- nvi, elvis, and vile -- is also included. You'll find several valuable appendixes, including an alphabetical quick reference to both vi and ex mode commands for regular vi and for vim, plus an updated appendix on vi and the Internet.\n\nLearning either vi or vim is required knowledge if you use Linux or Unix, and in either case, reading this book is essential. After reading this book, the choice of editor will be obvious for you too.\n\n\n     =======================================================================\n \n                                      UA-07\n                               â•¬Â¿ Together For Ever â•¬Â¿ \n     =======================================================================\t\n","torrent":{"xt":"urn:btih:b969f5ae00929552d3ccd7640a393006537d095e","amp;dn":"Learning+the+vi+and+Vim+Editors%2C+7th+Edition+-+%5BUA-07%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b969f5ae00929552d3ccd7640a393006537d095e","infoHashBuffer":{"type":"Buffer","data":[185,105,245,174,0,146,149,82,211,204,215,100,10,57,48,6,83,125,9,94]},"announce":[],"urlList":[]}}