{"title":"Success Built to Last - Building a Life That Matters (English, U","uid":4733808,"size":351528192,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:b97453fb4d897c7f52a0a93e318f5123b922802a&amp;dn=Success+Built+to+Last+-+Building+a+Life+That+Matters+%28English%2C+U&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"transpar3nt","files":-1,"time":1235170902,"description":"Success Built to Last: Creating a Life that Matters\nBy Jerry Porras, Stewart Emery, and Mark Thompson\n\nAudioBook\n6hrs 9mins\n\n128kbps\nGood voice quality, acceptable filesize for portable devices.\n\n-------------------------------------------------------\n\nPublisher's Summary\n(http://www.audible.com/adbl/site/products/ProductDetail.jsp?productID=BK_EXPT_000001&amp;BV_UseBVCookie=Yes)\n\nImagine discovering what successful people have in common, distilling it into a set of simple practices, and using them to transform your company, your career, and your life. Written by three thought leaders in organizational development and self-improvement, including Built to Last co-author Jerry Porras, Success Built to Last challenges conventional wisdom at every step. It draws on face-to-face, unscripted conversations with hundreds of remarkable human beings from around the world. Meet billionaires, CEOs, presidents of nations, Nobel laureates, and celebrities. Meet unsung heroes who've achieved lasting impact without obvious power or charisma. Famous or not, almost all started out ordinary.\n\nAbove all, discover why successful people stay successful and how you can too.\n# Why it's so damn hard to do what matters, and what you can do about it\n# See what you have in common with people who have impacted the world we live in, such as Nelson Mandela, Charles Schwab, and Maya Angelou\n# Learn how these enduringly successful people harvested their victories and failures, and found the courage to follow their passions\n\nThe audio edition of Success Built to Last includes a variety of bonus materials, including audio excerpts from interviews with former President Jimmy Carter, Senator John McCain, Dell Computers CEO Michael Dell, and writer Maya Angelou. Co-authors Jerry Porras, Stewart Emery, and Mark Thompson also give insight into the creation of, and the research behind, Success Built to Last.","torrent":{"xt":"urn:btih:b97453fb4d897c7f52a0a93e318f5123b922802a","amp;dn":"Success+Built+to+Last+-+Building+a+Life+That+Matters+%28English%2C+U","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b97453fb4d897c7f52a0a93e318f5123b922802a","infoHashBuffer":{"type":"Buffer","data":[185,116,83,251,77,137,124,127,82,160,169,62,49,143,81,35,185,34,128,42]},"announce":[],"urlList":[]}}