{"title":"Korn - Issues (1999) WMA320","uid":6264440,"size":184952358,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b97de9a15e05630fd88cc259d1810d030a6099f0&amp;dn=Korn+-+Issues+%281999%29+WMA320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"MARCELODRGZ","files":-1,"time":1300862057,"description":"Korn were always a popular band, but following the release of &quot;Follow the Leader&quot; in 1998, they really hit it big and crossed over into the mainstream. So maybe they wanted to strike while the iron was hot, but for some reason, Korn felt like they needed to follow up that album quickly with &quot;Issues,&quot; and release it the very next year. \n\nUnfortunately for them, 1999's &quot;Issues&quot; was Korn's first underrated album. &quot;Issues&quot; still went platinum, so it wasn't exactly &quot;a miss,&quot; but for whatever reason, some Korn fans didn't buy it. As of 1999, nu-metal was still very popular, so the collapse of that genre is not to blame. If anything, &quot;Issues&quot; didn't have enough nu-metal songs. It eliminated the hip-hop stylings which were present on &quot;Follow the Leader,&quot; and, since frontman Jonathan Davis plays bagpipes on this album, his Duran Duran influences are more apparent here than on other albums. \n\nBut &quot;Issues&quot; is also different for a variety of other reasons. First of all, its cover art was done by Korn fans, and there are four available covers for this one C.D.. Next, every other Korn album has a hidden track at the end, but &quot;Issues&quot; does not. The album closer, &quot;Dirty,&quot; just ends with the sound of static/white noise. (It's rumored that they pulled the hidden track at the last minute, before the album was released). Finally, and most importantly, this album has five short, &quot;interlude&quot; type of tracks. &quot;Dead,&quot; &quot;4 U&quot; (a song which has chimes and is almost a short ballad), &quot;It's Gonna Go Away,&quot; &quot;Am I Going Crazy,&quot; and &quot;Wish You Could Be Me&quot; are all very brief; they are 90 seconds or less. Now, this C.D. is 16 tracks long, so there are 11 full-length songs. Thus, I seriously doubt Korn had writer's block and just threw in those five tracks for filler. \n\nIt is possible that Korn released this album only a year after its predecessor because Jonathan Davis had a lot he wanted to talk about. Lyrically, much of this album was inspired by Davis' battle with substance abuse-particularly alcohol. Other recurring themes throughout these songs are death (as in &quot;Falling Away From Me&quot;), &quot;I'm dead inside&quot; feelings (which are especially apparent in the song &quot;Dead&quot;), and Korn's patented &quot;am I crazy?&quot; thoughts (i.e. in tracks five and seven). Track eight, &quot;Wake Up,&quot; however, is about apparent feuding amongst the band members, and JD wasn't happy about it. Elsewhere, &quot;Make Me Bad&quot; deals with Jonathan's obsession with sex (his feelings of constantly looking for a woman to have intercourse with), and &quot;Beg For Me&quot; is about performing live, on stage, in front of a crowd. \n\n&quot;Dead&quot; begins the album with an ascending bagpipe solo. Then Davis whispers &quot;All I want in life is to be happy,&quot; and a choir sings in the background. With a creepy beat/guitar noise and lyrics which are criminal and mentally disturbed, &quot;Trash&quot; is a common fan favorite, but &quot;Falling Away from Me&quot; is my personal favorite. It's incredibly catchy, and has big, speaker shredding guitars, and a mosh-pit-ready bridge. The other two singles, &quot;Somebody Someone&quot; and &quot;Make Me Bad,&quot; are both very catchy as well. &quot;Beg For Me&quot; has an irresistible chorus, and &quot;Hey Daddy&quot; has good vocal hooks. Next, the aforementioned &quot;Wake Up&quot; has very heavy choruses, with explosive riffs and blood pumping yells. And finally, &quot;Let's Get This Party Started&quot; is ironic because it has more dark lyrics and creepy vocals, but the song's chorus is very bouncy and energetic. \n\n\nNu-metal may not be popular anymore, but this is still a great album. It is, in my opinion, not their best album, but some Korn fans would argue it is, and it also has some of Korn's catchiest songs. &quot;Issues&quot; is definitely worth owning, so you should definitely buy it, but (as is the case, now-a-days, with all nu-metal albums) don't tell any of your friends.\n\nby A. Stutheit &quot;Teyad&quot;\n\nTRACKLIST:\nDisc 1:\n01 - Dead.wma                                          \n02 - Falling Away From Me.wma                          \n03 - Trash.wma                                         \n04 - 4 U.wma                                           \n05 - Beg For Me.wma                                    \n06 - Make Me Bad.wma                                   \n07 - It's Gonna Go Away.wma                            \n08 - Wake Up.wma                                       \n09 - Am I Going Crazy.wma                              \n10 - Hey Daddy.wma                                     \n11 - Somebody Someone.wma                              \n12 - No Way.wma                                        \n13 - Let's Get This Party Started.wma                  \n14 - Wish You Could Be Me.wma                          \n15 - Counting.wma                                      \n16 - Dirty.wma            \n\nDisc 2:\n01 - A.D.I.D.A.S. (Radio Mix).wma                      \n02 - Good God (Dub Pistols Mix).wma                    \n03 - Got The Life (Josh Abraham Remix).wma             \n04 - Twistchi (Live).wma                               \n05 - Jingle Balls.wma   \n\nWMA 320Kbps 44100Hz STEREO\n\nFollow Me On Facebook Pages: MarcelodrgzTPB","torrent":{"xt":"urn:btih:b97de9a15e05630fd88cc259d1810d030a6099f0","amp;dn":"Korn+-+Issues+%281999%29+WMA320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b97de9a15e05630fd88cc259d1810d030a6099f0","infoHashBuffer":{"type":"Buffer","data":[185,125,233,161,94,5,99,15,216,140,194,89,209,129,13,3,10,96,153,240]},"announce":[],"urlList":[]}}