{"title":"Divided &amp; United: The Songs of the Civil War [2013] [Compila","uid":9455504,"size":752380835,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba1f739f580da2af02b005df4bacb80a948b913c&amp;dn=Divided+%26amp%3B+United%3A+The+Songs+of+the+Civil+War+%5B2013%5D+%5BCompila&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":40,"time":1389262346,"description":"Artist: Various Artists\nRelease: Divided &amp; United: The Songs of the Civil War \nReleased: 2013\nLabel: ATO\nCatalog#: 218842\nFormat: FLAC / Lossless / Log (100%) / Cue\nCountry: USA\nStyle: FOLK\n\nimage\n\n\n\nDisc One\n\n1. Take Your Gun and Go, John - Loretta Lynn\n2. Lorena - Del McCoury\n3. Wildwood Flower - Sam Amidon\n4. Hell's Broke Loose In Georgia - Bryan Sutton\n5. Two Soldiers - Ricky Skaggs\n6. Marching Through Georgia - Old Crow Medicine Show\n7. Dear Old Flag - Vince Gill\n8. Just Before the Battle, Mother/ Farewell, Mother - Steve Earle and Dirk Powell\n9. The Fall Of Charleston - Shovels &amp; Rope\n10. Tenting on the Old Campground - John Doe\n11. Day Of Liberty - Carolina Chocolate Drops\n12. Richmond Is a Hard Road to Travel - Chris Thile and Michael Daves\n13. Two Brothers - Chris Stapleton\n14. The Faded Coat Of Blue - Norman Blake, Nancy Blake and James Bryan\n15. Listen to the Mockingbird - Stuart Duncan feat. Dolly Parton\n16. Kingdom Come - Pokey Lafarge\n\nDisc Two\n\n17. Rebel Soldier - Jamey Johnson\n18. The Legend of the Rebel Soldier - Lee Ann Womack\n19. The Mermaid Song - Jorma Kaukonen\n20. Dixie - Karen Elson with Secret Sisters\n21. The Vacant Chair - Ralph Stanley\n22. Hard Times - Chris Hillman\n23. Down By the Riverside - Taj Mahal\n24. Old Folks at Home/ The Girl I Left Behind Me - Noam Pikelny &amp; David Grisman\n25. Secesh - The Tennessee Mafia Jug Band\n26. The Battle of Antietam - T Bone Burnett\n27. Pretty Saro - Ashley Monroe\n28. Aura Lee - Joe Henry\n29. Johnny Has Gone for a Soldier - AA Bondy\n30. When Johnny Comes Marching Home - Angel Snow\n31. Battle Cry of Freedom - Bryan Sutton\n32. Beautiful Dreamer - Cowboy Jack Clement\n\n\n\n\n\nNearly 150 years after the Civil War ended, America is still both fascinated and haunted by the events that tore the country apart while defining a vision of this nation that in many respects stands to this day. Plenty of popular songs and stories have been written about the war and its impact, but fewer Americans are aware of just how many songs dealing with the conflict and its human consequences emerged between 1861 and 1865. Divided &amp; United: The Songs of the Civil War is an ambitious effort to study the songs of the era with fresh eyes and ears; here, 32 artists interpret popular songs from the Civil War years, some in styles that reflect the way they were performed in the 19th century and others appearing in arrangements that are radically contemporary. Randall Poster, who produced the project, has brought together an impressive variety of artists, ranging from living legends of country and folk (Loretta Lynn, Norman Blake, Dolly Parton, Del McCoury) to young upstarts of roots rock (the Carolina Chocolate Drops, Old Crow Medicine Show, Shovels &amp; Rope), and everyone on board delivers strong, thoughtful performances that respect the material not merely as history, but as music that remains compelling today, and this collection is frequently full of surprises. While the tone of these songs is often full of emotion, there's little sentimentality, as the stakes of life, death, and nation were clear in the minds of the people who wrote them -- the pull of home and family far outweighs politics in these tunes -- and hearing &quot;Just Before the Battle, Mother,&quot; &quot;When Johnny Comes Marching Home,&quot; and &quot;Dixie&quot; sung in full, rather than the fragments that are usually performed today, is a reminder of how familiar America had become with many kinds of loss during the war years. Even songs that outwardly have little or nothing to do with war serve as potent examples of how different popular song is today, as &quot;Listen to the Mockingbird&quot; and &quot;The Mermaid Song&quot; spin tales as deep and full of wonder as a good short story. And this set is simply full of great performances, with nearly everyone on board making this material sound vital and timeless, from Dr. Ralph Stanley (who was born in 1927, only 62 years after the end of the war, a time when more than a few men who fought in the war were still around to tell their tales, and sings &quot;The Vacant Chair&quot; like he clearly remembers those stories) to A.A. Bondy (whose electronic spin on &quot;Johnny Has Gone for a Soldier&quot; makes the lyrics sound painfully relevant in the 21st century). Divided &amp; United is vital listening for anyone interested in the history of pop music or the United States, and it satisfies as both education and entertainment....","torrent":{"xt":"urn:btih:ba1f739f580da2af02b005df4bacb80a948b913c","amp;dn":"Divided+%26amp%3B+United%3A+The+Songs+of+the+Civil+War+%5B2013%5D+%5BCompila","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba1f739f580da2af02b005df4bacb80a948b913c","infoHashBuffer":{"type":"Buffer","data":[186,31,115,159,88,13,162,175,2,176,5,223,75,172,184,10,148,139,145,60]},"announce":[],"urlList":[]}}