{"title":"City and Colour - The Hurry and the Harm (2013) [FLAC]","uid":8497824,"size":353947985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ba28d8bee071b4bf3acf6ac25a1cf745b38bd6d9&amp;dn=City+and+Colour+-+The+Hurry+and+the+Harm+%282013%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"politux","files":-1,"time":1369185046,"description":"\nCity and Colour was the solo acoustic project of Dallas Green, best known as the singer/guitarist for the Canadian post-hardcore band Alexisonfire. Born September 29, 1980, in St. Catharines, Ontario, Green served as a member of Helicon Blue before co-founding Alexisonfire in late 2001. Despite scant radio airplay, the band developed a strong fan following on the strength of their ferocious live shows, and their 2004 sophomore LP, Watch Out!, debuted in the Canadian Top Ten. At year's end Green issued the first City and Colour EP, The Death of Me, selling copies at his earliest solo shows. The full-length Sometimes followed in late 2005. Green supported the album with a Canadian tour and a sold-out string of gigs in the UK the same year. Sometimes was certified Platinum in 2006 and won a Juno in 2007 for Alternative Album of the Year. In March 2007, City and Colour released City and Colour Live. The following year saw the release of Bring Me Your Love, Green's second solo album, which featured appearances from Gordon Downie of the Tragically Hip and Romano and Spencer Burton of Attack in Black. Little Hell was scheduled for release in 2011.\n","torrent":{"xt":"urn:btih:ba28d8bee071b4bf3acf6ac25a1cf745b38bd6d9","amp;dn":"City+and+Colour+-+The+Hurry+and+the+Harm+%282013%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba28d8bee071b4bf3acf6ac25a1cf745b38bd6d9","infoHashBuffer":{"type":"Buffer","data":[186,40,216,190,224,113,180,191,58,207,106,194,90,28,247,69,179,139,214,217]},"announce":[],"urlList":[]}}