{"title":"Sunshine State of Mind - Various Artists","uid":8542595,"size":177426323,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ba71f9ea2d6e0b291d8c12e723f422a7605cdf50&amp;dn=Sunshine+State+of+Mind+-+Various+Artists&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fiveofseven","files":13,"time":1370438650,"description":"Something my circle of friends listened to back in the day and still do when the mood hits. I personally felt it compliments The Crystal Method Vegas album which we also listened to. Here are some reviews found on line...\n\n\nI used to own this album many years ago. I got it right after it had come out. Someone stole it, it was that good. Found it online and had to have it again.\n\n\nAlthough I currently reside in S. California, I was once a fairly hip young adult on the west coast of Florida. A friend of mine played a few tracks from this 'Sunshine State of Mind' CD in his car crossing the &quot;Sunshine Bridge&quot; near Sarasota and -- once I heard it -- I was stunned to learn that it was put together by local FL musicians. This is simply an AMAZING compilation. Now, all of these many years later, it takes me back there to those hot, sultry, rain-soaked, lightening-filled nights... Drug-use TOTALLY optional -- this is a disc you can spin just to feel the heat of summer. Road trip music, yes of course; but making LOVE to these tracks will not soon be forgotten, I can assure you of that.\n\n\nThis a great compilation of old school Miami Bass Breakbeat. I love this cd but must warn all interested that it is not mixed. I try not to buy albums that just contain tracks but this one is worth it. You're never going to find it at the local record store so break down and buy it NOW sucka. \n\n\nI've borrowed this CD from a friend (more than once) and had a hard time giving it back every time. This CD is a perfect example of the music found at the clubs and raves of Florida's (Sunshine State) scene. I've got many many techno/electronica CDs as it's my music genre of choice, and this would be one of the top 10 (once I buy it. :) If you're new to techno or a &quot;back-in-the-day-old-skool&quot; raver, you've got to pick this up.. All tracks are great. Enjoy! \n\n\nDespite having heard many many dance, techno, and elektronika artists, this CD is the most perfect example of true music that I have ever heard. Whoever made this CD knows what WE like and knows how to put it into a fine compilation. I recomment this one to all.\n\n\n320 bit rate MP3\n\nTrack listing\n\n 1. The Air Is Full Of Sound - DJ Icey\n 2. Puff The Magic - Q-Burn's Abstract Message\n 3. Look To The Future - Dynamix II\n 4. Floori.d.a. - Rabbit In The Moon\n 5. Step Into My Dream - Friction &amp; Spice\n 6. The Forest (Fade's Green Leaf Mix) - Nu Tribe\n 7. Eyes Half Shut - M-5\n 8. Rain (97 Remix) - Mot\n 9. Disillusion - Rainbow Bridge\n10. Alpha - Nubious\n11. You Hear Me Talkin' - AK1200\n12. Balloon To The Moon - Pimp Daddy Nash ","torrent":{"xt":"urn:btih:ba71f9ea2d6e0b291d8c12e723f422a7605cdf50","amp;dn":"Sunshine+State+of+Mind+-+Various+Artists","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba71f9ea2d6e0b291d8c12e723f422a7605cdf50","infoHashBuffer":{"type":"Buffer","data":[186,113,249,234,45,110,11,41,29,140,18,231,35,244,34,167,96,92,223,80]},"announce":[],"urlList":[]}}