{"title":"Miranda Lambert-The House That Built Me (Xvid-2nafish) 1080p","uid":5504651,"size":130965684,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bab88cac7490ccb30bddd951e47251b4dc94a626&amp;dn=Miranda+Lambert-The+House+That+Built+Me+%28Xvid-2nafish%29+1080p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"2nafish","files":-1,"time":1271745180,"description":"File Info:\n\nValid : Yes [AVI]\nDuration : 00:04:11\n\n[Video]\nResolution : 1920x1080\nCodec : XviD MPEG-4 codec\nFPS : 23.98\nBitRate : 3842 Kbps\nQuality Factor : 0.08 b/px\n\n[Audio]\nCodec : MPEG 1 or 2 Audio Layer 3 (MP3)\nNumber of channels : 2\nSample Rate : 48000 Hz\nBitRate : 320 Kbps\n\n\nThis video has no logos or titles.\n\n\n&quot;The House That Built Me&quot; is the title of a song written by Tom Douglas and Allen Shamblin, and recorded by American country  artist Miranda Lambert. It was released in March 2010 as the third single from her third studio album, Revolution. It is the fastest-rising single of her career, reaching the Top 20 in its eighth week.\n\nLambert will open the 2010 ACM Awards with a performance of &quot;The House That Built Me.&quot;\n\nThe music video, which was directed by Trey Fanjoy, premiered on CMT on April 8, 2010. In the video, Lambert's tour bus pulls up to her childhood home, and she walks up to the front door to ask if she could come in. Inside the house, she wanders through the various rooms, while flashbacks of herself as a child among her family are mixed in. Throughout the video, Lambert is shown performing with her acoustic guitar, seated on the floor in one of the bedrooms. Some of the footage used for the flashbacks consists of Lambert's own home videos.\n\nRevolution is the third studio album by American  country music singer Miranda Lambert. The album was released on September 29, 2009 via Columbia Nashville. The album includes the singles &quot;Dead Flowers&quot; and &quot;White Liar,&quot; both of which have charted on the U.S. Billboard country chart.\n\nMatt Bjorke described the song favorably in his review of Revolution, referring it as &quot;one of the absolute best songs on the record.&quot; He notes that while it could've been &quot;a bombastic, overdone song,&quot; Lambert and her producers kept it &quot;earthy and just downright beautiful.&quot; Bjorke later reviewed the single itself, describing it as a &quot;song that plays on the country clichÃƒÂ© of nostalgia without ever feeling clichÃƒÂ©&quot; and concluded that it stands a good chance of nomination in the 2010 CMA Awards. Blake Boldt of The 9513 gave the song a thumbs up, favoring Lambert's preference in &quot;organic storytelling instead of contrived commercial jingles.&quot; He described the song itself as &quot;a gorgeous piece of melancholy country without getting squishy or sentimental&quot; and called it an &quot;early favorite for single of the year.&quot; Dan Milliken of Country Universe gave the song an A rating, describing it favorably as &quot;the best on the album&quot; and a standout for radio, because of &quot;its grace and intelligence, not because it happens to be more disposably catchy than the others surrounding it.&quot;\n\n&quot;The House That Built Me&quot; was ranked #1 on The 9513's Best Country Songs of 2009 and won the award for Song of the Year in their second annual country music awards.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:bab88cac7490ccb30bddd951e47251b4dc94a626","amp;dn":"Miranda+Lambert-The+House+That+Built+Me+%28Xvid-2nafish%29+1080p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bab88cac7490ccb30bddd951e47251b4dc94a626","infoHashBuffer":{"type":"Buffer","data":[186,184,140,172,116,144,204,179,11,221,217,81,228,114,81,180,220,148,166,38]},"announce":[],"urlList":[]}}