{"title":"C J. Sansom - Mist over Londen. NL Ebook. DMT","uid":9494946,"size":1916698,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:baf8839af747c22563d9c40705f2647df0206efb&amp;dn=C+J.+Sansom+-+Mist+over+Londen.+NL+Ebook.+DMT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BiWild","files":-1,"time":1390078093,"description":"C J. Sansom - Mist over Londen. NL Ebook. DMT\n\nAfbeelding\n\nAuteur: C J. Sansom \nPagina's: 578\nTaal: Dutch/Nederlands\nUitgever: Eburon Uitgeverij\nJaar van uitgifte: 2013\nGenre: Thriller\n\nSamenvating\n\nWat zou er gebeurd zijn als Engeland had gecapituleerd in 1940... Londen, 1952. De stad ligt verscholen onder een dikke mist. \nEr zijn twaalf jaar verstreken sinds Engeland zich heeft overgegeven aan Duitsland en de bevolking leeft onder de bezetting. \nTerwijl in het oosten van Europa de oorlog tegen de Russen voortduurt, zucht de Britse bevolking onder de nazi veiligheidstroepen, \nworden pers en radio strikt gecensureerd en ziet men met lede ogen aan hoe de Britse Joden steeds meer beperkingen worden \nopgelegd. Er doen beangstigende geruchten de ronde over wat er gebeurt in de Duitse ambassade in Londen. Maar de weerstand \ntegen de overheersing groeit. Churchills verzetsgroep is steeds meer een doorn in het oog van de regering. Ook ambtenaar \nDavid Fitzgerald besluit bij het verzet te gaan. David wordt ingezet om contact te leggen met Frank Muncaster, een oude studievriend \nvan hem. Frank is gedwongen opgenomen in een gesloten inrichting in Birmingham. Hij beschikt over informatie die de wereld voor altijd \nzal kunnen veranderen en David krijgt de taak om Frank het land uit te krijgen. Al snel raakt hij verstrikt in een web van spionage \nen intrige, want niet alleen de verzetsgroep weet van Franks geheim, ook de Gestapo is hem op het spoor... \nWie kan David vertrouwen en zal hij zijn eigen verleden verborgen kunnen houden?\n\nMet dank aan de originele poster !! \n\n\nDeze review wordt u aangeboden door\n\nDUTCH MOVIE THEATER","torrent":{"xt":"urn:btih:baf8839af747c22563d9c40705f2647df0206efb","amp;dn":"C+J.+Sansom+-+Mist+over+Londen.+NL+Ebook.+DMT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"baf8839af747c22563d9c40705f2647df0206efb","infoHashBuffer":{"type":"Buffer","data":[186,248,131,154,247,71,194,37,99,217,196,7,5,242,100,125,240,32,110,251]},"announce":[],"urlList":[]}}