{"title":"Bright, Precious Days - Jay McInerney","uid":15519092,"size":1661154,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:bbed746121e44851bb29bc50050f1ceb70ef217a&amp;dn=Bright%2C+Precious+Days+-+Jay+McInerney&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mr_mando","files":2,"time":1470725118,"description":"From the best-selling author of Bright Lights, Big City: a sexy, vibrant, cross-generational New York story--a literary and commercial triumph of the highest order.  \r\n\r\nEven decades after their arrival, Corrine and Russell Calloway still feel as if they’re living the dream that drew them to New York City in the first place: book parties or art openings one night and high-society events the next; jobs they care about (and in fact love); twin children whose birth was truly miraculous; a loft in TriBeCa and summers in the Hamptons. But all of this comes at a fiendish cost. Russell, an independent publisher, has superb cultural credentials yet minimal cash flow; as he navigates a business that requires, beyond astute literary judgment, constant financial improvisation, he encounters an audacious, potentially game-changing—or ruinous—opportunity. Meanwhile, instead of chasing personal gain in this incredibly wealthy city, Corrine devotes herself to helping feed its hungry poor, and she and her husband soon discover they’re being priced out of the newly fashionable neighborhood they’ve called home for most of their adult lives, with their son and daughter caught in the balance.\r\n\r\nThen Corrine’s world is turned upside down when the man with whom she’d had an ill-fated affair in the wake of 9/11 suddenly reappears. As the novel unfolds across a period of stupendous change—including Obama’s historic election and the global economic collapse he inherited—the Calloways will find themselves and their marriage tested more severely than they ever could have imagined","torrent":{"xt":"urn:btih:bbed746121e44851bb29bc50050f1ceb70ef217a","amp;dn":"Bright%2C+Precious+Days+-+Jay+McInerney","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbed746121e44851bb29bc50050f1ceb70ef217a","infoHashBuffer":{"type":"Buffer","data":[187,237,116,97,33,228,72,81,187,41,188,80,5,15,28,235,112,239,33,122]},"announce":[],"urlList":[]}}