{"title":"Historias Minimas [2002]DVDrip.Spanish.latino[DXO]","uid":4870805,"size":732557312,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc1b7380955211bcd8b974f765740847fbd4964e&amp;dn=Historias+Minimas+%5B2002%5DDVDrip.Spanish.latino%5BDXO%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"DeliXiosO","files":1,"time":1240793471,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0291988/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0291988/&lt;/a&gt;\n\nA miles de kilÃƒÂ³metros al sur de Buenos Aires, tres personajes viajan por las solitarias rutas de la patagonia austral. Don Justo, 80 aÃƒÂ±os, dueÃƒÂ±o retirado de un bar de carretera que ahora regenta su hijo, se ha escapado de la tutela de ÃƒÂ©ste para buscar a su perro que ha desparecido hace un tiempo y al que alguien dice haber visto en San Julian. Hace el viaje haciendo auto-stop confiando que los camioneros, a quienes conoce desde hace tantos aÃƒÂ±os, lo irÃƒÂ¡n acercando.\nA medida que avanza al encuentro con su perro, don Justo va dando datos que nos hacen sospechar que algo raro sucediÃƒÂ³. Finalmente descubrimos, que mas allÃƒÂ¡ de encontrar al perro, lo importante para ÃƒÂ©l es cerrar ciertos capÃƒÂ­Ã‚Â­tulos aÃƒÂºn pendientes en su vida y poder enfrentar en paz a la muerte, cuando esta llegue. Roberto, 40 aÃƒÂ±os, viajante de comercio, hace el mismo viaje en su viejo coche, llevando un incÃƒÂ³modo cargamento: una tarta de crema encargada especialmente para el cumpleaÃƒÂ±os del hijo de una mujer joven, viuda reciente de uno de sus clientes en la zona. El plan de Roberto, siguiendo tÃƒÂ©cnicas que aprendiÃƒÂ³ en los libros de venta que ÃƒÂ©l suele leer, es llegar de imprevisto a la casa de la viuda, presentarse con la inesperada tarta de cumpleaÃƒÂ±os, impresionarla favorablemente, y asegurarse un ÃƒÂ©xito rotundo cuando le confiese sus intenciones de formar con ella una pareja estable. Ese mismo dÃƒÂ­Ã‚Â­a y por la misma ruta viaja MarÃƒÂ­Ã‚Â­a Flores, 25 aÃƒÂ±os, con su pequeÃƒÂ±a hija. Lo hace en trasporte pÃƒÂºblico. Es una mujer muy humilde, que se ha enterado que ha resultado ganadora en el sorteo de un programa de TV, cuyo premio mayor es un robot de cocina. Aunque no sabe bien de quÃƒÂ© se trata y vive de prestado sin tener dinero ni para comer, MarÃƒÂ­Ã‚Â­a decide emprender el viaje hacia el lejano y fascisnante mundo de la televisiÃƒÂ³n. Cada uno viaja por su cuenta pero como sucede en las desÃƒÂ©rticas rutas patagÃƒÂ³nicas, sus historias y sus ilusiones se entrecruzan en los escasos paradores\nDatos Pelicula:\nDirector: Carlos SorÃƒÂ­Ã‚Â­n.\nActores: Javier Lombardo , Antonio Benedectis, Javiera Bravo.\nIdioma: EspaÃƒÂ±ol.\nPaÃƒÂ­Ã‚Â­s: Argentina/EspaÃƒÂ±a.\nGÃƒÂ©nero: Drama/Comedia.\nTiempo: 94 Minutos.","torrent":{"xt":"urn:btih:bc1b7380955211bcd8b974f765740847fbd4964e","amp;dn":"Historias+Minimas+%5B2002%5DDVDrip.Spanish.latino%5BDXO%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc1b7380955211bcd8b974f765740847fbd4964e","infoHashBuffer":{"type":"Buffer","data":[188,27,115,128,149,82,17,188,216,185,116,247,101,116,8,71,251,212,150,78]},"announce":[],"urlList":[]}}