{"title":"Sonny Rollins This Is What I Do(jazz)(mp3@320)[rogercc]","uid":6351773,"size":116370772,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bc5715dc2851f3e10743768d37933e2b93c6a5cb&amp;dn=Sonny+Rollins+This+Is+What+I+Do%28jazz%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rogercc1","files":7,"time":1304023431,"description":"SONNY  ROLLINS THIS IS WHAT I DO \nYear Of Release: 2000\nLabel: Milestone Records\nGenre: Jazz\nFormat: MP3@320kbps\n\n\nTHIS IS WHAT I DO won the 2002 Grammy Award for Best Jazz Instrumental Album, Individual Or Group.\n\nWhen it comes to picking material, today's young hard boppers (both instrumentalists and singers) could learn a lot from Sonny Rollins -- a tenor titan who has always had a way of surprising us with interesting, unexpected choices. Over the years, he hasn't made the mistake of limiting himself to overdone Gershwin and Cole Porter favorites; Rollins doesn't exclude well-known standards by any means, but he has also made a point of interpreting a lot of material that other hard boppers have ignored (and that has included everything from forgotten show tunes to Stevie Wonder gems). True to form, the saxman continues to make interesting choices on This Is What I Do, which was recorded in 2000 and finds a 69-year-old Rollins joined by Clifford Anderson on trombone, Stephen Scott on acoustic piano, Jack DeJohnette or Perry Wilson on drums, and long-time companion Bob Cranshaw on electric bass. The CD's only real standard is the ballad &quot;A Nightingale Sang in Berkeley Square&quot; -- the other selections range from Rollins originals (which include the funky, playful &quot;Did You See Harold Vick?&quot; and the calypso-minded &quot;Salvador&quot;) to forgotten songs from 1937 movies. &quot;Sweet Leilani&quot; (which the seminal Bing Crosby defined) is from the film Waikiki Wedding, while &quot;The Moon of Manakoora&quot; is from The Hurricane (which starred Dorothy Lamour). Neither are tunes that have been done to death by hard boppers, and Rollins has no problem showing us that they can be relevant to jazz. This Is What I Do falls short of essential, but it offers some nice surprises and is a rewarding addition to Rollins' huge catalog. ~ Alex Henderson\n\nRecorded at Clinton Recording Studios, New York, New York on May 8 &amp; 9 and July 29, 2000.\n\nTracklist\n1. Salvador (Sonny Rollins) 7:52\n2. Sweet Leilani (Harry Owens) 7:01\n3. Did You See Harold Vick? (Sonny Rollins) 9:19\n4. A Nightingale Sang in Berkeley Square (Eric Maschwitz/Manning Sherwin) 8:06\n5. Charles M. (Sonny Rollins) 10:16\n6. The Moon of Manakoora (Frank Loesser/Alfred Newman) 5:45\n\n\nPersonnel:\nSonny Rollins (Tenor Saxophone)\nStephen Scott (Piano)\nBob Cranshaw (Bass Guitar)\nJack DeJohnette (Drums) - 1,2,4,6\nClifton Anderson (Trombone) - 2-5\nPerry Wilson (Drums) - 3,5 \n\n","torrent":{"xt":"urn:btih:bc5715dc2851f3e10743768d37933e2b93c6a5cb","amp;dn":"Sonny+Rollins+This+Is+What+I+Do%28jazz%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc5715dc2851f3e10743768d37933e2b93c6a5cb","infoHashBuffer":{"type":"Buffer","data":[188,87,21,220,40,81,243,225,7,67,118,141,55,147,62,43,147,198,165,203]},"announce":[],"urlList":[]}}