{"title":"Spider-Man/Human Torch 01-05 (2011|Digital|Kingpin-Emp)","uid":9555307,"size":110120293,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:bc618e0d5725ce521def69e47535c61f163a944d&amp;dn=Spider-Man%2FHuman+Torch+01-05+%282011%7CDigital%7CKingpin-Emp%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"VikTSlick","files":-1,"time":1391355167,"description":"Current Spider-Man scribe Dan Slott tackles this wonderful miniseries that explores the sometimes-contentious relationship between Johnny Storm and Peter Parker. The story takes place over the various eras, and it's fun to see callbacks to classic Spidey and Fantastic Four objects and tropes (the Spider-Car, anyone?). Along the way, we learn a lot about what these two think of each other early on, and how their mutual respect and friendship grows later on. Specifically, the seen after the Torch learns Spider-Man's identity and confesses to being jealous of Peter Parker over the years (and Parker's subsequent incredulous reaction) are handled really well, and make you appreciate and care for these characters in a deeper, more meaningful way. Slott's story is terrific, but Ty Templeton's work really shines here - he recreates all eras faithfully while adding many easter eggs and somehow maintaining a modern approach to the art. If you are a fan of either hero, this is a can't-miss Limited Series that you absolutely have to read! Thanks to Kingpin-Empire for these pristine digital copies - please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:bc618e0d5725ce521def69e47535c61f163a944d","amp;dn":"Spider-Man%2FHuman+Torch+01-05+%282011%7CDigital%7CKingpin-Emp%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc618e0d5725ce521def69e47535c61f163a944d","infoHashBuffer":{"type":"Buffer","data":[188,97,142,13,87,37,206,82,29,239,105,228,117,53,198,31,22,58,148,77]},"announce":[],"urlList":[]}}