{"title":"VMware-vShield-Manager-5.5.0a-1473628.ova","uid":9690460,"size":1454469120,"categoryP":"applications","categoryS":"other_os","magnet":"?xt=urn:btih:bd635dbf3b69c2ab6f83575ee321a1ab49f22e18&amp;dn=VMware-vShield-Manager-5.5.0a-1473628.ova&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1393852467,"description":"What's New\n\n    VXLAN gateway: vShield Edge functions as a VXLAN gateway mapping VXLAN logical networks to traditional VLAN networks.\n    Multi-interface support: Allows for multiple internal and external interfaces on a single vShield Edge virtual machine.\n    Secondary IP Pools: Allows for non contiguous IP block assignment to a vShield Edge interface useful for extending IP namespaces.\n    Load Balancing enhancements: vShield Edge supports HTTPS and TCP load balancing along with improved health check options.\n    DNS Relay: vShield Edge can be configured to act as a forwarding DNS server providing DNS name resolution of external domain names for applications. The requests of the client application are forwarded directly to the ISP's DNS server and cache the response from ISP's DNS.\n    SSL VPN-Plus: Remote users can access private corporate applications using this feature.\n    vShield Edge High Availability: You can create two vShield Edge virtual machines in active-passive configuration allowing stateful failover to achieve device level resilience and increase service availability.\n    New vShield Edge CLI Commands: Allows for configuration, feature and system information, logging, and troubleshooting. SSH CLI and Role Based Access Control are also supported.\n    vShield Edge available at different performance levels: Compact and Large sizes allow you to choose the performance level.\n    Enhanced vShield Edge Logging: Offers easier troubleshooting.\n    Hardware offloads: vShield Edge can take advantage of hardware acceleration on Intel Westmere chips to offload AES cryptographic processing.\n    Service Insertion framework: Offers the ability to insert network services (such as WAN optimization, application delivery, advanced load balancing, etc) and network security services (such as advanced firewalling, intrusion prevention, etc.) from any vendor into a virtualized environment.\n    New vShield App and vShield Edge firewall UI: Simplified UI offers easier rule manipulation.\n        New firewall rule table view.\n        Ability to add multiple objects as source and destination, thus reducing the total numbler of rules you need to create.\n        Pre populated objects from vCenter containers and Tier 1 Application service groups for easy rule creation.\n        Rule management simplified through icon driven wizards for adding and editing rules, new reordering options, option to selectively enable rules etc.\n        Easier object manipulation with new ways to group, search and select objects for rules.\n        Actionable flow monitoring and graphical insight to traffic patterns.","torrent":{"xt":"urn:btih:bd635dbf3b69c2ab6f83575ee321a1ab49f22e18","amp;dn":"VMware-vShield-Manager-5.5.0a-1473628.ova","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd635dbf3b69c2ab6f83575ee321a1ab49f22e18","infoHashBuffer":{"type":"Buffer","data":[189,99,93,191,59,105,194,171,111,131,87,94,227,33,161,171,73,242,46,24]},"announce":[],"urlList":[]}}