{"title":"PHIL PERRY - SAY YES 2013","uid":8381069,"size":67123063,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bda8f2c7336f1697990aab330fcb18707505a228&amp;dn=PHIL+PERRY+-+SAY+YES+2013&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"SAMSON4X","files":25,"time":1366165941,"description":"What can be said about this man's voice but EXCELLENCE. Here Phil Perry is back again with a stunning album of remakes featuring that multi range voice of his mixed in with his St Louis style and a dash of Cayenne to make it all good.\n\nOnce again the man Downbeat Magazine once referred to as &quot;The Pavarotti of Jazz,&quot; has released a timeless collection of classics and originals that will continue building his legacy as one of America's premier soul crooners. Phil Perry's SAY YES seamlessly moves from old school icon Sam Cooke's &quot;You Send Me,&quot; the first radio single, through to a stunning Gospel take on Simon &amp; Garfunkel's immortal &quot;Bridge Over Troubled Water,&quot; breathing new life and a fresh vibe into the covers as well as introducing us to new songs that could likely end up being new classics themselves with a contemporary spin offering cool beats and production wizardry courtesy of Chris &quot;Big Dog&quot; Davis along with help from Najee and Chante Moore, SAY YES is a more than satisfying listen from beginning to end. If you're a fan of classic R&amp;B, Soul and Smooth Jazz, then there is no question about it... you'll definitely SAY YES to Phil Perry's latest! \n","torrent":{"xt":"urn:btih:bda8f2c7336f1697990aab330fcb18707505a228","amp;dn":"PHIL+PERRY+-+SAY+YES+2013","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda8f2c7336f1697990aab330fcb18707505a228","infoHashBuffer":{"type":"Buffer","data":[189,168,242,199,51,111,22,151,153,10,171,51,15,203,24,112,117,5,162,40]},"announce":[],"urlList":[]}}