{"title":"Pier Solar and the Great Architects HD-SKIDROW","uid":11198092,"size":2138502048,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bdd304597fbf9427929b797dc264068dd53c6261&amp;dn=Pier+Solar+and+the+Great+Architects+HD-SKIDROW&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Tenguken","files":-1,"time":1413128518,"description":"S  K  I  D  R  O  W\n.the leading force.\n\nproudly presents\nPier Solar and the Great Architects - HD (c)  WaterMelon\n\n10-10-2014......Release Date &lt;-&gt; Protection.................Steam\nRPG................Game Type &lt;-&gt; Disk(s)....................1 DVD\n\nRELEASE NOTES\n\nBeing a turn-based RPG with state-of-the-art aesthetics, Pier Solar is\na story-based RPG about the journey of three young heroes from the town\nof Reja. In this prospered and peaceful town there live three best\nfriends: Hoston, Alina and Edessot. Young and curious, they want to go\non a herb-seeking quest to help cure Hoston's father's mysterious\nillness. Little do they know ... it will be the beginning of their\nlifetime journey where they will learn the true meaning of friendship\nand the thrill of adventure.\n\nThis journey will demand their courage and wisdom to solve a long-lost\nmystery while they face the forces of destruction dispatched by an evil\nman who is trying to change the world for his own good. Through this\nescapade, they will be reborn as great heroes to protect the universe\nfrom a mistaken purpose..\n\nWhat makes Pier Solar so special?\n\nPier Solar was originally designed and developed for the SEGA Mega Drive\nand SEGA Genesis. Yes, you read that right!! It was actually the only\nnewly developed game for SEGA's 16-bit system in the new millennium.\nIt's not a port, fan translation, or a copy of any other game.\nPier Solar is a 100% brand new, entirely original,16-bit RPG.\n\nWe'll get right in to what we think makes Pier Solar so special:\n\nA 100% Original RPG! Pier Solar was developed from the ground up. An\noriginal world, storyline, soundtrack, characters, enemies, and battle\nstyle. No ports, translations or copying from any other game - it's all\nfresh! The first original 16-bit RPG to do this in over a decade!\n\nA Massive World to Explore! Pier Solar has 50+ hours of gameplay, over\n300 locations, nearly 500 unique treasure chests, and over 800 NPCs!\n\nDirector's cut! Pier Solar expands what was the biggest 16-bit RPG Ever!\nWe released Pier Solar on a custom 64MEG cartridge (the average SEGA\nMega Drive/Genesis game size is 12MEG), making it the biggest 16-bit\nRPG ever!\nThis allowed us to push the 16-bit medium to a precedent setting level,\nwith state-of-the-art aesthetics and things like full-screen cut scenes\nbackground scaling and 3D modes. But Pier Solar HD is more than just a\nport, the game is getting a Director's cut, and includes an expanded\nstory with new locations and challenges, that couldn't fit on its\noriginal Sega Genesis/Mega Drive release.\n\nEpic Battle Tactics! We developed an innovative battle system that puts\nyou in control of up to five characters and includes in-depth strategic\nmoves such as counter-attacks and a special strategy called Gather,\nwhich stores energy to unleash even more powerful moves and spells!\n\nTranslated in 6 Languages! Pier Solar is translated in 6 languages:\nEnglish, Japanese, Spanish, Portuguese, French, and German.\n\nAn Original Soundtrack! A beautiful soundtrack written just for Pier\nSolar that embodies everything great about a classic retro soundtrack!\n\nThere Are Surprises! We also packed-in many other surprises and secrets\nlike hidden areas and mini-games!\n\nPier Solar truly is a love letter to the rich, imaginative 16-bit RPGs\nof a bygone era. We crafted Pier Solar in the same light - with an\nauthentic adventure, that resonates deeply about life, death, love,\nfamily, and friendship. Remember the wonder you felt when immersed into\nyour favorite retro RPG? Pier Solar captures that same wonder.\n\nINSTALL NOTES\n\n1. Unpack the release\n2. Mount or burn image\n3. Install\n4. Copy everything from the SKIDROW folder into the game installation\n5. Block the game in your firewall and mark our cracked content as\nsecure/trusted in your antivirus program\n6. Play the game\n7. Support the companies, which software you actually enjoy!","torrent":{"xt":"urn:btih:bdd304597fbf9427929b797dc264068dd53c6261","amp;dn":"Pier+Solar+and+the+Great+Architects+HD-SKIDROW","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bdd304597fbf9427929b797dc264068dd53c6261","infoHashBuffer":{"type":"Buffer","data":[189,211,4,89,127,191,148,39,146,155,121,125,194,100,6,141,213,60,98,97]},"announce":[],"urlList":[]}}