{"title":"Carbon Nanotubes - Basic Concepts and Physical Properties","uid":15340648,"size":6625986,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be3c7e984b97b2bb5b9019336d69003bf3e5efc6&amp;dn=Carbon+Nanotubes+-+Basic+Concepts+and+Physical+Properties&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1468833421,"description":"Carbon Nanotubes - Basic Concepts and Physical Properties - S. Reich et al. (Wiley-VCH, 2004).pdf\r\n\r\nISBN 3-527-40386-8\r\n\r\nCarbon nanotubes are exceptionally interesting from a fundamental research point of view. Many concepts of one-dimensional physics have been verified experimentally such as electron and phonon confinement or the one-dimensional singularities in the density of states; other 1D signatures are still under debate, such as Luttinger-liquid behavior. Carbon nanotubes are chemically stable, mechanically very strong, and conduct electricity. For this reason, they open up new perspectives for various applications, such as nano-transistors in circuits, field-emission displays, artificial muscles, or added reinforcements in alloys.\r\n\r\nThis text is an introduction to the physical concepts needed for investigating carbon nanotubes and other one-dimensional solid-state systems. Written for a wide scientific readership, each chapter consists of an instructive approach to the topic and sustainable ideas for solutions. The former is generally comprehensible for physicists and chemists, while the latter enable the reader to work towards the state of the art in that area. The book gives for the first time a combined theoretical and experimental description of topics like luminescence of carbon nanotubes, Raman scattering, or transport measurements. The theoretical concepts discussed range from the tight-binding approximation, which can be followed by pencil and paper, to first-principles simulations. We emphasize a comprehensive theoretical and experimental understanding of carbon nanotubes including\r\n\r\n- general concepts for one-dimensional systems\r\n- an introduction to the symmetry of nanotubes\r\n- textbook models of nanotubes as narrow cylinders\r\n- a combination of ab-initio calculations and experiments\r\n- luminescence excitation spectroscopy linked to Raman spectroscopy\r\n- an introduction to the 1D-transport properties of nanotubes\r\n- effects of bundling on the electronic and vibrational properties and\r\n- resonance Raman scattering in nanotubes","torrent":{"xt":"urn:btih:be3c7e984b97b2bb5b9019336d69003bf3e5efc6","amp;dn":"Carbon+Nanotubes+-+Basic+Concepts+and+Physical+Properties","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be3c7e984b97b2bb5b9019336d69003bf3e5efc6","infoHashBuffer":{"type":"Buffer","data":[190,60,126,152,75,151,178,187,91,144,25,51,109,105,0,59,243,229,239,198]},"announce":[],"urlList":[]}}