{"title":"VPNs  Illustrated","uid":8027032,"size":5662722,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:be5c3dd4270c288750196459277cac798582f349&amp;dn=VPNs++Illustrated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"d347hBy73","files":-1,"time":1358333070,"description":"VPNs Illustrated: Tunnels, VPNs, and IPsec\n\nPublication Date: November 5, 2005 | ISBN-10: 032124544X | ISBN-13: 978-0321245441 | Edition: 1 |Format: CHM\n\nVirtual private networks (VPNs) based on the Internet instead of the traditional leased lines offer organizations of all sizes the promise of a low-cost, secure electronic network. However, using the Internet to carry sensitive information can present serious privacy and security problems. By explaining how VPNs actually work, networking expert Jon Snader shows software engineers and network administrators how to use tunneling, authentication, and encryption to create safe, effective VPNs for any environment.\n\nUsing an example-driven approach, VPNs Illustrated explores how tunnels and VPNs function by observing their behavior on the wire. By learning to read and interpret various network traces, such as those produced by tcpdump, readers will be able to better understand and troubleshoot VPN and network behavior.\n\nSpecific topics covered include:\n\nBlock and stream symmetric ciphers, such as AES and RC4; and asymmetric ciphers, such as RSA and EIGamal\nMessage authentication codes, including HMACs\nTunneling technologies based on gtunnel\nSSL protocol for building network-to-network VPNs\nSSH protocols as drop-in replacements for telnet, ftp, and the BSD r-commands\nLightweight VPNs, including VTun, CIPE, tinc, and OpenVPN\nIPsec, including its Authentication Header (AH) protocol, Encapsulating Security Payload (ESP), and IKE (the key management protocol)\nPacked with details, the text can be used as a handbook describing the functions of the protocols and the message formats that they use. Source code is available for download, and an appendix covers publicly available software that can be used to build tunnels and analyze traffic flow.\n\nVPNs Illustrated gives you the knowledge of tunneling and VPN technology you need to understand existing VPN implementations and successfully create your own.\n\n","torrent":{"xt":"urn:btih:be5c3dd4270c288750196459277cac798582f349","amp;dn":"VPNs++Illustrated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be5c3dd4270c288750196459277cac798582f349","infoHashBuffer":{"type":"Buffer","data":[190,92,61,212,39,12,40,135,80,25,100,89,39,124,172,121,133,130,243,73]},"announce":[],"urlList":[]}}