{"title":"Iron Butterfly - Live At The Galaxy [1967][2014][320 KBPS]","uid":10520670,"size":131161787,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf818fa372a08b33e776d415dbfb776d4d7b84fa&amp;dn=Iron+Butterfly+-+Live+At+The+Galaxy+%5B1967%5D%5B2014%5D%5B320+KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LameDuck69","files":15,"time":1404970594,"description":"Iron Butterfly - Live At The Galaxy [1967][2014]\n\n\n\n\n01. Real Fright  \n02. Possession  \n03. Filled With Fear  \n04. Fields of Sun  \n05. It's Up to You  \n06. Gloomy Day to Remember  \n07. Evil Temptation  \n08. So-lo  \n09. Gentle As It May Seem  \n10. Lonely Boy  \n11. Iron Butterfly Theme  \n12. You Can't Win  \n\n\n\n\n\n320 KBPS [CBR]\n\nCover Art\n\n\n\n***NOTE***  The quality of this CD is not that great.  This may only be for the die hard Iron Butterfly fans, or just to have to complete your collection.  That's what I think.  You can decide for yourselves.\n\n\n\n\n\n\nFrom Wikipedia:\n\n\nIron Butterfly was an American psychedelic rock band best known for the 1968 hit &quot;In-A-Gadda-Da-Vida&quot;, providing a dramatic sound that led the way towards the development of hard rock music. Formed in San Diego, California among band members that used to be &quot;arch enemies&quot;, their heyday was the late 1960s, but the band has been reincarnated with various members with varying levels of success, with no new recordings since 1975. The band's seminal 1968 album In-A-Gadda-Da-Vida is among the world's 40 best-selling albums, selling more than 30 million copies. Iron Butterfly is also notable for being the very first group to receive an RIAA platinum award.\n\n--------------------------------------------------------------------------------\n\nThe band formed in 1966 in San Diego, California. The original members were Doug Ingle (vocals, organ), Jack Pinney (drums), Greg Willis (bass), and Danny Weis (guitar). They were soon joined by tambourine player and vocalist Darryl DeLoach. DeLoach's parents' garage on Luna Avenue served as the site for their almost nightly rehearsals.\n\nJerry Penrod and Bruce Morse replaced Willis and Pinney after the band relocated to Los Angeles in 1966 and Ron Bushy then came aboard when Morse left due to a critical family tragedy[vague]. All but Ingle and Bushy left the band after recording their first album in late 1967; the remaining musicians, faced with the possibility of the record not being released, quickly found replacements in bassist Lee Dorman and guitarist Erik Brann (also known as &quot;Erik Braunn&quot; and &quot;Erik Braun&quot;) and resumed touring. In early 1968, their debut album Heavy was released after signing a deal with ATCO, an Atlantic Records subsidiary.\n\nIn terms of sound, the group took inspiration from a variety of sources outside of the rock arena, such as the bongo playing of Preston Epps and the r&amp;b music of Booker T and the MGs. Around this time, the band notably ran into guitarist Jimmy Page, who stated that he used the group as partial inspiration for the name 'Led Zeppelin. As well, one of the Zeppelin's first touring sets in the U.S. was playing with Iron Butterfly at Fillmore East in New York, New York.\n\nDeLoach subsequently recorded with Two Guitars, Piano, Drum and Darryl, while Weis and Penrod went on to form the group Rhinoceros. In 1970 DeLoach formed Flintwhistle along with Erik Brann; the band performed live for about a year before breaking up.\n\nThe 17-minute &quot;In-A-Gadda-Da-Vida&quot;, the title track of Iron Butterfly's second album, became a Top 30 hit in the US and made the number 9 spot on the Dutch Top 40. The members when In-A-Gadda-Da-Vida was recorded were Doug Ingle (organ and vocals), Lee Dorman (bass guitar), Ron Bushy (drums), and 17-year-old Erik Brann (guitar). The album was awarded a gold disc by the R.I.A.A. in December 1968  and had sold over three million copies by the end of 1970. It ultimately sold over 20 million copies, went platinum, and stayed on the Billboard magazine charts for over a year.\n\nThe band had been booked to play at Woodstock but got stuck at an airport. When their manager called the promoters of the concert they explained the situation and asked for patience. However, the manager demanded that the Butterfly be flown in by helicopter, whereupon they would &quot;immediately&quot; take the stage. After their set they would be paid and flown back to the airport. The manager was told that this would be taken into consideration and he would be called back. According to drummer Bushy, &quot;We went down to the Port Authority three times and waited for the helicopter, but it never showed up&quot;.\n\nThe next album, Ball, reached No. 3 on the charts, but more lineup changes followed. In 1970, with Erik Brann gone, Iron Butterfly released their fourth studio album, Metamorphosis with two new members, guitarist/vocalist Mike Pinera (whose Blues Image had opened for the Butterfly's Vida tour) and guitarist Larry &quot;Rhino&quot; Reinhardt. The album managed to get into the top 20, but Doug Ingle quit the group shortly after its release. Without an organist for the first time in their history, the remaining four members cut a single, &quot;Silly Sally&quot;. It failed to chart and proved to be their last recording. The band broke up after playing a final show on May 23, 1971. Dorman and Reinhardt would subsequently found Captain Beyond.\n\n","torrent":{"xt":"urn:btih:bf818fa372a08b33e776d415dbfb776d4d7b84fa","amp;dn":"Iron+Butterfly+-+Live+At+The+Galaxy+%5B1967%5D%5B2014%5D%5B320+KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf818fa372a08b33e776d415dbfb776d4d7b84fa","infoHashBuffer":{"type":"Buffer","data":[191,129,143,163,114,160,139,51,231,118,212,21,219,251,119,109,77,123,132,250]},"announce":[],"urlList":[]}}