{"title":"MC Shan - Down By Law 1987 [FLAC] - Kitlope","uid":9465184,"size":313019930,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bf8ea7f0a7550778de6e01ad20f80bc8d4c4e565&amp;dn=MC+Shan+-+Down+By+Law+1987+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Kitlope","files":12,"time":1389448447,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: EAC 0.99 prebeta 3\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s): udp://tracker.openbittorrent.com:80, udp://tracker.publicbt.com:80, udp://tracker.istole.it:6969\nTorrent Hash: BF8EA7F0A7550778DE6E01AD20F80BC8D4C4E565\nFile Size: 299 Mb\nYear: 1987\nLabel: Cold Chillin'\nCatalog #: CCCD 9002\n\nPlease help seed these FLACs! \n\n\nFrom Wiki:\n\n\nShawn Moltke (born September 9, 1965) is an American rapper who uses the stage name MC Shan. Born and raised in the Queensbridge Projects located in Long Island City a section in Queens, New York City on September 9, 1965. Shan is the cousin of old school hip-hop producer Marley Marl. Shan got a record deal with Cold Chillin' Records in 1983 due to his relationship with Marl, and joined Marl's Juice Crew All-Stars. After a few singles were released , MC Shan's debut album Down By Law came out in 1987.\n\nShan also found himself to be a key player in the noted hip hop rivalry the Bridge Wars between the Juice Crew and Boogie Down Productions. The feud was started when Shan and Marl released a song called &quot;The Bridge&quot; as a B-side to &quot;Beat Biter,&quot; itself an answer record directed at L.L. Cool J. KRS-One responded with &quot;South Bronx,&quot; and the Juice Crew replied with &quot;Kill That Noise.&quot; Slate magazine described it as follows: &quot;In 1986, it was a beef that launched the star of KRS-One, when his withering attacks on MC Shan effectively ended his rival's career.&quot;[1] Boogie Down Productions then released &quot;The Bridge is Over,&quot; widely celebrated among hip-hop fans as the paramount dis song. Years later, MC Shan remade &quot;The Bridge&quot; into &quot;Da Bridge 2001,&quot; and strongly denied the bridge &quot;was over&quot;, saying:\n\n\nThe Bridge was never over / we left our mark / The jam is dedicated to you and your boys / I brought my Queensbridge thugs to kill that noise\n\n\nShan's second album, Born To Be Wild, followed in 1988 and revealed the b-boy persona of Shan, with production once again by Marley Marl. 1990's Play It Again, Shan displayed a more mature style, but proved to be his last album. When Cold Chillin's sub label Livin' Large was active, he was listed as one of its artists but never released any material. Despite the fact that he focused more on his production career (like Snow's 12 Inches of Snow, which featured &quot;Informer&quot;, on which Shan appeared) he recorded &quot;Da Bridge 2001&quot; for Nas's 2000 compilation called QB's Finest, which also featured Mobb Deep, Cormega, and Nature.\n\nShan also had a brief stint in film, playing a bit role in Steve Martin's L.A. Story film as the Rappin' Waiter. He is also the older brother of female rapper &amp; radio personality Princess Ivori. \n\n\n\n\nDown By Law 1987\n\n\nDown by Law is the debut album by East Coast hip hop artist MC Shan. Released at the height of the Bridge Wars, a feud between artists from Queensbridge (such as MC Shan) and South Bronx (such as KRS-One), the album contains various dis tracks. The most prodigious of these disses are &quot;Kill That Noise&quot; and &quot;The Bridge,&quot; which was later re-created as &quot;Da Bridge 2001&quot; by various Queensbridge artists. The album is produced by Marley Marl. It was the only Cold Chillin'/Warner Bros. album that was never initially released on CD by its distributor. The album was not released on the compact disc format until 1995, long after the 5-year distribution deal with Warner Bros. Records ended. By this time Cold Chillin' became independent and distributed its material solely, mostly from its back catalog. This CD pressing would only be available for a limited time and went out of print for a few years. It was then re-released in 2001 as MC Shan: The Best Of Cold Chillin, which featured all the tracks from Down by Law with a few additional non-album tracks. This version is now out of print as well. In 2007 it was re-released again by its new parent, Traffic Entertainment Group, in expanded form as a double-disc set with bonus tracks.\n\nIn 1998, The Source ranked it as one of the 100 Best Hip-Hop Albums.[1]\n\n\nTracks:\n\n\n1 &quot;Jane, Stop This Crazy Thing!&quot; Marley Marl, MC Shan MC Shan \n2 &quot;Project Ho&quot; Marley Marl MC Shan \n3 &quot;The Bridge&quot; Marley Marl MC Shan \n4 &quot;Kill That Noise&quot; Marley Marl MC Shan \n5 &quot;Down by Law&quot; Marley Marl MC Shan \n6 &quot;Left Me Lonely&quot; Marley Marl MC Shan, TJ Swan \n7 &quot;Another One to Get Jealous Of&quot; Marley Marl MC Shan \n8 &quot;MC Space&quot; Marley Marl MC Shan \n9 &quot;Living in the World of Hip Hop&quot; Marley Marl MC Shan\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:bf8ea7f0a7550778de6e01ad20f80bc8d4c4e565","amp;dn":"MC+Shan+-+Down+By+Law+1987+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf8ea7f0a7550778de6e01ad20f80bc8d4c4e565","infoHashBuffer":{"type":"Buffer","data":[191,142,167,240,167,85,7,120,222,110,1,173,32,248,11,200,212,196,229,101]},"announce":[],"urlList":[]}}