{"title":"Foxit PhantomPDF Business 7.1.3.0320","uid":11785888,"size":491063096,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c0239c68ca933fb8223c0e15ca76aab1ed7b8d9a&amp;dn=Foxit+PhantomPDF+Business+7.1.3.0320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"remcopol","files":45,"time":1427748805,"description":"New Features in Foxit PhantomPDF 7.1:\n- Scanned PDF Optimization\n- Reduces the file size of scanned PDFs before distributing or archiving to save transfer time and disk space.\n- PPDF (Pfile-based PDF) File Encryption (Business Only)\n- Supports using Microsoft IRM Protection for PDF Version 2 to encrypt PDFs and output the encrypted files in PPDF format.\n- Auto-straightens scanned PDF documents.\n- Allows users to link to a bookmark/specific page within a web pdf in a web browser using URL parameters.\n- Supports line spacing setting when designing text fields.\n- Provides printing templates when creating files to PDF and supports lossless compression.\n- Supports Greek language in OCR engines.\n- Supports adding bullet lists in Typewriter/Callout/Textbox/Note annotations and the availability of annotation rotation.\n\nImprovements in Foxit PhantomPDF 7.1:\n- Extends the Usage of GPO Templates\n- Supports more settings using the GPO templates, including forbidding all auto-connecting to server, setting to hide document message bar in preferences, and more.\n- Shared Review Enhancement\n- Allows configuration of the interval to check new comments during shared review and notifies users by flashing the PhantomPDF icon in the taskbar if any.\n- Supports to save custom colors in annotation properties and then all the annotations can share the custom colors.\n- Streamlines the workflow when scanning paper to PDF.\n- Optimizes the way to name form fields after running form field recognition.\n- Enhances the edit capabilities of scanned and OCRed PDF documents.\n- Shows the preview of ink signatures and stamps when the mouse cursor hovering over the document area after users select them.\n- Provides an option to apply a stamp to multiple pages.\n\nIssues Addressed in Foxit PhantomPDF 7.1:\n- Fixed an issue where users could not send RMS protected files for Shared Review. (Business only)\n- Fixed an issue where errors might occur when users tried to create reports twice after verifying compliance with PDF A/E/X.\n- Fixed an issue where the application interface became fuzzy in higher DPI.\n- Fixed a security issue where memory corruption may occur when converting a GIF file with an invalid value in Ubyte Size in its DataSubBlock Structure, which could lead to a controlled crash execution","torrent":{"xt":"urn:btih:c0239c68ca933fb8223c0e15ca76aab1ed7b8d9a","amp;dn":"Foxit+PhantomPDF+Business+7.1.3.0320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0239c68ca933fb8223c0e15ca76aab1ed7b8d9a","infoHashBuffer":{"type":"Buffer","data":[192,35,156,104,202,147,63,184,34,60,14,21,202,118,170,177,237,123,141,154]},"announce":[],"urlList":[]}}