{"title":"Power Rangers Jungle Fury (Legacy Collection and Beyond)","uid":11762790,"size":13038421603,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c0325baa5b9d1993734c9d1251c631658b00942a&amp;dn=Power+Rangers+Jungle+Fury+%28Legacy+Collection+and+Beyond%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"CeraKesh","files":33,"time":1426632712,"description":"Rangers Forever! Earth's defenders never surrender!\n\nThese are HQ x264 rips from the Power Rangers Legacy Collection DVDs.\n\n[img]http://vignette2.wikia.nocookie.net/powerrangers/images/1/1d/Jungle_fury.png/revision/latest?cb=20120131230325[/img]\nJungle Fury is the sixteenth season of Power Rangers. It was based on the thirty-first Super Sentai series, Juken Sentai Gekiranger.\n\nFor over ten thousand years, the spirit of a pure evil known as Dai Shi has been locked away and safely guarded by the Pai Zhuq, the &quot;Order of the Claw,&quot; a secretive Kung Fu clan. But now, evil has escaped and the Pai Zhuq has selected their three top members to fight this evil. Jarrod, Lily, and Theo were picked, but Jarrod turned out to be a bad choice and Casey, a cub was to take his place. Jarrod tried taking the container holding Dai Shi. It accidentally opened; Dai Shi killed Master Mao and took over Jarrod's body. The trio was sent to find a new master and he gave them the special gift to become Power Rangers. They alone are the Earth's only hope to stop the army of evil animal spirits from overtaking the human world.\n\nThe 2007-8 Writers Guild strike happened during production, upending some plans and forcing Bruce Kalish, Jackie Marchand, and John Tellegen to rush a few episodes to get them done. Jungle Fury was then written by strikebreaking/non-union writers until the strike finished, forcing the original writers to work out how to pick off where the interim had left off","torrent":{"xt":"urn:btih:c0325baa5b9d1993734c9d1251c631658b00942a","amp;dn":"Power+Rangers+Jungle+Fury+%28Legacy+Collection+and+Beyond%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0325baa5b9d1993734c9d1251c631658b00942a","infoHashBuffer":{"type":"Buffer","data":[192,50,91,170,91,157,25,147,115,76,157,18,81,198,49,101,139,0,148,42]},"announce":[],"urlList":[]}}