{"title":"Shirobon - 22-22 [2012]","uid":7795307,"size":83528377,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c0425694d20c55a2363963e27e9631f605cbac20&amp;dn=Shirobon+-+22-22+%5B2012%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"yousef86","files":-1,"time":1352128893,"description":"Tracklisting &amp; Info\n-------------------\nArtist - Shirobon\nAlbum - 22:22\nLength - 33:41min\nRelease - 2012\nBitrate - 320kbps\nRipped by killa1986\n\nIntroducing '22:22' by London based artist Shirobon. Set out to create music that crosses over hard hitting sounds with more delicate elements. By using concepts, field recordings, vintage consoles and other tricks up his sleeve Shirobon crosses over popular electronic genres to create his own flavor of hard hitting future inspired music!\n\nreleased 02 September 2012\nTo everyone who has supported me over the years i would like to say a massive thank you for keeping me inspired and giving me more reason to be an individual and make what i love! \n\n\n01. Intro\nIntroductory track to the album featuring re-sampled vintage consoles and field recordings.\n\n02. Running My Head\nRunning My Head, featuring London based singer/songwriter Camden Cox. This song combines organic (piano's, live bass, live drums, human vocals) and synthetic sounds to create a hybrid of the old and new.\n\n03. A New World\nHeavily conceptual track. Contains a lot of field recordings and sound design. Concept for this track is based around landing on another planet covered in ocean and exploring the deep waters to find a creature of sorts at the bottom. then you discover that it is the predator and you are the prey.\n\n04. Monster\nA Dubstep track with live drums and orchestra's featuring Acer.\n\n05. Derelict City\nBased around the concept of a vast city that has been left abandoned for many years, sound design is based around the textures of the city.. gritty basses being that hard chunks of rubble laying around, synthetic winds and little futuristic creatures that would be roaming this forgotten wasteland..\n\n06. Supernatural\nHouse track featuring vocalist Jared Fortune. Possibly one of the more pop driven songs of the album with usage of a talkbox.\n\n07. Wake You Up\nAn Electrohouse/Complextro track featuring London vocalist Matt Nash. Again, another more pop driven track from the album.\n\n08. You Know I Like It\nA crossover of different electronic styles that uses vocoded vocal effects.\n\n09. Never Let Go\nA more emotion filled track from the album featuring vocals from Australian based vocalist Hunz\n\n10. Internet Troll\nA humorous Dubstep track about internet trolls!\n\n11. 22:22\nFinal track of the album featuring my own vocals. The concept behind 22:22 is a little more personal. as i was writing this album it became more and more frequent that i would check the time and it would say 22:22 to a point where i would see it pretty much daily, in general i would see the number 22 everywhere i go. so i wrote this song about it and decided to name the album after this song, not because it's the strongest track of the album. but more because it's something that has been with me throughout the recording progress. To everyone who has given time to my music and supported me, thank you! :)","torrent":{"xt":"urn:btih:c0425694d20c55a2363963e27e9631f605cbac20","amp;dn":"Shirobon+-+22-22+%5B2012%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c0425694d20c55a2363963e27e9631f605cbac20","infoHashBuffer":{"type":"Buffer","data":[192,66,86,148,210,12,85,162,54,57,99,226,126,150,49,246,5,203,172,32]},"announce":[],"urlList":[]}}