{"title":"Gov't Mule - By A Thread [2009][EAC,log,cue. FLAC]","uid":8206488,"size":461707580,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c09235f8f33fdeccc18d58811fbd2bd0407079e2&amp;dn=Gov%27t+Mule+-+By+A+Thread+%5B2009%5D%5BEAC%2Clog%2Ccue.+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":8,"uploader":"dickspic","files":13,"time":1362097822,"description":"Artist: Gov't Mule\nRelease: By A Thread\nDiscogs: 2010705\nReleased: 2009\nLabel: Evil Teen / Provogue\nCatalog#: 651751-12051-8 / PRD 7294 2\nFormat: FLAC / Lossless / Log (100%) / Cue / CD\nCountry: Europe\nStyle: Rock, Blues Rock, Alternative Rock, Hard Rock\n\n\n\n01. Broke Down On The Brazos (6:19)\n02. Steppin' Lightly (7:10)\n03. Railroad Boy (5:03)\n04. Monday Mourning Meltdown (8:08)\n05. Gordon James (3:48)\n06. Any Open Window (4:45)\n07. Frozen Fear (5:48)\n08. Forevermore (4:17)\n09. Inside Outside Woman Blues #3 (9:04)\n10. Scenes From A Troubled Mind (7:27)\n11. World Wake Up (5:54)\n\nAllman Brothers Band guitarist Warren Haynes formed Gov't Mule in 1994 with Allman's bassist Allen Woody and drummer Matt Abts. Launched as a side project for Haynes and friends to pursue a harder-edged blues-rock sound, Gov't Mule was a power-trio masquerading as an early-1990s jam band. Mixing the Southern rock and inspired improvisational jams of the Allman Brothers with the psychedelic-tinged guitar-buzz of British blues bands like Cream, Gov't Mule debuted with its self-titled album in 1995.\n\nAlthough Woody tragically died in 2000, the core of Haynes and Abts has soldiered on, and almost a decade and a half later Gov't Mule has taken on a life of its own, separate and distinctive from the Allman Brothers. With better than a dozen live and studio albums to their credit, Gov't Mule has become a creative and performance force to be reckoned with. By A Thread, Mule's 13th album and its first studio effort in nearly three years is, by any standards, also the band's best work. Muscular, white hot, and musically more slippery than a snake's belly, with By A Thread bandleader Haynes has finally found the band chemistry he's been looking for since Woodys' death.\n\nGov't Mule's By A Thread\n\nBy A Thread is a stunning return to form for the Mule. The artistic flirtations of the band's last work, 2007's Mighty High, have largely been banished to a few adventuresome moments, while the bulk of the album is pure power trio (plus one) fervor. The ZZ Top-flavored &quot;Broke Down On The Brazos,&quot; for instance, is a bone-crunching leviathan of a song, the sort of 1970s classic rock-leaning meat-n-taters that Haynes cut his teeth on. Haynes and the Mule gnaw this one down to the bone, too, with guest guitarslinger Billy Gibbons providing &quot;badass guitar&quot; to the mix. The song provides the perfect measure of Delta grit and Rio Grande mud, with staggering ferocity and soaring fretwork.\n\nMuch of the rest of the album follows a similar blues-rock bonfire blueprint, with a few colorful flourishes to lively things up. The heartbroken, star-crossed lover of &quot;Steppin' Lightly&quot; shares his misery through Haynes' mighty soulful vocals and some of the hottest guitar licks you've heard in thirty years. The high lonesome vibe of the traditional &quot;Railroad Boy&quot; is matched by another fine vocal performance and exotic guitarplay, the song's soundtrack a haunting mix of Southern rock bluster and swamp-blues darkness.\n\nMonday Mourning Meltdown\n\nHaynes' &quot;Monday Mourning Meltdown&quot; treads heavily towards the experimental edge of the Hendrix milieu, the guitarist delivering some very cool outer-space guitar noodling, the band spinning out an oppressive, atmospheric backdrop against which Haynes embroiders his imaginative guitar licks. The song features syncopated rhythms, washes of synthesizer/keyboards, and otherworldly six-string oscillation that would stand miles away from the blues if not for Haynes' mournful vocals and his morose lyrics. A dancing keyboard solo around five-minutes into the eight-minute-plus jam opens the door for a jazzy solo that howls and squonks with the best of 'em.\n\nDedicated to the late Jimi Hendrix drummers Mitch Mitchell and Buddy Miles, &quot;Any Open Window&quot; channels vintage commercial Jimi with reckless aplomb, Abts crashing the cans with manic energy while Haynes' rips off some gorgeous, hard-rocking riffing and the band runs to catch up. Lyrically, the song evokes memories of Hendrix as well, a well-written period piece minus the psychedelic claptrap that Jimi often invested words. The hurricane-force &quot;Inside Out Woman Blues #3&quot; is a blues-rock fan's dream date, a knuckle-dragging, barn-burning, hair-singing guitar showcase where Haynes matches his best Howlin' Wolf vocals with uranium-heavy thunder-n-lightnin' guitarplay that sparks and sizzles as notes fly off the fretboard.\n\nThe Reverend's Bottom Line\n\nAlthough Warren Haynes is typically lauded for his incendiary six-string skills, many overlook the fact that he is a fine vocalist capable of great soul and subtlety as well as blow-the-roof-off-the-juke-joint bluster. Haynes continues to push himself and grow as a songwriter, too, and his lyrics convey strong emotion with often well-drawn imagery and creativity. With the current Gov't Mule line-up he's found an explosive chemistry that allows him to pursue his musical vision without restraint.\n\nBy A Thread is Haynes' best work with Gov't Mule, a high-octane headrush of guitar-driven blues-rock that has dragged the beast, screaming and kicking, from the 1970s into the 21st century. (Evil Teen Records, released October 27, 2009)","torrent":{"xt":"urn:btih:c09235f8f33fdeccc18d58811fbd2bd0407079e2","amp;dn":"Gov%27t+Mule+-+By+A+Thread+%5B2009%5D%5BEAC%2Clog%2Ccue.+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c09235f8f33fdeccc18d58811fbd2bd0407079e2","infoHashBuffer":{"type":"Buffer","data":[192,146,53,248,243,63,222,204,193,141,88,129,31,189,43,208,64,112,121,226]},"announce":[],"urlList":[]}}