{"title":"Windows XP Professional x64 SP2 - Activated","uid":4538264,"size":643826426,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c149679c3a7d7122afaf2f346b4edc62bc7f3378&amp;dn=Windows+XP+Professional+x64+SP2+-+Activated&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Goldfish_92","files":-1,"time":1227826361,"description":"*******************************************\nWindows XP Professional x64 SP2 - Actiavted\n*******************************************\n\nWindows XP Professional x64 Edition is designed to meet the demands of customers who require large amounts of memory and floating point performance in areas such as mechanical design and analysis, 3-D animation, video editing and composition, and scientific and high-performance computing applications.\n\nThe performance of 64-bit computing offers advantages in fields such as automobile or airplane design, by allowing engineers to create larger, more complex models. With such systems, engineers can use simulation software to analyze the effects of airflow, stress, and heat on materials of a car or plane, and then study the results to improve product design. Likewise, 64-bit computing is a benefit for digital content creators, including 3-D animators, digital artists, and game developers who can significantly reduce the time spent to digitally render three-dimensional models. In the areas of scientific and high performance computing, Windows XP Professional x64 Edition will aid in oil and gas exploration, seismic analysis, computational fluid dynamics and scientific visualization among other applications.\n\nWindows XP Service Pack 2 (SP2) offers advanced security tools and technologies in addition to the latest updates from Microsoft. Windows XP SP2 enables you to defend your systems and information against threats by giving you more control over the security features and tools in Windows XP. \n\n\n***********************************************************************************\n\nBefore you download I'd just like to let you know how poor driver support is with this 64 bit version of XP... its not my version but more XP 64 bit in general so unless you specifically need 64bit I would recommend the normal 32 bit version found here... http://thepiratebay.se/torrent/4535425\n\n\n\nJust burn,install and enjoy...\n\nNothing has been taken out of this install.\n\nNo serial key is needed during installation and once installed windows is fully activated and passes all validation,\n\nIMPORTANT - THIS WILL ONLY WORK ON x64 (64 BIT) PROCESSORS!\n\n\nSeed, enjoy :)\t\t\n","torrent":{"xt":"urn:btih:c149679c3a7d7122afaf2f346b4edc62bc7f3378","amp;dn":"Windows+XP+Professional+x64+SP2+-+Activated","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c149679c3a7d7122afaf2f346b4edc62bc7f3378","infoHashBuffer":{"type":"Buffer","data":[193,73,103,156,58,125,113,34,175,175,47,52,107,78,220,98,188,127,51,120]},"announce":[],"urlList":[]}}