{"title":"James Brown: Motherlode (Remastered)","uid":3311970,"size":143794935,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c18af0538486ed4365bc1dc93e08194d352048c9&amp;dn=James+Brown%3A+Motherlode+%28Remastered%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bergmanwasa","files":13,"time":1112646388,"description":"mp3 @256\nDuring the mid- and late '80s, after Brown and Polydor parted ways, the label began to reissue his work, some of which had been out of print for close to a decade. Motherlode is one of the finest compilations. Coming a few years after In the Jungle Groove, a compilation effort that culled some of Brown's harder-edged 1969-1971 tracks, this covers 1969-1973 and has the smoothness of a regular release effort.\n\n By this point, Motherlode producers Cliff White and Tim Rogers began to know more about Brown's &quot;classic&quot; work than he did and could do compilations where the tracks were all potent. This set starts off with an explosive live take of &quot;There It Is&quot; recorded at the Apollo in 1972. 1969's &quot;She's the One&quot; with his late-'60s orchestra has great guitar work from both Jimmy &quot;Chank&quot; Nolan and Alphonso &quot;Country&quot; Kellum. Since most of the tracks here weren't hits, or were even released, it provides a fresh interpretation of Brown's production style and the skills of his players.&quot;Untitled Instrumental&quot; features Brown's rock and psychedelic-influenced unit, with included guitarist Phelps Collins and his brother, Bootsy Collins, and his singular bass skills. The heart of this CD, however, is &quot;People Drive Your Funky Soul.&quot; Originally on Slaughter's Big Rip Off in a too brief 3:50 version, Motherlode brings the entire take to the public for the first time. The track, which manages to subtly cross reggae with bebop, again features Brown with his 1971-1975 band and it exhibits their chemistry and the band's unbelievable versatility. Although Motherlode has been lost in the shuffle due to a plethora of other compilations, this is still illuminating and enjoyable.","torrent":{"xt":"urn:btih:c18af0538486ed4365bc1dc93e08194d352048c9","amp;dn":"James+Brown%3A+Motherlode+%28Remastered%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c18af0538486ed4365bc1dc93e08194d352048c9","infoHashBuffer":{"type":"Buffer","data":[193,138,240,83,132,134,237,67,101,188,29,201,62,8,25,77,53,32,72,201]},"announce":[],"urlList":[]}}