{"title":"[PS3] Dante's Inferno (Divine Edition)","uid":9534853,"size":7489788759,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:c1b6c76b059a8249591b8b08e153f64e59b6bc1d&amp;dn=%5BPS3%5D+Dante%27s+Inferno+%28Divine+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fuckface69","files":-1,"time":1390868929,"description":"Dantes Inferno &quot;Divine Edition&quot; exclusive for the PlayStation 3 computer entertainment system. In addition to the game, all those who purchase Dantes Inferno on the PlayStation 3 system will receive this special edition which includes developer commentaries, a Wayne Barlowe digital art book, the soundtrack to the game and a digital version of the complete Longfellow translation of Dante Alighieris Inferno all for the standard retail price of $59.99.\n\nAn abducted soul. A lifetime of sins. A journey to the depths of despair. Based on the immensely influential classic poem, Dantes Inferno takes you on an epic quest of vengeance and redemption through the Nine Circles of Hell. You are Dante, a veteran of the Crusades who must chase Beatrices soul and challenge the seductive Satan for her love. As your pursuit takes you deeper into the pits of Hell, will you adopt the path of righteousness and redeem your sins, or will you fight evil with evil and damn yourself for all eternity? The choice is yours.\n\n* Take Dante through a harrowing, action-filled adaptation of Dante Alighieris masterpiece.\n* Descend into the Nine Circles of Hell: Limbo, Lust, Gluttony, Greed, Anger, Heresy, Violence, Fraud, and Treachery, each one a horrifying realm befitting the sins of its cursed inhabitants.\n* Tame infernal beasts to defeat the unrelenting horde of Hells minions.\n* Wield the power of Deaths soul-reaping Scythe, Beatrices Holy Cross, and more.\n* Punish the damned or absolve them your choices affect your characters abilities.\n________________________________________________\n\nYOU NEED LATEST WINRAR 5 TO EXTRACT THE ARCHIVE!","torrent":{"xt":"urn:btih:c1b6c76b059a8249591b8b08e153f64e59b6bc1d","amp;dn":"%5BPS3%5D+Dante%27s+Inferno+%28Divine+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1b6c76b059a8249591b8b08e153f64e59b6bc1d","infoHashBuffer":{"type":"Buffer","data":[193,182,199,107,5,154,130,73,89,27,139,8,225,83,246,78,89,182,188,29]},"announce":[],"urlList":[]}}