{"title":"Pet Shop Boys 24 Bit Vinyl Pack","uid":8720544,"size":10988699950,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c229aa62ae8feb489c0c6dd3a7b58af9ba48f529&amp;dn=Pet+Shop+Boys+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"politux","files":-1,"time":1374415269,"description":"\n  Pet Shop Boys 24 Bit Vinyl Pack\n\n  Genre: Pop/Rock, Electronic\n  Styles: Alternative Dance, Dance-Pop, House, Dance-Rock\n  Source: vinyl\n  Codec: FLAC\n  Bit Rates: ~ 2,900 - 3,100 kbps\n  Bit Depth: 24\n  Sampling Rate: 96,000 Hz\n\n  1998 Introspective (Limited Edition)\n  1990 So Hard (The KLF vs Pet Shop Boys\n  1991 The Complete Singles Collection (Italy, 2LP)\n  1993 Can You Forgive Her\n  1994 I Wouldn't Normally Do This Kind of Thing\n  1997 A Red Letter Day (Promo)\n  2000 You Only Tell Me You Love Me When YOu're Drunk (2x12&quot; Single)\n  2006 Numb\n  2007 Disco Four (Remixed by Pet Shop Boys 2LP)\n  2011 The Most Incredible Thing (Limited Edition Box Set)\n  \n  Postmodern ironists cloaked behind a veil of buoyantly melodic and lushly romantic synth pop confections, Pet Shop Boys established themselves among the most commercially and critically successful groups of their era with cheeky, smart, and utterly danceable music. Always remaining one step ahead of their contemporaries, the British duo navigated the constantly shifting landscape of modern dance-pop with rare grace and intelligence, moving easily from disco to house to techno with their own distinctive image remaining completely intact. Satiric and irreverent -- yet somehow strangely affecting -- they also transcended the seeming disposability of their craft, offering wry and thoughtful cultural commentary communicated by the Morse code of au courant synth washes and drum-machine rhythms.\n\n  Pet Shop Boys formed in London in August 1981, when vocalist Neil Tennant (a former editor at Marvel Comics who later gained some recognition as a journalist for Smash Hits magazine) first met keyboardist Chris Lowe (a onetime architecture student) at an electronics shop. Discovering a shared passion for dance music and synthesizers, they immediately decided to start a band. After dubbing themselves Pet Shop Boys in honor of friends who worked in such an establishment -- while also obliquely nodding to the sort of names prevalent among the New York City hip-hop culture of the early '80s -- the duo's career first took flight in 1983, when Tennant met producer Bobby &quot;O&quot; Orlando while on a writing assignment. Orlando produced their first single, 1984's &quot;West End Girls.&quot; The song was a minor hit in the U.S. but went nowhere in Britain, and its follow-up, &quot;One More Chance,&quot; was also unsuccessful.\n\n  Upon signing to EMI, Pet Shop Boys issued 1985's biting &quot;Opportunities (Let's Make Lots of Money).&quot; When it too failed to attract attention, the duo's future appeared grim, but Tennant and Lowe then released an evocative new Stephen Hague production of &quot;West End Girls,&quot; which became an international chart-topper. Its massive success propelled Pet Shop Boys' 1986 debut LP, Please, into the Top Ten, and when &quot;Opportunities&quot; was subsequently reissued, it too became a hit. Disco, a collection of dance remixes, was quickly rushed into stores, and in 1987 the duo resurfaced with the superb Actually, which launched two more Top Ten smashes -- &quot;It's a Sin&quot; and &quot;What Have I Done to Deserve This?,&quot; a duet between Tennant and the great Dusty Springfield. Later that year, &quot;Always on My Mind,&quot; a lovely cover of the perennial Elvis Presley standard, reached number one in several countries and the Top Ten in the U.S. A documentary film titled It Couldn't Happen Here was released one year later.\n\n  In October 1988, Pet Shop Boys issued their third studio LP, the eclectic Introspective. &quot;Domino Dancing&quot; and &quot;Left to My Own Devices&quot; both reached the Top Ten in Great Britain. The following year, Pet Shop Boys collaborated with a variety of performers, most notably Liza Minnelli, for whom they produced the 1989 LP Results. They also produced material for Springfield, and Tennant joined New Order frontman Bernard Sumner and ex-Smiths guitarist Johnny Marr in the group Electronic, scoring a hit with the single &quot;Getting Away with It.&quot; Tennant and Lowe reconvened in 1990 for the muted, downcast Behavior, produced by Harold Faltermeyer. Their hit medley of U2's &quot;Where the Streets Have No Name&quot; and Frankie Valli's &quot;Can't Take My Eyes Off You&quot; was released in 1991, and was followed in 1993 by Very, lauded as among the duo's finest efforts to date.\n\n  After a three-year absence, Pet Shop Boys resurfaced with Bilingual, a fluid expansion into Latin rhythms. Nightlife followed in 1999 and sparked the dance club hit &quot;New York City Boy,&quot; whose success allowed the group to tour the U.S. for the first time in eight years. While on tour, the duo also collaborated with playwright Jonathan Harvey on a musical surrounding gay life and societal criticisms, which the three had been planning since 1997. Closer to Heaven made its West End debut in 2001 and had a successful run for most of the year; Pet Shop Boys' score of the original cast recording was also a hit in the U.K. They still had time to make a record for themselves, too -- in April 2002, Tennant and Lowe issued Release, and Disco 3 was compiled for release the following year.\n\n  Pet Shop Boys continued releasing material throughout the decade's latter half. In 2005, they put together a volume of the Back to Mine series and released their soundtrack designed to accompany the 1925 silent film Battleship Potemkin, a soundtrack they'd performed a year earlier at a free concert/screening in Trafalgar Square. A year later, they issued Fundamental, a mature, sometimes political album produced by Trevor Horn. The live album Concrete: In Concert at the Mermaid Theatre appeared at the end of the year, and Yes -- a collaborative effort with the production crew Xenomania -- marked the band's tenth studio effort in March 2009. While playing shows in support of that album, Pet Shop Boys also released a hits compilation, Party, to coincide with the Brazilian leg of their tour. In 2010 the tour was documented on the CD/DVD release Pandemonium, and another greatest-hits compilation, Ultimate, arrived.\n\n  Their 2011 effort, The Most Incredible Thing, was a two-disc ballet score composed for the Sadlers Wells Theater in London, while 2012's Format rounded up the duo's B-sides and bonus tracks from the years 1996-2009. Also in 2012, the duo released the sports-themed single &quot;Winner&quot; and performed the track at the 2012 Olympics Summer Games, held that year in their hometown of London. The track landed on that year's album Elysium, which was produced by Kanye West affiliate Andrew Dawson. Stuart Price (Madonna, Seal, Kylie Minogue) was the producer of 2013's Electric, an album that featured no ballads, just dance tracks.","torrent":{"xt":"urn:btih:c229aa62ae8feb489c0c6dd3a7b58af9ba48f529","amp;dn":"Pet+Shop+Boys+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c229aa62ae8feb489c0c6dd3a7b58af9ba48f529","infoHashBuffer":{"type":"Buffer","data":[194,41,170,98,174,143,235,72,156,12,109,211,167,181,138,249,186,72,245,41]},"announce":[],"urlList":[]}}