{"title":"Stamatis Spanoudakis, Eleftheria Arvanitaki - Tanirama (Greek Mu","uid":6014336,"size":232527034,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c23bdb94dc3ceb9871e2def151f420a3fbcb04c1&amp;dn=Stamatis+Spanoudakis%2C+Eleftheria+Arvanitaki+-+Tanirama+%28Greek+Mu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"alekow1","files":20,"time":1291572587,"description":"\nStamatis Spanoudakis\n\nStamatis Spanoudakis was born in Athens Greece. At a very early age, music became the most important part of his life.    As a child, he first studied Classical music (guitar and theory) with professor Haralampos Ekmektsoglou. Then, as a teenager in the sixties and the seventies, he played bass guitar and keyboards in a number of bands in Athens, Paris and finally, London, where he lived for a number of years and recorded his first albums.\nAfter that, Classical music won him over again, so he decided to return to his studies of composition, at first in Wurzburg Germany with professor Bertold Hummel and then back in Athens with professor Konstantinos Kydoniatis.\nHe was then attracted to his third love - Byzantine music, which led him to Greek songwriting and instrumental music.\nSince then he has been consciously trying to reconcile his three musical influences (Rock, Classical and Byzantine), in his music. \nHe has written numerous hit songs (both the music and the lyrics) for most of the major contemporary Greek singers.  \nHe has also composed the music for many blockbuster films in Greece, Germany and Italy, music for theater and television and has so far recorded more than fifty albums.\nSince 1995, he has concentrated almost exclusively on instrumental music, based on Greek historical or religious themes. Music that has an unprecedented commercial appeal, with all his records turning gold and platinum, with minimum effort and very rare appearances in public. \nStamatis lives in a quiet suburb with his wife Dori and their four dogs. He has his own studio where he records his music, being the composer, arranger, producer, performer and sound engineer of his work. (www.stamatisspanoudakis.gr)\n\n\n\n\nTanirama (1989)\n\nThe 3rd personal abum of Arvanitaki.\nThe music is mainly elecronic and Spanoudakis play (almost) all the instruments.\n\n\n\n\n\n01 - Tanirama\n02 - The Lake\n03 - In The Bewitched Orient\n04 -  Only For A While\n05 - Why\n06 - Stolen Life\n07 - Come Back\n08 - Our Childhood's Voices\n09 - Maybe\n\n\n\nComposer: Stamatis Spanoudakis\nLyrics: Stamatis Spanoudakis \nProduced by Stamatis Spanoudakis and Kostas Hayer.\n\nLabel: Polygram\nReleased: 1989\nCatalogue: 841 844-2\n\n\n\nCompression Level: 5\nCovers Included (400dpi)\n\n\nAll information from: arvanitaki.gr/\n\n\n\nEnjoy, Seed and Share","torrent":{"xt":"urn:btih:c23bdb94dc3ceb9871e2def151f420a3fbcb04c1","amp;dn":"Stamatis+Spanoudakis%2C+Eleftheria+Arvanitaki+-+Tanirama+%28Greek+Mu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c23bdb94dc3ceb9871e2def151f420a3fbcb04c1","infoHashBuffer":{"type":"Buffer","data":[194,59,219,148,220,60,235,152,113,226,222,241,81,244,32,163,251,203,4,193]},"announce":[],"urlList":[]}}