{"title":"[FSX] Aerosoft - FS Flight Keeper v3.0","uid":7020930,"size":255728448,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c259e26ae098eca8b60c2cf09d9cd9a9de888acf&amp;dn=%5BFSX%5D+Aerosoft+-+FS+Flight+Keeper+v3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"_SnakEye","files":1,"time":1328836780,"description":"FS Flight Keeper (FSFK) combines six programs in one: A Logbook, a basic Aircraft Black Box, a Flight Weather planning tool, a Flight Information System (ACARS Device), a Ground Proximity Warning System (GPWS) and a Cockpit Sound Environment enhancement. \nThe Logbook keeps track of the flights you made. It stores Flight Times (also Day and Night), Fuel used, Pilot, Aircraft used, etc. Whilst the Black Box logs all aircraft events like autopilot settings, engine settings, weather, etc. FSFK also features flight weather planning (METARs, TAFs and ALOFTs), data export, configurable flight critique, World (Moving) Map display, Instant Messaging, Screenshot Manager and much more.\nFS Flight Keeper contains many features for Virtual Airlines (VA), which need a standardized way of logging, transmitting flights and even want to upload actual flight reporting maps. FS Flight Keeper can transmit fully customizable flight reports via Email or any available Web Service (page). FSFK also offers realtime (live) ACARS. This means that ACARS messages are created in realtime and automatically transmitted to an existing Virtual Airline Web Service. The service can then store and process the received messages. Virtual Airline (live ACARS) Traffic can displayed on the World Map. With the existing Virtual Airline Software Development Kit (SDK) and the contained example services and databases any VA can develop FSFK compatible web service in a really short time.\nThe Cockpit Sound Environment brings your Cockpit to life. Easily add crew announcements, which will be played automatically on different flight situations (e.g. Pushback, Pax Security Information, Crew prepare for Landing, etc.). You can also add a virtual copilot, that gives you aural information for different aircraft status changes (e.g. Gear down and locked, Glideslope active/captured, etc.). Cabin ambient sounds with full 3-D surround sound support will give you the feeling as if the passengers were really in your aircraft. But sounds can not only be played automatically, you can also play pre configured sounds manually by pressing a configurable hotkey. You can add an aural GPWS/TCAS, which can be used for every aircraft even if it does not have one installed by default.\nLast but not least you can access all this information directly from your cockpit without the need to switch any application during your flight. The ACARS Device (Gauge) allows the pilot to easily view all important information and even control FS Flight Keeper while sitting in the cockpit. The ACARS Device offers a detailed text based view on the current weather conditions (e.g. wind and cloud layers with icing, turbulence and wind shear warnings!), gives access to all important in-flight states and also contains a detailed airport and navaid information database.\nSystem Requirements:\n Microsoft Flight Simulator 2004\n Athlon or Pentium IV Processor 1,8GHz, 512 MB RAM\n 3D-graphic card with 64MB RAM\n CD-Rom drive\n 650 MB free hard disk space","torrent":{"xt":"urn:btih:c259e26ae098eca8b60c2cf09d9cd9a9de888acf","amp;dn":"%5BFSX%5D+Aerosoft+-+FS+Flight+Keeper+v3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c259e26ae098eca8b60c2cf09d9cd9a9de888acf","infoHashBuffer":{"type":"Buffer","data":[194,89,226,106,224,152,236,168,182,12,44,240,157,156,217,169,222,136,138,207]},"announce":[],"urlList":[]}}