{"title":"Standup Comedy - Maria Bamford - 2007 - How To Win!","uid":4319868,"size":120157157,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c3371470cc97d08b737aceffa80ac455199283ae&amp;dn=Standup+Comedy+-+Maria+Bamford+-+2007+-+How+To+Win%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rambam1776","files":25,"time":1217371050,"description":"I finally got an invitation to join Demonoid, where my Google searches for torrents I cannot find here keep showing great stuff. I spent all last week grabbing comedy albums which I am now going to upload here. Other than going to the trouble of fixing tags and getting artwork and details, these torrents are as the original posters seeded them. I am not endorsing or recommending all of these. In fact, I think some of them suck. However, there is a major lack of well seeded comedy torrents here, and I hope to encourage more people to post new ones. Also, who says *MY* taste matches somebody elses? The reviews are from ALLMUSIC or from AMAZON. As usual, much thanks to the OPs who put these out and about.\n\nRambam1776\n\n\n\nMARIA BAMFORD ? HOW TO WIN\n\nBamford was born at the naval base in Port Hueneme, California (where her father Joel was serving as a Navy doctor), growing up there and in Duluth, Minnesota. She attended Chester Park Elementary and The Marshall School in Duluth and went on to attend Bates College, the University of Edinburgh, and the University of Minnesota, where she earned a degree in Creative Writing. Bamford started doing stand-up in Minneapolis, Minnesota, at the age of 19 at Stevie Ray&amp;#039;s Comedy Cabaret and later joined Edinburgh&amp;#039;s improvised comedy show The Improverts. She has been in a number of movies and television shows, including several voice appearances in cartoons. One of the best-known aspects of Bamford&amp;#039;s act is the many different voices she uses. Her comedy often takes the form of vignettes rather than the standard setup/punchline format. Because her true voice has been described as child-like[citation needed], her various impersonations (including her mother and her agent) contrast sharply and draw a reaction from the audience as they sound more adult.\nMaria was recently featured on the documentary series The Comedians of Comedy on Comedy Central and Showtime, and now appears in short skits collectively titled &quot;The Maria Bamford Show&quot; which can be found on the website Super Deluxe [1]. She also appears on the comedy compilation CD Comedy Death-Ray (album).\nMaria has been quoted in her comedy act and on her appearance on the podcast Never Not Funny to have been diagnosed with, and treated for depression and obsessive-compulsive disorder. &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Maria_bamford&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Maria_bamford&lt;/a&gt;\n\nReview\tby Stewart Mason\nGiven a higher profile by her exposure on the Comedians of Comedy tours and documentaries alongside friends Patton Oswalt, Brian Posehn, and Zach Galifianakis, Maria Bamford has moved up a few levels in terms of exposure and general hipness. Luckily, her material has elevated as well. Bamford&amp;#039;s first album, The Burning Bridges Tour, overemphasized the comedian&amp;#039;s cartoony aspects, most notably a voice that makes her sound like Betty Boop&amp;#039;s neurotic sister. That trait is modulated on How to Win, and Bamford&amp;#039;s material takes a less insular turn, focusing on more social and political topics in routines like &quot;I Heart My Country&quot; and &quot;Competitive Living.&quot; Even her more personal material takes a different shape, including some amusingly dark turns like the hilarious &quot;Sister Sarah,&quot; a description of her older sister&amp;#039;s work as a pathologist. Or, as Bamford sweetly introduces her, &quot;This is my sister Sarah. She cuts up the dead into chunks.&quot; Bamford is a low-key comedian more interested in the wry observation than the manic belly laugh, which makes odd digressions like the tour de force soundtrack of old man body noises in &quot;Dad&quot; all the more surprising and funny.  &lt;a href=&quot;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfoxzr5ld6e&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://allmusic.com/cg/amg.dll?p=amg&amp;sql=10:dpfoxzr5ld6e&lt;/a&gt;\n\n","torrent":{"xt":"urn:btih:c3371470cc97d08b737aceffa80ac455199283ae","amp;dn":"Standup+Comedy+-+Maria+Bamford+-+2007+-+How+To+Win%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3371470cc97d08b737aceffa80ac455199283ae","infoHashBuffer":{"type":"Buffer","data":[195,55,20,112,204,151,208,139,115,122,206,255,168,10,196,85,25,146,131,174]},"announce":[],"urlList":[]}}