{"title":"he Korean War (The Greenwood Press Daily Life Through History Se","uid":11284578,"size":19809542,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c341b92bfe1383342cfa049d70c20a1ed2b0ebac&amp;dn=he+Korean+War+%28The+Greenwood+Press+Daily+Life+Through+History+Se&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JinRohEX","files":-1,"time":1414260741,"description":"he Korean War (The Greenwood Press Daily Life Through History Series: American Soldiers' Lives)\nby Paul M. Edwards\n\nDESCRIPTION:\n\nDespite the American tendency to bypass it, the Korean War from 1950 to 1953 was a watershed in American history. It was in Korea, for the first time, that the United States committed its armed forces to limiting an expansion, by Communist forces, which many believed was designed to take over the world; it was also the first war that a world organization, the United Nations, played a military role. The conflict in Korea was a war that was fought in hardship and danger by the grunt, the man and woman in the field, bringing an end to the myth that possession of an atomic bomb made conventional warfare unnecessary. Training, usually with World II weapons, life on the front, care of the wounded and the dead, and coming home, are just some of the topics covered in The Korean War. In addition, a time line of events, a helpful topically arranged bibliography of recommended sources, and illustrations, including many photos taken by the soldiers themselves, bring this period into full focus","torrent":{"xt":"urn:btih:c341b92bfe1383342cfa049d70c20a1ed2b0ebac","amp;dn":"he+Korean+War+%28The+Greenwood+Press+Daily+Life+Through+History+Se","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c341b92bfe1383342cfa049d70c20a1ed2b0ebac","infoHashBuffer":{"type":"Buffer","data":[195,65,185,43,254,19,131,52,44,250,4,157,112,194,10,30,210,176,235,172]},"announce":[],"urlList":[]}}