{"title":"INSANITY - THE ASYLUM","uid":8894859,"size":5754673601,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:c367921723a4208006f36fa5d863405975075c0a&amp;dn=INSANITY+-+THE+ASYLUM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"athyso","files":1,"time":1378676358,"description":"INSANITY: THE ASYLUMTM gets you GAME DAY ready. \n\nLook and feel like an elite athlete in just 30 days. Guaranteed! Former track-and-field star Shaun T will push you to Dig Deeper?Â® than ever with sports-specific training and drills inspired by pro athletes. \n\n6 athletic training DVDs, 2 bonus workouts, Speed Rope, Agility Ladder, Nutritional Plan, Calendar, and Playbook. \nShaun T will push you to Dig Deeper?Â® than ever with sports-specific training and drills inspired by pro athletes. \nLook and feel like an elite athlete in just 30 days by increasing your speed, coordination, agility, and power. \nMove like a football running back, serve aces like a tennis pro, and score points like an all-star guard. \n\nPlus, work with the included Agility Ladder and Speed Rope. Get faster, stronger, and more agile-so you can perform any sport or activity with eye-popping speed and skill. On game day, you'll have an unbeatable athletic edge. \n\nBrand new, factory sealed box set. Complete set includes 6 athletic training DVDs, 2 bonus workouts, Speed Rope, Agility Ladder, Get Shredded Nutritional Plan, ASYLUM Workout Calendar, and Guide Playbook. \n\nYou'll receive: 6 ASYLUM athletic training workout \n\nDVD1: Speed &amp; Agility: Get quick on your feet-fast, with this intense cardio workout. (45 minutes) \nDVD2: Vertical Plyo: Jump higher than ever with this lower-body training routine. (40 minutes) \nDVD3: Relief: Stretch out to build long, lean muscle and increase your flexibility. (25 minutes) \nDVD4: Strength: Increase your strength and power by cross-training with weights and resistance. (50 minutes) \nDVD5: Game Day: Put your new sports skills to the test with this cross-training workout. (60 minutes) \nDVD6: Back to Core: Build the rock-solid core, glutes, and hamstrings for the explosive power you'll need to play and dominate at an elite level. (45 minutes) \n2 bonus workouts: \n1: Sports Performance Assessment: Discover the improvements you've made in your fitness and skills with this performance measurement tool. (25 minutes) \n2: Overtime: Add this 15-minute monster to any ASYLUM workout to see if you've still got game. Agility Ladder, Speed Rope, Get Shredded Nutritional Plan, ASYLUM Workout Calendar, and Guide Playbook. ","torrent":{"xt":"urn:btih:c367921723a4208006f36fa5d863405975075c0a","amp;dn":"INSANITY+-+THE+ASYLUM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c367921723a4208006f36fa5d863405975075c0a","infoHashBuffer":{"type":"Buffer","data":[195,103,146,23,35,164,32,128,6,243,111,165,216,99,64,89,117,7,92,10]},"announce":[],"urlList":[]}}