{"title":"Myths, Lies and Oil Wars - F. William Engdahl","uid":11715694,"size":2869692,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c3da2609abddcfb7c6a2216c4899c1c958e64e6c&amp;dn=Myths%2C+Lies+and+Oil+Wars+-+F.+William+Engdahl&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424560908,"description":"\nThe myth of oil scarcity has allowed four giant corporations--ExxonMobil, Shell, BP and Chevron--along with a handful of Wall Street and London banks to control the world's most important energy commodity, oil. The myth originated in the 1950's from a geologist at Shell, and was revived by the big oil giants in 2003 in time for the US bombing of Iraq.\n\nThe reality is quite different from claims of Peak Oil. Truth is that the world is running into oil, not running out of oil. Huge new oil and gas fields are being discovered from the eastern Mediterranean to the coast of Brazil, from East Africa to Iran and Iraq, from Norway to the Caribbean.\n\nF. William Engdahl discusses little-known details of wars and manipulations designed over the past half century or more-- wars in Africa, the mis-named Arab Spring, Iraq, Afghanistan, all to maintain a lock-grip control of the world's known oilfields. The myth of scarcity has been a pillar of their power and in fact of the power-projection of the United States as sole superpower.\n\nThe book details revolutionary new scientific work developed in Cold War secrecy in the Soviet Union which proved that oil originates not from dinosaur detritus or fossilized algae as western geology mythology maintains. The Soviet scientists showed that oil and gas have deep Earth origins some 200 km below. Like volcanoes, hydrocarbons are forced upwards until they typically are &quot;trapped&quot; in reservoir rock formations. The Russian work has been the target of a concerted campaign to discredit the theory. Little wonder. Were its implications understood widely, oil and gas would be considered as virtually a renewable energy and our energy crises and wars a thing of the past. As Henry Kissinger said, &quot;If you control the oil you control entire nations.&quot; The converse is also true--If oil cannot be controlled the controlling powers lose their control over other nations and the wars that go with it. This book is an eye-opener to comprehend the endless wars of the past decades.\n\n\nAbout the author:\n F. William Engdahl is is an internationbal best-selling author whose books on geopolitics and economics have been published in twelve languages. Included are A Century of War: Anglo-American Oil Politics; Gods of Money; Seeds of Destruction: The Hidden Agenda of Genetic Manipulation and Full-Spectrum Dominance: Totalitarian Democracy in the New World Order. he may be contacted at www.williamengdahl.com","torrent":{"xt":"urn:btih:c3da2609abddcfb7c6a2216c4899c1c958e64e6c","amp;dn":"Myths%2C+Lies+and+Oil+Wars+-+F.+William+Engdahl","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3da2609abddcfb7c6a2216c4899c1c958e64e6c","infoHashBuffer":{"type":"Buffer","data":[195,218,38,9,171,221,207,183,198,162,33,108,72,153,193,201,88,230,78,108]},"announce":[],"urlList":[]}}