{"title":"Emilia Fox Reads Agatha Christie","uid":13414792,"size":717439493,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c4365851c1ff80c3cbea957a6d01230d3068e7ec&amp;dn=Emilia+Fox+Reads+Agatha+Christie+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Horisarte","files":36,"time":1454478562,"description":"http://i.imgur.com/oEIDdRB.jpg\r\n\r\n#1. The Man in the Brown Suit [1924], 8 hours 27 mins, 48kbps/44kHz\r\nYearning for a little adventure in life, Anne Beddingfeld gets far more than she bargained for - while at the tube station, she sees a man fall to the tracks and die! A man dressed in brown, claiming to be a doctor, pronounces him dead and hurries away, dropping a scrap of paper with the peculiar words &quot;17-122 Kilmorden Castle.&quot; The police conclude the death was an accident, but Anne suspects otherwise. Lord Nasby, the press tycoon, agrees to hire her to investigate the matter. Armed with a small inheritance and the scrap of paper the mysterious man in the brown suit left behind, she sets off on her mission -- a mission that takes her from England to South Africa, and that leads to the discovery of missing diamonds, another murder, and attempts on Anne's own life...\r\n\r\n#2. The Seven Dials Mystery [1929], 7 hours 48 mins, 32kbps/22kHz \r\nAn innocent house party at the stately country mansion called &quot;Chimneys&quot; turns to horror when young Gerry Wade is found dead. His death is made worse by the fact that his friends had planned to play a practical joke on him; since he was a notorious over-sleeper, they ranged eight alarm clocks around his bed set to go off at intervals. When his dead body is found, however; only seven of those clocks remain, aligned in a row along the mantelpiece. George's friend, Ronny Devereux, ia convinced that his death is foul play, and his suspicions seem confirmed when Bundle finds him shot to death. She soon finds herself enlisting the help of another guest, Jimmy Thesiger and the stepsister of Gerald Wade, to find out what Ronny meant by his last words of &quot;Seven Dials&quot;. Bundle's adventures lead her into what looks like an international spy ring intent upon recovering a secret formula that would revolutionize the steel industry. Yet along the way, she quickly learns that she may not be able to trust the people she thought she could confide in....\r\n\r\n#3. Why Didn't They Ask Evans? [1935], 7 hours 13 mins, 48kbps/44kHz, (US title: The Boomerang Clue)\r\nWhen a man plunges down a cliff, two adventurous young friends decide to find his killer! While playing an erratic round of golf, Bobby Jones slices his ball over the edge of a cliff. His ball is lost, but on the rocks below he finds the crumpled body of a dying man. With his final breath the man opens his eyes and says, 'Why didn't they ask Evans?' Haunted by these words, Bobby and his vivacious companion, Frankie, set out to solve a mystery that will bring them into mortal danger!\r\n\r\n#4. They Came to Baghdad [1951], 7 hours 44 mins, 48kbps/44kHz\r\nPretty Victoria Jones, an incurable romantic with a mischievous streak, falls for a handsome stranger in Fitz-James Gardens and determines to pursue him in exotic Baghdad. When Edward eludes her, she is drawn into a quagmire of dust, deception, and murder. After a man dies in Victoria's hotel room, British agents recruit her to infiltrate a devious group that has developed a secret weapon of massive proportions. The evil conspirators - and a certain young man - may have finally met their match...\r\n\r\n#5. Destination Unknown [1954], 6 hours 46 mins, 32kbps/22kHz, (US title: So Many Steps to Death)\r\nWhen a number of leading scientists disappear without trace, concern grows within the international intelligence community. Are they being kidnapped? Blackmailed? Brainwashed? One woman appears to have the key to the mystery. Unfortunately, Olive Betterton now lies in a hospital bed, dying from injuries sustained in a Moroccan plane crash. Meanwhile, in a Casablanca hotel room, Hilary Craven prepares to take her own life. But her suicide attempt is about to be interrupted by a man who will offer her an altogether more thrilling way to die!","torrent":{"xt":"urn:btih:c4365851c1ff80c3cbea957a6d01230d3068e7ec","amp;dn":"Emilia+Fox+Reads+Agatha+Christie+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4365851c1ff80c3cbea957a6d01230d3068e7ec","infoHashBuffer":{"type":"Buffer","data":[196,54,88,81,193,255,128,195,203,234,149,122,109,1,35,13,48,104,231,236]},"announce":[],"urlList":[]}}