{"title":"Alfred Hitchcock Classics - The Manxman (1929) Silent - Xvid 1cd","uid":9564774,"size":525207552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4f2e9039f93062b7a218c7fa88ee672658823b7&amp;dn=Alfred+Hitchcock+Classics+-+The+Manxman+%281929%29+Silent+-+Xvid+1cd&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SaM","files":-1,"time":1391488082,"description":"Alfred Hitchcock Classics - The Manxman (1929) Silent - Xvid 1cd - Carl Brisson, Anny Ondra [DDR]\n\nThe Manxman is a 1929 British silent drama film directed by Alfred Hitchcock and starring Anny Ondra, Carl Brisson and Malcolm Keen. The film is based on a popular 1896 romantic novel The Manxman by Hall Caine, which had previously been made into a 1917 film. This was the last silent film Hitchcock directed before he made the transition to sound film with his next film Blackmail.\n\n    CAST:-\n    Carl Brisson - Pete Quilliam\n    Malcolm Keen - Philip Christian\n    Anny Ondra - Kate Cregeen\n    Randle Ayrton - Caesar Cregeen\n    Clare Greet - Mother (as Claire Greet)\n    Kim Peacock - Ross Christian (uncredited)\n    Nellie Richards - Wardress (uncredited)\n    Wilfred Shine - Doctor (uncredited)\n    Harry Terry - Man (uncredited)\n\nDirected by Alfred Hitchcock\nProduced by John Maxwell\nWritten by Hall Caine (novel), Eliot Stannard \nRunning time 110 minutes\n\nSYNOPSIS:- The Manxman (1929 Silent\nThe film tells the story of two childhood friends, a poor fisherman, Pete Quilliam (Carl Brisson), and a lawyer, Philip Christian (Malcolm Keen). Pete is in love with Kate (Anny Ondra), but when her father, Old Caesar (Randle Ayrton), refuses to consent to their marriage, Pete sets off for Africa to make his fortune, asking Philip to take care of Kate until he returns.\n\nIn his absence, Kate and Philip fall in love. When news reaches them that Pete was killed, they begin planning their lives together, as Philip prepares to assume the position of Deemster, the island's chief magistrate. The news is false however, and Pete returns to the island a wealthy man. Old Caesar agrees to let Kate marry him, and neither she nor Philip have it in them to break Pete's heart. As the wedding party proceeds in an old mill, Old Caesar sternly warns the newlyweds to remember how serious the vows of marriage are.\n\nKate is still in love with Philip. Shortly after a daughter is born, she decides to leave Pete, leaving him both the child and a note saying that she loves another man. However, Philip is about to become the Deemster and is unwilling to give up his career for her. Frustrated, she returns to Pete to take the baby, telling him that he is not the father, but he refuses to believe her or hand the child over. Distraught, Kate leaves and attempts to commit suicide by throwing herself off the quay, a crime on the Isle of Man.\n\nKate is brought to trial on the first day that Philip serves as Deemster. He is reluctant to sentence her, and when Pete appears in the courtroom to plead for his wife, he agrees to hand her over to him. Kate refuses to go, and Old Caesar, who is watching, gets up and condemns Philip for being the &quot;other man&quot;. Philip admits this and leaves the court.\n\nIn the final scene, Philip and Kate prepare to leave the Isle of Man and come to Pete's house to pick up the baby. In a shot reminiscent of the theater, Kate picks up the child, while Philip and Pete stand at opposite ends of the room. She brings the child over to Pete to say one last goodbye, and he breaks down, having lost everything. Philip and Kate leave the cottage to the jeers of the villagers, who have been watching the scene.\n\nTECHNICAL SPECIFICATIONS:-\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 855 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 23.976\nAudio Codec: 0x2000 (Dolby AC3) AC3\nAudio Bitrate: 192kb/s CBR 48000 Hz\nAudio Streams:  2\nAudio Languages:English\nRunTime 110 mins\nSubtitles: NONE\nRipped by: Trinidad [DDR]\nDuration: 110 mins","torrent":{"xt":"urn:btih:c4f2e9039f93062b7a218c7fa88ee672658823b7","amp;dn":"Alfred+Hitchcock+Classics+-+The+Manxman+%281929%29+Silent+-+Xvid+1cd","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4f2e9039f93062b7a218c7fa88ee672658823b7","infoHashBuffer":{"type":"Buffer","data":[196,242,233,3,159,147,6,43,122,33,140,127,168,142,230,114,101,136,35,183]},"announce":[],"urlList":[]}}