{"title":"The Best of Knitscene: A Collection of Simple, Stylish, and Spir","uid":9439638,"size":69462086,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c566a22a52aa05078807eed12ce10878f0a6825e&amp;dn=The+Best+of+Knitscene%3A+A+Collection+of+Simple%2C+Stylish%2C+and+Spir&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KnitLady","files":-1,"time":1388979149,"description":"Enjoy the 20 most popular knitting patterns and expert advice from the first five years of Knitscene magazine in The Best of Knitscene.\n\nThe knitwear designs of this one-of-kind collection have been knitted thousands of times by hundreds of knitters around the world. For the first time ever Lisa Shroyer, editor of Knitscene magazine, has compiled the most beloved, fashionable creations into a single all-star collection. Among the patterns included are Heather Lodinsky's Central Park Hoodie, Connie Chang Chinchio's Geodesic Cardigan, Katie Himmelberg's Phiaro Scarf, and other favorite designs. And these patterns are even better than ever, they've been updated with corrections, additional sizes, technique tutorials, and more. Some of these must-have knit patterns are now out of print, so Lisa is offering you a second chance to add them into your knitting pattern collection.\n\nPlus, you'll get articles and profiles on some of the most popular designers including Cecily Glowik MacDonald, Star Athena, and Kate Gagnon Osborn.\n\nWith The Best of Knitscene you'll fall in love all over again with your favorite patterns from Knitscene.","torrent":{"xt":"urn:btih:c566a22a52aa05078807eed12ce10878f0a6825e","amp;dn":"The+Best+of+Knitscene%3A+A+Collection+of+Simple%2C+Stylish%2C+and+Spir","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c566a22a52aa05078807eed12ce10878f0a6825e","infoHashBuffer":{"type":"Buffer","data":[197,102,162,42,82,170,5,7,136,7,238,209,44,225,8,120,240,166,130,94]},"announce":[],"urlList":[]}}