{"title":"Life in the Middle Ages - Goetz- [Non-Fiction] PDF_(K-Slender)","uid":8931942,"size":18076783,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c5a9f9f29c8263abc2e52fbbd6ce23c1ec59cb3e&amp;dn=Life+in+the+Middle+Ages+-+Goetz-+%5BNon-Fiction%5D+PDF_%28K-Slender%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"K-Slender","files":3,"time":1379480367,"description":"Historian Hans-Werner Goetz presents here a comprehensive depiction of life in the earlier Middle Ages that focuses on &quot;everyday history&quot;. According to Goetz it is nearly impossible to write a history of everyday life during the Middle Ages since the written sources of that age had entirely different purposes, never describing everyday life for its own sake. However, by drawing on chronicles, legal documents and even fiction, Goetz is able to produce a lively picture of this era, illuminating everyday life as it was conditioned by institutional, physical, and social environments. &quot;Life in the Middle Ages&quot; addresses many of the current concerns of medieval historians in one volume. After a brief introduction to the general conditions of medieval life, Goetz examines the family, illustrating the family's fundamental importance as an ideal building block for other forms of society. The book explores monasticism and the monastery, which during the early and the high Middle Ages affected not only religious but also social, political, economic and spiritual life. Goetz examines peasant life within the seigneurial system, focusing on the social and existential forms of the medieval manorial system. He also examines the life of the ruling class, concentrating on the sociopolitical level of princes and kings and the &quot;courtly life&quot;. Finally, Goetz evokes the beginning of urban life in the early medieval and high medieval town. Throughout the book Goetz uses vignettes to illustrate the lives of simple people who may not have influenced world history but were nevertheless an integral part of it. Written for a broad audience, &quot;Life in the Middle Ages&quot; should interest students, scholars and all general readers interested in both history and the Middle Ages. ","torrent":{"xt":"urn:btih:c5a9f9f29c8263abc2e52fbbd6ce23c1ec59cb3e","amp;dn":"Life+in+the+Middle+Ages+-+Goetz-+%5BNon-Fiction%5D+PDF_%28K-Slender%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5a9f9f29c8263abc2e52fbbd6ce23c1ec59cb3e","infoHashBuffer":{"type":"Buffer","data":[197,169,249,242,156,130,99,171,194,229,47,187,214,206,35,193,236,89,203,62]},"announce":[],"urlList":[]}}