{"title":"Corbin Fisher - - - Best Buds 4 ((MictrmbL))","uid":5272731,"size":161363968,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:c635043e5381a81fd516b3933531e3efe874ba0b&amp;dn=Corbin+Fisher+-+-+-+Best+Buds+4+%28%28MictrmbL%29%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mictrmbl","files":45,"time":1263290110,"description":"From the vaults of Corbin Fisher:\n\nWe've waited a very long time to see Ben finally bottom, and that wait has made two things absolutely inevitable:\n\n1. He WOULD finally bottom (because the chorus of e-mails requesting to see just that progressively got louder and louder, and I was right there with you in wanting to see it)!\n\n2. TJ would be the one to do the honors.\n\nIndeed, there was no way anyone but TJ could be the one to pop Ben's cherry. These two guys - best buds for years - have been through a whole lot together. They were in high school together, shared girls with one another, played on the same football team as one another, and did most everything two straight stud buds could possibly do with one another. When they both arrived here at CF - together, as well! - they began to do a whole lot more with each other. Ben and TJ jerked off for us side by side, blew one another, Ben fucked TJ, and both even took part in a 4way - all of it for the first time, and all before our very eyes.\n\nIt took awhile for things to get to the point where Ben was willing to bottom, though, as he really wouldn't even consider doing such a thing for the longest time. Once he and TJ started to have some fun with each other here on CF, though, his take on it began to change. As you know, Ben confessed to having thought about doing stuff with TJ before and there's no doubt that once the ice was broken, anything was possible.\n\nAnd so here we have it - the long awaited culmination of the Best Buds series that is more than just a sequence of videos but also a fascinating story of friendship you can't see anywhere else but here. If this video makes anything clear, it's that Ben is one hell of a loud bottom, TJ's dick looks entirely at home buried in Ben's tight ass, and that TJ and Ben - Best Buds - are amazingly hot together, and we all owe them a tremendous amount of thanks for not only being willing to take their friendship to this new level, but do it all right before our very eyes and letting us see every single step of the journey!\n","torrent":{"xt":"urn:btih:c635043e5381a81fd516b3933531e3efe874ba0b","amp;dn":"Corbin+Fisher+-+-+-+Best+Buds+4+%28%28MictrmbL%29%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c635043e5381a81fd516b3933531e3efe874ba0b","infoHashBuffer":{"type":"Buffer","data":[198,53,4,62,83,129,168,31,213,22,179,147,53,49,227,239,232,116,186,11]},"announce":[],"urlList":[]}}