{"title":"The Creatures Trilogy (Creatures 1, Creatures 2, Creatures 3)","uid":4095894,"size":785299914,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c6521496d9ebef7d533c98d45a82bf36e356f0fe&amp;dn=The+Creatures+Trilogy+%28Creatures+1%2C+Creatures+2%2C+Creatures+3%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Civoknay","files":26,"time":1206313886,"description":"-=The Creatures Trilogy 3 in 1 Gold Pack=-  (PC VERSION, no Mac or Linux, sorry)\n\n\nA compilation CD of the &amp;#039;97, &amp;#039;98, and &amp;#039;99 releases of Creatures 1, 2, and 3, from Creature Labs.  Released by Encore Software.  Life Kit #1 for Creatures 1 and Creatures 2 are allegedly included, although I&amp;#039;ve yet to find evidence of that.\n\nIncluded as a bonus in case their site ever goes down permanently, are most of the important downloadable patches, upgrades, and object packs from Creature Labs.  Docking Station (the free game linkable with Creatures 3) and its one or two addons are NOT included, as if the Creature Labs homepage does perish, Docking Station will become unusable, as it requires an online registration and connection to the master server to function.  If you want to download that, go to http://www.gamewaredevelopment.co.uk/creatures_index.php and hit up the Free Downloads area.\n\nAlso not included are no-CD cracks for any of the games.  They&amp;#039;re a pain in the ass and typically require registry edits, so just Google them if you&amp;#039;re that desperate.  Being able to run all three of them from one CD is pretty convenient anyway.\n\n\nINSTRUCTIONS:\n\nBurn it, mount it, pretty much anything should work.  This was designed to run on Windows 9x, so if you&amp;#039;re having problems running it on XP, compatibility settings are your friend.  The autorun (LAUNCHER.EXE) will most likely crash before even displaying, so you can either try going into the subfolders and launching the individual setups manually, or try compatibility settings.  If you&amp;#039;re trying to run this on Vista, best of luck, you&amp;#039;ll need it.\n\nIt is HIGHLY RECOMMENDED that you install the extras, at the very least the updated executables and probably the Life Kits, preferably before playing for the first time.  Some of the updates also require other updates to be installed before they&amp;#039;ll function.\n\nCreatures 1: Creatures_Update_2.exe patches the game to 1.02 and should be run first.  The 1.04 update doesn&amp;#039;t fix very much and personally made things worse for me, so you might just want to bypass that.  Life Kit 1 should be installed next, followed by the updated Injector.exe.  The rest is up to you.\n\nCreatures 2: Install the EXE upgrade first.  Eggs.exe is the genome update to supposedly prevent the notorious One Hour Stupidity Syndrome, and should come next.  (There are a couple other fixes for OHSS if you need an alternative, check out http://creatures.wikia.com/wiki/OHSS)  Injector.exe needs to be installed before Hatchery.exe.  The rest is up to you.\n\nCreatures 3: Update2 should probably be installed before anything else.  That&amp;#039;s it.\n\nBear in mind that these games were never the most stable, and you&amp;#039;ll likely end up with two or three add-ons or updates that won&amp;#039;t install regardless of what kind of setup you&amp;#039;re trying to play on.  God help you if you start installing the fanmade COBS willy-nilly.\n\nEnjoy, and slap a Grendel for old time&amp;#039;s sake.","torrent":{"xt":"urn:btih:c6521496d9ebef7d533c98d45a82bf36e356f0fe","amp;dn":"The+Creatures+Trilogy+%28Creatures+1%2C+Creatures+2%2C+Creatures+3%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c6521496d9ebef7d533c98d45a82bf36e356f0fe","infoHashBuffer":{"type":"Buffer","data":[198,82,20,150,217,235,239,125,83,60,152,212,90,130,191,54,227,86,240,254]},"announce":[],"urlList":[]}}