{"title":"Oncology Boards Flash Review [PDF][tahir99] VRG.pdf","uid":10634397,"size":3601911,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c68210e4e9cddde71800f6b3173c5c3d47b337a4&amp;dn=Oncology+Boards+Flash+Review+%5BPDF%5D%5Btahir99%5D+VRG.pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tahir99","files":1,"time":1406371153,"description":"Oncology Boards Flash Review\n\nby Francis P. Worden MD (Author), Rami N. Khoriaty MD (Author)\n\nTRUE PDF, BOOKMARKED and INDEXED\n\nimage\n\nISBN-13: 978-1936287819 ISBN-10: 1936287811 Edition: 1st May 15, 2013\n\n\nOncology Boards Flash Review is a question-and-answer book designed to summarize the most important facts one needs to know for the medical oncology boards, including the most up-to-date information on well-established chemotherapy regimens for a variety of malignancies.\n\nCoverage extends across the range of major hematologic malignancies and solid tumors, and includes reviews of pharmacology, biostatistics, genetics and tumor biology, and survivorship and palliative care. The book covers all of the topics listed by the American Board of Internal Medicine as essential material for the Medical Oncology Board Examination. Each chapter is written by a fellow and edited by expert faculty and clinicians, and Flash Review includes key points summarized in bullet point form for easy recall. Question-based headings enable the reader to systematically review and assess his knowledge.\n\nThis study guide distills the must-know points of medical oncology into a single source for targeted board review, self-assessment, or handy quick reference.\n\nOncology Boards Flash Review features:\n\nMust-know points of medical oncology\nCoverage of hematologic malignancies, solid tumors, pharmacology, biostatistics, genetics and tumor biology, and survivorship and palliative care\nKey points summarized in bullet form for easy recall\nEach chapter written by a fellow and edited by expert faculty and clinicians\nUseful tool for board review, self-assessment or, handy quick reference","torrent":{"xt":"urn:btih:c68210e4e9cddde71800f6b3173c5c3d47b337a4","amp;dn":"Oncology+Boards+Flash+Review+%5BPDF%5D%5Btahir99%5D+VRG.pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c68210e4e9cddde71800f6b3173c5c3d47b337a4","infoHashBuffer":{"type":"Buffer","data":[198,130,16,228,233,205,221,231,24,0,246,179,23,60,92,61,71,179,55,164]},"announce":[],"urlList":[]}}