{"title":"Madonna 24 Bit Vinyl Pack","uid":8621202,"size":14609660606,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c700b0763ad5be9829dc1996896ea09284588114&amp;dn=Madonna+24+Bit+Vinyl+Pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":8,"uploader":"politux","files":-1,"time":1372378420,"description":"\n  Madonna 24 Bit Vinyl Pack\n\n  * Genre: Pop/Rock, Electronic\n  * Styles: Club/Dance, Dance-Pop, Pop, Adult Contemporary\n  * Source: Vinyl\n  * Codec: FLAC\n  * Bit Rates: ~ 2,800 - 3,200 kbps\n  * Bit Depth: 24\n  * Sampling Rate: 96,000 Hz\n\n  Albums\n\n  * 1983 Madonna LP (Japan P-11394)\n  * 1985 Dress You Up + Aint No Big Deal (Japan)\n  * 1985 Material Girl (US)\n  * 1985 Like a Virgin\n  * 1987 La Isla Bonita (9206633-0)\n  * 1989 Like a Prayer\n  * 1990 Hanky Panky \n  * 1990 Keep It Together (92 14270)\n  * 1993 Fever + Rain (PRO 819)\n  * 2006 Confessions on a Dance Floor\n  * 2006 Confessions on a Dance Floor (2xLP Limited) (EU)\n  * 2008 Hard Candy (470972-1)\n  * 2012 Erotica (2LP Remastered) (EU)\n  * 2012 Girl Gone Wild \n  * 2012 True Blue (Heavy Vinyl, Remastered)\n\n  Artist Bio\n\n  * After stars reach a certain point, it's easy to forget what they became famous for and concentrate solely on their personas. Madonna is such a star. She rocketed to stardom so quickly in 1984 that it obscured most of her musical virtues. Appreciating her music became even more difficult as the decade wore on, as discussing her lifestyle became more common. However, one of Madonna's greatest achievements is how she has manipulated the media and the public with her music, her videos, her publicity, and her sexuality. Arguably, Madonna was the first female pop star to have complete control of her music and image.\n\n  * She moved from her native Michigan to New York in 1977 with dreams of becoming a ballet dancer. She studied with choreographer Alvin Ailey and modeled. In 1979, she became part of the Patrick Hernandez Revue, a disco outfit that had the hit &quot;Born to Be Alive.&quot; She traveled to Paris with Hernandez; it was there that she met Dan Gilroy, who would soon become her boyfriend. Upon returning to New York, the pair formed the Breakfast Club, a pop/dance group. Madonna originally played drums for the band, but she soon became the lead singer. In 1980, she left the band and formed Emmy with her former boyfriend, drummer Stephen Bray. Soon, Bray and Madonna broke off from the group and began working on some dance/disco-oriented tracks. A demo tape of these tracks worked its way to Mark Kamins, a New York-based DJ/producer. Kamins directed the tape to Sire Records, which signed the singer in 1982.\n\n  * Kamins produced Madonna's first single, &quot;Everybody,&quot; which became a club and dance hit at the end of 1982; her second single, 1983's &quot;Physical Attraction,&quot; was another club hit. In June of 1983, she had her third club hit with the bubbly &quot;Holiday,&quot; which was produced by Jellybean Benitez. Madonna's self-titled debut album was released in September of 1983; &quot;Holiday&quot; became her first Top 40 hit the following month. &quot;Borderline&quot; became her first Top Ten hit in March of 1984, beginning a remarkable string of 17 consecutive Top Ten hits. While &quot;Lucky Star&quot; was climbing to number four, Madonna began working on her first starring role in a feature film, Susan Seidelman's Desperately Seeking Susan.\n\n  * Madonna's second album, the Nile Rodgers-produced Like a Virgin, was released at the end of 1984. The title track hit number one in December, staying at the top of the charts for six weeks; it was the start of a whirlwind year for the singer. During 1985, Madonna became an international celebrity, selling millions of records on the strength of her stylish, sexy videos and forceful personality. After &quot;Material Girl&quot; became a number two hit in March, Madonna began her first tour, supported by the Beastie Boys. &quot;Crazy for You&quot; became her second number one single in May. Desperately Seeking Susan was released in July, becoming a box office hit; it also prompted a planned video release of A Certain Sacrifice, a low-budget erotic drama she filmed in 1979. A Certain Sacrifice wasn't the only embarrassing skeleton in the closet dragged into the light during the summer of 1985 -- both Playboy and Penthouse published nude photos of Madonna that she posed for in 1977. Nevertheless, her popularity continued unabated, with thousands of teenage girls adopting her sexy appearance, being dubbed &quot;Madonna wannabes.&quot; In August, she married actor Sean Penn.","torrent":{"xt":"urn:btih:c700b0763ad5be9829dc1996896ea09284588114","amp;dn":"Madonna+24+Bit+Vinyl+Pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c700b0763ad5be9829dc1996896ea09284588114","infoHashBuffer":{"type":"Buffer","data":[199,0,176,118,58,213,190,152,41,220,25,150,137,110,160,146,132,88,129,20]},"announce":[],"urlList":[]}}