{"title":"The Long Dark v226","uid":11844495,"size":1085626275,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c79bb20d5b7b6e81302ce0519d2f86c1d3967f79&amp;dn=The+Long+Dark+v226&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dauphong","files":1,"time":1429904546,"description":"THE LONG DARK SANDBOX UPDATED to v.226 -- CHANGELIST\n\nUPDATE TO UNITY 5\n\n* The Long Dark has now been updated to use Unity 5. Everyone should experience performance improvements between +50-300%. Depending in your hardware, you may now be able to play at higher resolutions or quality settings than you could before. In general the game should feel smoother and look better for everyone.\n\n\nADDITIONS &amp; TUNING\n\n* All skies and Time of Day settings have been revised to utilize Unity 5's improved skybox technology.\n* Bears have now migrated to all regions of the game world.\n* Adding fuel to a fire at the embers state now restarts the fire.\n* Increased rate at which warmth reduces player's Freezing rating.\n* Improved loot spawn variation in car trunks and fishing huts.\n* Improvement to Item Transfer UI: Items in a stack will transfer one by one unless the stack is greater than five items.\n* Cat Tails can be harvested once to produce both the Stalks and the Heads.\n* Harvestable plants can be inspected before committing to the harvesting action.\n* Rifle Aim sensitivity can be tuned separately from mouse zoom settings. This should improve rifle aiming.\n\nBUGS FIXED\n\n* Fixed UI issue that could cause some HUD elements to not be visible at certain aspect ratios.\n* Fixed issue that could cause Cat Tails to have zero weight and zero calories.\n* Fixed problem with movement not resuming if movement key was held down when exiting an interface.\n* Fixed bug where flare audio would not end if the player was attacked while holding a lit flare.\n* Fixed problem where certain containers (e.g., file cabinets) would never have loot in Stalker\n* Fixed problem with not being able to bind the Apple Command key (Mac only)","torrent":{"xt":"urn:btih:c79bb20d5b7b6e81302ce0519d2f86c1d3967f79","amp;dn":"The+Long+Dark+v226","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c79bb20d5b7b6e81302ce0519d2f86c1d3967f79","infoHashBuffer":{"type":"Buffer","data":[199,155,178,13,91,123,110,129,48,44,224,81,157,47,134,193,211,150,127,121]},"announce":[],"urlList":[]}}