{"title":"Leslie Gore First 4 Albums","uid":4597907,"size":105212043,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c7e5e35c6f4a6aa29e4881f5ecd7184ff6c46f8a&amp;dn=Leslie+Gore+First+4+Albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Criptor","files":48,"time":1230078051,"description":"This is Leslie Gores' first 4 albums recorded direct from the LP at 128KBPS \n\nAlbums in this torrent\n\n&quot;I'll Cry If I Want To&quot; 1963\n&quot;Sings Of Mixed Up Hearts&quot; 1963\n&quot;Boys, Boys, Boys&quot; 1964\n&quot;Girl Talk&quot; 1964\n\nBiography\n\nThe most commercially successful solo singer to be identified with the girl group sound, Lesley Gore hit the number one spot with her very first release, &quot;It's My Party,&quot; in 1963. Produced by Quincy Jones, who fattened the teenager's sound with double-tracked vocals and intricate backup vocals and horns, she reeled off a few more big hits in 1963 and 1964, including &quot;Judy's Turn to Cry,&quot; &quot;She's a Fool,&quot; &quot;You Don't Own Me,&quot; &quot;That's the Way Boys Are,&quot; and &quot;Maybe I Know.&quot; She wasn't the most soulful girl group singer by a long shot, but she projected an archetype of female adolescent yearning. Her best songs survive as classics, particularly the irresistibly melodic &quot;Maybe I Know&quot; and &quot;Look of Love&quot; (both written by Ellie Greenwich and Jeff Barry) and &quot;You Don't Own Me,&quot; an anthem of independence with a feminist theme that was considerably advanced for early 1964.\n\nSo what was Quincy Jones doing producing a white suburban teenager who had never recorded before? A couple of demos she recorded with her vocal coach made their way to Mercury's president, who recommended her to Jones, the label's A&amp;R head. For their first session, Gore and Jones picked &quot;It's My Party&quot; out of a pile of about 200 demos. The &quot;It's My Party&quot; single was rush-released when Jones found out that Phil Spector had plans to record the same song with the Crystals.\n\n&quot;It's My Party&quot; and the weaker sequel, &quot;Judy's Turn to Cry,&quot; have given Gore a somewhat unfair bratty image. Those are the hits that are remembered the most, but much of her subsequent material was both more mature (or, perhaps more accurately, less immature) and stronger. The singles were also very well-produced, with orchestral arrangements (by Claus Ogerman) that hewed closer to mainstream pop than Phil Spector's Wall of Sound. Retrospectives of Jones' career usually downplay or omit his work with Gore, although it was among his most commercially successful; he's known now for recordings that are, well, funkier. But his success with Gore did a lot to build his already impressive rÃƒÂ©sumÃƒÂ© within the industry.\n\nGore appeared on the legendary T.A.M.I. Show alongside such heavyweights as the Rolling Stones, James Brown, and Smokey Robinson, but after 1964 her star plummeted rapidly. Mercury was still investing a lot of care in her sessions throughout the rest of the '60s, and her material and arrangements showed her capable of greater stylistic range than many acknowledged. But after the mid-'60s, Jones no longer worked with the singer on a regular basis. &quot;Sunshine, Lollipops and Rainbows&quot; (1965) and &quot;California Nights&quot; (1967), both of which were co-written by Marvin Hamlisch, would be her only Top 20 entries after 1964. She played the cabarets after her days as an active recording artist, and eventually had some success as a songwriter for other performers. Shortly after the turn of the century, Gore returned to recording, collaborating with multi-instrumentalist Blake Morgan. In 2005, she released the critically acclaimed Ever Since, which landed songs on CSI: Miami and Showtime's The L Word as well as Jeff Lipsky's film Flannel Pajamas, which debuted at Sundance in 2006. ","torrent":{"xt":"urn:btih:c7e5e35c6f4a6aa29e4881f5ecd7184ff6c46f8a","amp;dn":"Leslie+Gore+First+4+Albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7e5e35c6f4a6aa29e4881f5ecd7184ff6c46f8a","infoHashBuffer":{"type":"Buffer","data":[199,229,227,92,111,74,106,162,158,72,129,245,236,215,24,79,246,196,111,138]},"announce":[],"urlList":[]}}