{"title":"Livat.i.Parken.2013.SWEDISH.PAL.DVDR","uid":15171470,"size":4681422848,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c7ee4507b21f0a4eab95f30aeb5b4a8be63490ab&amp;dn=Livat.i.Parken.2013.SWEDISH.PAL.DVDR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1467395982,"description":"Åbackens folkpark har varit stängd i sex år, men nu ska den återigen få liv. Det är tyvärr lite lättare sagt än gjort. Dagen före invigning är renoveringen långt ifrån färdig.\r\n\r\nDen raka, ärliga och känslokalla ägarinnan Eivor Stark (Jeanette Capocci) lägger hela ansvaret på sin tafatte och rent ut sagt odugliga assistent Richard (Pär Nymark) Mer problem blir när den något anspråkslösa mannen Torsten (Tomas Hedengran) dyker upp och anser sig vara rättmätig ägare av parken. Hur har han tänkt där? Och vad förväntar sig hans fru Gunilla (Sanna Ekman)? Det är ju trots allt hennes födelsedag.\r\n\r\nHur går det för den nyutexaminerade fotografen Harald (Jojje Jönsson)? Får han någonsin sin bild på den avdankade tyska operastjärnan Brunhild Müller (Siw Carlsson)? Som för övrigt inte bara lider av svår hypokondri utan också har andra stora problem, för varför vill inte hon inte dela med sig av sin vackra stämma? Man kan ju nästan tro att den inte är vacker längre.\r\n\r\nSen kan man fråga sig vad Conny Cash (Stefan Gerhardsson) gör där? Har inte han en lunchtid att passa, i fängelset? Ett frosseri i förvecklingar och galenskap, allting samlat år 1985 på Åbackens folkpark","torrent":{"xt":"urn:btih:c7ee4507b21f0a4eab95f30aeb5b4a8be63490ab","amp;dn":"Livat.i.Parken.2013.SWEDISH.PAL.DVDR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7ee4507b21f0a4eab95f30aeb5b4a8be63490ab","infoHashBuffer":{"type":"Buffer","data":[199,238,69,7,178,31,10,78,171,149,243,10,235,91,74,139,230,52,144,171]},"announce":[],"urlList":[]}}