{"title":"Days of Hunger, Days of Chaos - Texe Marrs","uid":11712901,"size":950128,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c86dc5c9d5ee2bf482600a4d39dece906bfbaa43&amp;dn=Days+of+Hunger%2C+Days+of+Chaos+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424399195,"description":"\n&quot;Nothing to Eat,&quot; screams the newspaper headlines. &quot;Hungry Mobs Panic and Riot.&quot; Are we, in fact, about to suffer disastrous food shortages? Will an angry and desperate people strike back in rage, giving a corrupt government the pretext to set up a frightening police state?\n\nDays of Hunger, Days of Chaos reveals the horrifying truth about a monumental plot to starve Americans and the people of the world into submission. The coming great hunger will come upon us suddenly, at an instant, astonishing all with its ferocity and total devastation.\n\nThe book of Revelation warns of deadly famine and pestilence to overtake the world in the last days. We now face the ominous reality of mass suffering and death. It will be hell on Earth, a fierce and brutal time of utter misery and despair. In this stunning investigative report, Texe Marrs reveals how these incredible prophecies are quickly coming to pass.\n\nAbout the author:\n Texe Marrs is author of 46 books, including The Personal Robot Book; Careers with Robots; The Great Robot Book; and Codex Magica: Secret Signs, Mysterious Symbols, and Hidden Codes of the Illuminati. A retired United States Air Force officer, he graduated Summa Cum Laude from Park University and earned his Masters Degree at North Carolina State University. Mr. Marrs is founder and president of powerofprophecy.com in Austin, Texas and is host of a popular radio program heard around the world","torrent":{"xt":"urn:btih:c86dc5c9d5ee2bf482600a4d39dece906bfbaa43","amp;dn":"Days+of+Hunger%2C+Days+of+Chaos+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c86dc5c9d5ee2bf482600a4d39dece906bfbaa43","infoHashBuffer":{"type":"Buffer","data":[200,109,197,201,213,238,43,244,130,96,10,77,57,222,206,144,107,251,170,67]},"announce":[],"urlList":[]}}