{"title":"Mickey Newbury - Nights When I Am Sane [1994] [EAC/FLAC]","uid":10646876,"size":248026578,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c9b630e0d5f646948eb84501e550d9eb8d8d1f5a&amp;dn=Mickey+Newbury+-+Nights+When+I+Am+Sane+%5B1994%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":-1,"time":1406557975,"description":"FLAC / Lossless / Log (100%) / Cue\nLabel/Cat#: Winter Harvest Entertainment #3301)\nCountry: USA\nYear: February 21, 1995\nGenre: folk,americana\nFormat: CD\n\n\n\n[b]\n\n1. Just Dropped In \n2. Thirty-Third of August \n3. East Kentucky \n4. Nights When I Am Sane \n5. Heaven Help the Child Listen\n6. Genevieve \n7. Easy Street \n8. Apples Dipped in Candy \n9. You're My Lady Now\n10. San Francisco Mabel Joy \n11. Earthquake \n12. Saint Cecilia \n13. Four Ladies \n14. What Will I Do \n\n\n\n\n\nReleased by the tiny Nashville label Winter Harvest, Nights When I Am Sane was Newbury's first album in six years and his first live album since Live at Montezuma Hall 20 years earlier. Those decades may have deepened Newbury the singer's voice a bit, but it only made him a more powerful performer. As one would expect, Nights When I Am Sane is comprised of a batch of Newbury's most well-known songs, but the power these performances hold make them the definitive versions. With one guitar or at most one accompanist, Newbury has always been able to convey what most others would need an entire band to try to get to. Songs like &quot;Just Dropped In (To See What Condition My Condition Was In)&quot; (bet you didn't know he wrote that, did ya?) come across with so much feeling, pathos, and depth that it's possible to see clear into the darkness in the soul of the man when he wrote it. When Newbury gets to his famous refrain on &quot;Nights When I Am Sane,&quot; he's telling a hidden truth, one so obscured by legend and the grime of time and music-business bullsh*t that it almost slips though in its gentleness. &quot;We would sweat and moan/Until the need in us was gone/In one another's arms all through the night,&quot; begins &quot;What Will I Do Now,&quot; the track that ends this set. A song of a lover left to bear his grief in the darkness now that she's gone, Newbury's falsetto conveys the grief with so much empathy, it's hard to believe this isn't some man crying on his best friend's shoulder. Only Newbury would have the naked, unpretentious honesty to end a concert with a song like this, and only he could get away with it.","torrent":{"xt":"urn:btih:c9b630e0d5f646948eb84501e550d9eb8d8d1f5a","amp;dn":"Mickey+Newbury+-+Nights+When+I+Am+Sane+%5B1994%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b630e0d5f646948eb84501e550d9eb8d8d1f5a","infoHashBuffer":{"type":"Buffer","data":[201,182,48,224,213,246,70,148,142,184,69,1,229,80,217,235,141,141,31,90]},"announce":[],"urlList":[]}}