{"title":"MANSUN - ATTACK OF THE GREY LANTERN (1997) (256 KBPS)","uid":3600768,"size":115842434,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c9b8dbfb5e6e2534ca41384a6378c06ffc6018ce&amp;dn=MANSUN+-+ATTACK+OF+THE+GREY+LANTERN+%281997%29+%28256+KBPS%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"topleatherman","files":13,"time":1169408749,"description":"ATTACK OF THE GREY LANTERN - The stunning first album from the UK&amp;#039;s MANSUN - in its original UK sequencing.. \n\nOne of those RARE first albums - as in the case of MASSIVE ATTACK, SANTANA, and LED ZEPPELIN - that is so well conceptualized, mature and brilliantly executed that it belies the rookie status of the artist. Despite having built an extensive fan base with their constant touring prior to the release of their first record, ATTACK OF THE GREY LANTERN nonetheless stunned virtually every European music &quot;pundit&quot; by crashing into the UK charts at #1 - dislodging the seemingly invincible reign of BLUR&amp;#039;s PARKLIFE in the top chart position. \n\n\nFROM THE ALLMUSIC GUIDE: \n\nOpening with the swirling, cinematic strings of &quot;The Chad Who Loved Me,&quot; Mansun&amp;#039;s debut album Attack of the Grey Lantern is anything but a conventional Brit-pop record. Few debut records are this assured, especially when a group is developing such an idiosyncratic, individual style. Mansun recalls many artists ? Suede, Manic Street Preachers, Tears for Fears, David Bowie, ABC, Blur, Prince ? without sounding exactly like any of them. Attack of the Grey Lantern is a grandiose, darkly seductive blend of new wave and &amp;#039;90s indie rock, filled with phased guitars, drum machines, and subversive, off-kilter song structures, many of which wind past five minutes. No song is ever quite what it seems ? &quot;Mansun&amp;#039;s Only Love Song&quot; balances between soul and fractured pop, &quot;Stripper Vicar&quot; has new wave backing vocals and hard-rock chords, while &quot;Taxloss&quot; marries Suede&amp;#039;s dark glam rock with uneasy psychedelia. It&amp;#039;s an ambitious, even pretentious, record, but Mansun has enough confidence and skill to make it an astonishingly original debut.","torrent":{"xt":"urn:btih:c9b8dbfb5e6e2534ca41384a6378c06ffc6018ce","amp;dn":"MANSUN+-+ATTACK+OF+THE+GREY+LANTERN+%281997%29+%28256+KBPS%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9b8dbfb5e6e2534ca41384a6378c06ffc6018ce","infoHashBuffer":{"type":"Buffer","data":[201,184,219,251,94,110,37,52,202,65,56,74,99,120,192,111,252,96,24,206]},"announce":[],"urlList":[]}}