{"title":"John Dies at the End","uid":8810624,"size":698881,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:c9f4e20ec90b1ef62c79b8bc4c5a144d0cfcca5d&amp;dn=John+Dies+at+the+End&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"livhre","files":-1,"time":1376448861,"description":"STOP.  You should not have touched this flyer with your bare hands.  NO, don't put it down. It's too late.  They're watching you.  My name is David Wong. My best friend is John. Those names are fake. You might want to change yours.  You may not want to know about the things you'll read on these pages, about the sauce, about Korrok, about the invasion, and the future. But it's too late. You touched the book. You're in the game. You're under the eye.  The only defense is knowledge. You need to read this book, to the end. Even the part with the bratwurst. Why? You just have to trust me.\n\nThe important thing is this:  The drug is called Soy Sauce and it gives users a window into another dimension.  John and I never had the chance to say no.  You still do.   I'm sorry to have involved you in this, I really am. But as you read about these terrible events and the very dark epoch the world is about to enter as a result, it is crucial you keep one thing in mind:   None of this was my fault.\n\nFollow me on twitter: @livhre\nRequest books on twitter: @livhre\nPlease seed and rate the torrents I upload. ","torrent":{"xt":"urn:btih:c9f4e20ec90b1ef62c79b8bc4c5a144d0cfcca5d","amp;dn":"John+Dies+at+the+End","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c9f4e20ec90b1ef62c79b8bc4c5a144d0cfcca5d","infoHashBuffer":{"type":"Buffer","data":[201,244,226,14,201,11,30,246,44,121,184,188,76,90,20,77,12,252,202,93]},"announce":[],"urlList":[]}}