{"title":"Neil Young and Bluenote Cafe' - Bluenote Cafe' (2015) [2CD] [EAC","uid":13683576,"size":1042805993,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca69aa716b638bd7af2069d9ff14f5e2628011ff&amp;dn=Neil+Young+and+Bluenote+Cafe%27+-+Bluenote+Cafe%27+%282015%29+%5B2CD%5D+%5BEAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pucholoco","files":38,"time":1456523269,"description":"Neil Young and Bluenote Cafe' - Bluenote Cafe' (2015) [2CD] \r\n          EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 0.98 Gb \r\n                   Full Artwork @ 300 dpi (png) -&gt; 43 Mb\r\n\r\n\r\nRecorded at various shows during Neil Young and Bluenote Café's 1988 tour, this superb live set documents one of Neil's most funky and heartfelt periods, featuring 7 unreleased songs - &quot;Soul of a Woman,&quot; &quot;Bad News Comes to Town,&quot; Ain't it the Truth,&quot; &quot;I'm Goin',&quot; &quot;Crime of the Heart,&quot; &quot;Doghouse,&quot; &quot;Fool for Your Love,&quot; - and a searing 19+ minute version of the immortal &quot;Tonight's the Night&quot; at The Pier in New York City. It was a wild night. \r\n\r\nNeil Young is famous as a man who is going to do what he wants, and he's willing to pounce on a moment's inspiration and run with it if it pleases him. In 1987, Young decided he wanted to set aside rock &amp; roll for a while and play the blues, and that's just what he did. He recruited his longtime musical partners Crazy Horse (Frank Sampedro on keys, Billy Talbot on bass, and Ralph Molina on drums), added a six-piece horn section (led by Steve Lawrence on tenor sax), and called the new band the Bluenotes, hitting the road with the new act in late 1987.\r\n\r\nIn 1988, Young cut an album with the Bluenotes, This Note's for You, and toured some more with the group before deciding he wanted to move back to topical songwriting with 1989's Freedom, leaving the Bluenotes behind for good. Bluenote Café is an installment in Young's Neil Young Archives series that documents his 1987-1988 concerts with the Bluenotes; unlike most of the NYA releases, this doesn't present a single show, but stitches together highlights from 11 different gigs from November 1987 to August 1988. \r\n\r\nOne of the unusual aspects of Young's Bluenotes period is that the format of the band didn't adapt itself well to his back catalog, so with the exception of a 19-minute workout on &quot;Tonight's the Night,&quot; pretty much everything here is unique to this particular ensemble, and while it might have been interesting to hear Young rework some of his more primal material with a bluesy spin, that doesn't happen. \r\n\r\nBut there are a number of otherwise unrecorded tunes here that merit preservation, particularly the lean, funky &quot;Doghouse&quot; and the tough but playful &quot;Ain't It the Truth,&quot; and the performances here are consistently solid. Crazy Horse don't sound as exciting when reduced to a rhythm section, but they give this music a solid foundation and a deep groove, and if the horn section has only so many moves, they're emphatic and drive these songs home with impressive force. \r\n\r\nAnd the Bluenotes were a fine showcase for Young's guitar work; he doesn't spin off many epic solos here as he does with most of his electric bands, but the urgent, brittle tone of Young's guitar is a great match for his brief bursts of six-string fury, recalling a wired and feral version of Albert Collins. As a two-disc set, Bluenote Café feels a bit overstuffed and drawn out, but these recordings confirm the Bluenotes hold up better than many of Young's creative left turns in the '80s, and this is a thorough and entertaining look at an often overlooked phase in Young's creative journey.\r\n\r\nCD1\r\n01 - Welcome To The Big Room\r\n02 - Don't Take Your Love Away From Me\r\n03 - This Note's For You\r\n04 - Ten Men Workin'\r\n05 - Life In The City\r\n06 - Hello Lonely Woman\r\n07 - Soul Of A Woman\r\n08 - Married Man\r\n09 - Bad News Comes To Town\r\n10 - Ain't It The Truth\r\n11 - One Thing\r\n12 - Twilight\r\n\r\nCD2\r\n01 - I'm Goin'\r\n02 - Ordinary People\r\n03 - Crime in the City\r\n04 - Crime of the Heart\r\n05 - Welcome Rap\r\n06 - Doghouse\r\n07 - Fool for Your Love\r\n08 - Encore Rap\r\n09 - On the Way Home\r\n10 - Sunny Side\r\n11 - Tonight's the Night\r\n\r\n*2015 Reprise Records | 9362-49261-0\r\n\r\n\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:ca69aa716b638bd7af2069d9ff14f5e2628011ff","amp;dn":"Neil+Young+and+Bluenote+Cafe%27+-+Bluenote+Cafe%27+%282015%29+%5B2CD%5D+%5BEAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca69aa716b638bd7af2069d9ff14f5e2628011ff","infoHashBuffer":{"type":"Buffer","data":[202,105,170,113,107,99,139,215,175,32,105,217,255,20,245,226,98,128,17,255]},"announce":[],"urlList":[]}}