{"title":"Antunes, Scandurra &amp; Toumani - A Curva Da Cintura [FLAC] TQM","uid":8157807,"size":325170654,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ca8db7f2290f95c6c7bef6cf21448694e39dd4ba&amp;dn=Antunes%2C+Scandurra+%26amp%3B+Toumani+-+A+Curva+Da+Cintura+%5BFLAC%5D+TQM&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pastafari","files":22,"time":1361193083,"description":"Arnaldo Antunes, Egdard Scandurra &amp; Toumani Diabate - A Curva Da Cintura\n2012\nMais um Discos, MAIS08CD\n\n* * * * * * * * * * * * * * * * * * *\n\nWith:\nLasanna Diabate, balafon\nSidiki Diabate, kora\nZoumana Tereta, soku, vocal\nAboubakar Diabate, djembe\n\n* * * * * * * * * * * * * * * * * * *\n\nA Curva Da Cintura is a delicate gem of an album resulting from the collaboration of Brazilian musicians Arnaldo Antunes and Edgard Scandurra with the Malian kora legend Toumani Diabate. Initially born out of a festival performance that paired the avant-pop inclinations of Antunes with Diabate's searing virtuosity, Curva is a set of songs written by Antunes and Scandurra, brought to life at Diabate's studio in Mali, and released on ground breaking Brazilian/English label Mais um Discos.\n\nRecorded primarily on electric/acoustic guitars and koras, Curva offers a listening experience that is subtle and yet remarkably rich, full of complexly layered arrangements that reveal more of their details with every listen. Many of these songs only give up their sweetness with effort, as the intricate structures and complex chords tangle with Arnaldo's dead-pan vocals to create a peculiar, yet ultimately thrilling flavor of pop music. Focusing on a handful of primarily acoustic instruments allows for an intimate style of recording, one in which the sonic field is small and uncluttered, the backbones of the songs emerge from the simple interplay of one or two acoustic guitars. This feeling is maintained even when the guitar parts that form these backbones are draped in overdubs- the percussive sound of fingers plucking strings makes up a crucial part of the album's soundscape, effortlessly replacing the absent rhythm section.\n\nThe vocals share the same sonic space, generating a similar feel of proximity to the listener. While they aren't quite a whisper, they hardly have the kind of projection necessary to cut through a full band. This is amplified by the unique vocal style employed by Arnaldo throughout the album, a sort of recitational, almost chant-like delivery that falls squarely in-between singing and speaking, barely (and yet clearly) tonal in its movement.\n\nThis isn't to suggest that the album is entirely laid back, and its often quiet intimacy doesn't preclude a driving, psychedelic intensity that surfaces from time to time. This versatility is primarily due to the fascinating way that the electric guitars used in the album were recorded. Instead of a full-bodied tone that would unduly take up space, these guitars are thin, able to dance with and through their acoustic backdrops, harmonize in a way that can recall the ornamented highlights of 70's country-rock, or sliding like an electrified cousin of the country blues.\n\nAround all of this, the koras of Toumani and Sidiki (his son, who also plays on the album) cut and bite, nipping around the spaces of a melody or rolling out a distinctively Malian line over the Brazilian's guitars. Playing his kora through distortion and a wah-wah peddle, the young Sidiki calls forth a rare sense of threat and presence from the often placid instrument. In his hands, the kora snarls its way through the heart of the track, pulling towards the vital center of songs in which it might easily have skipped around the edges. Of course the Malian camp provides more than just extra tonal color- several tracks are built around a crucial violin or vocal part, and at least one (&quot;Kaira&quot;) is a slow, dreamy drone built entirely around Toumani's mastery of the kora.\n\nUltimately, all of this does little justice to an album able to move fluidly between the bright bounce of Brazilian pop and the full-on echo laden freakouts of psychedelia, touching on the blues, alt-country of The Eagles, and 10 centuries of Malian music in the process. Taken as a whole, it is a highly impressive and greatly rewarding listen.\n~ afropop.org\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n\n01 - Ce Nao Vai Me Acompanhar\n02 - A Curva da Cintura\n03 - Grao de Chaos\n04 - Kaira\n05 - Ir, Mao\n06 - Se Voce\n07 - Um Senhor\n08 - Cara\n09 - Psiu\n10 - Que Me Continua\n11 - Neblina de Areia\n12 - Muito Alem\n13 - Coracao de Mae\n14 - Meu Cabelo\n15 - Bamako's Blues\n\n* * * * * * * * * * * * * * * * * * *\n\nEAC log, CUE sheet &amp; artwork included.\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:ca8db7f2290f95c6c7bef6cf21448694e39dd4ba","amp;dn":"Antunes%2C+Scandurra+%26amp%3B+Toumani+-+A+Curva+Da+Cintura+%5BFLAC%5D+TQM","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ca8db7f2290f95c6c7bef6cf21448694e39dd4ba","infoHashBuffer":{"type":"Buffer","data":[202,141,183,242,41,15,149,198,199,190,246,207,33,68,134,148,227,157,212,186]},"announce":[],"urlList":[]}}