{"title":"Personal Computer Games magazine 1983-85 OCR'd PDF *repack*","uid":6907254,"size":651986089,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb6a111132379d98db058ff0fd4b870fe7c3f382&amp;dn=Personal+Computer+Games+magazine+1983-85+OCR%5C%27d+PDF+%2Arepack%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Ken__D","files":16,"time":1324599202,"description":"Personal Computer Games Magazine Issues 01-15 (Summer 1983 - February\n1985)\n\n** Note: This is a repack of a collection previously available. It is \n** identical except that the PDF's are now approximately half the size!\n\nPersonal Computer Games (PCG) was a short-lived but popular multi-format\nmagazine, edited by Chris Anderson (who went on to found Future\nPublishing and, later, the TED conferences). It carried reviews for\nalmost all of the 8-bit micros of the early 80's, along with industry\nnews, gossip and in-depth features. It was pulled by publisher VNU with\nno warning in February 1985.\n\nThese PDFs are the complied collections of page scans available on\nwww.worldofspectrum.org . They've been OCR'd to allow text searching and\ncopying - this should prove very useful for the Sinclair archivist who'd\nlike to have their own local searchable archive. They look great on most\nPDF readers, including the iPad.\n\nThe OCR software has done it's best, but has struggled with some of the\nmore unusual fonts and layouts used (especially in later issues), and by\nthe relatively low DPI of the source images. Paragraph formatting is a\nbit random at best, and I've had to switch off the image alignment\ntweaking used in other scans as the offset text used in the review pages\nwas causing all sorts of weirdness otherwise.\n\nThe file size is a bit larger than the combined size of the original JPG\nimages; I've done my best to make the PDF's as compact as possible\nwithout losing image quality. Be grateful for cheap storage :)\n\nMore OCR'd scans will be periodically available - please check\nretropdfswordpresscom for more information.\n\nThanks to Martijn van der Heide for the wonderful World Of Spectrum site\n(wwwworldofspectrumorg), and everyone on the WoS forums\nfor help and advice.\n\n90's style &quot;greets&quot; to anyone formally or currently involved in the\nAmiga scene, especially Pazza, Mic Flair, Violator, Denzil, Tango, Fat\nWill, mUb and Maximan, and anyone else who read or wrote for LSD\nGrapevine. Nostalgia ain't what it used to be ;)\n\nKen D \nfabwhack [at] gmailcom \nretropdfswordpresscom\n\n\n","torrent":{"xt":"urn:btih:cb6a111132379d98db058ff0fd4b870fe7c3f382","amp;dn":"Personal+Computer+Games+magazine+1983-85+OCR%5C%27d+PDF+%2Arepack%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb6a111132379d98db058ff0fd4b870fe7c3f382","infoHashBuffer":{"type":"Buffer","data":[203,106,17,17,50,55,157,152,219,5,143,240,253,75,135,15,231,195,243,130]},"announce":[],"urlList":[]}}