{"title":"Sharon McCone Series (1-10) by Marcia Muller","uid":9121913,"size":4716219,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cb6c4fc4f7fc4aa1f0a9c9230893871444ecdcbf&amp;dn=Sharon+McCone+Series+%281-10%29+by+Marcia+Muller&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ZamKhan","files":-1,"time":1383149740,"description":"Marcia Muller (born September 28, 1944) is an American author of fictional mystery and thriller novels.\nMuller has written many novels featuring her Sharon McCone female private detective character. Vanishing Point won the Shamus Award for Best P.I. Novel. Muller had been nominated for the Shamus Award four times previously.\nIn 2005, Muller was awarded the Mystery Writers of America's Grand Master award. Previous winners of the award include Alfred Hitchcock (1973) and Agathe Christie (1955).\nShe was born in Detroit, Michigan and grew up in Birmingham, Michigan and graduated in English from the University of Michigan and worked as a journalist at Sunset magazine.She is married to detective fiction author Bill Pronzini with whom she has collaborated on several novels.\n\n\nEdwin of the Iron Shoes (Sharon McCone #1)\n\nIt's Sharon McCone's first case as staff investigator for All Souls Legal Cooperative. She knows nothing about antiques, yet she has an affection for Salem Street with its charming mix of antique and curio shops. Now elderly dealer Joan Albritton has been found dead, stabbed with an antique dagger. \n\nHer neighbors are shocked. Recurring vandalism has them frightened. Ferreting out the facts will take Sharon from the chaotic jumble of the junk dealer's establishment to a museum where San Francisco's most elegant socialites gather. But it is not until she is alone in Joan's dark shop with Clothilde, the headless dressmaker's dummy; Bruno, the stuffed German shepherd; and Edwin, the little boy mannequin in the ornate iron shoes that she will have the chance to discover the murderous secret someone will kill -- and kill again -- to keep.\n\nAsk the Cards a Question (Sharon McCone #2)\n\nThere's trouble in Sharon McCone's quiet San Francisco apartment building. Madame Anya, with her cards, her tame crow, and her candles, had predicted evil for Molly Antonio. Linnea Carraway, drinking heavily and careening crazily in the wake of a divorce, had argued with her. Now the sweet, elderly lady lies in her apartment. Linnea, last to see Molly alive, is the prime suspect and if Sharon means to clear her best friend, she has to find the murderer fast. Suddenly death is in the cards, threatening Sharon's oldest friendship, her professional credibility-and her life.\n\n\nThe Cheshire Cat's Eye (Sharon McCone #3)\n\nInvestigating her friend's murder, private eye Sharon McCone follows a trail into San Francisco's glamorous architectural community in search of a very valuable clue--a Tiffany lamp adorned with the grinning face of a Cheshire Cat. \n\n\nGames to Keep the Dark Away (Sharon McCone #4)\n\nPicture Salmon Bay: an isolated, run-down northern California village, home to an idle fleet of fishing boats, a deserted amusement park, and a handful of secretive, even hostile residents. When private investigator Sharon McCone arrives in search of one of the town's wayward daughters, the train leads to the thriving resort of Port San Marco. McCone believes that the missing woman, a former social worker named Jane Anthony, was involved in the suspicious deaths of three terminally ill patients at an exclusive hospice.\n\n\nLeave a Message for Willie (Sharon McCone #5)\n\nAmid the shifting world of San Francisco flea markets, shady vendors sell junk, precious antiques, and stolen goods side by side. Somewhere in the mix, a priceless collection of sacred Torah scrolls is gathering dust - and attracting a group of fanatical killers.\nWhen private investigator Sharon McCone helps one flea market kingpin fend off a stalker, she's drawn into the netherworld of deal-making and thievery, a dangerous milieu seldom seen by outsiders. For her client Willie Whelan, the sidewalk sales are a game: trick the customer, outsell the competition, and stay one step ahead of the cops. But Willie's enemies have something more sinister in mind - a conspiracy so heinous it threatens the religious artifacts, Willie's freedom, and McCone's life.\n\nThere's Nothing to Be Afraid Of (Sharon McCone #6)\n\nThe Globe Apartments, six stories of decaying brick and concrete, rises above San Francisco's volatile Tenderloin district. The seedy former hotel, once a haven for the city's down and out, now houses Vietnamese families striving to improve their lives. But private eye Sharon McCone believes that someone from the Tenderloin's shadowy underworld is determined to drive the newcomers out. The suspects range from the colorful to the dangerous: a poetry-loving drifter, a mean-spirited preacher, a flower seller with a deadly touch, an enterprising photographer, and a developer who'd like nothing better than to unload his worst investment - the Globe Hotel.\nWhen the All Souls Legal Cooperative is called upon to stop the patterns of intimidation, resentment explodes into murder. As McCone takes up the refugees' cause, she is drawn into the depths of the city's most hated industry - and into the secrets of San Francisco's buried past.\n\nEye of the Storm (Sharon McCone #7)\n\nAppleby Island, once the magnificent home of a tycoon and planter, is a place of history and mystery in the Sacramento delta. Its story includes hints of tragedy, fueling rumors that ghosts still walk its derelict orchards. Now Patsy McCone, her new lover, and a group of investors are turning the old mansion into an elegant bed and breakfast inn. Summoned by her eccentric younger sister, San Francisco's #1 P.I. Sharon McCone arrives in the teeth of a gale, taking a busman's holiday to investigate mysterious acts of vandalism that are running the project to ruin. But when simple sabatoge escalates to savage murder, she finds herself trapped on the island with a desperate killer - and flung into a raging storm of treachery, violence, and sudden death.\n\nThere's Something in a Sunday (Sharon McCone #8)\n\nIt's a cold Sunday in San Francisco. Sharon McCone's alone on a routine surveillance job, following a man named Frank Wilkinson through the city's lush horticultural hot spots to the sere foothills of the Diablos. But when she returns to find her kindly old client in a pool of blood nothing she's learned explains it. The search for answers takes her from Wilkinson's sullen brood on Burning Oak Ranch, to the eccentric havoc of a household in the Haight, to Golden Gate Park and the desperate digs of the homeless. Unraveling the threads that link a homeless man, a pair of prominent activists, a wayward rancher, and a mysterious missing beauty, Sharon is plunged into the depths of domenstic mayhem...entering a realm where dreams shatter and marriage leads to bloody murder.\n\nThe Shape of Dread (Sharon McCone #9)\n\nBobby Foster, car-hop at the chic Cafe Comedie, is going to the gas chamber. He's already confessed to the murder of Tracy Kostakos, the club's rising star. But two years after the crime, Tracy's body is still missing and Bobby's confession is full of holes. All Souls Legal Cooperative's final appeal sends San Francisco's #1 P.I. Sharon McCone behind the footlights into the super-charged arena of anxious club owners and aspiring young hopefuls...into the fractured world of Tracy's privileged family and the mind of a young comedienne who was not the good little girl they thought they knew...into a labyrinth of death and deception where someone will kill to laugh last and get away with murder.\n\n\nTrophies and Dead Things (Sharon McCone #10)\n\nWhen a former sixties radical is murdered during a string of random sniper attacks, the All Souls Legal Cooperative must settle his surprisingly large estate. Then private investigator Sharon McCone comes across a new will, made just days before he died, that disinherits his two children in favor of four unknown and unconnected parties. McCone sifts through Perry Hilderly's belongings, but finds little to explain this puzzling change - until she uncovers a .357 with the serial number burned off.\n\n\n","torrent":{"xt":"urn:btih:cb6c4fc4f7fc4aa1f0a9c9230893871444ecdcbf","amp;dn":"Sharon+McCone+Series+%281-10%29+by+Marcia+Muller","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb6c4fc4f7fc4aa1f0a9c9230893871444ecdcbf","infoHashBuffer":{"type":"Buffer","data":[203,108,79,196,247,252,74,161,240,169,201,35,8,147,135,20,68,236,220,191]},"announce":[],"urlList":[]}}