{"title":"FSOL - THE AMORPHOUS ANDROGYNOUS - The Peppermint Tree And Seeds","uid":4117100,"size":166392101,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb910e4e60fe592c867e6a639e4f75dccced9d4f&amp;dn=FSOL+-+THE+AMORPHOUS+ANDROGYNOUS+-+The+Peppermint+Tree+And+Seeds&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"creatinghavoc","files":20,"time":1207361584,"description":"FSOL \n\nTHE AMORPHOUS ANDROGYNOUS - The Peppermint Tree And Seeds of Superconsciousness\nFollowing on from the genre defying the ISNESS and ALICE IN ULTRALAND comes this new MINDBENDING oozescape from the Amorphous Androgynous over an hour of PSYCHEDELIC PROG-ROCKTRONIC SAMPLERDELICA with a dash of FOLKfunkRAGA COSMIC SPACE MUSIC - a trip into the sixth dimension- LIGHT BEYOND SOUND-&amp;#039;turn ON and TUNE INTO the new psychedelia!\n\nTRACK LISTING\n\n01. The Peppermint Tree\n02. Given That We&amp;#039;ve Given\n03. I Have Loved You Into Oblivion\n04. Light Beyond Sound\n05. In Fear Of The Electromagnetic Machine (Part 1)\n06. Nowhere At The Edge Of Somewhere\n07. Riders (On Circadian Rhythm)\n08. Carousel\n09. Yantra\n10. Opus Of The Black Sun\n11. Marylebone Road\n12. Tiny Space Birds\n13. Drifter\n14. Rocket Fuel\n15. Listen Little Man\n16. Man Is A Virus In Shoes\n17. Mr. Sponge&amp;#039;s Groovy Oscilations\n18. It&amp;#039;s A Sunshine Day (Yeah! Yeah!)\n19. An Absurd Consequence Of Living In Absurd Times (bonus track)\n\n\nThe Peppermint Tree &amp; The Seeds Of Superconsciousness\n&quot;A Collection Of Psychedelic Relics From The Amorphous Androgynous 1967-2007&quot;\nIn the shop now! Not the interpretations of Peppermint Tree &amp; a couple of bonus tracks we were originally promised, this is an entirely new album, recently completed from more strong tracks from the Alice/Isness sessions.\nA few snippets - those of you who&amp;#039;ve been following for a while may recognise &quot;Drifter&quot; and &quot;Marylebone Road&quot; after being revealed on the official site seven years ago. &quot;Marylebone Road&quot; itself now makes sense of the mention in the &quot;Goodbye Sky&quot; credits - they both feature the same brass section (we can also finally confirm &quot;Guru Song&quot; was spawned from the same sessions as this collection&amp;#039;s title track).\n&quot;Opus&quot; - a title from the Alice sessions - may well now be &quot;Opus Of The Black Sun&quot;.\n&quot;Oblivion&quot; from the Freeze sampler has a full title &quot;I Have Loved You Into Oblivion&quot; (and features vocals from Gaz as well as that Shirley Bassey-alike). There are some superbly ridiculous titles in there too...\n\n&quot;Drifter&quot; may seem familiar to some of you - the acoustic loop featured as the backing track to the Isness section of futuresoundoflondon.com mk2 back in 2002. It also features in a remixed form as the album&amp;#039;s bonus track. Otherwise, it all sounds fairly standard Amorphous fare (at least as standard as you can get for a band who shift from Indian ragas to progressive rock and psychedelic funk quicker than you can say A Monstrous Psychedelic Bubble Exploding In Your Mind). It resembles Alice more than Isness, with ambient interludes, densely layered tracks and emphasis more on funk and odd electronics than tablas and banjos. The first half is nicely mixed together with shorter, interlude tracks, but it becomes more song-by-song nearer to the end. The mix of instrumentals and vocals remains similar to previous releases - here, &quot;The Peppermint Tree&quot;, &quot;I Have Loved You Into Oblivion&quot;, &quot;Marylebone Road&quot;, &quot;Rocket Fuel&quot;, &quot;Listen Little Man&quot; and, to an extent, &quot;It&amp;#039;s A Sunshine Day&quot; are all &amp;#039;songs&amp;#039;, the rest are pretty much instrumental. There&amp;#039;s no Galaxial/Plankton style epic, although Max Richter&amp;#039;s orchestration on &quot;...Oblivion&quot; leaves it sounding as epic as the intro to &quot;Her Tongue Is Like A Jellyfish&quot; promised six years ago.\nAll in all, it&amp;#039;s a consistently good record, and will certainly satisfy fans of The Isness and Alice In Ultraland after more &quot;PSYCHEDLIC PROG-ROCKTRONICA SAMPLERDELICA with a dash of FOLKfunkRAGA COSMIC SPACE MUSIC&quot; (their words, not mine)\n\n","torrent":{"xt":"urn:btih:cb910e4e60fe592c867e6a639e4f75dccced9d4f","amp;dn":"FSOL+-+THE+AMORPHOUS+ANDROGYNOUS+-+The+Peppermint+Tree+And+Seeds","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb910e4e60fe592c867e6a639e4f75dccced9d4f","infoHashBuffer":{"type":"Buffer","data":[203,145,14,78,96,254,89,44,134,126,106,99,158,79,117,220,204,237,157,79]},"announce":[],"urlList":[]}}