{"title":"The Last Sovereign","uid":15407721,"size":431069936,"categoryP":"porn","categoryS":"games","magnet":"?xt=urn:btih:cbd2e09b824ca3f38d05ea5d16f251b007d7a4a7&amp;dn=The+Last+Sovereign&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dkrnmmq","files":1,"time":1469524922,"description":"If you're stuck, looking for strategy, or interested in lore, check out the game's wiki: \nhttp://thelastsovereign.wikia.com/wi...overeign_Wikia\r\n\r\n\r\n\r\nThe Last Sovereign is an adult fantasy RPG that plunges you into the saga of a world torn between forces of lust and purity. As you enter the complex conflict, you forge a new path that will change the course of history! \r\n\r\n...maybe. The thing is, acting like most heroes gets you killed, and most evil overlords' plans make no sense. The Last Sovereign is a game that twists your expectations for adult games, while fully embracing a reconstruction of some familiar old tropes to provide a lot of fun, sexy content.\r\n\r\nCurrent Content\r\nHours of Gameplay: 15+\r\nSex Scenes: 75+\r\nPairings: M/F, M/F/F, F/F, M/F/M, M/F/F/F\r\nFetishes: harem, blowjob, titfuck, anal, gangbang, bukkake, domination, monster girls, furries, nonconsensual, pseudo-incest, futa, mind control\r\n\r\nBy telling a story that has sex as an integral component, The Last Sovereign offers a deep storyline that naturally includes sex scenes. No need to grind for hours or lose to every enemy to find the content. Not only will you adventure in a world where sex is a weapon, you'll build a harem of fully-realized characters with their own reasons for being with you... in and out of the bedroom.\r\n\r\n\r\n\r\nThe game has been updated with a new chapter every month without fail, each update adding more sex scenes and advancing the intricate plot. You'll not only battle monsters and explore dungeons, you'll negotiate with kings, survive steamy encounters with succubi, investigate mysteries, dominate the world economically, and claim a glorious destiny!","torrent":{"xt":"urn:btih:cbd2e09b824ca3f38d05ea5d16f251b007d7a4a7","amp;dn":"The+Last+Sovereign","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbd2e09b824ca3f38d05ea5d16f251b007d7a4a7","infoHashBuffer":{"type":"Buffer","data":[203,210,224,155,130,76,163,243,141,5,234,93,22,242,81,176,7,215,164,167]},"announce":[],"urlList":[]}}