{"title":"Lonely Planet - Banff, Jasper and Glacier National Parks (2016)","uid":14735997,"size":22405482,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:cd0971fd54164e9ddec43ada97b4e5195060fb9b&amp;dn=Lonely+Planet+-+Banff%2C+Jasper+and+Glacier+National+Parks+%282016%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1464637276,"description":"Lonely Planet - Banff, Jasper and Glacier National Parks (Travel Guide) - 4th Edition (2016).pdf Gooner\r\n\r\nPublisher: Lonely Planet; 4 edition (15 April 2016)\r\nLanguage: English\r\nISBN-10: 1742206182\r\nISBN-13: 978-1742206189\r\n\r\nLonely Planet: The world's leading travel guide publisher\r\n\r\nLonely Planet Banff, Jasper &amp; Glacier National Parks is your passport to the most relevant, up-to-date advice on what to see and skip, and what hidden discoveries await you. Go hiking and camping in the Backcountry in Banff; mountain-biking and horseback riding in Jasper, or wildlife spotting in Glacier; all with your trusted travel companion. Get to the heart of Banff, Jasper &amp; Glacier National Parks and begin your journey now!\r\n\r\nInside the Lonely Planet Banff, Jasper &amp; Glacier National Parks Travel Guide:\r\n\r\n* User-friendly highlights and itineraries help you tailor your trip to your personal needs and interests\r\n\r\n* Insider tips to save time and money and get around like a local, avoiding crowds and trouble spots\r\n\r\n* Essential info at your fingertips - hours of operation, phone numbers, websites, transit tips, prices, emergency information, park seasonality, hiking trail junctions, viewpoints, landscapes, elevations, distances, difficulty levels, and durations\r\n\r\n* Focused on the best - hikes, drives, and cycling tours\r\n\r\n* Honest reviews for all budgets - eating, sleeping, camping, sight-seeing, going out, shopping, summer and winter activities, and hidden gems that most guidebooks miss\r\n\r\n\r\n* Contextual insights give you a richer, more rewarding travel experience - history, geology, wildlife, and conservation\r\n\r\n* Over 52 full-color trail and park maps and full-color images throughout\r\n\r\n* Useful features - Travel with Children, Clothing and Equipment, and Day and Overnight Hikes\r\n\r\n* Covers Banff National Park, Jasper National Park, Glacier National Park, Lake Louise, Lake Minnewanka, Bow Valley, Backcountry, Kananaskis Country, Lake O'Hara, Jasper Town, Blackfeet Indian Reservation and more\r\n\r\nThe Perfect Choice: Lonely Planet Banff, Jasper &amp; Glacier National Parks, our most comprehensive guide to these Canadian national parks, is perfect for both exploring top sights and taking roads less traveled.\r\n\r\nAuthors: Written and researched by Lonely Planet.\r\n\r\nAbout Lonely Planet: Since 1973, Lonely Planet has become the world's leading travel media company with guidebooks to every destination, an award-winning website, mobile and digital travel products, and a dedicated traveler community. Lonely Planet covers must-see spots but also enables curious travelers to get off beaten paths to understand more of the culture of the places in which they find themselves.\r\n\r\nTripAdvisor Travelers' Choice Awards winner in Favorite Travel Guide category for 2012, 2013, 2014 and 2015","torrent":{"xt":"urn:btih:cd0971fd54164e9ddec43ada97b4e5195060fb9b","amp;dn":"Lonely+Planet+-+Banff%2C+Jasper+and+Glacier+National+Parks+%282016%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd0971fd54164e9ddec43ada97b4e5195060fb9b","infoHashBuffer":{"type":"Buffer","data":[205,9,113,253,84,22,78,157,222,196,58,218,151,180,229,25,80,96,251,155]},"announce":[],"urlList":[]}}