{"title":"Harvey Kurtzman: Two-Fisted Tales # 18-41","uid":8661654,"size":511050258,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:cda76b622eb154dcd7f881734711a23fb623b1ac&amp;dn=Harvey+Kurtzman%3A+Two-Fisted+Tales+%23+18-41&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"fudoh101","files":25,"time":1373326518,"description":"I gotta be brutal, but a lot of the EC books and stories are a lot more interesting to read and write about than to actually read!\nBut credit should be given where credit is due, and Two-Fisted Tales do have a lot to offer, if nothing else the editor-ship and occasional illustration jobs of one Harvey Kurtzman!\n\n24 issues published by EC 1950-1955\n\nAs with many EC comics published at the time, Two-Fisted Tales did not start with issue number one; a renaming of The Haunt of Fear, Two-Fisted Tales began with issue #18 (cover-dated Dec. 1950) and ran 24 issues through #41 (March 1955).[1] Wholesaler problems had caused Gaines to consider canceling The Haunt of Fear, but he changed his mind without skipping an issue. Two-Fisted Tales took over the numbering, and The Haunt of Fear then reverted to the correct numbering for the remainder of its run.\n\nKurtzman's editing approach to Two-Fisted Tales and Frontline Combat was a stark contrast to fellow EC editor Al Feldstein's style. Whereas Feldstein allowed his artists to draw the story however they chose, Kurtzman prepared detailed layouts for each story and required his artists to follow them exactly. Kurtzman's writing tended to use less text than Feldstein's, which enabled the two war titles to be hand-lettered rather than machine-lettered like the remainder of EC's titles.[4] Kurtzman was dedicated to making the stories as historically accurate as possible and along with assistant Jerry DeFuccio put a lot of research into each story. As a result, where Feldstein took generally about a week to complete each issue he edited, Kurtzman took approximately a month.\n\nArtists who contributed included Kurtzman and other EC regulars such as John Severin, Jack Davis, Wally Wood, George Evans, Will Elder, Reed Crandall and Bernard Krigstein. Non-EC regulars that contributed to the comic included Alex Toth, Ric Estrada, Gene Colan, Joe Kubert and Dave Berg.","torrent":{"xt":"urn:btih:cda76b622eb154dcd7f881734711a23fb623b1ac","amp;dn":"Harvey+Kurtzman%3A+Two-Fisted+Tales+%23+18-41","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cda76b622eb154dcd7f881734711a23fb623b1ac","infoHashBuffer":{"type":"Buffer","data":[205,167,107,98,46,177,84,220,215,248,129,115,71,17,162,63,182,35,177,172]},"announce":[],"urlList":[]}}