{"title":"Sub-Mariner: The Depths TPB (2009) (Digital-Empire)","uid":9857373,"size":170732380,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:ce2cf8015a659499d53e1c0f5d25c9bedf586dc4&amp;dn=Sub-Mariner%3A+The+Depths+TPB+%282009%29+%28Digital-Empire%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"VikTSlick","files":-1,"time":1396234295,"description":"Promotional info - &quot;The latest offering from the red-hot Marvel Knights line offers a searing vision of Namor, the Sub-Mariner as you've never seen, brought to you by Peter Milligan (X-Force) and Esad Ribic (Silver Surfer: Requeim)! Atlantis. Throughout the ages, a few men have wondered if this fabulous place actually exists. Fewer have imagined that the city is protected by a wild and vengeful being, the very embodiment of the untameable depths themselves - the Sub-Mariner. When a deep sea expedition mysteriously vanishes without a trace near the Marianes trench, legendary adventurer Randolph Stein embarks on a journey that will rock him - and his crew - to their very core. Travelling deep into the dark belly of the sea, the men of the good ship, Voyager, are about to see things that defy description, that supersede their wildest imagination - things that men aren't meant to see. Staring into the abyss, Stein will soon discover that the abyss can indeed stare right back at him! Collects Sub-Mariner: The Depths #1-5.&quot;\n\nThis is the one-volume TPB edition, with a nice new digital copy courtesy of Empire. Please seed, and enjoy! :-)","torrent":{"xt":"urn:btih:ce2cf8015a659499d53e1c0f5d25c9bedf586dc4","amp;dn":"Sub-Mariner%3A+The+Depths+TPB+%282009%29+%28Digital-Empire%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce2cf8015a659499d53e1c0f5d25c9bedf586dc4","infoHashBuffer":{"type":"Buffer","data":[206,44,248,1,90,101,148,153,213,62,28,15,93,37,201,190,223,88,109,196]},"announce":[],"urlList":[]}}