{"title":"Powerhouse Gospel On Independent Labels 1946-1959 (4CD-JSP)","uid":7293844,"size":712949928,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cefca111d83c9dd711f8e78d7d26a233e4469851&amp;dn=Powerhouse+Gospel+On+Independent+Labels+1946-1959+%284CD-JSP%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mudmashers","files":104,"time":1337819952,"description":"Powerhouse Gospel On Independent Labels 1946-1959 [4CD-Box, JSP Records, 320kb]\n\nReviewed by Tony Cummings - Cross Rhythms\n\nThis four CD box set put together by compiler Opal Louis Nations gives us, the non-specialist collector, a feast of timeless music. Though it's doubtful that many can afford the big money today offered for the 78s and 45s which fill this box set thanks to those good folk at JSP we now get the chance to hear some of the finest gospel of the era.\n\nIn the years following World War Two dozens of independent labels sprang up to release, usually along with other styles, the musical riches of the African American churches. Some of the labels like Fortune, Dootone, J.O.B and Gotham enjoyed hits and a taste of the big time, while others like John W Gilbert's Religious Recordings, Avant and Chariot Of Memphis lasted for only the blink of an eye. But, as demonstrated here, these brave independents released vibrant, soul stirring music. Styles range from cool, melodious jubilee singing to blues-based musical evangelists and from hard shouting gospel quartets to sanctified preachers and their excited congregations. \n\nVolume 4 is, in fact, devoted entirely to the latter and gives us the Rev C L Franklin (yep, Aretha's dad), recorded at the New Bethel Baptist Church in Detroit; a seering, lining hymn &quot;Lord I Cannot Live In Sin&quot; by Chicago's Deacon Leroy Shinnault; both parts of the blistering sermonette &quot;It Rained 40 Days And 40 Nights&quot; by Rev H R Jelks; and Elder Charles Beck denouncing rock 'n' roll even though his sermon is accompanied by a hugely amplified guitar! The latter (&quot;Rock And Roll Sermon Parts 1 &amp; 2&quot;) was recently reissued on another compilation but there's little else here which has ever found its way onto CD. \n\nThere are gems aplenty on the other three CDs. &quot;Jesus Came At Midnight&quot; by the Kansas City Soul Receivers has a glorious undulating rhythm and fiery vocals; the Rev H B Crum who, in the words of another reviewer, &quot;must have had a pair of lungs the size of South Carolina judging by his performance on 'Do You Know Me Thomas'&quot;; a spine-tingling &quot;Night Prayer&quot; by the Blind Wonders Of Washington DC; the magnificent Bessie Griffin (you read about her recently on Cross Rhythms) accompanied by bluesman Brownie McGhee and dozens more. \n\nMusically this is indeed powerhouse gospel.","torrent":{"xt":"urn:btih:cefca111d83c9dd711f8e78d7d26a233e4469851","amp;dn":"Powerhouse+Gospel+On+Independent+Labels+1946-1959+%284CD-JSP%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cefca111d83c9dd711f8e78d7d26a233e4469851","infoHashBuffer":{"type":"Buffer","data":[206,252,161,17,216,60,157,215,17,248,231,141,125,38,162,51,228,70,152,81]},"announce":[],"urlList":[]}}