{"title":"(JazzPlanet) Mccoy Tyner &amp; Michael Brecker-Infinity(UF)","uid":5048968,"size":143268757,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cf2b37d62b5325b4896b3ac7637fef389584fa19&amp;dn=%28JazzPlanet%29+Mccoy+Tyner+%26+Michael+Brecker-Infinity%28UF%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blogmas","files":16,"time":1249800906,"description":"Mccoy Tyner &amp; M.Brecker - Infinity\n\nTitle: Infinity\nLeader Artist: McCoy Tyner\nOriginally released: 1995\nLabel: Impulse!\nGenre: Jazz, Post Bebop, Modale\nFormat:  Mp3 256@Kbps\nSize Torrent: 131 Mb\nCover Included\n\n\n1. Flying High   \n2. I Mean You  \n3. Where Is Love  \n4. Changes  \n5. Blues Stride  \n6. Happy Days  \n7. Impressions  \n8. Mellow Minor  \n9. Good Morning Heartache  \n\n\n\n\n\nMcCoy Tyner Piano\nMichael Brecker Tenor Saxophone\nAvery Sharpe Bass \nAaron Scott Drums \nValtinho Anastacio Percussion, Congas (1, 6)\n\n &lt;a href=&quot;\nhttp://www.amazon.com/gp/recsradio/radio/B0000DELZV/ref=pd_krex_dp_a&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/gp/recsradio/radio/B0000DELZV/ref=pd_krex_dp_a&lt;/a&gt;\n\n\n\n\n\nt seems only fitting that the initial new release on the latest revival of the Impulse label features McCoy Tyner and Michael Brecker. When Impulse started out in 1960, John Coltrane and Tyner were the first artists to be signed, and when Impulse was briefly brought back by MCA in the 1980s, two of its most important albums were recordings by Brecker. There are not a lot of surprises on this quartet matchup (with bassist Avery Sharpe and drummer Aaron Scott) except perhaps for how well Tyner and Brecker mesh together. The music is somewhat similar to a set by the pianist's regular trio with a solo piece (&quot;Blues Stride&quot;), a generous amount of Tyner originals and colorful versions of Thelonious Monk's &quot;I Mean You&quot; and &quot;Good Morning Heartache,&quot; but Brecker's presence and consistently powerful playing does inspire Tyner and his sidemen. For a strong example as to why today's saxophonists have such a high opinion of Michael Brecker, his roaring statement on the extended &quot;Impressions&quot; will suffice. Highly recommended. ~ Scott Yanow, All Music Guide\n\n\n\nINFINITY won a 1996 Grammy Award for Best Jazz Instrumental Performance, Individual Or Group. Michael Brecker won a 1996 Grammy for Best Jazz Instrumental Solo for &quot;Impressions.&quot;\n\nFew modern pianists have been able to completely transcend ...    Full DescriptionMcCoy Tyner's breakthroughs in chordal voicings, harmonic cycles and rhythmic/melodic development. Like so many great jazz artists, the road to technical mastery and acclaim inevitably leads to repetition and redundancy, as the innovations of yesterday become the stylistic vestments of today.\n\nWhich is why Tyner has always searched for new avenues of exploration and expression. Over the past few years, these mature inquiries have led to some exceptional big band and solo recordings. Now, with the revival of the Impulse! label, Tyner inaugurates this new era with a trio recording that illustrates the depth and range of his art.\n\nINFINITY reflects Tyner's love affair with music from jazz's past, present and future, as well as the greater global village. For a pianist so identified with power and velocity, the charming ragtime variations and abstractions of &quot;Blues Stride&quot; and Monk's &quot;I Mean You&quot; illustrate a more playful aspect of Tyner's art, while the ballad &quot;Good Morning, Heartache,&quot; which echoes several traditional spirituals and melodic strains associated with Billie Holiday, balances the rich orchestral dimension of Tyner's concept with moments of abiding simplicity and tenderness.\n\nThe joyous Afro-backbeats and second lines of &quot;Happy Days&quot; (inspired by a recent journey to Senegal)--featuring Tyner's gorgeous open voicings and Mike Brecker's heartfelt tenor testimonies--reflect Tyner's roots in (and affection for) the gospel-drenched outlook of hard bop (a la Horace Silver). A fired up Brecker rejoins the trio for a romp through Coltrane's &quot;Impressions,&quot; where bassist Avery Sharpe and drummer Aaron Scott distinguish themselves through their tasteful restraint. &quot;Flying High&quot; and &quot;Changes&quot; showcase the resounding lyric dimension of the pianist's art, distinguished by an orchestral conception of lines and chords that serve to confirm McCoy Tyner's place in the hierarchy of virtuoso jazz improvisers.","torrent":{"xt":"urn:btih:cf2b37d62b5325b4896b3ac7637fef389584fa19","amp;dn":"%28JazzPlanet%29+Mccoy+Tyner+%26+Michael+Brecker-Infinity%28UF%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf2b37d62b5325b4896b3ac7637fef389584fa19","infoHashBuffer":{"type":"Buffer","data":[207,43,55,214,43,83,37,180,137,107,58,199,99,127,239,56,149,132,250,25]},"announce":[],"urlList":[]}}