{"title":"X Rebirth-RELOADED","uid":9198754,"size":5490766064,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cfe24c93f620bc3f9bbe0906d870e1ef0b973272&amp;dn=X+Rebirth-RELOADED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"extremezone","files":-1,"time":1384541019,"description":" &lt;a href=&quot;http://img5.imageshack.us/img5/9210/bmdx.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://img5.imageshack.us/img5/9210/bmdx.jpg&lt;/a&gt;\n\nScreens:\n &lt;a href=&quot;\nhttp://img824.imageshack.us/img824/7141/6l5w.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img824.imageshack.us/img824/7141/6l5w.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img41.imageshack.us/img41/8520/ouhs.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img41.imageshack.us/img41/8520/ouhs.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://img600.imageshack.us/img600/7361/i24t.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img600.imageshack.us/img600/7361/i24t.jpg&lt;/a&gt;\n\nX Rebirth-RELOADED\n11/2013: RELEASE.DATE .. PROTECTION: Steam\n1: DISC(S) .. GAME.TYPE: Action, Simulation\n\nIn the distant future, the X universe faces a period of profound and\nirrevocable change. While the universe stumbles towards an uncertain future\ncountless adventures await as new enemies rise in search of power. Enter a\nyoung adventurer and his unlikely female ally traveling in an old, battered\nship with a glorious past - two people alone against the galaxy, playing a\nkey part in the events to come. The fate of the universe rests in the hands\nof the player\n\nX Rebirth represents a spectacular new beginning for the X series, offering\nloyal fans and newcomers alike a vast, vivid and extremely detailed universe\nto explore throughout the game. Varied gameplay elements such as\naction-packed space combat, detailed trading mechanics and high-speed space\nexploration with fast travel allow players to experience a truly unique space\nsaga that will keep them hooked for dozens of hours. X Rebirth features a\nwhole new user experience - it is easier than ever to start with, and remains\nas deep as fans expect it\n\nFEATURES\nTRADE! A fully simulated economy that means your actions really do matter\nTravel the space highways to nd prot in gigantic space cities, swarming with\nships and drones\n\nEvery ship you see has a task. Stop a freighter from reaching its\ndestination and its cargo will be stopped too, causing prices to rise\n\nFIGHT! From small scale skirmishes to epic eet encounters, battles in the X\nUniverse know no limits. Choose to ght for the military, work for the police\nor be a lawless pirate, or if you prefer just ght when you need to defend\nyourself - it's up to you\n\nTake the action right into massive structures. Target turrets and shield\ngenerators to weaken your enemy, damage engines and jump drives to prevent\ntheir ships from escaping, or stop their factories producing to cripple their\neconomy\n\nBUILD! Create your own empire! From trading stations to large factories\nfarms to hightech military complexes, everything can belong to you. Build for\ntrade and prot or to strengthen your military presence and dominate your\nenemies\n\nExtend and upgrade your stations to make them operate more efciently, with\nevery element visible in glorious animated detail. Harvest your own resources\nto keep your empire running smoothly\n\nTHINK! A rich, detailed history and a deep complex plot await you, but you\nare free to decide when and where to take part. Explore the universe at your\nown pace - choose your own path and create your own destiny\n\nGet up-close and personal with aliens and humans alike. Land on stations\nmeet people, then accept missions from them or hire them as crew members for\nyour ships\n\nTRADE, FIGHT, BUILD, THINK... in the X Universe - the biggest sandbox this\nside of the galaxy\n\n- Russian and French languages will be available approximately 2 weeks after\nNovember 15th\n\n2. Burn or mount the image\n3. Install the game\n4. Copy over the cracked content from the /Crack directory on the image to\nyour game install directory\n5. Play the game\n6. Support the software developers. If you like this game, BUY IT!\n\nNote: We need anything you can offer as early releases,seedboxes,links,accounts,etc\nplease contact us on piratepedia[@]gmail.com or our website torentz 3xforum ro\nSeed Stats: 20-400 GiB at aprox 10 MiB/sec/20 slots per torrent\n\nX Rebirth-RELOADED Torrent Free Download\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/extremezone/0/7/0&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/extremezone/0/7/0&lt;/a&gt;\n\nHow To Get Your MAXSPEED (uTorrent)\n\nTorrent Client - Preferences - Bandwidth - Number of connections - Set aprox. 500 for each \nTorrent Client - Preferences - BiTorrent - Protocol Encryption - Forced\nBandwidth Allocation - High (Set download/upload limit - Unlimited)\nStop Other Active Torrents - Start downloading and wait for connections.\nEnjoy and Seed for at least 1:1 ratio. Don't forget to say thanks/leave reviews.\nFor more info,crack only,PATCH,serial,keygen,trainers,CRACKFIX,UPDATES,\nsystem requirements,cheats,NFO,gameplay trailers,free downloads,\npc iso,demos,screenshots,visit some RELEASE SITES or official web pages. \nIF the game does not work for you then update drivers, directX, components\nas netframework/redist files/etc, run as administrator, change compatibility\nmode, block/disable access to internet, copy crack/overwrite, other tweaks,upgrade pc,etc\nSearch on scene release websites for any future updates/working status/etc and \nother quality filesharing sites or just use this - other torrent search functions\nStop using stupid av's as AVG reporting false positive viruses-disable or use ESET","torrent":{"xt":"urn:btih:cfe24c93f620bc3f9bbe0906d870e1ef0b973272","amp;dn":"X+Rebirth-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfe24c93f620bc3f9bbe0906d870e1ef0b973272","infoHashBuffer":{"type":"Buffer","data":[207,226,76,147,246,32,188,63,155,190,9,6,216,112,225,239,11,151,50,114]},"announce":[],"urlList":[]}}