{"title":"A History of the English Speaking Peoples - Volume 1","uid":6463862,"size":368454978,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:d0d2e2e0bf2ab7f1d5cb7918cfb2bbf221029f45&amp;dn=A+History+of+the+English+Speaking+Peoples+-+Volume+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rosie1966","files":15,"time":1307889064,"description":"Winston Churchill - A History of the English-speaking Peoples Vol 1 The Birth of Britain (Unabridged) - Read by Christian Rodska\n\nSource CD\nDuration approx 17:01 hours \nFhG MPEG 1 Layer III 48 Kbps CBR \n44100Hz, 16-bit, Mono\n\n\nThe book\n\nThe narrative commences 55 years before the birth of Christ, when Julius Caesar famously 'turned his gaze upon Britain' and concludes with the Battle of Bosworth in 1485. Along the way we encounter a plethora of closely observed characters, all of whom breathe life into the page: William the Conqueror, Alfred the Great, Richard the Lionheart, Joan of Arc. The beginnings of Parliament, the Church and the monarchy are all analysed alongside this comprehensive chronology. THE ISLAND RACE Britannia; Subjugation; Roman Province; Lost Island; England; Vikings; Alfred the Great; Saxon Dusk THE MAKING OF THE NATION Norman Invasion; William the Conqueror; Growth amid Turmoil; Henry Plantagenet; English Common Law; Coeur de Lion; Magna Carta; On the Anvil; Mother of Parliaments; Edward I; Bannockburn; Scotland &amp; Ireland; Long-Bow; Black Death THE END OF THE FEUDAL AGE King Richard II and the Social Revolt; Usurpation of Henry Bolingbroke; Empire of Henry V; Joan of Arc; York and Lancaster; Wars of the Roses; Adventures of Edward IV; Richard III \n\n\nThe author\n\nSir Winston Churchill (1874-1965) was prime minister of Great Britain during World War II. Throughout his long and distinguished political career his writing was prolific.\n\n\nThe reader\n\nChristian Rodska (born 5 September 1945 in Northumberland) is a versatile English actor who has appeared in many television and radio series and narrated a number of audiobooks. His role in Follyfoot as Ron Stryker is well-remembered. More recently known for his narration of Ice Road Truckers and &quot; on Discovery Channel, as well as MegaStructures for United Kingdom channel five.\n\n\nEnjoy and Seed!!","torrent":{"xt":"urn:btih:d0d2e2e0bf2ab7f1d5cb7918cfb2bbf221029f45","amp;dn":"A+History+of+the+English+Speaking+Peoples+-+Volume+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d0d2e2e0bf2ab7f1d5cb7918cfb2bbf221029f45","infoHashBuffer":{"type":"Buffer","data":[208,210,226,224,191,42,183,241,213,203,121,24,207,178,187,242,33,2,159,69]},"announce":[],"urlList":[]}}