{"title":"The Replacements - 1990 - All Shook Down  [EAC - FLAC]","uid":4821097,"size":271201156,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d13e85c149a104cde199c9f74d4620cd8756bdad&amp;dn=The+Replacements+-+1990+-+All+Shook+Down++%5BEAC+-+FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bludStain","files":-1,"time":1238768129,"description":"The Replacements - 1990 - All Shook Down  [EAC - FLAC]\n\nlossless with cue, log, jpg and txt..  OF COURSE!  like it? buy it. i did.\n\nTracks\n01 - Merry Go Round   Westerberg   3:29\n02 - One Wink at a Time   Westerberg   3:02\n03 - Nobody   Westerberg   3:06\n04 - Bent Out of Shape   Westerberg   3:42\n05 - Sadly Beautiful   Westerberg   3:09\n06 - Someone Take the Wheel   Westerberg   3:37\n07 - When It Began   Westerberg   3:07\n08 - All Shook Down   Westerberg   3:16\n09 - Attitude   Westerberg   2:43\n10 - Happy Town   Westerberg   2:54\n11 - Torture   Westerberg   1:51\n12 - My Little Problem   Westerberg   4:09\n13 - The Last   Westerberg   2:54 \n\n\nReview  by Stephen Thomas Erlewine\n\nBattered and broken from the debacle of Don't Tell a Soul -- the album's failure to take off, followed by a disastrous tour supporting Tom Petty &amp; the Heartbreakers -- the Replacements were on their last legs when it came time for 1990's All Shook Down, so worn down that the band ceased to exist for most intents and purposes. Paul Westerberg even began recording the album as a solo project with R.E.M. producer Scott Litt, gradually turning it into the final Replacements album. It may bear the band's name, but All Shook Down never quite shakes the feeling of a solo album; above all, it's a writers album, with the focus placed entirely on the songs. To a certain extent, that was true of the ballad-heavy Don't Tell a Soul, but that felt over-thought from its conception to execution, where there is a light touch to All Shook Down, despite its plethora of guest musicians, including John Cale's viola on &quot;Sadly Beautiful,&quot; Heartbreaker Benmont Tench, Terry Reid, and a duet with Concrete Blonde's Johnette Napolitano on &quot;My Little Problem.&quot; Instead of aiming for a crossover hit, Westerberg has now resigned himself to his status as an also-ran, even embracing it to some extent, so there are no sops to rock radio aside from &quot;My Little Problem,&quot; whose bluster is jarring amidst the nimble folk-pop of the rest of the record.\n\nAll the acoustic guitars and skipping electric guitars push All Shook Down far outside of the nascent Zeitgeist of grunge, or the sound of college rock in 1990; although Westerberg would soon be back in the thick of things with his Singles soundtrack -- sounding not too dissimilar to this record -- this finds him retreating from the rat race, reflecting on what he's been through. All Shook Down is designed as a coda to the Replacements' career, with Westerberg looking back to &quot;When It Began,&quot; pleading that &quot;Someone Take the Wheel&quot; and wrapping the whole thing up with &quot;The Last,&quot; as self-aware a final song as the Beatles' &quot;The End.&quot; Westerberg balances these self-referential slices of autobiography with his self-deprecation and heartbreak, but all this melancholy never feels heavy, not even when he dips into thick sorrow on &quot;Sadly Beautiful&quot; or the disembodied spookiness of &quot;All Shook Down.&quot; There's a palpable sense of relief to All Shook Down, as if Westerberg realized he dodged a bullet by not becoming a true rock star. This lightness is appealing, especially as it surfaces in his writing, which is surely more considered than it was even on Pleased to Meet Me, but it has an offhand quality, recalling the casual virtuosity of Let It Be and Tim -- it's the same guy, only older but maybe not too much wiser. And as it's true to that spirit, All Shook Down winds up being a note-perfect denouement to the Replacements' career, even if it's quiet and careful in a way the band never was at its peak. ","torrent":{"xt":"urn:btih:d13e85c149a104cde199c9f74d4620cd8756bdad","amp;dn":"The+Replacements+-+1990+-+All+Shook+Down++%5BEAC+-+FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d13e85c149a104cde199c9f74d4620cd8756bdad","infoHashBuffer":{"type":"Buffer","data":[209,62,133,193,73,161,4,205,225,153,201,247,77,70,32,205,135,86,189,173]},"announce":[],"urlList":[]}}