{"title":"Issa - Crossfire [2015] ak","uid":11719263,"size":112491553,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d1cc22eae87e24f7ee95ef63dd964a182f88dc23&amp;dn=Issa+-+Crossfire+%5B2015%5D+ak&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"analogkid6103","files":12,"time":1424741031,"description":"Artist: Issa\nAlbum: Crossfire\nGenre: Hard Rock / Melodic Rock\nCountry: Norway\nReleased: 2015\nFormat: MP3 CBR 320 kbps\n\n\nIssa Oversveen had a string of solo albums, three between 2010 and 2012, then nothing until now. Crossfire finds the Norwegian singer in fine form and still steering her voice and music towards AOR melodic rock. As usual she's surrounded by fine European talent, notably the songwriting partnership with Tom and James Martin. A personal favorite of hers, Steve Overland (FM, Overland) joins Issa in duet on Raintown.\n\nIssa\n\nAfter these things, there's not much to declare about Crossfire. All the songs are top notch, catchy and melodic. Issa's voice is always smooth and strong, staying above the music, and never out of control. Most songs feature a steady rock groove, generous keyboards, and sizzling solos. It's all the basic AOR melodic combination we expect from Issa. I guess we could argue as to whether this approach and output is redundant or merely consistent. But the point is moot, since the same could be applied to a great many artists and bands. Issa is in her element and, as always, she sounds pretty darn terrific.\n\nHighlighting some songs then. The duet with Overland is quite the large ballad, nearly melodramatic in it's presentation. Issa kicks out the jams with more than a few rockers including Crossfire, the heavier Long Time Coming, and Red Lights. Then, for some reason I can't put my finger on, a song like Heartbeat has a more American pop rock flavor to it. Another ballad of sorts, probably best considered an anthem, comes with Ghost Inside My Heart, and the inspirational We Rise. Again, this is familiar territory, AOR melodic rock, and Issa handles it with her usual impressive talent. If you liked everything else she's done, you'll dig this. Recommended.\n\nTracklist\n\n\n\n01. Crossfire\n02. New Horizon\n03. Raintown\n04. Long Time Coming\n05. Fight Fire With Rain\n06. Heartbeat\n07. Electronic Lights\n08. Ghost Inside My Heart\n09. Red Lights\n10. We Rise\n11. Only You\n\nGuest:\nSteve Overland (FM)\nDaniel Palmqvist (XOrigin)\nAlessandro Del Vecchio (Hardline)\nSteve Newman (Newman)\nRobert Sall (Work Of Art)\nDaniel Johansson (Degreed)\nStephen Chesney\nPete Newdeck (In Faith / Tainted Nation)\nMatt Black (Fahran)\nMichael Kew (Vega)","torrent":{"xt":"urn:btih:d1cc22eae87e24f7ee95ef63dd964a182f88dc23","amp;dn":"Issa+-+Crossfire+%5B2015%5D+ak","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1cc22eae87e24f7ee95ef63dd964a182f88dc23","infoHashBuffer":{"type":"Buffer","data":[209,204,34,234,232,126,36,247,238,149,239,99,221,150,74,24,47,136,220,35]},"announce":[],"urlList":[]}}