{"title":"The Vampire Lovers (Roy Ward Baker, 1970) UNCUT [RePoPo]","uid":4452448,"size":1488094389,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d1e89bde5845f060cde26e7657a40a644056b5f6&amp;dn=The+Vampire+Lovers+%28Roy+Ward+Baker%2C+1970%29+UNCUT+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"repopo","files":-1,"time":1224329680,"description":"*******************************************************************************\n                   The Vampire Lovers (Roy Ward Baker, 1970)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              Technical Information\n-------------------------------------------------------------------------------\nType..................: Movie\nContainer file........: AVI\nVideo Format..........: H.264\nTotal Bitrate.........: 2273 Kbps\nBits/(Pixel*Frame)....: 0.300\nAudio format..........: AC3 192 Kbps (Untouched)\nAudio Languages.......: English 1.0\nSubtitles Ripped......: Spanish\nResolution............: 720x384 (Original, cropped black bars)\nAspect Ratio..........: 1.85:1\nOriginal Aspect Ratio.: 1.85:1\nColor.................: Color\nFPS...................: 25.000\nSource................: PAL DVD\nDuration..............: 01:27:17\nGenre.................: Horror\nIMDb Rating...........: 6.3\nMovie Information.....: http://www.imdb.com/title/tt0066518/\n\n\n-------------------------------------------------------------------------------\n                                 PLEASE NOTICE\n-------------------------------------------------------------------------------\n\nSize has been calculated in order to get the optimum PQ without oversizing the\nfile, hence the irregular size of the file (not the usual 700Mb/1.4Gb rip).  \nA rate of Bits/(Pixel*Frame) around 0.3 is perfect, above that point, picture\nquality becomes virtually the same to the original source.\n\nCheck you have installed the right codecs, as listed in this .nfo file, before\ntrying to play it.  VLC will play this file without having to install any codec.\n\nIf you don't like the codec(s), container, resolution, file size, languages or\nany technical aspect on this rip, keep it to yourself and go and do your own.\n\nSerious feedback on quality will always be welcome.  IF you can/can't play it\non standalone players, PS3, Xbox, etc etc, that'd be of interest so I can\nenhance future rips.\n\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nPlot Synopsis\tby Dan Pavlides\n\nThis sexy horror story from Britain's Hammer Films finds Ingrid Pitt playing \nthree roles, the most notable being a lesbian vampire who will resort to biting \na man only when it is absolutely necessary. A doctor and a manservant are \nvictims, but only after she has exhausted all attempts to sink her fangs into \nthe bosoms of young women. The General (Peter Cushing) finds his daughter Laura \n(Pippa Steel) is victimized by the bite of the vampiress. With the help of Baron \nHartog (Douglas Wilmer), they try to end the horror brought by the blood-sucking \nbeauty. Blood, gore and a few decapitations are depicted before the wooden \nstakes and crosses are brought out.\n-------------------------------------------------------------------------------\nCAST\nIngrid Pitt                 - Mircalla/Marcilla/Carmilla\nGeorge Cole                 - Roger Morton\nKate O'Mara                 - Mme. Perrodot\nMadeline Smith              - Emma Morton\nPeter Cushing               - Gen. Spielsdorf\nDawn Addams                 - The Countess\nFerdy [Ferdinand] Mayne     - Doctor\nDouglas Wilmer              - Baron Hartog\nCarl Finch                  - Carl Ebbhardt\nKirsten Betts               - 1st Vampire\nJohn Forbes-Robertson       - Man in Black\nHarvey Hall                 - Renton\nCharles Farrell             - Landlord\nGraham James                - Young Man\nOlga James                  - Village Girl\nJanet Key                   - Gretchen\nPippa Steele                - Laura Spielsdorf\nShelagh Wilcox              - Housekeeper \n\nCREW\nRoy Ward Baker              - Director\nHarry Fine                  - Producer / Screenwriter\nMichael Style               - Producer / Screenwriter\nTudor Gates                 - Screenwriter\nMoray Grant                 - Cinematographer\nHarry Robertson             - Composer (Music Score)\nHarry Robinson              - Composer (Music Score)\nJames Needs                 - Editor\nScott MacGregor             - Art Director\nRoy Hyde                    - Sound/Sound Designer\nTom Smith                   - Makeup\nDerek Whitehurst            - First Assistant Director\nTom Sachs                   - Production Manager\nVic Armstrong               - Stunts Coordinator\nJoseph Sheridan Le Fanu     - Short Story Author\n-------------------------------------------------------------------------------\nSOME REVIEWS\n\nbritishhorrorfilms.co.uk \n(http://www.britishhorrorfilms.co.uk/vampirelovers.shtml)\n\nThe Vampire Lovers is one of the more famous of Hammer's later cycle of films, \nfor two reasons (both belonging to Ingrid Pitt). But copious amounts of Ms \nPitt's flesh aside, it has been unfairly maligned. In no way is it as bad as the \nsequel Lust For A Vampire, and it's certainly not as toe-curlingly awful as the \nreal tit-and-bum stuff like Virgin Witch.\nIt's a very literate translation of La Fanu's short story Carmilla (some would \nsay too literate), with none of the kitschness of Lust. Apart from the \noccasional appearance of an unnamed green-faced tosser on horseback (I have no \nidea why), Lovers is also quite a good film. Not as wonderful as Twins Of Evil, \nbut certainly not as bad as Horror Of Frankenstein.\nIn the pre-credit sequence we get told the new vampire rules - if you steal \ntheir shroud, they can have no night of rest. Plus they can only be killed by a \nstake through the heart or decapitation. So after self-styled vengeful vampire \nkiller Joachim Von Hartog goes to search for these &quot;murderers from beyond the \ngrave&quot; and spies a &quot;kind of human shape&quot; (or woman under a pink blanket), we get \nHammer's new approach distilled into a single scene - shrinking away from a \ngorgeous blonde, Hartog appears to have failed until her exposed boobs touch his \ncrucifix. She bears her fangs, he finds his strength and lops her head off in a \ntriumph of special effects. No, really. Unfortunately, the makers were obviously \nso impressed with their cleverness that they chose to repeat the scene twice \nagain during the film.\nDuring a Pride And Prejudice style dance hosted by General Spielsdorf (Peter \nCushing), we are introduced to Marcilla (Pitt) and her suspiciously \nyoung-looking mum, who arrive after Morton (George Cole) and his daughter Emma \n(Maddy Smith) have left. Marcilla's mum does a bunk and leaves her daughter in \nthe charge of Spielsdorf, and it's not long before his daughter, Laura (Pippa \nSteele), has succumbed to Marcilla's nudy breast-kissing antics (&quot;Oh Marcilla \nyou're so kind to me... I swear I shall die when you leave...&quot;). Every night \nLaura finds herself attacked by a giant cat, and during the day Ingrid practises \nher acting on-camera (sample dialogue: &quot;I could not SLEEP... I went to the \nCHAPEL... to PRAY...&quot;), but it's not long before Laura's dead, the doctor \ndiscovers puncture marks on her norks and Marcilla vanishes, the house echoing \nto Cushing's plaintive calls of her name. Marcilla has made her way back to the \ncastle seen in the pre-credits sequence, and as her nightgowned figure vanishes \ninto the fog, the camera comes to rest on the tombstone of Mircalla Karnstein. \nA-ha.\nOf course, it's not long before the obligatory busty girl is attacked in the \nforest, and we're then treated to a spectacular coach crash which sends footmen \nand horses scattering in all directions. The crash has happened right in front \nof Morton and Emma, and who should stagger out of the overturned coach but \nMarcilla's mum - her daughter is inside. Mum palms her daughter (this time \ncalled Carmilla) off on the trusting Cole and legs it again, and it's not long \nbefore Pitt and the equally busty (and more lovely) Maddy Smith are enjoying \nseveral naked bed and bathroom scenes together (&quot;You must take it all off...&quot; \nsays Carmilla).\nIt's also not long before Emma is having the same nocturnal feline visits as \nLaura before her (&quot;The trouble with this part of the world is they have too many \nfairytales,&quot; says her governess, Kate O'Mara), but of course, this being an age \nbefore telephones, the family has no idea what has happened to their friends \ndown the road.\nAnother peasant girl is killed in the forest, and as her funeral courtege passes \nby Carmilla and Emma, Carmilla reacts quite badly.\n&quot;I hate funerals!&quot;\n&quot;I thought it sad, yet somehow beautiful,&quot; replies Emma.\n&quot;You must die! Everyone must die!&quot;\nBlimey. Calm down, love.\nIt's not long though before people start putting two and two together, and \nrealise there's a vampire at work. The weakening Emma is surrounded with \ncricifixes and garlic (Pitt does a fantastic double-take the first time she \nwalks into the bedroom), the Karnstein legacy is explained (twice) and Cole \nmeets up with Spielsdorf, Laura's boyfriend and Bartok, finally realising that \nMarcilla, Carmilla and Mircalla are all one and the same: &quot;That girl is a guest \nin my house!&quot;\nAs a whole bunch of sweaty blokes rush back to Cole's house, Pitt is busy \nmunching her way through the servants (the butler failing to realise it was her \nwho was the be-fanged one), but fails to kill Emma - and as a knife is thrown at \nher by Laura's grieving boyfriend, vanishes into thin air. Things are boiling up \nnicely for a climactic approach towards the castle by torchlight, and we're not \nlet down as we proceed to a very gory staking and a not-as-good-as-the-first-one \ndecapitation.\nThe final scene sees Mircalla's painting turn from a beautiful girl into a \nskeleton (nice touch).\nVampire Lovers is a good film, not great, illuminated by the gorgeous Maddy \nSmith, the ever-dependable Cushing, a decent script and a few home truths about \nvampires. Much like Dracula in the original book, Mircalla walks around in \nsunlight, is afraid of just garlic and crosses, nothing more, and doesn't have \nrecourse to coffins. Refreshingly, she doesn't even like funerals. Makes Lee's \nDracula look positively Transylvanian.\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\n\nKeith Allen (Movierapture.com)\n\nRoy Ward Baker's The Vampire Lovers is a wonderfully fun film. While it is \nburdened with several overdone scenes, a number of awkward lines, and a few \nother faults, it is such a genuinely fascinating, sensuous, and eerie movie that \nit is almost certain to captivate the viewer.\n\nThe director combines in his film a sense of ominous menace with both a potent \nevocation of the supernatural and a sensuous almost feverish eroticism. While \nmaking the viewer aware of some mysterious, numinous presence, some uncanny \npower that has taken form in Carmilla, Baker repeatedly reminds him of the \ndangerous cruelty of that power and, consequently, fills him with real feelings \nof fear. At the same time, the director brings out the seductive allure of such \nan otherworldly being and makes clear the intoxicating, hypnotic influence she \nis able to exert on those around her. Thanks to the skillful evocations of all \nthese feelings, Baker's film is able to draw the viewer into its unearthly, \ndeadly, and profoundly sensual world and immerse him in its beauty, its mystery, \nand its brutality.\n\nThe performances of the various members of the cast greatly contribute to this \nemotive impact achieved by The Vampire Lovers. Pitt brings to her role a \nsophisticated but desperate salacity and makes the viewer feel that he is \nwatching some ancient, lethal power that, though alienated from mankind, is \ndesirous of forging connections with the young women it encounters. Madeline \nSmith and Pippa Steel, who play these women, may be the least accomplished \nperformers in the film, but both, especially the former, do infuse their \ncharacters with an innocent, youthful carnality and with a sense of that \nwondrous excitement felt by persons discovering their own sexuality and \nanticipating their first sexual experiences. Even Peter Cushing, though he plays \nonly a small part in the movie, is able to make the viewer aware both of General \nvon Spielsdorf's love for his daughter and of the character's determination to \navenge her death.\n\nNot only is much of the acting surprisingly good, The Vampire Lovers is also, \nfor the most part, a genuinely well made film. The sets and costumes used are \nall beautiful and successfully evoke another era. The special effects, if never \nimpressive, are usually effectively employed, and the script, if not poetic, is \nwell crafted. Occasionally, the movie's production values are not of the highest \nquality and the lines spoken by the actors are, at times, clichÃƒÆ’Ã‚Â©d, but such \nfaults are relatively rare and do little to decrease the film's enjoyableness.\n\nWhile it is hardly a great movie, The Vampire Lovers is consistently well made, \nevocative, and engaging. It is one of the best horror films I have seen. \n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:d1e89bde5845f060cde26e7657a40a644056b5f6","amp;dn":"The+Vampire+Lovers+%28Roy+Ward+Baker%2C+1970%29+UNCUT+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1e89bde5845f060cde26e7657a40a644056b5f6","infoHashBuffer":{"type":"Buffer","data":[209,232,155,222,88,69,240,96,205,226,110,118,87,164,10,100,64,86,181,246]},"announce":[],"urlList":[]}}