{"title":"Think Complexity - Allen B. Downey (eBook)","uid":7291798,"size":1288142,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d26801002d2cf4a6083b8bf6d9007ef2fc3819df&amp;dn=Think+Complexity+-+Allen+B.+Downey+%28eBook%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mhrsn","files":1,"time":1337762015,"description":"Think Complexity\nby Allen B. Downey\n\nPublisher: O'Reilly Media\nReleased: February 2012\nPages: 160\n================================================================================\n\nThis book is about complexity science, data structures and algorithms, intermediate programming in Python, and the philosophy of science:\n\n    Data structures and algorithms: A data structure is a collection that contains data elements organized in a way that supports particular operations. For example, a dictionary organizes key-value pairs in a way that provides fast mapping from keys to values, but mapping from values to keys is generally slower.\n\n    An algorithm is a mechanical process for performing a computation. Designing efficient programs often involves the co-evolution of data structures and the algorithms that use them. For example, the first few chapters are about graphs, a data structure that is a good implementation of a graph---nested dictionaries---and several graph algorithms that use this data structure.\n\n    Python programming: This book picks up where Think Python leaves off. I assume that you have read that book or have equivalent knowledge of Python. As always, I will try to emphasize fundmental ideas that apply to programming in many languages, but along the way you will learn some useful features that are specific to Python.\n\n    Computational modeling: A model is a simplified description of a system that is useful for simulation or analysis. Computational models are designed to take advantage of cheap, fast computation.\n\n    Philosophy of science: The models and results in this book raise a number of questions relevant to the philosophy of science, including the nature of scientific laws, theory choice, realism and instrumentalism, holism and reductionism, and Bayesian epistemology. \n\nThis book focuses on discrete models, which include graphs, cellular automata, and agent-based models. They are often characterized by structure, rules and transitions rather than by equations. They tend to be more abstract than continuous models; in some cases there is no direct correspondence between the model and a physical system.\n\nComplexity science is an interdiscipinary field---at the intersection of mathematics, computer science and physics---that focuses on these kinds of models. That's what this book is about. \n\n================================================================================\nThis book is under the Creative Commons Attribution-NonCommercial 3.0 Unported License, which means that you are free to copy, distribute, and modify it, as long as you attribute the work and don't use it for commercial purposes. \n\n================================================================================ &lt;a href=&quot;\nhttp://www.greenteapress.com/compmod/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.greenteapress.com/compmod/&lt;/a&gt; &lt;a href=&quot;\nhttp://shop.oreilly.com/product/0636920022480.do&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://shop.oreilly.com/product/0636920022480.do&lt;/a&gt;","torrent":{"xt":"urn:btih:d26801002d2cf4a6083b8bf6d9007ef2fc3819df","amp;dn":"Think+Complexity+-+Allen+B.+Downey+%28eBook%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d26801002d2cf4a6083b8bf6d9007ef2fc3819df","infoHashBuffer":{"type":"Buffer","data":[210,104,1,0,45,44,244,166,8,59,139,246,217,0,126,242,252,56,25,223]},"announce":[],"urlList":[]}}