{"title":"Alexander' s Care of the Patient in Surgery, 14E [PDF] [StormRG]","uid":10042746,"size":71551921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d28ed00fedcd84075cc1de15219f9578cd342946&amp;dn=Alexander%27+s+Care+of+the+Patient+in+Surgery%2C+14E+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":3,"time":1398484701,"description":"Author: Jane C. Rothrock\nSeries: Alexanders Care of the Patient in Surgery\nHardcover: 1328 pages\nPublisher: Mosby; 14 edition (June 21, 2010)\nLanguage: English\nISBN-10: 0323069169\nISBN-13: 978-0323069168\nFormat: Retail PDF\nReader Required: Adobe Reader, Foxit, Nitro, Adobe Digital Editions\n\nNote: This is the eBook of the printed book and may not include any media, website access codes, or print supplements that may come packaged with the bound book.\n\nTested on the above readers with no problems on laptop and Android tablet. Please allow a couple seconds for the seedboxes to kick in, then it should move pretty quick.\nHope it helps in your studies. Go for it! :D\n\n_________________________________________________________________________________\n\n\nFor more than 65 years, Alexander's Care of the Patient in Surgery has been a trusted source for detailed information on perioperative nursing. Well-known author and educator Jane C. Rothrock sets up a solid foundation for practice, and offers step-by-step instructions for over 400 surgical interventions as well as many minimally invasive surgical procedures, all backed by the latest research. More than 1,000 full-color illustrations and photos depict procedures and methods, as well as surgical anatomy and instrumentation. This edition adds Rapid Response Team boxes with suggested interventions, plus coverage of new trends in patient and staff safety, the increase in interventional radiology, and the growth of outpatient ambulatory surgery. Alexander's gives you the tools you need to provide safe, cost-effective, high-quality patient care.\n\n* Cutting-edge information keeps you up to date with the latest technological advances related to surgical procedures, both invasive and non-invasive, including areas such as interventional radiology.\n\n* 1,250 full-color illustrations and photos show surgical anatomy, instrumentation, procedures, and methods.\n\n* Over 400 specialty surgical interventions are included, as well as many minimally invasive surgical procedures.\n\n* A full-color design highlights special features and makes it easier to focus on essential concepts.\n\n* Patient and Family Education boxes include specific guidelines for preprocedural and postprocedural care, side effects and complications, home care, discharge/follow-up care, psychosocial care, and referrals.\n\n* Surgical Pharmacology tables summarize and offer quick reference to the drugs most commonly used for specific surgical procedures, including generic and trade names, purpose/description, and pharmacokinetics.\n\n* Patient Safety boxes highlight recent Joint Commission initiatives and important safety topics.\n\n* Evidence for Practice boxes apply scientific research to perioperative nursing.\n\n* Research Highlight boxes provide the latest research and apply it to patient care.\n\n* History boxes summarize significant historical events related to surgery and perioperative nursing.\n\n* A clear and consistent chapter format makes it easy to find information, including general discussions of surgical anatomy and perioperative nursing considerations followed by more specific discussions of procedural considerations and operative procedure for each surgical intervention.\n\n* Sample plans of care include nursing diagnosis, outcome, and interventions, linking specific interventions to clearly identified outcomes.\n\n* An emphasis on workplace safety includes recent OSHA guidelines, and helps you recognize and address an unsafe work environment.\n\n* Comprehensive discussions of Perioperative Nursing Considerations cover Assessment, Nursing Diagnosis, Outcome Identification, Planning, Implementation, Evaluation, Patient and Family Education and Discharge Planning.\n\n* Coverage of emergency preparedness and bioterrorism helps you know what to look for and how to handle different situations.\n\n* Coverage of cross-specialty areas includes special considerations for pediatric, geriatric, and trauma surgeries, as well as interventional radiology, complementary and alternative therapy, plus workplace issues and staff safety.\n\n* Patient Safety and Risk Management chapter addresses growing concerns for patient safety and liability within the OR, including issues related to documentation, legal issues, and patients' rights.\n\n* Interventional Radiology chapter covers the patient care needs associated with outpatient procedures done via scopes.\n\n* Workplace Issues and Staff Safety chapter explores how a positive workplace can improve morale, safety, and productivity.\n\n* Ambulatory Surgery Considerations boxes highlight information related to outpatient surgery.\n\n* Risk Reduction Strategies boxes describe ways to minimize negative outcomes in the perioperative setting.\n\n* Unique Rapid Response Team boxes suggest ways to intervene earlier in critical situations with the goal of preventing an emergency crisis response.\n\n* Unique pharmacology index provides a quick and easy reference to drug information.","torrent":{"xt":"urn:btih:d28ed00fedcd84075cc1de15219f9578cd342946","amp;dn":"Alexander%27+s+Care+of+the+Patient+in+Surgery%2C+14E+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d28ed00fedcd84075cc1de15219f9578cd342946","infoHashBuffer":{"type":"Buffer","data":[210,142,208,15,237,205,132,7,92,193,222,21,33,159,149,120,205,52,41,70]},"announce":[],"urlList":[]}}