{"title":"Mothers of the Church: The Witness of Early Christian Women","uid":15623819,"size":2353726,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2bbba6ca9b36c5b696222254e56e52566965baf&amp;dn=Mothers+of+the+Church%3A+The+Witness+of+Early+Christian+Women&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"catholicstuff","files":6,"time":1471895411,"description":"Mike Aquilina - Mothers of the Church: The Witness of Early Christian Women (EPUB, MOBI, PDF)\r\n\r\nMeet the heroines of Christianity's formative years!\r\n\r\nMike Aquilina and Christopher Bailey, in a follow-up to the best-selling The Fathers of the Church, have penned an inspiring companion volume on the Mothers of the Church that, like no other book, explores their impact on history and the Faith.\r\n\r\nMothers of the Church: The Witness of Early Christian Women will reinforce Catholics understanding of the part played by women in the early Church. Drawing upon a wide spectrum of sources, it illustrates the many kinds of women that left their mark on sacred history by responding to God s call. Whether they were martyrs, abbesses, mothers, desert solitaries, or managers of large family businesses, these women s stories will encourage you and deepen your faith.\r\n\r\nEach chapter features a concise biography that is supplemented by quotes from the Fathers writings concerning the woman in question, poetry concerning her, and other ancient testimonials.\r\n\r\nThe authors authoritative yet accessible writing style deftly explores the important impact of early Christian women.\r\n\r\nThe Mothers of the Church include:\r\n\r\nHoly Women of the New Testament\r\n--St. Blandina\r\n--St. Perpetua and St. Felicity\r\n--St. Helena\r\n--St. Thecla\r\n--St. Agnes of Rome\r\n--St. Macrina\r\n--Proba the Widow\r\n--St. Marcella\r\n--St. Paula\r\n--St. Eustochium\r\n--St. Monica\r\n--Egeria the Tourist\r\n\r\nThe Witness of Early Christian Women demonstrates the radical nature of Christianity's understanding of women and their roles, especially in a pagan society that viewed them as little more than property. The variety of women here is striking: poor widows, consecrated virgins, heroic martyrs, but also businesswomen, the wealthy, and an indomitable traveler on a world tour.\r\n\r\n---\r\n\r\nIf you enjoy this media, please seed and purchase a physical copy to support the producers and share with family and friends. \r\n\r\nFor more Catholic ebooks, audiobooks, audio presentations, movies &amp; video, visit \nhttps://thepiratebay.org/user/catholicstuff/","torrent":{"xt":"urn:btih:d2bbba6ca9b36c5b696222254e56e52566965baf","amp;dn":"Mothers+of+the+Church%3A+The+Witness+of+Early+Christian+Women","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2bbba6ca9b36c5b696222254e56e52566965baf","infoHashBuffer":{"type":"Buffer","data":[210,187,186,108,169,179,108,91,105,98,34,37,78,86,229,37,102,150,91,175]},"announce":[],"urlList":[]}}