{"title":"Nine Algorithms That Changed The Future: The Ingenious Ideas Tha","uid":8512101,"size":9517750,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d2fc6274b3943c0469e0bce7cd414639de16d959&amp;dn=Nine+Algorithms+That+Changed+The+Future%3A+The+Ingenious+Ideas+Tha&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ShihanMihiranga","files":2,"time":1369605426,"description":"Nine Algorithms That Changed The Future: The Ingenious Ideas That Drive Today's Computers (2012) John MacCormick\n\nScreen Short \n &lt;a href=&quot;\nhttp://www.shiblyonline.com/i/?v=sshgvml7j.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shiblyonline.com/i/?v=sshgvml7j.jpg&lt;/a&gt;\n\n\nFormat: mobi/epub\nGenre: Computers &amp; Technology\nPrint Length: 204 pages\nRelease Date: 2012\n\nEvery day, we use our computers to perform remarkable feats. A simple web search picks out a handful of relevant needles from the world's biggest haystack: the billions of pages on the World Wide Web. Uploading a photo totransmits millions of pieces of information over numerous error-prone network links, yet somehow a perfect copy of the photo arrives intact. Without even knowing it, we use public-key cryptography to transmit secret information like credit card numbers; and we use digital signatures to verify the identity of the websites we visit. How do our computers perform these tasks with such ease?\n\nThis is the first book to answer that question in language anyone can understand, revealing the extraordinary ideas that power our PCs, laptops, and smartphones. Using vivid examples, John MacCormick explains the fundamental 'tricks' behind nine types of computer algorithms, including artificial intelligence (where we learn about the 'nearest neighbor trick' and 'twenty questions trick') Google's famous PageRank algorithm (which uses the 'random surfer trick') data compression, error correction, and much more.\n\nThese revolutionary algorithms have changed our world: this book unlocks their secrets, and lays bare the incredible ideas that our computers use every day.\n\nContents:\n\n1. Introduction: What Are the Extraordinary Ideas Computers Use Every Day?\n2. Search Engine Indexing: Finding Needles in the World's Biggest Haystack\n3. PageRank: The Technology That Launched Google\n4. Public Key Cryptography: Sending Secrets on a Post?card\n5. Error Correcting Codes: Mistakes That Fix Themselves\n6. Pattern Recognition: Learning from Experience\n7. Data Compression: Something for Nothing\n8. Databases: The Quest for Consistency\n9. Digital Signatures: Who Really Wrote This Software?\n10. What Is Computable?\n11. Conclusion: More Genius at Your Fingertips?\n\nAuthor:\n\nJohn MacCormick is a computer science teacher and researcher. He grew up in New Zealand, studied mathematics and computer science in England, and now lives in Pennsylvania, USA. MacCormick has a PhD in computer vision from the University of Oxford, has worked in the research labs of Hewlett-Packard and Microsoft, and is currently a professor of computer science at Dickinson College. His work spans several sub-fields of computer science, including computer vision, large-scale distributed systems, computer science education, and the public understanding of computer science. ","torrent":{"xt":"urn:btih:d2fc6274b3943c0469e0bce7cd414639de16d959","amp;dn":"Nine+Algorithms+That+Changed+The+Future%3A+The+Ingenious+Ideas+Tha","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d2fc6274b3943c0469e0bce7cd414639de16d959","infoHashBuffer":{"type":"Buffer","data":[210,252,98,116,179,148,60,4,105,224,188,231,205,65,70,57,222,22,217,89]},"announce":[],"urlList":[]}}