{"title":"Sexually Broken--Chanell Heart fucked hard and put away wet","uid":9724826,"size":1337808897,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d34349c1fedd5421814d9aaf0495d7467c23cd14&amp;dn=Sexually+Broken--Chanell+Heart+fucked+hard+and+put+away+wet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"merzedes","files":-1,"time":1394286371,"description":"\nChanell Heart fucked hard and put away wet! Brutal deep throat, tag teamed and worked over by BBC! | Chanell Heart | Matt Williams\n\nMarch 7, 2014\n\n\nMP4 only.\n\n\nChanell Heart has made quite a name for herself in the past year. This beautiful 20 year old has really made her mark in the industry with her eagerness and enthusiasm. We are happy to have her back and see what all she has learned since she last graced the Sexuallybroken stage. Can she take what we dish out?\n\nWe keep our pet locked in a cage, taking it out when we feel like playing. And right now we feel like playing. Chanell is hauled out and bent over our handy fuck table, which is the perfect height to leave both ends deliciously, completely exposed. Face down, ass up, her elbows are bound behind her back. That and a neck rope is all it takes to keep her in her place. Then our pet is dropped to her knees to earn her keep. Which she does with vigor. Chanell sinks home to the base.\n\nWhat follows is a full on takedown and destruction by dick. Chanell gets the complete Sexuallybroken experience. Tag teamed by two cocks that never let up or show a sliver of mercy. Yanked up and thrown back on the fuck table, she fucks and sucks every which way. There is a dick buried in both holes at all times. Multiple orgasms shake through her bound body. We add a vibrator to rip yet more out of that overworked cunt. Chanell is sweaty and glassy eyed. It is a good look on her.\n\nOver and over, without lessening the pace, Chanell is plowed into sexual subspace. Fingerblasting causes her to cum yet again, helplessly. The feistiness leaves her face as she accepts her fate. Chanell knows what she is good for. Being a cock sheath. When we have had our fun for the time being, we haul our pet back up and shove her back in the cage, spraying her face down for good measure. Fucked hard and put away wet, like a good pet. You are a keeper Chanell! \n \nScreens &lt;a href=&quot;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_07cheart5/SexuallyBroken-Chanell-Heart-Matt-Williams-Chanell-Heart-fucked-hard-and-put-away-wet-Brutal-deep-throat-tag-teamed-and-worked-over-by-BBC.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://sexuallybroken.com/sexual/bondage/2014/03_07cheart5/SexuallyBroken-Chanell-Heart-Matt-Williams-Chanell-Heart-fucked-hard-and-put-away-wet-Brutal-deep-throat-tag-teamed-and-worked-over-by-BBC.php&lt;/a&gt;\n\n13 000 uploads and counting, 14k here we come :) And as usual, if you still like what Shallow2 and I upload, how about leaving us a nice comment below ? :)\n\n\nAny Questions ?? Read our FAQ!!\n &lt;a href=&quot;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image.bayimg.com/eaea7e9e982a9a677d61e4f5aaf93b7643bd6eeb.jpg&lt;/a&gt;\n\n\nCheers  :-)  \n\n\n","torrent":{"xt":"urn:btih:d34349c1fedd5421814d9aaf0495d7467c23cd14","amp;dn":"Sexually+Broken--Chanell+Heart+fucked+hard+and+put+away+wet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d34349c1fedd5421814d9aaf0495d7467c23cd14","infoHashBuffer":{"type":"Buffer","data":[211,67,73,193,254,221,84,33,129,77,154,175,4,149,215,70,124,35,205,20]},"announce":[],"urlList":[]}}