{"title":"Team Titans v1 #1-24 + 2 Annuals (1992-1994)","uid":7936150,"size":619842019,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:d3ac4abfd8f25489e711868c6dd287093d0c6ecc&amp;dn=Team+Titans+v1+%231-24+%2B+2+Annuals+%281992-1994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"blackcanary","files":-1,"time":1355864698,"description":"English | CBR | 36 Issues\n\nTeam Titans v1 #1-24 + 2 Annuals\nPublisher:  DC Comics\nPublication Date:  September 1992 - September 1994\n\nTraveling from the future, the Team Titans' mission was to kill Donna Troy before she can give birth to the boy who, in their future, would become the evil Lord Chaos. The Team Titans and their future were erased from existence during Zero Hour.\n\nOrigin\nThe Team Titans' story began 10 years in the future; or, rather, the false future where Lord Chaos reigned and a force known as the Team Titans struggled to overthrow his tyranny. To combat the Titan-god, the mysterious leader of the Team Titans sought out or created groups of super-powered teens. Collecting these youths together as the Teen Titans, named in honor of the original super-hero group of the 20th century, he created a nearly invisible army of underground freedom fighters. But he knew Lord Chaos' power, and he knew if Chaos had captured any one of his warriors, they could be forced to reveal his location and the whereabouts of the entire Teen Titans army. To prevent this, he created smaller subgroups of Titans. Each small platoon force was given specific missions, but knew nothing of their leader or the whereabouts of the other Titan-platoons. This would assure each group's safety, as well as the safety and existence of the entire underground. \n \nThe &quot;Leader&quot; sent one such platoon of Team Titans, consisting of Killowat, Mirage, Nightrider, Prestor Jon, Redwing, and Terra, back in time to the 20th century to kill Lord Chaos' mother before his birth. However, Lord Chaos' mother was the super-heroine Donna Troy, founding member of the Teen Titans.\n\nAs the &quot;Total Chaos&quot; event continued, crossing from the pages of Deathstroke the Terminator into the pages The New Titans, the Titans found themselves at odds with a group of teens from an alternate future. These teens would go on to form the Team Titans and spin off into an ongoing series of their own. Although their series would only last 24 issues, the team nevertheless started with a bang, offering five first issues, that each contained a different origin story for every team member. Marv Wolfman provided the scripts for each issue, while the art was handled by Kevin Maguire, Gabriel Morrissette, Adam Hughes, Michael Netzer, Kerry Gammill and Phil Jimenez.\n\nKritter-KMA has released updated scans of #5-8, 10, and 13 which are included in this torrent.\n\nThanks goes to Imbie, Rougher (DCP), and Kritter-KMA for these scans.","torrent":{"xt":"urn:btih:d3ac4abfd8f25489e711868c6dd287093d0c6ecc","amp;dn":"Team+Titans+v1+%231-24+%2B+2+Annuals+%281992-1994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3ac4abfd8f25489e711868c6dd287093d0c6ecc","infoHashBuffer":{"type":"Buffer","data":[211,172,74,191,216,242,84,137,231,17,134,140,109,210,135,9,61,12,110,204]},"announce":[],"urlList":[]}}