{"title":"Defcon One_ A Novel - Joe Weber.epub (steelballz)","uid":9499516,"size":2255999,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d4c3794d0f4e746ffae8a2144028519929fa0270&amp;dn=Defcon+One_+A+Novel+-+Joe+Weber.epub+%28steelballz%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"steelballz","files":-1,"time":1390186963,"description":"In this explosive bestseller, the U.S. and the Soviet Union are poised on the brink of Armageddon. Glasnost has failed. Russia is economically desperate. And Gorbachev's successor has launched the &quot;first strike&quot; in what may become WWIII. Only one man knows the full extent of the impending horror--a CIA operative trapped in the Kremlin.\n\nEditorial Reviews\nFrom Publishers Weekly\nA first novel, this gripping techno-thriller is set in the early 1990s, with the Soviet system falling apart and the U.S. about to take a commanding lead in the arms race, thanks to a combination of Stealth technology and SDI. The assassination of the Soviet premier brings to power a hard-liner with a daring plan: to force the U.S. to the brink of war--a state called Defense Readiness Condition Two, only one stage below maximum readiness, DefCon One--and then suddenly relax the pressure. If, as expected, the U.S. forces stand down, the U.S.S.R. will launch a surprise first strike. Weber, a former Marine fighter pilot, handles the military aspects of the developing confrontation convincingly, concentrating on air and naval operations. The novel's secret-agent aspect, a fast-paced escape-and-evasion trail through the heart of the Soviet Union, is only slightly less effective. The process by which responses to Russian provocation escalate to the limit is frighteningly credible, even in the age of glasnost. 100,000 first printing; $150,000 ad/promo.\nCopyright 1989 Reed Business Information, Inc.\nFrom Library Journal\nWhen aging Soviet hard-liner Zhilinkov attains power, he bullies his Politburo comrades into &quot;testing&quot; the speed of U.S. military reactions. The scenes shift rapidly from gripping air and naval battles to national strategy centers in Washington and Moscow as an equally determined President increases U.S. readiness posture towards Defense Condition One. Weber's forte is his ability to tell a fast-paced war story filled with accurate details of the latest weapons systems. The only characters who emerge as human beings are Dimitri Karpov, a Russian-speaking mole, and Steve Wickham, the senior CIA agent in Moscow, as they battle throughout the book to escape the clutches of the KGB and GRU with their critical information about Zhilinkov's intentions. In this first novel about the sunset of nuclear war, Weber chooses to ignore the roles Congress, the media, and the public would play in deciding U.S. responses. Recommended. Previewed in Prepub Alert, LJ 5/15/89.\n- Elsa Pendleton, Computer Sciences Corp., Ridgecrest, Cal.\nCopyright 1989 Reed Business Information, Inc.\nReview\n''A blazing debut.'' --Tom Clancy\n\n''Thought provoking to everyone interested in the global balance of power.'' --W. E. B. Griffin\n\n''Chilling and credible...It's a must-read.'' --Stephen Coonts\n\n''[A] gripping techno-thriller . . . Weber, a former Marine fighter pilot, handles the military aspects of the developing confrontation convincingly, concentrating on air and naval operations . . . Frighteningly credible.'' --Publishers Weekly\n\n''Weber's forte is his ability to tell a fast-paced war story filled with accurate details of the latest weapons systems.'' --Library Journal\n\n''For military buffs, DEFCON's the one . . . A taut narrative that should please and entertain those military buffs who like their action seasoned with high-level espionage.'' --Tallahassee Democrat / Sun\n\n''A war thriller not for the faint of heart. The pace of DEFCON One is faster than a heat-seeking missile . . . If military thrillers are for you, then DEFCON One is a must-read.'' --Atlantic City Press --This text refers to the Audio CD edition.\nAbout the Author\nJOE WEBER is a former fighter pilot who knows his subject well. His military thrillers are fast-paced, accurate, and as current as this morning's headlines. His novels have appeared on the bestseller lists of the New York Times, Publishers Weekly, the Associated Press, and the Chicago Tribune and have been translated into Chinese, Japanese, Hebrew, Spanish, Polish, Russian, and Italian. Mr. Weber holds a Master of Science degree in aviation management and is an Airline Transport-rated pilot with over 10,500 hours of flight time in forty-three different types of aircraft, ranging from aerobatic biplanes and high-performance military jets to four engine transports. He served in the United States Marine Corps from 1970-1975. A native of Enid, Oklahoma, he lives near Pensacola, Florida, with his wife.","torrent":{"xt":"urn:btih:d4c3794d0f4e746ffae8a2144028519929fa0270","amp;dn":"Defcon+One_+A+Novel+-+Joe+Weber.epub+%28steelballz%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4c3794d0f4e746ffae8a2144028519929fa0270","infoHashBuffer":{"type":"Buffer","data":[212,195,121,77,15,78,116,111,250,232,162,20,64,40,81,153,41,250,2,112]},"announce":[],"urlList":[]}}