{"title":"Futurama - Season 3 - Audio Commentary - DVDRip - AAC","uid":7508876,"size":265075951,"categoryP":"audio","categoryS":"sound_clips","magnet":"?xt=urn:btih:d4c751d9d5e8b994cc7335cc26104e080480ef1b&amp;dn=Futurama+-+Season+3+-+Audio+Commentary+-+DVDRip+-+AAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"schleicher","files":24,"time":1344213251,"description":"A Leela of Her Own (3ACV16) (Audio Commentary by Matt Groening, David X. Cohen, Patric M. Verrone, Swinton O. Scott III. and John DiMaggio)\n\nA Pharaoh to Remember (3ACV17) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ron Weiner, John DiMaggio and Billy West)\n\nA Tale of Two Santas (3ACV03) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Bill Odenkirk, Ron Hughart and Scott Vanzo)\n\nAmazon Women in the Mood (3ACV01) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Brian Sheesley, John DiMaggio, Billy West and Maurice LaMarche)\n\nAnthology of Interest II (3ACV18) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Bret Haaland, Billy West, John DiMaggio and Maurice LaMarche)\n\nBendin' in the Wind (3ACV13) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Horsted, John DiMaggio and Billy West)\n\nBendless Love (3ACV06) (Audio Commentary by Matt Groening, David X. Cohen, Eric Horsted, Swinton O. Scott III., John DiMaggio and Billy West)\n\nFuture Stock (3ACV21) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Jeff Westbrook, Brian Sheesley, John DiMaggio, Billy West and Tress MacNeille)\n\nGodfellas (3ACV20) (Audio Commentary by Matt Groening, David X. Cohen, Ken Keeler, Susan Dietter, John DiMaggio and Billy West)\n\nI Dated a Robot (3ACV15) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Kaplan, Peter Avanzino and Scott Vanzo)\n\nInsane in the Mainframe (3ACV11) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Bill Odenkirk and Peter Avanzino)\n\nParasites Lost (3ACV02) (1) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Eric Kaplan, Peter Avanzino and Scott Vanzo)\n\nRoswell that Ends Well (3ACV19) (Audio Commentary by Matt Groening, David X. Cohen, J. Stewart Burns, Susan Dietter, John DiMaggio and Billy West)\n\nRoswell that Ends Well (3ACV19) (Additional Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Claudia Katz and Scott Vanzo)\n\nThat's Lobstertainment (3ACV08) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Patric M. Verrone, Bret Haaland and John DiMaggio)\n\nThe 30% Iron Chef (3ACV22) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Brian Sheesley, John DiMaggio, Billy West and Tress MacNeille)\n\nThe Birdbot of Ice-Catraz (3ACV05) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Dan Vebber, John DiMaggio and Billy West)\n\nThe Cyber House Rules (3ACV09) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Lewis Morton, Susan Dietter, John DiMaggio, Billy West and Maurice LaMarche)\n\nThe Day the Earth Stood Stupid (3ACV07) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Jeff Westbrook, Brian Sheesley, John DiMaggio, Billy West and Tress MacNeille)\n\nThe Luck of the Fryrish (3ACV04) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Ron Weiner, John DiMaggio and Billy West)\n\nThe Route of All Evil (3ACV12) (Audio Commentary by Matt Groening, David X. Cohen, Rich Moore, Dan Vebber, Brian Sheesley, John DiMaggio, Billy West and Maurice LaMarche)\n\nTime Keeps on Slippin' (3ACV14) (Audio Commentary by Matt Groening, David X. Cohen, Ken Keeler, Susan Dietter, John DiMaggio and Billy West)\n\nWhere the Buggaloo Roam (3ACV10)  (Audio Commentary by Matt Groening, David X. Cohen, Pat Shinagawa, J. Stewart Burns, John DiMaggio and Billy West)","torrent":{"xt":"urn:btih:d4c751d9d5e8b994cc7335cc26104e080480ef1b","amp;dn":"Futurama+-+Season+3+-+Audio+Commentary+-+DVDRip+-+AAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4c751d9d5e8b994cc7335cc26104e080480ef1b","infoHashBuffer":{"type":"Buffer","data":[212,199,81,217,213,232,185,148,204,115,53,204,38,16,78,8,4,128,239,27]},"announce":[],"urlList":[]}}