{"title":"Cuckold session/-------CS Veruca James hd 720p","uid":7748990,"size":1226759139,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:d5473e950d4530f0df657a38d2f2d2af4bd60f5d&amp;dn=Cuckold+session%2F-------CS+Veruca+James+hd+720p&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"merzedes","files":-1,"time":1350848033,"description":"Cuckold session/-------CS Veruca James hd 720p\n\n\n\nNever sent a white boy to do a black man's job: Pleasuring white women. Lexington Steele is consulting Veruca James and her\nboyfriend Wade. Veruca loves her man but he can' offer her what she really needs- a goof hardcore fucking. Wade is packing as much as a\nsquirrel and Lex is about to prescribe a big black cock to remedy the situation. Wade knows this is the last resort before Veruca kicks him\nto the curb. Veruca James unzips Lex's pants and whips out the 10th Wonder of The World. Wade can only sit and watch as his girl sucks\non the legendary Lexington Steele. Veruca keeps sucking on that big black cock until it's her pussy's turn to get a taste of chocolate. Lex's\nblack missile guides its way into Veruca's fuck hole until her boyfriend's self esteem dwindles away. Wade's front row to this interracial\nfucking sees his girlfriend getting her white pussy drilled by a black cock that could double for a submarine in Jamaica. Veruca's pussy\nbecomes permanently useless for Wade and the next stop on the interracial express is her asshole. Veruca's bunghole gives that black\ncock a vice-like grip as it tunnels its way inside her colon. Wade can;t help but look on as his girlfriend is finally get then physical satisfaction\nshe;s always craved. Veruca James never had anal sex and for her to get Lex's cock as her first really says something. It also says something\nabout Veruca that she's wearing the biggest smile as Lex sprays her face with his Steele sauce. The cuckold can't compare on many levels\nand we have a feeling that Veruca James is done with crackers.\n\n\n\nScreens  &lt;a href=&quot;\nhttp://bayimg.com/LaeMgaaEG&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/LaeMgaaEG&lt;/a&gt;\n\n8000 uploads and counting, if you like what Shallow2 and I upload, how about leaving us a nice comment below ? :)   \n \nCheers  :-)  \n\n\t","torrent":{"xt":"urn:btih:d5473e950d4530f0df657a38d2f2d2af4bd60f5d","amp;dn":"Cuckold+session%2F-------CS+Veruca+James+hd+720p","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5473e950d4530f0df657a38d2f2d2af4bd60f5d","infoHashBuffer":{"type":"Buffer","data":[213,71,62,149,13,69,48,240,223,101,122,56,210,242,210,175,75,214,15,93]},"announce":[],"urlList":[]}}