{"title":"Mead, Richelle - Georgina Kincaid 01 - Succubus Blues-viny","uid":6424157,"size":3839318,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d56f3c42ed9ebe84b9b6ae1eacbb63fbf5eeefd7&amp;dn=Mead%2C+Richelle+-+Georgina+Kincaid+01+-+Succubus+Blues-viny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306403550,"description":"Mead, Richelle - Georgina Kincaid 01 - Succubus Blues-viny\n\nSuccubus. An alluring, shape-shifting demon who seduces and pleasures mortal men. Pathetic. A succubus with great shoes and no social life. See: Georgina Kincaid.\n\nWhen it comes to jobs in hell, being a succubus seems pretty glamorous. A girl can be anything she wants, the wardrobe is killer, and mortal men will do anything just for a touch. Granted, they often pay with their souls, but why get technical?\n\nBut Seattle succubus Georgina Kincaid's life is far less exotic. Her boss is a middle-management demon with a thing for John Cusack movies. Her immortal best friends haven't stopped teasing her about the time she shape-shifted into the Demon Goddess getup complete with whip and wings. And she can't have a decent date without sucking away part of the guy's life. At least there's her day job at a local bookstore--free books; all the white chocolate mochas she can drink; and easy access to bestselling, sexy writer, Seth Mortensen, aka He Whom She Would Give Anything to Touch but Can't.\n\nBut dreaming about Seth will have to wait. Something wicked is at work in Seattle's demon underground. And for once, all of her hot charms and drop-dead one-liners won't help because Georgina's about to discover there are some creatures out there that both heaven and hell want to deny...","torrent":{"xt":"urn:btih:d56f3c42ed9ebe84b9b6ae1eacbb63fbf5eeefd7","amp;dn":"Mead%2C+Richelle+-+Georgina+Kincaid+01+-+Succubus+Blues-viny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d56f3c42ed9ebe84b9b6ae1eacbb63fbf5eeefd7","infoHashBuffer":{"type":"Buffer","data":[213,111,60,66,237,158,190,132,185,182,174,30,172,187,99,251,245,238,239,215]},"announce":[],"urlList":[]}}