{"title":"(PSX-PSP) Monster Rancher collection converted properly (Kingdom","uid":4727682,"size":714524520,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:d5a7a96ab87dfaf4c59614e54deb7ab79b92eb29&amp;dn=%28PSX-PSP%29+Monster+Rancher+collection+converted+properly+%28Kingdom&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"toxicjuggalo","files":5,"time":1234833066,"description":"MONSTER RANCHER:\n\nKnown as Monster Farm in Japan, Monster Rancher is a pet breeding game with RPG elements. You raise, train, breed, and find monsters for the monster fighting tournaments, while trying to keep your monsters healthy and happy.\n\nMONSTER RANCHER 2:\n\nMONSTER RANCHER 2 is the second title in the monster-raising franchise, and is what many consider to be the best on the PlayStation. You place any CD into your PlayStation which reads a segment from the disc and the data is used to generate your monster. Then you must train your monster to fight, controlling every aspect of his training from what it eats to errantry training, where your beast can learn new and more effective attack moves. Once you feel that your monster is ready to fight, you can enter it in competitions where it gains valuable experience and new moves. Your ultimate goal is to raise your monster-breeding stats from an &quot;E&quot; level to the revered &quot;S&quot; level, where you can create a host of new monsters. Along the way you'll run into a diverse cast of characters, explore the land in search of lost treasure, spar with your monster, and even receive fan mail.\n\nMONSTER RANCHER - BATTLE CARD EPISODE II:\n\nMonsters inhabit the world and are raised and trained to battle each other. Children who are too young to own monsters collect and battle with cards instead. You give a friend a Phoenix card for her birthday, which completes her set. Thanks to an unknown curse she is transported to Monster Paradise. Now you must travel through the world entering tournaments and playing other collectors to build another complete set in order to rescue her. To battle, you must build decks of cards that relate to the three monsters you are battling with. In each turn, you draw five cards; you then have to decide which cards to play and which to discard for GUTS points which are required to perform certain attacks. Will you be able to battle your way through the competition in MONSTER RANCHER BATTLE CARD: Episode II and save your friend?\n\nMONSTER RANCHER - HOP-A-BOUT:\n\nThe MONSTER RANCHER craze reaches new heights with this highly enjoyable platform game for the PlayStation. You'll choose which monster you want to control, then bounce your way through various races against a series of competitors. Sundry panels can be overturned to uncover power-ups and bonuses throughout each level, and each board plays out like an otherworldly obstacle course of sorts. One of the game's most amazing features is its Level Editor, which allows gamers to design their own courses that can be played alone or against friends. All such work can be saved to a memory card for later use, which could include trading original levels with buddies. The game's Versus mode is also a ton of fun, challenging gamers to make it all the way to the finish line in a side-by-side struggle. The POK?MON series might have started the ball rolling, but MONSTER RANCHER has taken monster collecting to broad, new horizons.\n\nAll 4 games tested and working properly on CFW m33-4 combined with the 500 popsloader pack on 3.72 POPS...KloWn","torrent":{"xt":"urn:btih:d5a7a96ab87dfaf4c59614e54deb7ab79b92eb29","amp;dn":"%28PSX-PSP%29+Monster+Rancher+collection+converted+properly+%28Kingdom","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5a7a96ab87dfaf4c59614e54deb7ab79b92eb29","infoHashBuffer":{"type":"Buffer","data":[213,167,169,106,184,125,250,244,197,150,20,229,77,235,122,183,155,146,235,41]},"announce":[],"urlList":[]}}