{"title":"--XFROG 5 Plugin  for CINEMA 4D12 &amp; R13--","uid":7041925,"size":10313,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d5cc66ce9655f70da427f5e1412a78b866e956bf&amp;dn=--XFROG+5+Plugin++for+CINEMA+4D12+%26amp%3B+R13--&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"39Hax","files":-1,"time":1329578554,"description":"Re-Upped this one, previous one didn't satisfy me....comment if you like it, or if you don't...\n\nXfrog 5 is a procedural organic 3D modeller that allows you to create and animate 3d trees, flowers, nature based special effects or architectural forms. Xfrog enables even the most casual user with the powerful ability to create and animate organic models. Since it\\'s release in 2005, Xfrog for CINEMA 4D, endorsed by MAXON, quickly become one of the most popular plugins for CINEMA 4D.\n\nSome common examples of Xfrog 5 include: tree growth, tree seasons, blossoming flowers, complex nature-based effects, abstract, and many other uses. \n\nXfrog 5 includes several bug fixes, performance optimization including 20% speedup over Xfrog 4.4 as well as full compatibility with Cinema 4D R12 and R13. \n\nXfrog 5 for CINEMA 4D adds seven procedural Objects to CINEMA 4D.\nBy combining Xfrog Procedural Objects with each other and with any CINEMA 4D Objects, you can quickly create very realistic organic models and animations far beyond the existing capabilities of CINEMA 4D R 13.\n\n    The Branch Object is for easily setting up elaborate multi-level branching structures with numerous parameters to give them a natural look.\n\n    The Phyllotaxis Object arranges other Objects on an abitrary surface of revolution, according to the rules of nature (golden section).\n\n    The Hydra Object arranges Objects in a circular pattern.\n\n    The Curvature Object creates Splines which can be used as a basis for naturally curved leafs or twigs.\n\n    The Variation Object allows you to use multiply different Objects with Branch, Phyllotaxis and Hydra.\n\n    The Tropism Object lets your spline-based objects (like Branch, but also the CINEMA 4D SweepNURBS) bend towards an abitrary direction or position.\n\n    The Deviation Object is a simple way to add natural detail to your Branches, by deviating a Branch Object at the places where other Branches emerge.\n","torrent":{"xt":"urn:btih:d5cc66ce9655f70da427f5e1412a78b866e956bf","amp;dn":"--XFROG+5+Plugin++for+CINEMA+4D12+%26amp%3B+R13--","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5cc66ce9655f70da427f5e1412a78b866e956bf","infoHashBuffer":{"type":"Buffer","data":[213,204,102,206,150,85,247,13,164,39,245,225,65,42,120,184,102,233,86,191]},"announce":[],"urlList":[]}}