{"title":"[SoM]Nel continente nero[SatRip-Divx-Ita-Mp3]","uid":4754782,"size":739231744,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d5d0479427573a3fbf79b5357cfd86cf4da92bb1&amp;dn=%5BSoM%5DNel+continente+nero%5BSatRip-Divx-Ita-Mp3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mitimex","files":1,"time":1236389675,"description":"Il giovane e brillante manager Alessandro Benini sta illustrando in una importante riunione il suo brevetto su di un codice fonetico per il telefono, quando la madre lo avverte di aver ricevuto da Mombasa la notizia della morte del padre, Alfonso, partito da venti anni e del quale non avevano piÃƒÂ¹ saputo nulla. Alessandro, partito per il Kenia con la fidanzata Irene, e raggiunta Malindi (una cittadina sull'Oceano Indiano dove c'ÃƒÂ¨ una numerosa colonia di italiani), assiste al funerale del padre e conosce il combattivo missionario locale, il quale, dopo una dura orazione funebre, fa cantare &quot;Volare&quot; ad un coro di negretti. Alfonso ÃƒÂ¨ morto appunto in un incidente di volo, di notte, perchÃƒÂ¨ le luci del campo d'atterraggio erano spente. Il giovane apprende che il padre possedeva una villa e delle piantagioni, ma aveva anche moltissimi debiti e per questo motivo il capo della polizia locale gli sequestra il passaporto, in attesa che vengano pagati tali debiti. Intanto Benini viene arrestato con un pretesto, e rilasciato quando la sua cauzione viene pagata da Fulvio Colombo, socio del defunto Alfonso, il quale vuole apparirgli come un salvatore, ma ÃƒÂ¨ in realtÃƒÂ  il creditore unico di suo padre. Egli ÃƒÂ¨ uno scaltro e spregiudicato affarista, che gli si professa amico e lo intrappola invece con mille chiacchiere, riuscendo a farlo trattenere a Malindi per un processo per debiti, che fa sempre rinviare da un avvocato di colore. La colonia italiana di Malindi ÃƒÂ¨ composta da affaristi, legati da vari intrallazzi, tutti soggetti a Colombo, che temono, e fra essi l'onorevole Sparafico, personaggio importante, ma corrotto, e perfino un vescovo di pochi scrupoli, il quale non esita a ribattezzare un ragazzino di undici anni (pur sapendo benissimo che ÃƒÂ¨ giÃƒÂ  stato battezzato), per farsi fotografare in questo importante momento. Ripartita Irene per l'Italia, Alessandro ÃƒÂ¨ sempre piÃƒÂ¹ circuÃƒÂ¬to da Colombo, che vuole l'ereditÃƒÂ , ma anche la sua amicizia. Invece il giovane ha capito che potrÃƒÂ  lasciare il Kenia solo quando avrÃƒÂ  firmato la cessione dei suoi beni, cosa che egli fa. Ormai in procinto di partire, Benini viene portato da Colombo a visitare le rovine di un'antica cittÃƒÂ , dove Fulvio vorrebbe fare una bella residenza solo per loro due, ma, mentre Benini rifiuta, Fulvio viene morso da un serpente mamba, e muore in pochi istanti, negando sempre che Alfonso sia morto per suo ordine. Alessandro saluta il missionario, al quale comunica di aver lasciato alla missione il suo terreno, quindi parte per l'Italia.","torrent":{"xt":"urn:btih:d5d0479427573a3fbf79b5357cfd86cf4da92bb1","amp;dn":"%5BSoM%5DNel+continente+nero%5BSatRip-Divx-Ita-Mp3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d5d0479427573a3fbf79b5357cfd86cf4da92bb1","infoHashBuffer":{"type":"Buffer","data":[213,208,71,148,39,87,58,63,191,121,181,53,124,253,134,207,77,169,43,177]},"announce":[],"urlList":[]}}