{"title":"House of Night - Revealed, P.C. &amp; Kristin Cast","uid":9119639,"size":2129963,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d63181cfaa30e931db3f801da47d5aecfdd8a293&amp;dn=House+of+Night+-+Revealed%2C+P.C.+%26amp%3B+Kristin+Cast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GeekyGirl1983","files":-1,"time":1383101880,"description":"&quot;Revealed&quot; is the spellbinding eleventh and penultimate installment in the #1 &quot;New York Times&quot; bestselling vampyre series by PC and Kristin Cast. \n\nDrastically altered after her fall at the end of Hidden, Neferet is now more dangerous than ever--and her quest for vengeance will wreak havoc on humans, as well as Zoey and her friends. Chaos is loosed in Tulsa and the House of Night is blamed. Can Zoey stop Neferet in time to keep her anger from escalating to full-on war? Or will someone else have to step in to take the fall?\n\nThe House of Night series is an international phenomenon, reaching #1 on U.S., German, and UK bestseller lists, and remaining a fixture on &quot;The New York Times &quot;Children's Series bestseller list for nearly 150 weeks and counting. With more than 12 million copies in print, rights sold in thirty-eight countries to date, and relatable, addictive characters, this series is unstoppable. Now, in the eleventh and penultimate installment of the series, the action is more intense and the stakes even higher as Zoey and her friends battle to protect their school and home from devastating evil - all while balancing romances, precarious friendships and the daily drama of the House of Night's halls.\n\nForm: EPUB &amp; PDF","torrent":{"xt":"urn:btih:d63181cfaa30e931db3f801da47d5aecfdd8a293","amp;dn":"House+of+Night+-+Revealed%2C+P.C.+%26amp%3B+Kristin+Cast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d63181cfaa30e931db3f801da47d5aecfdd8a293","infoHashBuffer":{"type":"Buffer","data":[214,49,129,207,170,48,233,49,219,63,128,29,164,125,90,236,253,216,162,147]},"announce":[],"urlList":[]}}