{"title":"Yasunari Kawakata - Palm-Of-The-Hand Stories (pdf)","uid":10473080,"size":1832984,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d775053f840ca0b8ae5075479c0641aba2cc805b&amp;dn=Yasunari+Kawakata+-+Palm-Of-The-Hand+Stories+%28pdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pharmakate","files":-1,"time":1404276937,"description":"Yasunari Kawakata - Palm-Of-The-Hand Stories (North Point Press, 1988). Translated by Lane Dunlop and J. Martin Holman. 238 pp.\n\nImproved version of an older scan. Page images completely reprocessed.  Searchable pdf (clearscan) with contents in bookmarks, accurate pagination and metadata, etc. Many thanks to anmisto for finding the source file.\n\n**long-delayed fulfillment of anmisto's request -- hope it was worth the wait!**\n\n\nCollection of short fiction -- mostly short-shorts -- by the winner of the 1968 Nobel Prize for Literature.\n\n\ndescription:\n\nWinner of the Nobel Prize in Literature in 1968, Yasunari Kawabata is perhaps best known in the United States for his deeply incisive, marvelously lyrical novel Snow Country. But according to Kawabata himself, the essence of his art was to be found in a series of short stories-which he called &quot;Palm-of-the-Hand Stories&quot;-written over the entire span of his career. He began experimenting with the form in 1923 and returned to it often. In fact, his final work was a &quot;palm-sized&quot; reduction of Snow Country, written not long before his suicide in 1972. Dreamlike, intensely atmospheric, at times autobiographical and at others fantastical, these stories reflect Kawabata's abiding interest in the miniature, the wisp of plot reduced to the essential. In them we find loneliness, love, the passage of time, and death. Palm-of-the-Hand Stories captures the astonishing range and complexity of one of the century's greatest literary talents.\n\nFrom Publishers Weekly\n\nNobel laureate Kawabata is best known in the West for such novels as Snow Country and Thousand Cranes, yet his short stories, written over 50 years, seem to contain his essence as a writer. Here sensitively translated are 70 of them, most written in Kawabata's youth and usually no more than a page or two in length, though the last one, &quot;Gleanings from Snow Country,&quot; is somewhat longer and was written just before Kawabata's suicide in 1972; it is a miniaturization of the highly praised novel of the same name. The tales are variously realistic, allegorical and fantastic; and, as in the novels, the principal themes are love, loneliness, social change, man's relation with nature and death. Each story exhibits some sharp and often subtle perception of life (in Kawabata's world, stillness can &quot;resound&quot; and men listening to a woman's laugh can experience &quot;a strange kind of aural jealousy&quot;); and each, like a haiku or classic Zen painting, suggests far more than it states. \n\nFrom Library Journal\n\nThese 60 stories by 1968 Nobel laureate Kawabata are engagingly and sensitively translated. The stories, never more than three pages long and often only a page, were written from 1923 to 1972, the year of Kawabata's suicide. Some are cryptic, permitting only guessed-at meanings, others whimsically humorous; some express poignant emotions, others epiphanies; some deal with everyday life, others with ghosts; some with samurais, others with peasants. Though they all take place in 20th-century Japan, these stories are timeless and essentially universal. Kawabata is a master storyteller reminiscent of James Joyce, but with a smaller, sharper, more incisive vision. Highly recommended.\n\n-----\n\nfor more Yasunari Kawabata, see workerbee's torrent: &lt;a href=&quot;\nhttp://thepiratebay.se/torrent/10352836&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/torrent/10352836&lt;/a&gt;\n","torrent":{"xt":"urn:btih:d775053f840ca0b8ae5075479c0641aba2cc805b","amp;dn":"Yasunari+Kawakata+-+Palm-Of-The-Hand+Stories+%28pdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d775053f840ca0b8ae5075479c0641aba2cc805b","infoHashBuffer":{"type":"Buffer","data":[215,117,5,63,132,12,160,184,174,80,117,71,156,6,65,171,162,204,128,91]},"announce":[],"urlList":[]}}