{"title":"Salif Keita &amp; Kante Manfila - The Lost Album [FLAC] TQMP","uid":6848146,"size":320263467,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:d843c56de180d57b63914469853fae90c85f3534&amp;dn=Salif+Keita+%26amp%3B+Kante+Manfila+-+The+Lost+Album+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"pastafari","files":-1,"time":1322421666,"description":"Salif Keita &amp; Kante Manfila - The Lost Album\nOriginal release, 1980\nRe-issue, 2005\n\n* * * * * * * * * * * * * * * * * * *\n\nKeeping my latest trend of looking at the past, here's a little gem I found this past summer. The disc was used and all messed up but the rip came out fine. I also found another excellent album produced by Kante Manfila. That's coming next. Enjoy!\n\n* * * * * * * * * * * * * * * * * * *\n\nAn icon of Malian music, Salif Keita is an accomplished artist whose international recognition testifies of his huge talent. Through his many different musical experiences during his career, this out of the ordinary artist asserted himself in the musical world.\n\nSalif Keita had a painful childhood. Albino born, he grew up in total loneliness. Actually, because of his difference, no one wanted to approach him, not even his father who didn't talk to him for years. Playing guitar and singing were a way out of loneliness for this young talented musician.\n\nAt this time, in this part of Africa, singing was exclusively the griot's right, a person with noble descent didn't have the right to sing. Nevertheless, Salif Keita had no choice, because even the State refused to employ him as a teacher. He then decided to leave for Bamako, the Malian capital, to earn his living. At the end of the 60's, he joined the &quot;Rail Band of Bamako&quot; &quot;Hotel de la Gare&quot;, with the blessing of Tidiane Kone. Four years later, the young Salif Keita left the Rail Band for the rival group, &quot;Ambassadors of the Motel&quot;, run by Guinean born Manfila Kante, convinced by the incredible vocal abilities of Salif.\n\nWith Manfila Kante's complicity, Salif Keita left Mali in 1977 for Abidjan, the Ivory Coast capital and also the rallying point of African show business. In Ivory Coast, after many enriching experiences, Salif Keita and Kante Manfila decide to produce in 1980 an acoustic album. An album that caused general enthusiasm to African music lovers, even if at this period the local trends were towards pop, funk and reggae music.\n\nThe result was breathtaking. Titles like &quot;Idjo fama&quot;, Touramakan&quot; or &quot;Wara&quot; proved the maturity of this out of the ordinary artist, combining a militant pacifist spirit and Pan-African convictions. Through this album, Salif Keita and Kante Manfila brought African music to a brand new dimension.\n\nAlways striving for perfection, Salif Keita succeeded in putting the new generation on the right track, a generation that 25 years later has come back to acoustic music.\n-- CD liner notes\n\n* * * * * * * * * * * * * * * * * * *\n\nReview -\n\nThe Lost Album resurrects six lengthy and largely acoustic tracks recorded in 1980 by West African singer Salif Keita and his longtime collaborator, guitarist Kante Manfila. Musical partners since the late '60s, first in the Rail Band and then in Les Ambassadeurs Internationaux, Keita and Manfila seem to be moving away from that group's somewhat westernized Afro-pop sound with these sessions. This is not to say that these are all traditional African musical forms: although the hypnotic &quot;Toura Makan&quot; sounds like it could have fit on one of the Nonesuch Explorers collections, Manfila's opening showcase &quot;I Djo Fama&quot; begins with a double-tracked acoustic guitar figure that's been processed to sound like Mike Oldfield's trademark half-speed guitar experiments. The arrangements are stripped down and the production medium-fi at best; some percussion, kalimba, a bit of trumpet, and a female vocal chorus make occasional appearances (frustratingly, there are no personnel or recording credits), but throughout, the focus remains on Keita's spellbinding vocals. Free of the synthesized gloss of his breakthrough solo albums from later in the decade, The Lost Album features a young Keita in a slightly rougher but warmly intimate musical setting.\n- allmusic.com\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01 - I Djo Fama\n02 - Finzamba\n03 - Toura Makan\n04 - Djigui\n05 - Nkana\n06 - Wara\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:d843c56de180d57b63914469853fae90c85f3534","amp;dn":"Salif+Keita+%26amp%3B+Kante+Manfila+-+The+Lost+Album+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d843c56de180d57b63914469853fae90c85f3534","infoHashBuffer":{"type":"Buffer","data":[216,67,197,109,225,128,213,123,99,145,68,105,133,63,174,144,200,95,53,52]},"announce":[],"urlList":[]}}