{"title":"Air Conflicts Vietnam PS3-DUPLEX","uid":8988534,"size":3633159089,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:d87c6fa65667805e935ce9d2bdebb4f10802e1e6&amp;dn=+Air+Conflicts+Vietnam+PS3-DUPLEX+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dududus","files":75,"time":1380735754,"description":"Vietnam War. It is the year 1965. A conflict, that began 20 years ago, escalates. Vietnam is a divided country. The communistic North fights against the anti-communistic South in a fierce civil war. The USA are at Cold War with the Soviet Union and, in order to demonstrate their interests, they decide to support South Vietnam in the fight against the communistic Vietcong troops.\n\nWitness the story of Joe Thompson, a brave pilot of the US Air Force during the Vietnam War. He reaches Vietnam as one of the first soldiers of the USA. He is young, talented and dutiful. The will to serve his country and to help people by doing that dominates his life. Take a seat in the pilot's seat of jet fighters and helicopters, those war machines that were used during the Vietnam War for the first time in history, and experience explosive aerial combat in a class of its own and accompany Joe on his way to become a real ace. But during this war he will face an acid test. What Joe experiences in Vietnam will change him forever and even the relationship to his family on another continent, watching his mission from afar. They can reach him only by writing letters...\n\nRelease Date: November 19, 2013\nRP for Rating Pending:\nGenre: Flight\nPublisher: BitComposer Games\nDeveloper: Games Farm","torrent":{"xt":"urn:btih:d87c6fa65667805e935ce9d2bdebb4f10802e1e6","amp;dn":"+Air+Conflicts+Vietnam+PS3-DUPLEX+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d87c6fa65667805e935ce9d2bdebb4f10802e1e6","infoHashBuffer":{"type":"Buffer","data":[216,124,111,166,86,103,128,94,147,92,233,210,189,235,180,241,8,2,225,230]},"announce":[],"urlList":[]}}