{"title":"The Last StarFighter [Divx - Ita - Mp3][Tntvillage.Scambioetico]","uid":5300099,"size":629594112,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d8d5c0f00ae5f11b3ab94f35368770666893a54d&amp;dn=The+Last+StarFighter+%5BDivx+-+Ita+-+Mp3%5D%5BTntvillage.Scambioetico%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"RDaneel20","files":1,"time":1264190809,"description":"The Last Starfighter\n\n\n\nby rdaneel\n\n\n\n\nAttori\n\nLance Guest: Alex Rogan/Beta Alex\nRobert Preston: Centauri\nDan O'Herlihy: Grig\nCatherine Mary Stewart: Maggie Gordon\nChris Hebert: Louis Rogan\nKay E. Kuter: Enduran\nDan Mason: Lord Kril\nBarbara Bosson: Jane Rogan\nNorman Snow: Xur\nJohn O'Leary: Rylan Bursar\n\n\n\n\n\nAlex ÃƒÂ¨ un giovane cresciuto in un campo di baracche in mezzo alla natura che conduce una vita piuttosto noiosa ai margini della societÃƒÂ  americana. ÃƒË† il campione di Starfighter, un videogioco sparatutto simile a Space Invaders in cui il solo obiettivo ÃƒÂ¨ distruggere ogni possibile minaccia aliena. Ma una volta battuto l'ultimo livello incontra un uomo misterioso di nome Centauri che si presenta come uno dei produttori del gioco. Quello che sembrava solo un videogioco, in realtÃƒÂ  si rivela essere un modo, poco ortodosso, di selezionare i migliori piloti di Gunstar, i caccia da guerra di una unione planetaria chiamata Lega Stellare. Alex viene cosÃƒÂ¬ praticamente rapito da Centauri, condotto alla base della Lega Stellare e arruolato nell'esercito per la difesa delle frontiere della galassia contro Xur e l'armata di Ko-dan (come diceva il videogioco). Ma capito l'inganno chiede di tornare a casa, per scoprire soltanto che un cacciatore di taglie, inviato da Xur, gli sta giÃƒÂ  dando la caccia. Viene salvato da Centauri e rimpiazzato sulla Terra da un clone alieno che dovrebbe spacciarsi per l'originale nel tentativo di mascherare la partenza di Alex. Tornato nello spazio scopre che tutti i piloti di Gunstar sono rimasi uccisi in un attacco alla base della Lega Stellare ed essendo rimasto l'unico in grado di fermare l'invasione aliena, prende i comandi della sua astronave come ultimo Starfighter.\n\n\n\n    * Giochi Stellari ÃƒÂ¨ il primo film che per gli effetti speciali ha utilizzato interamente un computer.\n    * Atari aveva in progetto di creare un videogioco simile a quello utilizzato da Alex nel film.\n    * La macchina spaziale guidata da Centauri ÃƒÂ¨ basata su una DeLorean (come l'auto vista in Ritorno al futuro).\n\n\n\n\n\n:::-&gt;Scheda tecnica del Rip","torrent":{"xt":"urn:btih:d8d5c0f00ae5f11b3ab94f35368770666893a54d","amp;dn":"The+Last+StarFighter+%5BDivx+-+Ita+-+Mp3%5D%5BTntvillage.Scambioetico%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8d5c0f00ae5f11b3ab94f35368770666893a54d","infoHashBuffer":{"type":"Buffer","data":[216,213,192,240,10,229,241,27,58,185,79,53,54,135,112,102,104,147,165,77]},"announce":[],"urlList":[]}}