{"title":"FSX - FS9 - Flight Replicas Messerschmitt Bf 109F","uid":4622708,"size":494026752,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d997b86fc7b79abb83b772a598ed4452b8bbcefe&amp;dn=FSX+-+FS9+-+Flight+Replicas+Messerschmitt+Bf+109F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"flyer220","files":-1,"time":1231096791,"description":"Messerschmitt Bf 109F &quot;Friedrich&quot;, for FS2004 and (( FSX   SP1/Accel , Vista/XP ))\n\n\nWork began on a new version of the Bf-109 at the start of 1940, to replace the Bf-109E. Pre-production models of the new F &quot;Friedrich&quot; version first appearing at the end of 1940. The fuselage aerodynamics were improved, most noticeably with a new engine cowling and spinner, and the squared wings of the Emil replaced by newly designed and improved units featuring most noticeably rounded wing tips and different flap configuration. The first production series F-1/F-2 received the 1,175 hp (875 kW) DB601N engine. The 1,350 hp (1,005 kW) DB601E was first used in the F-3 model together with a better propeller with improved performance. The most popular version, the F-4, appeared at the start of 1942. Pilots generally agreed that the F series were the best-handling of all the Bf 109 series.\n\nThe armament of the Bf 109F consisted of the two MG 17 above the engine plus a cannon firing through the propeller hub: The early F versions were equipped with the MG FF/M cannon, the F-2 got the 15 mm MG 151, and from F-4 on the 20 mm MG 151/20 was used. Several aces, particularly Oberst Adolf Galland, criticised the light armament as inadequate for the average pilot. Major Walter Oesau even refused to fly an F as long as 'Emil's were still available. Only after a lack of spare parts, did he accept an F. Later on, an attachment of underwing 20 mm cannons addressed the issue of fire-power, but at a price to performance. Werner MÃƒÂ¶lders on the other hand was very much pleased and saw the single centerline gun as an improvement. It is possible that the criticism of the Bf 109F's armament is based on the early F-2 version with the 15 mm MG 151/15 cannon, which was later replaced by the 20 mm version of the same weapon and was seen highly effective by aces like GÃƒÂ¼nther Rall.Hans Joachim Marseille, the Luftwaffe pilot who scored the highest number of kills against Western aircraft, a total of 158, achieved most of his victories in a Bf-109F-4/Trop, in North Africa. Having scored five kills in the Battle of Britain, he rapidly accumulated further victories over the desert due to his excellent marksmanship.\n\nApproximately 2,200 Friedrichs were built.\n\nFeatures: \n\n- Highly accurate VC, with many functioning parts \n- ReviC12D gunsight, that can be turned on and off\n- 7 different models to cover variations\n- Each model features versions with and without pilot lifejacket, for over-water flights\n- 7 different textures\n- Accurate and challenging ground-handling characteristics; \n- Droppable Drop Tank, that removes weight and fuel from the aircraft.cfg for realistic performance\n- Droppable bomb\n- Accurate pilot flight suit, lifejacket and flight helmet\n- 100% authentic Bf-109 startup sounds\n- Propeller blades which alter their angle with prop setting\n- Functioning automatic/manual coolant flaps, which also serve as landing flaps\n- 3D gauges in the VC, for incredible realism\n\nThe Manual and Paintkit are in the F-4 aircraft folder.\n\n\n\n","torrent":{"xt":"urn:btih:d997b86fc7b79abb83b772a598ed4452b8bbcefe","amp;dn":"FSX+-+FS9+-+Flight+Replicas+Messerschmitt+Bf+109F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d997b86fc7b79abb83b772a598ed4452b8bbcefe","infoHashBuffer":{"type":"Buffer","data":[217,151,184,111,199,183,154,187,131,183,114,165,152,237,68,82,184,187,206,254]},"announce":[],"urlList":[]}}