{"title":"Anne_Melody-Surrender.epub","uid":8881008,"size":451650,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d998583e1e1106256f21088efadc8ba261c4a962&amp;dn=Anne_Melody-Surrender.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"420weedman","files":1,"time":1378321340,"description":"Raffaello (Rafe) Palazzo takes what he wants with no regrets. Arianna (Ari) Lynn Harlow has led a charmed life until tragedy strikes her family. He's looking for a no-emotions attached mistress, she's looking for redemption. They are not a pair that should ever work, but undeniable attraction and devastating tragedies bring them together in the city by the bay where he fights to keep their relationship nothing more than an enjoyable way to meet his needs, and she battles to not lose herself in him. Spending time with Ari starts cracking the hard shell that Rafe has built around his heart, but he denies the affect she has on him until it's too late to stop the inevitable conclusion that their relationship is headed for.Rafe once believed in happily ever after, coming from a large Italian family. He's got the Midas touch, since every endeavor he tries turns to gold. That all ends when his wife walks out the door and leaves him blindsided. His devastation quickly turns to steel when he decides no woman will fool him again. From that point on he treats relationships as nothing more than business transactions where both party's come out mutually benefited.Just when Ari has sunk to the lowest she's ever been she finds an ad in the paper announcing a job that's too good to be true. It turns out she's right. She makes it through the intense rounds of interviews only to find out the job is for a mistress to the powerful Rafe Palazzo, owner of Palazzo Enterprises. Rafe gives her a day to think about whether she wants the position or not, and she's sent on her way, only to find out her mother's near-terminal position has taken a turn for the worse. Her mom's only in the hospital because Ari messed up, and her mother's the one who paid the price. Is Rafe her savior, or will he take her with him straight to the depths of hell?","torrent":{"xt":"urn:btih:d998583e1e1106256f21088efadc8ba261c4a962","amp;dn":"Anne_Melody-Surrender.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d998583e1e1106256f21088efadc8ba261c4a962","infoHashBuffer":{"type":"Buffer","data":[217,152,88,62,30,17,6,37,111,33,8,142,250,220,139,162,97,196,169,98]},"announce":[],"urlList":[]}}