{"title":"Pink Floyd The Wall DTS-CD","uid":6288261,"size":861188034,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9c77a9c7fa101ded1ca17e6a820684e2501a4f2&amp;dn=Pink+Floyd+The+Wall+DTS-CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"JaGrab3","files":1,"time":1301696993,"description":"Roger Waters constructed The Wall, a narcissistic, double-album rock opera about an emotionally crippled rock star who spits on an audience member daring to cheer during an acoustic song. Given its origins, it's little wonder that The Wall paints such an unsympathetic portrait of the rock star, cleverly named &quot;Pink,&quot; who blames everyone -- particularly women -- for his neuroses. Such lyrical and thematic shortcomings may have been forgivable if the album had a killer batch of songs, but Waters took his operatic inclinations to heart, constructing the album as a series of fragments that are held together by larger numbers like &quot;Comfortably Numb&quot; and &quot;Hey You.&quot; Generally, the fully developed songs are among the finest of Pink Floyd's later work, but The Wall is primarily a triumph of production: its seamless surface, blending melodic fragments and sound effects, makes the musical shortcomings and questionable lyrics easy to ignore. But if The Wall is examined in depth, it falls apart, since it doesn't offer enough great songs to support its ambition, and its self-serving \nmessage and shiny production seem like relics of the late-'70s Me Generation.\n\nSpecially for Corey.\n\nP.","torrent":{"xt":"urn:btih:d9c77a9c7fa101ded1ca17e6a820684e2501a4f2","amp;dn":"Pink+Floyd+The+Wall+DTS-CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9c77a9c7fa101ded1ca17e6a820684e2501a4f2","infoHashBuffer":{"type":"Buffer","data":[217,199,122,156,127,161,1,222,209,202,23,230,168,32,104,78,37,1,164,242]},"announce":[],"urlList":[]}}