{"title":"Jim Reeves - Wel My World - 1949-1964 - Bear Family 16CD","uid":6435165,"size":2602986668,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d9e44d6366dbd91a04816d6cda71d2782b770fc1&amp;dn=Jim+Reeves+-+Wel+My+World+-+1949-1964+-+Bear+Family+16CD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":3,"uploader":"bonnie335","files":508,"time":1306785494,"description":"Bear Family. Release: 1996. Remastered.\n\nThis massive collection by the German Bear Family label is the most intimidatingly thorough collection of Jim Reeves' work. Basically, it's virtually everything from his recording sessions, and there are two separate boxes of his radio transcriptions besides! But this one is unwieldy enough -- it's 16 CDs covering all of Reeves' recordings from his earliest in 1949 for the Macy label to his move to Abbott in 1952, including ten unissued alternate takes and rejected masters, a single side issued by Fabor, and then back to Abbott. These sides make up the first two discs of the collection and offer what most folks have never heard in Reeves -- his hillbilly records that reflect a beautiful fusion of the Western swing, honky tonk and cowboy traditions; Reeves' songwriting was also in full flower at this early period in Texas. The early crooning style that hinted at his later pop recordings came in the latter period of his association with Abbott. These songs are all revelatory in that they reveal without doubt what it was RCA heard in Reeves and why he stood out: His relaxed, smooth full-throated baritone delivery transcended country &amp; western music. Beginning with disc three and going all the way though disc 13 are Reeves' complete recordings for RCA. The earliest of them are still very much in the country and Western swing tradition, but in the production the sound is a bit more lush, where the instruments begin to balance with Reeves' honeyed delivery. The fiddles play more like strings and so does the pedal steel. &quot;I'm Hurtin' Inside&quot; slips along without seam or stitch, and is a perfect example of where Reeves would go with his style.\n\nAnd it didn't take him long to get there. By the time Reeves recorded &quot;Am I Losing You&quot; in 1956, the mature ballad style was already in his voice, and producer Chet Atkins was aware of where it could go; still, it would be the recording of &quot;Four Walls&quot; in 1957 that the real transition was in full swing. And 1957 was a big year. The Jordanaires and Floyd Cramer became integral to the Reeves sound and the roots of countrypolitan were dug. They would begin to sprout on &quot;Everywhere You Go,&quot; from that same year, which was as much Nat King Cole as it was Reeves: a brushed jazzy four on the drums, Cramer comping with beautiful -- if a tad rigid -- jazz chords, and the Jordanaires singing a near scat chorus behind Reeves. By December, with &quot;I Love to Say I Love You&quot; with the Anita Kerr Singers backing him, the transition was complete. The story is well-known from here beginning on the fifth disc; Reeves' prolific output as the king of country crooners was already evidenced by his chart success internationally. Even after the Beatles changed everything in 1963, Reeves was charting in England. From &quot;He'll Have to Go&quot; to &quot;Welcome to My World&quot; to &quot;Missing You&quot; and &quot;Maureen,&quot; his last two sides before dying in a plane crash, it's all here. There's an entire disc dedicated to the (in)famous charted overdub recordings from 1966 and 1967, as well as two discs of demo recordings -- 59 tracks in all -- that make this set not only a definitive document, but a testament to a legacy of genius, both Reeves and Atkins. As per usual, there is a full-size book with an authoritative essay by Colin Escott, exhaustive discographical documentation, and pages upon pages of photographs. Only fanatics will want it, but if you are one, you will not be disappointed. ","torrent":{"xt":"urn:btih:d9e44d6366dbd91a04816d6cda71d2782b770fc1","amp;dn":"Jim+Reeves+-+Wel+My+World+-+1949-1964+-+Bear+Family+16CD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d9e44d6366dbd91a04816d6cda71d2782b770fc1","infoHashBuffer":{"type":"Buffer","data":[217,228,77,99,102,219,217,26,4,129,109,108,218,113,210,120,43,119,15,193]},"announce":[],"urlList":[]}}