{"title":"A Brief History of the Vikings by Jonathan Clements.epub","uid":8695658,"size":2499745,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:daaa436a0ed2a11aba01691cd29e2bc7655e6fda&amp;dn=A+Brief+History+of+the+Vikings+by+Jonathan+Clements.epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"dickspic","files":1,"time":1373971115,"description":"A Brief History of the Vikings\n\nBy Jonathan Clements\n\nPublished by Robinson Publishing in 2005\n\nTags: nonfiction, history\n\nEPUB, Retail, 320 pages, English (1845290763)\n\n'From the Fury of the Northmen deliver us, O Lord'. Between the eighth and eleventh centuries, the Vikings surged from their Scandinavian homeland to trade, raid and invade along the coasts of Europe. Their influence and expeditions extended from Newfoundland to Baghdad, their battles were as far-flung as Africa and the Arctic. But were they great seafarers or desperate outcasts, noble heathens or oafish pirates, the last pagans or the first of the modern Europeans? This concise study puts medieval chronicles, Norse sagas and Muslim accounts alongside more recent research into ritual magic, genetic profiling and climatology. It includes biographical sketches of some of the most famous Vikings, from Erik Bloodaxe to Saint Olaf, and King Canute to Leif the Lucky. It explains why the Danish king Harald Bluetooth lent his name to a twenty-first century wireless technology; which future saint laughed as she buried foreign ambassadors alive; why so many Icelandic settlers had Irish names; and, how the last Viking colony was destroyed by English raiders. Extending beyond the traditional 'Viking age' of most books, &quot;A Brief History of the Vikings&quot; places sudden Scandinavian population movement in a wider historical context. It presents a balanced appraisal of these infamous sea kings, explaining both their swift expansion and its supposed halt. Supposed because, ultimately, the Vikings didn't disappear: they turned into us.","torrent":{"xt":"urn:btih:daaa436a0ed2a11aba01691cd29e2bc7655e6fda","amp;dn":"A+Brief+History+of+the+Vikings+by+Jonathan+Clements.epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"daaa436a0ed2a11aba01691cd29e2bc7655e6fda","infoHashBuffer":{"type":"Buffer","data":[218,170,67,106,14,210,161,26,186,1,105,28,210,158,43,199,101,94,111,218]},"announce":[],"urlList":[]}}