{"title":"Entangled Minds- Extrasensory Experiences in a Quantum Reality[T","uid":7286916,"size":1653379,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dade907c8ae40417baa4b60bdb14a3f43c128dad&amp;dn=Entangled+Minds-+Extrasensory+Experiences+in+a+Quantum+Reality%5BT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"594mgnav","files":3,"time":1337613804,"description":"Entangled Minds- Extrasensory Experiences in a Quantum Reality[Team Nanban][TPB]\n\n English | ISBN: 1416516778 | 2006 | 368 pages | PDF | 1,6 MB\n\n DESCRIPTION:\n\n Can we sense what's happening to loved ones thousands of miles away? Why are we sometimes certain of a caller's identity the instant the phone rings? \n Do intuitive hunches contain information about future events? Is it possible to perceive without the use of the ordinary senses? \n\n Many people believe that such &quot;psychic phenomena&quot; are rare talents or divine gifts. Others don't believe they exist at all. \n But the latest scientific research shows that these phenomena are both real and widespread, and are an unavoidable consequence of the interconnected, \n entangled physical reality we live in. \n\n Albert Einstein called entanglement &quot;spooky action at a distance&quot; -- the way two objects remain connected through time and space, \n without communicating in any conventional way, long after their initial interaction has taken place. Could a similar entanglement of minds explain \n our apparent psychic abilities? Dean Radin, senior scientist at the Institute of Noetic Sciences, believes it might. \n\n In this illuminating book, Radin shows how we know that psychic phenomena such as telepathy, clairvoyance, and psychokinesis are real, based on \n scientific evidence from thousands of controlled lab tests. Radin surveys the origins of this research and explores, among many topics, \n the collective premonitions of 9/11. He reveals the physical reality behind our uncanny telepathic experiences and intuitive hunches, and \n he debunks the skeptical myths surrounding them. Entangled Minds sets the stage for a rational, scientific understanding of psychic experience.\n\n PLZ SEED WHILE AND AFTER DOWNLOADING...\n\n &quot;SHARING IS CARING&quot;","torrent":{"xt":"urn:btih:dade907c8ae40417baa4b60bdb14a3f43c128dad","amp;dn":"Entangled+Minds-+Extrasensory+Experiences+in+a+Quantum+Reality%5BT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dade907c8ae40417baa4b60bdb14a3f43c128dad","infoHashBuffer":{"type":"Buffer","data":[218,222,144,124,138,228,4,23,186,164,182,11,219,20,163,244,60,18,141,173]},"announce":[],"urlList":[]}}