{"title":"Daz3D - Poser - Lunar Science Station: Rim Corridor &amp; Access","uid":9599119,"size":5375955,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:db2ab4202a9d7adb60bf0f971f2f4642a86ad468&amp;dn=Daz3D+-+Poser+-+Lunar+Science+Station%3A+Rim+Corridor+%26amp%3B+Access&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KatSucks","files":2,"time":1392072597,"description":"Swiped from another site and reuploaded here.\n\nDescription: The Lunar Science Station is the premier research institute in the Solar System. At the LSS, scientists perform the many ground-breaking experiments needed to make space travel easier and safer.\n\nThe Access Bridges provide links between the station's main Rim Corridor and the various Research Towers. There is an airtight security door at each end of the Bridge to prevent unauthorized access to sensitive areas. The long windows also provide a breathtaking view of the station exterior and the surrounded lunar landscape.\n\nThe Access Bridge set comes with 8 different number and color combinations: one for each of the research towers. The bridges can be placed next to the Rim Corridor to provide a complete set. The set is designed to be lighted using pure indirect illumination, although separate lights can also be used. A scene with default render settings is included, as well as some default camera setups.\n\nThe Rim Corridor is one of the most traveled areas in the LSS. It provides easy access between the various research towers, as well as a scenic view of the surrounding Lunar landscape. Each corridor segment has two airtight vertically opening security doors that lead to the Access Bridges to the research towers, as well as another security door leading to the interior of the main base. The wall panels and ceiling lights provide useful information for scientists, including red alert notices.\n\nThe Rim Corridor set comes with 8 different number and color combinations: one for each research towers. The corridors can be placed next to each other to provide a complete set. The set is designed to be lighted using pure indirect illumination, although separate lights can also be used. A scene with default render settings is included, as well as 3 default dolly cameras and a starry background material. \n\nReference links: http://www.runtimedna.com/Lunar-Science-Station-Rim-Corridor.html\n &lt;a href=&quot;\nhttp://www.runtimedna.com/Lunar-Science-Station-Access-Bridge.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.runtimedna.com/Lunar-Science-Station-Access-Bridge.html&lt;/a&gt;\n\nHaving said that, I don't like the green in the Rim Corridor one.  Hope there's a way to change it.","torrent":{"xt":"urn:btih:db2ab4202a9d7adb60bf0f971f2f4642a86ad468","amp;dn":"Daz3D+-+Poser+-+Lunar+Science+Station%3A+Rim+Corridor+%26amp%3B+Access","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db2ab4202a9d7adb60bf0f971f2f4642a86ad468","infoHashBuffer":{"type":"Buffer","data":[219,42,180,32,42,157,122,219,96,191,15,151,31,47,70,66,168,106,212,104]},"announce":[],"urlList":[]}}