{"title":"The Sword and the Sorcerer (1982) XviD","uid":3642219,"size":734252592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:db514325fe5d86201145a8bd9194bd6d1e89f174&amp;dn=The+Sword+and+the+Sorcerer+%281982%29+XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"mike18xx","files":4,"time":1174284927,"description":" &lt;a href=&quot;http://upload.wikimedia.org/wikipedia/en/4/40/Sword_and_sorcerer.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://upload.wikimedia.org/wikipedia/en/4/40/Sword_and_sorcerer.jpg&lt;/a&gt;\n\n720-width xvid\n\nOne of several 80&amp;#039;s fantasy films that were produced during the peak of the Dungeons &amp; Dragons craze, The Sword and the Sorcerer had been billed as a major motion picture upon its release. Its success at the box office, however, was marginal, and it was ultimately forced into the shadow of much higher profile fantasy films, such as Conan the Barbarian. But it certainly didn&amp;#039;t stop me from enjoying this movie any less as a kid.\n\nThe tale begins as the tyrannical King Cromwell lands ashore of Tomb Island, in search of someone who can help him in his ongoing struggle to capture the prosperous kingdom of Eh-Dan. King Richard, the ruler of Eh-Dan, has successfully thwarted Cromwell&amp;#039;s every attempt at invading the kingdom, but the evil king isn&amp;#039;t about to give up.\n\nWith the aid of a hired witch, Cromwell manages to raise the long-dead sorcerer Xusia from his slumber. Skilled in the arts of black magic, the undead sorcerer might be Cromwell&amp;#039;s only hope of ever defeating King Richard.\n\nAfter making a deal with the sorcerer, Cromwell launches an all-out attack on his rival&amp;#039;s kingdom, easily laying waste to King Richard&amp;#039;s soldiers with the aid of Xusia&amp;#039;s powerful spells. With the battle all but won, Cromwell turns his attention to Xusia. Rather than taking the risk of the undead sorcerer betraying him, the evil king instead thrusts his dagger deep into Xusia&amp;#039;s torso, before sending him over a cliff to his death.\n\nMeanwhile, sensing the impending destruction of his kingdom, King Richard prepares to meet his rival in battle. Knowing that the encounter could very well mean his death, Richard entrusts his youngest son, Talon, with his legendary triple-bladed &quot;Sly Sword&quot;, with the sole condition that Talon avenge his death should the worst befall him on the battlefield.\n\nAfter a titanic struggle, Cromwell&amp;#039;s forces eventually win out, with the murder of Talon&amp;#039;s mother and father solidifying his victory. Realizing that the young whelp, Talon, has eluded his grasp, the king orders his soldiers to find him, but the sole surviving heir to the throne was nowhere to be found.\n\nEleven years later, a hulking young rogue would return to the place of his birth, to avenge the family he had lost so long ago.\n\nBut in a world of wicked kings and soldiers who rape and pillage, it is the sorcerer who is the most powerful of all.","torrent":{"xt":"urn:btih:db514325fe5d86201145a8bd9194bd6d1e89f174","amp;dn":"The+Sword+and+the+Sorcerer+%281982%29+XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db514325fe5d86201145a8bd9194bd6d1e89f174","infoHashBuffer":{"type":"Buffer","data":[219,81,67,37,254,93,134,32,17,69,168,189,145,148,189,109,30,137,241,116]},"announce":[],"urlList":[]}}