{"title":"[Dual PDF] A Manual for Creating Atheists, by Peter Boghossian","uid":9133700,"size":3590065,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:db6b2f43daf4e606e54907a0532c07aaded7d9d0&amp;dn=%5BDual+PDF%5D+A+Manual+for+Creating+Atheists%2C+by+Peter+Boghossian&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"halofubar","files":5,"time":1383372871,"description":"This is the Dual PDF release, in resolutions 525x640 (small) and 744x1022 (large), based on the original Kindle 6&quot; for smaller screens and the Kindle DX for larger screens (or PCs); choose whichever looks best on your digital device. The original release is MOBI and EPUB -- the link can be found at http://www.halofubar.com/#torrents.\n\n&quot;For thousands of years, the faithful have honed proselytizing strategies and talked people into believing the truth of one holy book or another. Indeed, the faithful often view converting others as an obligation of their faith--and are trained from an early age to spread their unique brand of religion. The result is a world broken in large part by unquestioned faith. As an urgently needed counter to this tried-and-true tradition of religious evangelism, A Manual for Creating Atheists offers the first-ever guide not for talking people into faith--but for talking them out of it. Peter Boghossian draws on the tools he has developed and used for more than twenty years as a philosopher and educator to teach how to engage the faithful in conversations that will help them value reason and rationality, cast doubt on their religious beliefs, mistrust their faith, abandon superstition and irrationality, and ultimately embrace reason.&quot;\n\nEnjoy! +*halofubar*+","torrent":{"xt":"urn:btih:db6b2f43daf4e606e54907a0532c07aaded7d9d0","amp;dn":"%5BDual+PDF%5D+A+Manual+for+Creating+Atheists%2C+by+Peter+Boghossian","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db6b2f43daf4e606e54907a0532c07aaded7d9d0","infoHashBuffer":{"type":"Buffer","data":[219,107,47,67,218,244,230,6,229,73,7,160,83,44,7,170,222,215,217,208]},"announce":[],"urlList":[]}}