{"title":"GTA 5 Special Edition DLC","uid":8980351,"size":396273,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:dbfc196ca90c22ff6d432c8a4655a7493a7a9240&amp;dn=GTA+5+Special+Edition+DLC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"stretch25","files":1,"time":1380549767,"description":"Features:\n ATOMIC BLIMP\n --With access to this iconic feature of the Los Santos skyline, players can take control of the most leisurely aircraft in the Los Santos skies.\n\n ADDITIONAL WEAPONS\n --Regardless of which version you've chosen, your local Ammu-Nation will always be stocked with a pair of special firearms\n at no additional cost that also have their own unique customization options, skins and attachments - the .50 Caliber Pistol and the Bullpup Shotgun.\n --You'll also have access to the Hammer, which acts as a brutal melee weapon.\n\n SPECIAL ABILITY BOOST\n\n --Michael, Franklin and Trevor each have their own unique Special Ability, which can be activated once each of them fills up the Special Ability bar based on various actions.\n --Michael is an expert marksman, Franklin is a skilled driver with sharp reflexes, Trevor is a sociopath with a short fuse and rage.\n --With the boost, the Special Ability bar will generate 25% faster.\n\nSTUNT PLANE TRIALS\n --Take in Los Santos and Blaine County at breakneck speeds in the Stunt Plane Trials.\n --In five thrilling and unique challenges, you can zip through mountains, deserts, oceans, and cities as you navigate through a maze of checkpoints- Completing each Trial will improve the piloting skill of your character.\n\nBONUS OUTFITS, TATTOOS AND MORE\n --Michael, Franklin and Trevor will receive a special 20% discount in shops, along with access to special items either in their personal wardrobes or from stores.\n --Each character will receive 1 outfit each, one additional article of clothing (shirt, hoodie and jacket) each and a tattoo. \n\n\nRead more: http://www.mateogodlike.com/2013/09/ps3-grand-theft-auto-v-special-edition.html#ixzz2gNPBUM7j","torrent":{"xt":"urn:btih:dbfc196ca90c22ff6d432c8a4655a7493a7a9240","amp;dn":"GTA+5+Special+Edition+DLC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbfc196ca90c22ff6d432c8a4655a7493a7a9240","infoHashBuffer":{"type":"Buffer","data":[219,252,25,108,169,12,34,255,109,67,44,138,70,85,167,73,58,122,146,64]},"announce":[],"urlList":[]}}