{"title":"Mastering Wireless Penetration Testing for Highly-Secured Enviro","uid":12585308,"size":34182163,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dc25c11f148d9da493add1f46115c13cadbe2406&amp;dn=Mastering+Wireless+Penetration+Testing+for+Highly-Secured+Enviro&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GoonerTPB","files":2,"time":1445006074,"description":"Publisher: Packt Publishing - ebooks Account (January 23, 2015)\r\nLanguage: English\r\nISBN-10: 1782163182\r\nISBN-13: 978-1782163183\r\n\r\nScan, exploit, and crack wireless networks by using the most advanced techniques from security professionals\r\n\r\nAbout This Book\r\nConduct a full wireless penetration test and implement defensive techniques that can be used to protect wireless systems\r\nCrack WEP, WPA, and even WPA2 wireless networks\r\nA hands-on guide teaching how to expose wireless security threats through the eyes of an attacker\r\n\r\nWho This Book Is For\r\n\r\nThis book is intended for security professionals who want to enhance their wireless penetration testing skills and knowledge. Since this book covers advanced techniques, you will need some previous experience in computer security and networking.\r\n\r\nWhat You Will Learn\r\n\r\nLearn the wireless penetration testing methodology\r\nCrack WEP, WPA, and WPA2 encrypted networks\r\nScan and sniff wireless networks for rogue access points and logins\r\nIdentify and detect vulnerable hosts\r\nRun vulnerability scans and exploit systems\r\nLearn to protect yourself from the latest wireless security threats\r\nPivot between networks and systems to access other hosts and networks\r\n\r\nIn Detail\r\n\r\nPenetration testing is a tool for testing computer systems, networks, or web applications to find vulnerabilities that an attacker could exploit. By performing a penetration test, you can proactively identify which vulnerabilities are most critical. This allows your organization to more intelligently prioritize remediation and apply necessary security patches to ensure that they are available.\r\n\r\nThis book covers how to set up Kali Linux, scan and sniff wireless networks, and crack WEP, WPA, and even WPA2 encryption. By the end of this book, you will feel much more confident when it comes to conducting wireless penetration tests, and you will have a full understanding of wireless security threats.\r\n\r\nThis book is full of hands-on demonstrations and how-to tutorials. This will benefit you, as the reader, when it comes to security awareness. Having some knowledge of wireless penetration testing would be helpful","torrent":{"xt":"urn:btih:dc25c11f148d9da493add1f46115c13cadbe2406","amp;dn":"Mastering+Wireless+Penetration+Testing+for+Highly-Secured+Enviro","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc25c11f148d9da493add1f46115c13cadbe2406","infoHashBuffer":{"type":"Buffer","data":[220,37,193,31,20,141,157,164,147,173,209,244,97,21,193,60,173,190,36,6]},"announce":[],"urlList":[]}}