{"title":"Three Dog Night - Complete Hit Singles","uid":4875418,"size":108617727,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dc3fc229832e3896888d24d57e64090561933c62&amp;dn=Three+Dog+Night+-+Complete+Hit+Singles&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"chika73","files":41,"time":1241102546,"description":"Three Dog Night ran off a string of 21 Top 40 hits between 1968 and 1975, including three number ones: &quot;Joy to the World,&quot; &quot;Mama Told Me (Not to Come),&quot; and &quot;Black &amp; White.&quot; Despite this, they are often written off as a lightweight band who couldn't write their own songs. Granted they were laid-back and very easygoing, but they had some heft. The vocals of Chuck Negron, Danny Hutton, and Cory Wells were surprisingly soulful and the band that backed them was solid, and even rocked pretty hard on occasion. They didn't write songs -- it is true -- but their genius was picking songs. Along with producer Richard Podolor, the group found songs by writers like Randy Newman, Harry Nilsson, Laura Nyro, Hoyt Axton, Paul Williams, and John Hiatt and turned them into hits.\n\nSo the group had laudable credentials, but more importantly, the songs collected here play like the soundtrack to the '70s. If you were just a casual fan, listening to Complete Hit Singles provides moment after moment of &quot;I didn't remember these guys did that song!&quot; exclamations. The hits just keep coming one after the other: &quot;Joy to the World,&quot; &quot;Celebrate,&quot; &quot;Shambala,&quot; &quot;Liar,&quot; &quot;An Old Fashioned Love Song,&quot; and &quot;Let Me Serenade You.&quot; Never sappy, never overbearing, always settled into a low-key, hooky groove, these songs are about as good as early-'70s pop gets.\n\n~ AMG All Music Guide","torrent":{"xt":"urn:btih:dc3fc229832e3896888d24d57e64090561933c62","amp;dn":"Three+Dog+Night+-+Complete+Hit+Singles","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc3fc229832e3896888d24d57e64090561933c62","infoHashBuffer":{"type":"Buffer","data":[220,63,194,41,131,46,56,150,136,141,36,213,126,100,9,5,97,147,60,98]},"announce":[],"urlList":[]}}