{"title":"Rascal Flatts - [2014] Rewind (FLAC)","uid":10392195,"size":374984196,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:dc6e94248ea2b261be90527805159a01a731ae7e&amp;dn=Rascal+Flatts+-+%5B2014%5D+Rewind+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"homelighter","files":-1,"time":1403206650,"description":"Rascal Flatts - Rewind (FLAC)\n\nRelease Date: May 13, 2014\nExact Audio Copy &gt; Flac\n\n\nReview by Stephen Thomas Erlewine:\nThe title Rewind suggests Rascal Flatts are ready to turn back the clock, perhaps to the start of their career or something even earlier, but the first song on this 2014 album drops an allusion to Instagram, so the trio is hardly unaware of the digital age. Throughout Rewind, Rascal Flatts reference other wonders of the modern age while also taking pains to position themselves as part of a lineage -- the title track casually mentions George Strait as a common thread between alienated lovers -- but there's never any indication that this Ohio band considers the past as more worthy than the present. This embrace of the now is one of the hallmarks of Rascal Flatts, a group that thoroughly inhabits the new suburban country, a country that resides not in the sticks but on the outskirts of a major urban center, the place where big box stores stretch as far as the eye can see. To that end, the trio brings in Howard Benson -- a producer better known for active rockers like 3 Doors Down, Saliva, Hoobastank, and DAUGHTRY who has also often worked with Kelly Clarkson -- to give Rewind a stainless gleam suited for the suburbs and this makes Rewind far livelier than any of its immediate predecessors, which by and large favored the softer, slower side of the trio. Certainly, that sweetness is evident on Rewind -- not so coincidentally, it surfaces strongly on the title track and the syrupy &quot;I Have Never Been to Memphis&quot; -- but the record thrives on its brighter moments, the times where it adopts either the sound or sentiment of &quot;DJ Tonight,&quot; &quot;Powerful Stuff,&quot; and &quot;I Like the Sound of That,&quot; songs that consciously weave modern catch phrases into friendly, hooky songs designed to be heard everywhere a radio could be played. Occasionally, there are hints that Rascal Flatts are getting a little bit old to be pandering for big hits -- Gary LeVox does not easily drop references to phone apps -- but when the music is as carefully constructed as &quot;I'm on Fire,&quot; a song that expertly fuses their arena-rock stomp and their waiting-room sentimentality, it's hard not to succumb to Rascal Flatts' smooth touch.\n\n\nTracks:\n1. Payback\n2. Rewind\n3. I Have Never Been to Memphis\n4. DJ Tonight\n5. Powerful Stuff\n6. Riot\n7. Night of Our Lives\n8. I Like the Sound of That\n9. Aftermath\n10. I'm on Fire\n11. Life's a Song\n12. Honeysuckle Lazy\n13. The Mechanic\n\n","torrent":{"xt":"urn:btih:dc6e94248ea2b261be90527805159a01a731ae7e","amp;dn":"Rascal+Flatts+-+%5B2014%5D+Rewind+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dc6e94248ea2b261be90527805159a01a731ae7e","infoHashBuffer":{"type":"Buffer","data":[220,110,148,36,142,162,178,97,190,144,82,120,5,21,154,1,167,49,174,126]},"announce":[],"urlList":[]}}