{"title":"BBC Later with Jools Holland S48E07 1080i HDTV h264-NX","uid":14788744,"size":3377004520,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:dcf7f09d8fac1ff6ce7125897450f027c12798be&amp;dn=BBC+Later+with+Jools+Holland+S48E07+1080i+HDTV+h264-NX&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"BasilBrush","files":1,"time":1465042419,"description":"BBC Later with Jools Holland S48E07 1080i HDTV h264-NX.ts\r\n\r\nBroadcast date: 4th June 2016\r\n\r\nJoining Jools in the last studio session of the series are Kevin Parker's Tame Impala, who won Best International Group at this year's Brit Awards for 2015 album Currents, which continues to celebrate Parker's melodic and psychedelic gifts while channelling the 'Bee Gees on mushrooms' and Supertramp. Incredibly, Tame Impala first appeared on Later in November 2012 alongside Biffy Clyro! The Scottish trio also have a date with destiny in the shape of the Later studio and return at their melodic and piledriving best with tunes from their seventh album Ellipsis, which has all the melody, power and musical complexity that we've come to expect, as showcased on lead track Wolves of Winter.\r\n\r\nAlso returning to the studio is singer-songwriter Michael Kiwanuka who previews the big soul sound of his second album Love and Hate, which successfully expands the blueprint of his solo music which helped make him the BBC Sound of 2012. And introducing the punk-jazz of Brooklyn-based trio Moon Hooch, who peddle horns, drums and party in their unique and noisy blend of what they like to call cave music as featured on forthcoming album Red Sky. As their press release claims, 'it's like house but it's more wild, more jagged, more free, more natural to live in.'\r\n\r\nJames Blake returns to the show fresh from collaborating with Beyonce on her Lemonade album with songs from his third album The Colour of Anything, which features a cover by Quentin Blake (no relation) and which builds on Blake's hushed fusion of balladry and dubstep, continuing his mission to 'subdue a generation' as he joked to the Guardian recently. And introducing singer-songwriter Lera Lynn, whose latest album Resistor is a noirish blend of late-night atmospherics, tough rock 'n' roll and sparse poetry.\r\n\r\nTechnical Spec\r\nVideo Codec: h264 CABAC   \r\nVideo Bitrate: 6262Kbps (Q~21)\r\nVideo Resolution: 1920x1080\r\nVideo Aspect Ratio: 16:9\r\nFrames Rate: 50i/MBAFF\r\nAudio Codec: AC3\r\nAudio Bitrate: 384Kbps CBR 48KHz\r\nAudio Channels: 6\r\nRun-Time: 64 mins\r\nNumber Of Parts: 1\r\nPart Size: 3.14 GB\r\nSource: HDTV\r\nSubtitles: Merged","torrent":{"xt":"urn:btih:dcf7f09d8fac1ff6ce7125897450f027c12798be","amp;dn":"BBC+Later+with+Jools+Holland+S48E07+1080i+HDTV+h264-NX","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcf7f09d8fac1ff6ce7125897450f027c12798be","infoHashBuffer":{"type":"Buffer","data":[220,247,240,157,143,172,31,246,206,113,37,137,116,80,240,39,193,39,152,190]},"announce":[],"urlList":[]}}