{"title":"Game Center CX - Near Perfect Complete English Collection 2015","uid":12890999,"size":131484054959,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:dd01887289a1832d7195421042e1034c002fc5f4&amp;dn=Game+Center+CX+-+Near+Perfect+Complete+English+Collection+2015+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":4,"uploader":"PiebaldX","files":316,"time":1449119115,"description":"GAME CENTER CX: NEAR PERFECT COMPLETE ENGLISH COLLECTION\r\nDecember 2nd, 2015 Edition\r\n\r\nHey! I still love Game Center CX. I decided to wait two years for more episodes to release so I could make a more substantial &quot;update&quot; to the torrent. \r\n\r\nAs it was last time, this torrent contains *all* GCX material (to my knowledge) on the internet that has been subbed in English.\r\n\r\nI have once again left out the DVD episodes. Please enjoy this torrent, watch the show, and buy the DVD to support GCX and see what you're missing!\r\n\r\nThanks!\r\nRasalom\r\n\r\nThe below info is from the first release, but is still relevant.\r\n\r\n===\r\nGAME CENTER CX: NEAR PERFECT COMPLETE ENGLISH COLLECTION\r\nDecember 5th, 2013 Edition\r\n===\r\n\r\nHello!\r\n\r\nThis torrent comprises &gt;what I believe&lt; to be the most current and complete collection of Game Center CX videos released on the internet by English fan subbing groups as of December 5th, 2013.\r\n\r\nI decided to put this collection together to demonstrate my love for the series, and to help as many people as possible get in touch with GCCX without having to struggle to find the episodes. Currently, it can be a real pain to track down all the episodes in decent quality (it has taken me a year to gather all this material). I hope this collection sets a new standard in getting the show out to the people and the confusion of the past few years can be left behind!\r\n\r\n---\r\n\r\nWhat is Game Center CX (GCCX)?\r\n\r\nGCCX is a live-action, unscripted video game show that revolves around the trials and tribulations of our host, middle-aged Japanese comedian Chief Arino, as he marathon plays through some of the most difficult and challenging video games on consoles ranging the NES, Super Nintendo, Playstation, and everything in-between. Arino's goal is to simply beat the game challenge of the day and become a champion, or go home an abject failure... Oftentimes, he's a little bit of both!\r\n\r\nHowever, GCCX isn't just a gaming show. It has a wide appeal and will entertain all, whether you're a hardcore gamer or the type of person that mispronounces Mario's name. Side-splitting humor, intense gaming, triumphant comebacks, memorable miracle moments and detailed peeks into the whole other world that is Japanese gaming are just a few of the highlights GCCX has to offer as Arino struggles through multiple games spanning many consoles and genres. Truly, this is a magnificent comedygamingplain ole' human show, and you now have hours of material to pore through waiting at your fingertips. \r\n\r\nTo put it in the purest terms: GCCX is one of those TV shows that you need in your life. I guarantee you will come to love GCCX for probably the rest of your life. Yeah, it's THAT good.\r\n\r\n---\r\n\r\nWHAT'S IN THE TORRENT?:\r\nAll current English translated episodes of GCCX, seasons 1-19 in their best available quality, including all currently translated specials, live events, advertisements, Nintendo Channel episodes, extra Arino appearances on Japanese TV, and much more.\r\n\r\nAll of this is neatly organized and arranged for ease of viewing. In interest of presenting all available subbed material, there are some episodes that overlap content from other episodes where sub groups have gone above and beyond and translated episodes beyond previous subbed releases. I have named these episodes to lessen confusion as &quot;Full Coverage.&quot;\r\n\r\nI have also included an episode guide that was last current in August 2013 (It now has a link to the latest episode guide!). I used it as a guide for tracking down the truly obscure bits of Arino-nalia out there. I also followed the naming scheme for the specialslive events and other material presented there, as well, to avoid confusion. Hopefully my efforts are good enough!\r\n\r\nIt's safe to say not many people have a collection of GCCX this complete, but sharing this show and getting the word out is more important than claiming to be a master collector.\r\n\r\n---\r\n\r\nWHAT ISN'T IN THE TORRENT? (AND WHY...):\r\nIn the interests of promoting the series without detracting from its Retro Game Master US DVD sales, I have not included the Hi-Def English subbed episodes contained on said US DVD. \r\n\r\nFor now, you'll have to endure the Kotaku dubbed releases. However, if you want to find the original Japanese audio episodes, and you like the show and want to support more high-quality, official subbed episodes being released in the future, please look up the Retro Game Master DVD at Amazonand similar sellers. \r\n\r\nBy buying this relatively cheap DVD boxset (buy it from 1st party sellers, not from used sellers!), not only will you help GCCX out, you'll show that we want more Game Center CX material officially translated and presented in Hi-Def quality. Also, you'll get a previously unsubbed episode: Shiren the Wanderer. It's a great episode and you're missing out if you don't have it! The DVD is the only place to see it while also helping out our favorite beleaguered gamer, Chief Arino!\r\n\r\n---\r\n\r\nThat should be all. If I am missing something, please let me know in the comments and I'll update my release. I may periodically update this pack with new files if the demand is there (And I did, in 2015!).\r\n\r\n---\r\n\r\nSpecial thanks to: SomethingAwful for subbing most of the episodes and working hard to spread the word; TV-Nihon for their efforts; Last Continue GCCX for their subbing; Kotaku for bridging the gap between shores; To anyone who subbed anything Game Center CX, ever; MaskedTai for organizing and creating torrents of the main folders before I refined them, you saved me a ton of work; To anyone who downloads and enjoys the show; To those who buy the Retro Game Master DVD and supports the show; Most importantly, to Kacho Arino and all of the Game Center CX staff. Thank you for all your years of hard work and good luck on your future endeavors!! \r\n\r\nGanbare, Arino Kachō!\r\n\r\nEnjoy!","torrent":{"xt":"urn:btih:dd01887289a1832d7195421042e1034c002fc5f4","amp;dn":"Game+Center+CX+-+Near+Perfect+Complete+English+Collection+2015+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd01887289a1832d7195421042e1034c002fc5f4","infoHashBuffer":{"type":"Buffer","data":[221,1,136,114,137,161,131,45,113,149,66,16,66,225,3,76,0,47,197,244]},"announce":[],"urlList":[]}}