{"title":"Trust.Me.Im.Dr..Ozzy.Advice.from.Rocks.Ultimate.Survivor.Audiobo","uid":10518921,"size":381939326,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:dddbcfe03da40ff5c26bfbb7238b0950f98d5f70&amp;dn=Trust.Me.Im.Dr..Ozzy.Advice.from.Rocks.Ultimate.Survivor.Audiobo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"wildturkey00","files":2,"time":1404944304,"description":"Format: AudioBook\nGenre: Autobiography\nPublished: 2011\nUnabridged edition 2011 | 6 hours and 38 mins | ISBN: 1611138787, ASIN: B005SYNJ4M | MP3 80 kbps | 231 MB\n\nTHIS IS A DRM FREE FILE! so it will work on players that will not allow the use of DRM protected files. ENJOY!\nBook Description: Wondering if science could explain how he survived his 40-year avalanche of drugs and alcohol, Ozzy Osbourne became one of a handful of people in the world to have his entire DNA mapped in 2010. It was a highly complex, $65,000 process, but the results were conclusive: Ozzy is a genetic anomaly. The &quot;Full Ozzy Genome&quot; contained variants that scientists had never before encountered and the findings were presented at the prestigious TEDMED Conference in San Diego-making headlines around the world. The procedure was in part sponsored by The Sunday Times of London, which had already caused an international fururoe by appointing Ozzy Osbourne its star health advice columnist. The newpaper argued that Ozzy's mutliple near-death experiences, 40-year history of drug abuse, and extreme hypocondria qualified him more than any other for the job. The column was an overnight hit, being quickly picked up by Rolling Stone to give it a global audience of millions. In TRUST ME, I'M DR. OZZY, Ozzy answers reader's questions with his outrageous wit and surprising wisdom, digging deep into his past to tell the memoir-style survival stories never published before-and offer guidance that no sane human being should follow. Part humor, part memoir, and part bad advice, TRUST ME, I'M DR. OZZY will include some of the best material from his published columns, answers to celebrities' medical questions, charts, sidebars, and more.","torrent":{"xt":"urn:btih:dddbcfe03da40ff5c26bfbb7238b0950f98d5f70","amp;dn":"Trust.Me.Im.Dr..Ozzy.Advice.from.Rocks.Ultimate.Survivor.Audiobo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dddbcfe03da40ff5c26bfbb7238b0950f98d5f70","infoHashBuffer":{"type":"Buffer","data":[221,219,207,224,61,164,15,245,194,107,251,183,35,139,9,80,249,141,95,112]},"announce":[],"urlList":[]}}