{"title":"There Was No Jesus, There Is No God - Raphael Lataster (pdf, ep","uid":10928014,"size":1864252,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:de8d17b433b3543b30dfe5744d5bfd504cf0392a&amp;dn=+There+Was+No+Jesus%2C+There+Is+No+God+-+Raphael+Lataster+%28pdf%2C+ep&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"AreciboMessage","files":2,"time":1409383495,"description":"In this unique book, sceptical Religious Studies scholar, Raphael Lataster, seeks to merge the accessibility of popular atheistic writings, with the rigorous scholarly research normally limited to academic journals and monographs. Avoiding the seemingly endless debates on the social impacts of religion, There Was No Jesus, There Is No God is only concerned with the evidence. The base content of this fully referenced tome of free-thought has been peer-reviewed by leading scholars in the fields of History, Philosophy, Biblical Studies and Studies in Religion.\n\nPart 1 reveals the spurious nature of the sources used to establish the truth of Christianity and the existence of Jesus, and the equally spurious methods employed by many Biblical scholars. A brief interlude then leaves no doubt that the existence of the Christ of Faith is virtually impossible, and concludes that even the existence of a stripped-down Historical Jesus is uncertain. Bayesian reasoning is shown to justify sceptical views on many topics, including the existence of God.\n\nPart 2 shifts the focus to the God of classical theism and monotheism, examining the evidence and arguments from scientific, historical, and philosophical perspectives. The inadequacy of the case for God is found to easily justify non-belief (atheism). Furthermore, considerations of alternative gods and conceptions of God, lead to game-changing concerns for Christians, Muslims and Jews.","torrent":{"xt":"urn:btih:de8d17b433b3543b30dfe5744d5bfd504cf0392a","amp;dn":"+There+Was+No+Jesus%2C+There+Is+No+God+-+Raphael+Lataster+%28pdf%2C+ep","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de8d17b433b3543b30dfe5744d5bfd504cf0392a","infoHashBuffer":{"type":"Buffer","data":[222,141,23,180,51,179,84,59,48,223,229,116,77,91,253,80,76,240,57,42]},"announce":[],"urlList":[]}}