{"title":"Suzie Superstar #1 (1983) - Classic Porn XXX","uid":9625201,"size":1435881089,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dea6709f6086868c101a09a4e415ce964ef37b47&amp;dn=Suzie+Superstar+%231+%281983%29+-+Classic+Porn+XXX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"KidAtomic","files":-1,"time":1392579868,"description":"Suzie Superstar 1 (1983)\n\nCOVERS AND SCREENS FOUND HERE: &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&lt;/a&gt;\n\nShauna Grant's tragically short career was marked by several legendary films, most notably Suzie Superstar in which she plays a sexy rock singer at the top of the charts. Her overbearing manager played by John Leslie sparks an adventure filled with sex, betrayal, money, and love.\n\nWith incredible appearances by Ron Jeremy, Joey Silvera, and Sharon Mitchell, Suzie Superstar remains one of the greatest classic features of all time, not just for its superior filmmaking and gorgeous sex scenes, but also for its story, acting, and je ne sais quoi. This is classic XXX at its very best.\n\n    Scene 1. Gail Sterling, Laurie Smith, Ron Jeremy\n    Scene 2. Gail Sterling, Laurie Smith, Jon Martin\n    Scene 3. Shauna Grant, John Leslie\n    Scene 4. Shauna Grant, Joey Silvera\n    Scene 5. Laura Lazare, John Leslie\n    Scene 6. Shauna Grant, Ron Jeremy\n    Scene 7. Laura Lazare, John Leslie\n    Scene 8. Sharon Mitchell, John Leslie\n\nLength 1 hrs. 26 mins.\nRating XXX\nReleased on dvd Sep 25 2008\nStudio  Cal Vista\n\nActresses:\n    Gail Sterling (as Gayle Sterling)\n    Laura Lazare (as Laura Lazarre) [Facial]\n    Shauna Grant (as Shana Grant)\n    Sharon Mitchell\n    Laurie Smith (as Stephanie Taylor) [Facial]\n    NonSex Performers\n    Mai Lin\n    Tara Aire\n    Tigr\n\nActors:\n    Joey Silvera\n    John Leslie\n    Jon Martin\n    Ron Jeremy\n    NonSex Performers\n    Aaron Stuart\n    Jean Clark\n    Jeff Lyle\n    Ken Scudder\n    Ross Roberts\n\nWinner of 4 Erotica Awards! Hustler's Highest rating!!! Adam Film World's Best Picture of the Year are the raves on the front DVD sleeve of VCX's re-release of Robert Mc Callum's SUZIE SUPERSTAR, (1984, Cal Vista) part of VCX's Cal Vista Classic DVD series. This standard frame presentation looks great and the sound is fine.\n\nRobert McCallum directed close to 150 titles in the 1970s, 80s and 90s but more than 2/3 of these productions are from after 1985, when many xxx features switched from film to video. So, this DVD re-release should please the many who enjoyed Mc Callum's film work.\n\nThe prolific Mc Callum receives both director and cinematographer credit for SUZIE SUPERSTAR and it's a solid all-around film production that follows the exploits (and sexploits) of a fictional rock band and their lead singer, Suzie (the slender and beautiful Shauna Grant) as they unhatch a plot to get rid of their manager, Z. W. (John Leslie) who has them under a long term contract.\n\nSUZIE SUPERSTAR opens with Suzie and band performing on stage while Z. W. drives around with a couple of groupies (strawberry blonde Gail Sterling and dark haired Laurie Smith) in the backseat. He ditches the groupies and leaves them with his driver/tough guy, Raoul (Ron Jeremy) who manages to get these gals to fuck him in the back seat.\n\nGAIL STERLING &amp; LAURIE SMITH &amp; RON JEREMY---a dark, but fun back-seat sex romp---!!!\n\nFinisihed fucking Raoul, the groupies get inside the theater after the show and hook up with guitarist Bobby (Jon Martin) on the empty stage among the band's instruments. Meanwhile, Suzie bitches at boyfriend Z. W. then fucks him anyway as two sex scenes are intercut together.\n\nGAIL STERLING &amp; LAURIE SMITH &amp; JON MARTIN---a solid threeway---!!!\n\nSHAUNA GRANT &amp; JOHN LESLIE---A fine scene with John and Shauna in a variety of straight sex positions that ends with mishfucking on the corner of a bed and a pop shot onto her tummy. Shauna's arched-back moments are incredible---!!!!\n\nA combined rating of !!! 1/2 for the combo scene.\n\nPissed at Z. W., Suzie seeks refuge in the weight room, where Rick (Joey Silvera) puts down his wieghts, picks up a guitar and sings Suzie a song. She joins in, sings some lyrics; they kiss then Suzie disrobes.\n\nSHAUNA GRANT &amp; JOEY SILVERA--- A short but solid mish-fucking with Shauna looking incredible flat on her back upon the red carpeting of the weight room---!!! 1/2\n\nAn ex-mob guy sends his beautiful daughter, Priscilla (leggy and lovely Laura Lazare) to negotiate a deal with Z. W. that would land the band a private party gig. Z. W. finds a way to negotiate a good deal that includes fucking Prisciilla while Suzie pokes around the premises.\n\nLAURA lAZARE &amp; JOHN LESLIE---A wonderful sex scene that takes place beside a wild fireplace with roaring fire. Lots of blow action, mish fucking, cowgirl and a facial. Laura looks stunning---!!!! 1/2\n\nSuzie needs a phone number and gives Raoul a blowjob so that she can get it.\n\nSHAUNA GRANT &amp; RON JEREMY---Shauna looks great as she sucks then takes a load on her beautiful breasts---!!!\n\nSuzie buddies up with the old mob guy and attends his party with strippers (Asian Mai Linn is in that number) then arranges things so that the mob guy catches his daughter Priscilla with Z. W. Suzie and the gang get out of their contract thanks to some old stong-arm tactics from the mob guy.\n\nZ. W. scouts for fresh talent and catches a performance by country singer Opan Kincaid (Sharon Mitchell) who likes what Z. W. has to offer her career then lands in the shower with her new manager.\n\nSHARON MITCHELL &amp; JOHN LESLIE---A solid, well-shot, sex scene inside a step-in shower with water flowing---!!! 1/2\n\nSUZIE SUPERSTAR ends the way it begins with some sort of &quot;fantasy' song that may or may not be lip-synched in a performance resembling those videos from the early days of M-TV, when the cable station actually played music videos around the clock.\n\nThe plot for SUZIE SUPERSTAR gets sillier as it moves along so the wonderful xxx performances of Shauna Grant and Laura Lazare that are crammed into the middle of Mc Callum's film are the main reasons to check out this DVD re-release.\n\nOther irritants are Z. W.'s stupid golf outfits, dialog about golf that no one understands, his putting in his office.\n\nThe last 30 minutes of SUZIE SUPERSTAR is rather sparse interms of xxx action, so kudos to Mc Callum for putting so much effort into the shower scene so that SUZIE SUPERSTAR ends with a bang.\n\nFinal rating for SUZIE SUPERSTAR (1984, Cal Vista; 2008, VCX-Cal Vista Classic re-release) is !!! 1/2 outa !!!!! It's a far cry from Mc Callum's best work, something like V-The Hot One (!!!!! outa !!!!!) that blended xxx sex and story\nin a fascinating way. \n\nCOVERS AND SCREENS FOUND HERE: &lt;a href=&quot;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/Thread-High-Quality-Interracial-Ebony-Porn-XXX?page=3&lt;/a&gt;","torrent":{"xt":"urn:btih:dea6709f6086868c101a09a4e415ce964ef37b47","amp;dn":"Suzie+Superstar+%231+%281983%29+-+Classic+Porn+XXX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dea6709f6086868c101a09a4e415ce964ef37b47","infoHashBuffer":{"type":"Buffer","data":[222,166,112,159,96,134,134,140,16,26,9,164,228,21,206,150,78,243,123,71]},"announce":[],"urlList":[]}}