{"title":"The Enigma of Capital and the Crises of Capitalism (epub, pdf, m","uid":6792562,"size":3987021,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:def1d967e017df2c9ddac559369128216eae0671&amp;dn=The+Enigma+of+Capital+and+the+Crises+of+Capitalism+%28epub%2C+pdf%2C+m&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"acosmic","files":-1,"time":1320279798,"description":"The Enigma of Capital and the Crises of Capitalism\nby David Harvey\n(pdf, epub, mobi)\n\nTaking a long view of the current economic crisis, eminent academic David Harvey explains how capitalism came to dominate the world and why it resulted in the current financial crisis. For three centuries, the capitalist system has shaped western society, informed its rulers, and conditioned the lives of its people. Using his unrivalled knowledge of the subject, Harvey lays bare the follies of the international financial system, looking closely at the nature of capitalism, how it works and why sometimes it doesn't. He examines the vast flows of money that surge round the world in daily volumes well in excess of the sum of all its economies. He looks at the cycles of boom and bust in the world's housing and stock markets and shows that periodic episodes of meltdown are not only inevitable in the capitalist system but essential to its survival. The essence of capitalism is its amorality and lawlessness and to talk of a regulated, ethical capitalism is to make an error of reasoning of the most fundamental kind. &quot;The Enigma of Capital&quot; considers how crises of the current sort can best be contained within the constraints of capitalism, and makes the case for a social order that would allow us to live within a system that really could be responsible, just, and humane.","torrent":{"xt":"urn:btih:def1d967e017df2c9ddac559369128216eae0671","amp;dn":"The+Enigma+of+Capital+and+the+Crises+of+Capitalism+%28epub%2C+pdf%2C+m","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"def1d967e017df2c9ddac559369128216eae0671","infoHashBuffer":{"type":"Buffer","data":[222,241,217,103,224,23,223,44,157,218,197,89,54,145,40,33,110,174,6,113]},"announce":[],"urlList":[]}}