{"title":"dvd decrypter","uid":4328839,"size":1012313,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:df1bbe1be1193ec52df877b0ac8a43c61c1c10f4&amp;dn=dvd+decrypter&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"romelanda","files":5,"time":1217933662,"description":"DVD Decrypter is a software application that can create backup disc images of the DVD-Video structure of DVDs. It can be used to image any DVD, but controversially it is especially useful for decrypting copy-protected movies. The program can also burn images to disc. CSS decrypting software (such as DVD Decrypter, AnyDVD, Smartripper, and DVD Shrink) allows a region-specific DVD to be copied as an all-region DVD. It also removes Macrovision, Content Scrambling System (CSS), region codes, and user operation prohibition.\n\n\n[edit] Legality\nAs DVD Decrypter facilitates the removal of copy restrictions, certain uses may be illegal under the United States Digital Millennium Copyright Act. In countries without similar laws there may not be any legal restrictions.\n\nOn June 6, 2005, the developer (known as &quot;Lightning UK!&quot;) announced [1] via the CD Freaks[2] website that he received a cease and desist letter from Macrovision[3]. He later stated it was within his best interests to comply with the letter, and stopped development of the program. By June 7, 2005 a mirror site was up [4], which allowed people to download the final version (3.5.4.0). On 27 November 2005, Afterdawn.com, a Finnish website, announced that it complied with a letter received from Macrovision demanding that DVD Decrypter be taken down from its site. Shortly after, a site with no connection to Lightning UK! appeared and claimed to be the &quot;new&quot; DVD Decrypter Site. This site has since closed down.\n\nMany American legal experts believe that under United States&amp;#039; Federal law, making a backup copy of a DVD-Video or an audio CD by a consumer is legal. Some feel this provision of United States law conflicts with the Digital Millennium Copyright Act prohibition of so-called &quot;circumvention measures&quot; of copy protections.\n\nIn 2006, the United States Library of Congress created an exemption that explicitly allows circumventing access control for certain educational purposes.[5]\n\nIn the noted &quot;321&quot; case, Federal District Judge Susan Illston, of the Northern District of California [6], ruled that the backup copies made with software such as DVD Decrypter are in fact legal but that distribution of the software used to make them is illegal. As of the date of this revision, neither the US Supreme Court nor the US Congress has taken definitive action on the matter.\n\nOn October 4, 2005, Lightning UK! continued the development of the burning engine used by DVD Decrypter in his new tool, ImgBurn.[7]\n\n","torrent":{"xt":"urn:btih:df1bbe1be1193ec52df877b0ac8a43c61c1c10f4","amp;dn":"dvd+decrypter","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df1bbe1be1193ec52df877b0ac8a43c61c1c10f4","infoHashBuffer":{"type":"Buffer","data":[223,27,190,27,225,25,62,197,45,248,119,176,172,138,67,198,28,28,16,244]},"announce":[],"urlList":[]}}