{"title":"Alan Moore and Mitch Jenkins - Unearthing","uid":8715110,"size":619331116,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:df5ce8539227383f714271d3d870003233937ee5&amp;dn=Alan+Moore+and+Mitch+Jenkins+-+Unearthing&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1374315614,"description":"An intensely poetic and innovative work of biography, Unearthing maps the lifetime of author, orientalist, and occultist Steve Moore, while simultaneously investigating the extraordinary history of South London with which that life has been intertwined. With haunting and exquisite imagery, Unearthing excavates a territory at the margins of a city, of reality, and of human imagination. \n\n'Unearthing'\n\nLex Records, 2010\n\nText Written and Narrated by Alan Moore\n\nConcept and Photography by Mitch Jenkins (with apologies, this upload does not include quality scans of Jenkins photography)\n\nMusic Written, Composed and Performed by Adam Drucker, Andrew Broder, Crook &amp; Flail, Justin Broadrick, Matt Darling, Mike Patton, Paul Metzger, Stuart Braithwaite, Zach Hill\n\nCast - Alan Moore, Gemma Young, Robert Goodman\n\nUnearthing is an audio and visual project uniting legendary comic book writer Alan Moore, award-winning photographer Mitch Jenkins, and a cast of high calibre musicians. This unique creation consists of an epic, bewitching story written and narrated by Moore set against a mesmerizing score from Crook&amp;Flail, Stuart Braithwaite, Zach Hill, Justin Broadrick, Mike Patton and others.\n\nAlan Moore is best known for his groundbreaking graphic novels, The League of Extraordinary Gentlemen, From Hell, V For Vendetta, and The Watchmen. These, along with work for 2000 AD and DC Comics, have established Moore as one of the most influential and important writers in the history of comics. His output has sold millions, lead to numerous awards and been adapted for feature films - Moore has even made a cameo appearance on The Simpsons.\n\nThe musical score for Unearthing is produced by Crook&amp; Flail, a partnership between Andrew Broder and Adam Drucker. Broder is the multi-instrumentalist behind the band Fog, whilist Drucker's adventures under his Doseone solo guise - and with cLOUDEAD, Themselves and Subtle. Together the pair have listed an impressive array of talented collaborators, including Strart Braithwhite of post rockers Mogwai, drummer Zach Hill from acclaimed experimental band Hella, the trailblazing and prolific Justin Broadrick of Napalm Death, Godflesh and Jesu and alternative rock hero and Faith No More/Mr. Bungle/Tomahawk/Fantomas frontman, Mike Patton. ","torrent":{"xt":"urn:btih:df5ce8539227383f714271d3d870003233937ee5","amp;dn":"Alan+Moore+and+Mitch+Jenkins+-+Unearthing","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df5ce8539227383f714271d3d870003233937ee5","infoHashBuffer":{"type":"Buffer","data":[223,92,232,83,146,39,56,63,113,66,113,211,216,112,0,50,51,147,126,229]},"announce":[],"urlList":[]}}