{"title":"Universe By Design - Dr. Danny R. Faulkner","uid":10386814,"size":8882700,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfae65d0a483dcebec127ecfc4e624f2819e185e&amp;dn=Universe+By+Design+-+Dr.+Danny+R.+Faulkner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":2,"time":1403140955,"description":"The universe was created with purpose and reason; and modern science with all of its experiments, exploration, and sophistication has never proven otherwise. In fact, as author Dr. Danny Faulkner makes plain, advanced science argues more for a created cosmology than a big bang. Written for the upper-level student through the well-read layman, Universe by Design explores the universe, explaining its origins and discussing the historical development of cosmology from a creationist viewpoint.\n\nIncludes:\n\n- Recent developments in cosmology\n- Explanatory diagrams and illustrations\n- Theories and facts on the origin and expansion of the universe\n- The contributions of Ptolemy, Galileo, Brahe, Newton, Hubble, Einstein, and other famous scientists to the field\n- Thorough discussion and problems with the big bang theory\n- Many examples and analogies to help understand concepts of cosmology\n- Difficulties and critiques of modern cosmology\n- Chapter questions and answers for homeschool study\n\nAs an excellent supplement to an upper-level homeschool curriculum or the library of an astronomer - amateur or advanced - this book will inform and enlighten the scientific mind.\n\n\nAbout the author:\nDanny R. Faulkner, Ph.D., is a Full Professor at the University of South Carolina, Lancaster, where he teaches physics and astronomy. He has published about two dozen papers in various astronomy and astrophysics journals. ","torrent":{"xt":"urn:btih:dfae65d0a483dcebec127ecfc4e624f2819e185e","amp;dn":"Universe+By+Design+-+Dr.+Danny+R.+Faulkner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfae65d0a483dcebec127ecfc4e624f2819e185e","infoHashBuffer":{"type":"Buffer","data":[223,174,101,208,164,131,220,235,236,18,126,207,196,230,36,242,129,158,24,94]},"announce":[],"urlList":[]}}