{"title":"Computer Forensics: Investigating Network Intrusions and Cyber ","uid":6878839,"size":35700640,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:dfe825e79aa0a2d0bff141cd92649e1c466643a5&amp;dn=+Computer+Forensics%3A+Investigating+Network+Intrusions+and+Cyber+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"freaktorrent07","files":-1,"time":1323563747,"description":"\nComputer Forensics: Investigating Network Intrusions and Cyber Crime By EC-Council\nPublisher: Cou..rse Tech..nol..ogy 2010 | 394 Pages | ISBN: 1435483529 | PDF + EPUP | 30.0 MB\n\n\nThe Computer Forensic Series by EC-Council provides the knowledge and skills to identify, track, and prosecute the cyber-criminal. The series is comprised of five books covering a broad base of topics in Computer Hacking Forensic Investigation, designed to expose the reader to the process of detecting attacks and collecting evidence in a forensically sound manner with the intent to report crime and prevent future attacks. Learners are introduced to advanced techniques in computer investigation and analysis with interest in generating potential legal evidence. In full, this and the other four books provide preparation to identify evidence in computer related crime and abuse cases as well as track the intrusive hacker's path through a client system. The series and accompanying labs help prepare the security student or professional to profile an intruder's footprint and gather all necessary information and evidence to support prosecution in a court of law. Network Intrusions and Cybercrime includes a discussion of tools used in investigations as well as information on investigating network traffic, web attacks, DOS attacks, Corporate Espionage and much more!","torrent":{"xt":"urn:btih:dfe825e79aa0a2d0bff141cd92649e1c466643a5","amp;dn":"+Computer+Forensics%3A+Investigating+Network+Intrusions+and+Cyber+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dfe825e79aa0a2d0bff141cd92649e1c466643a5","infoHashBuffer":{"type":"Buffer","data":[223,232,37,231,154,160,162,208,191,241,65,205,146,100,158,28,70,102,67,165]},"announce":[],"urlList":[]}}