{"title":"Illumination, Color and Imaging: Evaluation and Optimization of","uid":9791115,"size":8993378,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e03d5db437dd9ebd5bc84df912edf7e1e0f6b4f0&amp;dn=Illumination%2C+Color+and+Imaging%3A+Evaluation+and+Optimization+of+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"xXGalaxyXx","files":-1,"time":1395248380,"description":"Illumination, Color and Imaging: Evaluation and Optimization of Visual Displays\n\n2012 |ISBN-10: 3527410406 |PDF | 395 pages | 8.57 Mb\n\nThis comprehensive and modern reference on display technology, Illumination, color and imaging focuses on visual effects and how displayed images are best matched to the human visual system.\nIt teaches how to exploit the knowledge of color information processing to design usable, ergonomic, and visually pleasing displays and display environments. The contents describe design principles and methods to optimize self-luminous visual technologies for the user using modern still and motion image displays and the whole range of indoor light sources. Design principles and methods are derived from knowledge of the human visual system, with a special emphasis on color vision, cognition, harmony, preference, memory colors and visually evoked emotions. The authors, who are recognized experts in the field, include the most important and the very latest applications of design principles and methods, to provide a comprehensive description of the entire psychophysical gamut of human color information processing from the eye through aspects of high-level visual perception to the already mentioned cognition, preference, harmony, and visually evoked emotions.\nThis book contains a significant amount of previously unpublished material. A much needed and very up to date work, it will provide great benefit to all who work in the visual display field.","torrent":{"xt":"urn:btih:e03d5db437dd9ebd5bc84df912edf7e1e0f6b4f0","amp;dn":"Illumination%2C+Color+and+Imaging%3A+Evaluation+and+Optimization+of+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e03d5db437dd9ebd5bc84df912edf7e1e0f6b4f0","infoHashBuffer":{"type":"Buffer","data":[224,61,93,180,55,221,158,189,91,200,77,249,18,237,247,225,224,246,180,240]},"announce":[],"urlList":[]}}