{"title":"John Peel - The Artist Formerly Known As Captain Beefheart","uid":4340069,"size":537019763,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e0ef43ec5663631cfc047305094f317bc9af7e1a&amp;dn=John+Peel+-+The+Artist+Formerly+Known+As+Captain+Beefheart&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mel_ducasse","files":2,"time":1218546448,"description":"1 hour documentary on Captain Beefheart, presented by John Peel.\n\nBBC 2 * THE ARTIST FORMERLY KNOWN AS CAPTAIN BEEFHEART\n\nengland 1994 bbc 2 television documentary 19.08.97\nrepeated without film 'some yo yo stuff' 29.08.99\n\n*\n\n    real surprises come unexpectedly. like the documentary about the artist who, when he was part of the rock 'n' roll circus, demolished the musical rules and created a new and daring sound: don vliet alias captain beefheart. during his 1964-1982 musical period but few people realized how unique his music would proof to be - and he even met greater recognition in other countries than his culturally narrow-minded land of origin, the united states of america hamburgers. so it really isn't a surprise that the only report ever made about the lives and times of the captain comes from the european continent, which has delivered a book (not to mention mine about the cover versions), four biographies, a fanzine and all those vinyl and cd bootlegs.\n\n    on the other hand it is quite a wonder the special has been broadcast anyhow. because originally it was planned to be a part of the bbc's &quot;late show&quot; programs in autumn 1994, but that art series simply stopped (in 1995) before the beefheart item was shown. it looked like no-one would ever see the expected visual report - as well as the including don van vliet/anton corbijn co-production &quot;some yo yo stuff&quot;. the fact that this short film was shown by anton corbijn on dutch television last year, made clear that the bbc presumably had given up all plans for the documentary. how it turned out to be wrong! when we all had lost hope, there came the unbelievable message that on 19 august 1997 their second channel would bring a program called &quot;the artist formerly known as captain beefheart&quot;, followed by &quot;some yo yo stuff&quot;.\n\n    so all the hastily warned clans of beefheart fans who could receive that program (in the u.k., ireland and the lucky netherlands) of course stayed up late to watch it. after just five minutes they were completely stunned - and out of their minds for at least a week. hell, why? because the 'show' is so fantastic, marvelous, great and amazing it leaves the viewer paralysed and speechless. i'm glad i did survive this enormous moment and meanwhile have restored to life enough to tell all the poor folks who had to miss this milestone in beefheart-land, about it. [nevertheless they really gotta see it!!!] \n\n================================================================================\n--- File Information ---\nFile Name:            Peel Night (1999) - The Artist Formerly Known as Captain Beefheart.avi\nFile Size:            537,016,320 bytes\n\n--- Video Information ---\nVideo Codec Name:     XviD ISO MPEG-4\nDuration:             51:15.080\nVideo Bitrate:        1258kb/s\nBits / Pixel:         0.164\nResolution:           640x480\nFrames Per Second:    25.000\n\n--- Advanced ---\nB-VOP:                B-VOP\nQPel:                 \nGMC:                   \n\n--- Audio Information ---\nNo of Audio Streams:  1\nAudio Codec:          0x0055 MPEG-1 Layer 3\nAudio Bitrate:        130kb/s VBR 48000 Hz\nAudio Channel Count:  2\nInterleave:           40ms\nPreload:              504ms\nAudio alignment:      Aligned o Scope Nerof\n===============================================================================\nall hail to backbacon the original capper.","torrent":{"xt":"urn:btih:e0ef43ec5663631cfc047305094f317bc9af7e1a","amp;dn":"John+Peel+-+The+Artist+Formerly+Known+As+Captain+Beefheart","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0ef43ec5663631cfc047305094f317bc9af7e1a","infoHashBuffer":{"type":"Buffer","data":[224,239,67,236,86,99,99,28,252,4,115,5,9,79,49,123,201,175,126,26]},"announce":[],"urlList":[]}}