{"title":"Shadow man [PC game - avventura - ita][Tntvillage]","uid":5208453,"size":740097279,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e10d7dc4ac5e6598b31f1ed9a768f650818bc0dd&amp;dn=Shadow+man+%5BPC+game+-+avventura+-+ita%5D%5BTntvillage%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"maxmalu6601","files":3,"time":1260480905,"description":"Visit this link: http://www.shareimmage.com/fx_images/maxmalu6601_43608a09dc7d.jpg\n\n.::.Recensione.::.\n\n&quot;E come un dio esco dalla contorta e putrescente carne di quel serpente che ÃƒÂ¨ la Terra dei \n\nMorti. Che nome ha il suo sonno? Quali sogni si annidano nel mortale srotolarsi delle sue \n\nspire?&quot; Ecco come inizia una delle poesie che fanno da introduzione a Shadowman... inquietante, \n\nvero? E ancora non avete visto il gioco!\nShadowman, la nuova avventura 3D di Acclaim, non si discosterebbe troppo dalla stragrande \n\nmaggioranza dei suoi simili, se non fosse per la sua ambientazione e per l'indubbio fascino \n\ndell'atmosfera. L'eroe del gioco ÃƒÂ¨ Mike LeRoi, oriundo di New Orleans, studente fallito di \n\nletteratura inglese che, dopo essersi ridotto in rovina scialacquando ogni cosa in alcolici e \n\ngioco d'azzardo, tenta senza troppo successo di guadagnarsi da vivere facendo il tassista a \n\nChicago; il caso vuole che nel 1991 le cose cambino radicalmente e che fra le mani del \n\nmalcapitato Mike giungano ben 20000 dollari piÃƒÂ¹ o meno come manna dal cielo: il denaro ÃƒÂ¨ \n\ninfatti tutto ciÃƒÂ² che resta sul suo taxi di un cliente, vittima della malavita locale. Il \n\nnostro eroe approfitta quindi dell'occasione per tornare a New Orleans e pagare un'operazione \n\ndi cui il suo fratellino Luke ha disperato bisogno; tuttavia la banda responsabile \n\ndell'omicidio del suo cliente lo sta cercando e inizia a minacciarlo di morte. Mike chiede \n\nprotezione ad un sacerdote voodoo, e sicuramente la ottiene: il problema ÃƒÂ¨ che la banda sceglie \n\ndi aggredirlo proprio mentre si trova assieme alla famiglia... e miracolosamente ÃƒÂ¨ lui il solo \n\na salvarsi. Come se tutto ciÃƒÂ² non fosse abbastanza, il sacerdote gli ha lanciato a tradimento \n\nuna maledizione, privandolo della memoria e rendendolo suo schiavo, obbligandolo ad agire come \n\nassassino su commissione...\nTutto questo fino a quando Mama Nettie, una sacerdotessa, non gli impianterÃƒÂ  nel torace la \n\nMaschera delle Ombre, restituendogli ogni ricordo e trasformandolo in Shadow Man, una sorta di \n\neroe voodoo immortale capace di passare alternativamente dal mondo dei vivi alla Terra dei \n\nMorti. Il compito che in questo gioco Mama Nettie ha affidato a Shadow Man (che ÃƒÂ¨ costretto ad \n\nubbidirle, perchÃƒÂ© rimane comunque suo schiavo), ÃƒÂ¨ di dare la caccia a cinque terribili serial \n\nkiller, che parrebbero essere collegati niente meno che con la Fine del Mondo! E naturalmente, \n\nla cosa ÃƒÂ¨ assai piÃƒÂ¹ facile a dirsi che a farsi.\n\n\nI giudizi esprimibili su Shadowman possono essere efficacemente sintetizzati da una sola \n\nparola: questo gioco ÃƒÂ¨ impressionante. Innanzitutto dal punto di vista grafico: l'aspetto \n\nischeletrito e vagamente irreale dei personaggi si intona alla perfezione con la bellezza \n\nlugubre dei paesaggi, ricchissimi di colore, realismo, fluiditÃƒÂ , profonditÃƒÂ  ma soprattutto di \n\natmosfera; l'intera ambientazione infatti emana un fascino spettrale, profondamente \n\ninquietante, che talvolta costringerÃƒÂ  a fermarsi per riprendere letteralmente il fiato... e non \n\nÃƒÂ¨ un'esagerazione. Davanti all'orrida maestÃƒÂ  architettonica della Terra dei Morti, ai laghi di \n\nfuoco e alle cascate di sangue, o al marciume dei sobborghi di New Orleans, si rimarrÃƒÂ  comunque \n\nprofondamente colpiti dall'abbondanza dei particolari, e dall'inequivocabile bellezza del \n\nrisultato complessivo... un'altra nota di merito va aggiunta naturalmente per i numerosissimi \n\neffetti speciali, non solo oggettivamente belli e curati, ma soprattutto coinvolgenti e mai \n\nfuori luogo, talvolta ipnotici: un esempio per tutti sono i nastri di luce viola che avvolgono \n\nle Anime Prave (rappresentate come abominevoli larve che pulsano!), di cui Mike/Shadow Man \n\nassorbirÃƒÂ  la potenza; persino il modo in cui quest'ultimo muore riesce ad essere spettacolare e \n\ninteressante, come nel caso di un'accidentale caduta nell'acido, nell'eventualitÃƒÂ  che ancora \n\nnon si possieda il tatuaggio voodoo che dovrebbe proteggere il nostro eroe in circostanze \n\nsimili.L'aspetto sonoro non ÃƒÂ¨ meno, per l'appunto, impressionante di quello grafico. Versi \n\ninumani e gemiti veramente agghiaccianti diversi da un nemico all'altro, esplosioni sfrigolanti \n\ndi anime distrutte accompagneranno il nostro Mike/Shadow Man in questa missione, il tutto \n\ncondito da una colonna sonora che ha del sensazionale: rimarrÃƒÂ  quasi sempre in sottofondo, ma \n\nil pulsare attutito e incalzante delle percussioni, i suoni bassi che amplificano la tensione e \n\ni cori maestosi ed inquietanti contribuiranno a rendere ancora piÃƒÂ¹ penetrante l'atmosfera di \n\ndecadenza e di dannazione, che pervade questo gioco dall'inizio alla fine. In conclusione, \n\nsonoro e grafica costruiscono insieme un'ambientazione piuttosto ricca che sa coinvolgere da \n\nsubito.\n\nShadowman continua ad essere impressionante anche dal punto di vista della longevitÃƒÂ , ma \n\nstavolta le accezioni di questo termine sono meno positive che nel caso di grafica e sonoro. Il \n\nmondo che il nostro Mike/Shadow Man si troverÃƒÂ  infatti ad affrontare e ad esplorare ÃƒÂ¨ veramente \n\nvastissimo, disseminato di acrobazie e di enigmi anche discretamente difficili, ma soprattutto \n\ndi nemici! Una quantitÃƒÂ  sterminata di nemici piuttosto tenaci, la cui forza e potenza si adegua \n\nspontaneamente a quella del personaggio; nemici che, soprattutto, hanno la sgradevole abitudine \n\ndi rinascere piÃƒÂ¹ agguerriti di prima ogniqualvolta il nostro eroe ha la disgrazia di dover \n\nrientrare nel livello in questione. ÃƒË† questa la principale pecca di Shadowman; l'atmosfera cupa \n\ne coinvolgente, la trama accattivante, l'azione intensa e gli enigmi, la vastitÃƒÂ  del mondo e il \n\nsemplicissimo sistema di controllo, in sÃƒÂ© stessi dovrebbero assicurare numerose ore di \n\ndivertimento anche ad un giocatore esperto, ma i continui combattimenti e il meccanismo di \n\n&quot;rinascita&quot; dei nemici, entrambi spesso veramente tediosi, tolgono non poca godibilitÃƒÂ  al gioco \n\nstesso, penalizzando sia la longevitÃƒÂ  che la giocabilitÃƒÂ .Il meccanismo di combattimento in \n\nShadowman ÃƒÂ¨ fin troppo semplice, aggiungendo a questo i difetti sovracitati in merito alla \n\ngestione dei nemici, otteniamo in parole povere che il giocatore, dopo una buona mezz'ora \n\npassata a cercare di salvarsi la vita senza riuscire ad ottenere grandi risultati \n\nnell'esplorazione, potrebbe iniziare ad annoiarsi. Le dimensioni del mondo esplorabile, che \n\nteoricamente costituirebbero un pregio, formano cosÃƒÂ¬ in un certo senso un difetto: considerando \n\nle pecche giÃƒÂ  esposte nella meccanica dei combattimenti, che di per sÃƒÂ© in Shadowman non sono \n\ndelle esperienze particolarmente stimolanti (se non per il modo spettacolare in cui muoiono i \n\nnemici!), le conseguenti difficoltÃƒÂ  del giocatore ad esplorare i livelli con un minimo di \n\ncriterio, saranno aggravate certamente dalla vastitÃƒÂ  del mondo... che ha quindi un effetto \n\ndispersivo sull'avanzamento nell'avventura.\nIn altre parole, la grandezza sterminata del mondo esplorabile renderebbe questo titolo molto \n\nlongevo, almeno se non ci fossero i difetti giÃƒÂ  citati nel campo del combattimento che fanno sÃƒÂ¬ \n\nche il giocatore si stanchi assai prima del previsto.\n\nIn conclusione, Shadowman ÃƒÂ¨ praticamente impeccabile dal punto di vista dell'ambientazione e \n\ndell'atmosfera, per quanto queste siano strettamente vincolate al genere del gioco e \n\nquest'ultimo non risulti infine troppo originale; stimolante altresÃƒÂ¬ per i numerosi enigmi e la \n\nvastitÃƒÂ  dell'avventura, risulta tuttavia spesso assai dispersivo e stancante, anche a causa di \n\nalcune lacune in merito alla meccanica dei combattimenti e alla gestione dei nemici. Malgrado \n\ndifetti simili in un gioco di questo genere siano difficili da digerire, rimane tuttavia \n\nun'esperienza assai piacevole, che sa offrire sfide stimolanti e che cattura con la bellissima \n\natmosfera che lo impregna interamente. ÃƒË† insomma probabile che anche i giocatori meno tenaci, \n\nbenchÃƒÂ© stancandosi piÃƒÂ¹ facilmente e bloccandosi piÃƒÂ¹ spesso, ritroveranno altrettanto \n\nfrequentemente lo stimolo per tornare a giocarci. \n &lt;a href=&quot;\nhttp://www.shareimmage.com/fx_images/maxmalu6601_f4274867db11.jpg!!http://www.shareimmage.com/f&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.shareimmage.com/fx_images/maxmalu6601_f4274867db11.jpg!!http://www.shareimmage.com/f&lt;/a&gt;\n\nx_images/maxmalu6601_b618c38e8eb8.jpg!!http://www.shareimmage.com/fx_images/maxmalu6601_4d9fdba\n\n9e363.jpg!!http://www.shareimmage.com/fx_images/maxmalu6601_7a5c41ef3a9b.jpg!!http://www.sharei\n\nmmage.com/fx_images/maxmalu6601_d9b88669a3e8.jpg!!http://www.shareimmage.com/fx_images/maxmalu6\n\n601_5c43314ef73d.jpg!!http://www.shareimmage.com/fx_images/maxmalu6601_2c3f23f178ae.jpg!!http:/\n\n/www.shareimmage.com/fx_images/maxmalu6601_fe3d4adaf78a.jpg!!http://www.shareimmage.com/fx_imag\n\nes/maxmalu6601_7755efc2bf12.jpg\n\nCommenti\nNon lasciatevi ingannare dalle dimensioni (1 CD). E' un gioco d'avventura stupendo. Un solo \n\nconsiglio: non giocateci da soli e .... di notte\n\nVisit thelink:thelink: \n\n\n.::.Informazioni sul gioco.::.\n\nIl gioco ÃƒÂ¨ in italiano. E' stato testato su Windows XP SP3 (ci ho ri-giocato per un po senza \n\nalcun problema). Non ha grosse pretese Hardware. Per installarlo basta montare il file immagine \n\ne , una volta installato, curarlo(anche dopo la cura il cd del gioco deve essere inserito)\n\nVisit http://www.tntvillage.scambioetico.org/","torrent":{"xt":"urn:btih:e10d7dc4ac5e6598b31f1ed9a768f650818bc0dd","amp;dn":"Shadow+man+%5BPC+game+-+avventura+-+ita%5D%5BTntvillage%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e10d7dc4ac5e6598b31f1ed9a768f650818bc0dd","infoHashBuffer":{"type":"Buffer","data":[225,13,125,196,172,94,101,152,179,31,30,217,167,104,246,80,129,139,192,221]},"announce":[],"urlList":[]}}