{"title":"PhotoZoom Pro 6.0.8 x86 x64","uid":14535020,"size":24927128,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e10f0848615394ee79357875ab4c9aad39070a5a&amp;dn=PhotoZoom+Pro+6.0.8+x86+x64&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"annuaireweb","files":3,"time":1462486055,"description":"BenVista PhotoZoom Pro 6 est le numéro un mondial des solutions logicielles d'agrandissement et de réduction des photos et graphiques numériques.\r\n\r\nPhotoZoom Pro 6 permet non seulement de créer des images plus grandes que n'importe quel autre logiciel (jusqu'à 1 million par 1 million de pixels), mais il produit également des résultats de qualité supérieure. PhotoZoom Pro 6 est équipé de S-Spline Max, technologie unique et brevetée de redimensionnement d'images qui conserve à la perfection des bords impeccables, la netteté ainsi que la finesse des détails.\r\nMême les originaux compressés et bruités peuvent être agrandis. En général, au cours de l'agrandissement, le bruit et les artefacts de compression JPEG deviennent visibles et perturbants. PhotoZoom Pro 6 offre néanmoins les outils pour supprimer ces distorsions. Vous serez impressionné par le nombre de détails que PhotoZoom Pro 6 peut extraire.\r\n\r\nPhotoZoom Pro 6 possède de nombreux paramètres prédéfinis. Ces paramètres peuvent également être ajustés manuellement. Vous pouvez même associer vos propres profils de redimensionnement : les compilations de vos techniques de redimensionnement et paramètres de taille favoris, que vous pouvez sélectionner d'un simple clic. Lorsque vous utilisez souvent les mêmes paramètres, les profils de redimensionnement vous permettront de simplifier votre flux de travail.\r\nIl est possible de redimensionner d'importants volumes d'images en une seule fois grâce au traitement par lots. La prise en charge multi-processeur et 64 bits et la nouvelle accélération graphique dont bénéficie PhotoZoom Pro 6 permet de réduire les temps de traitement.\r\n\r\nOptimisé à la fois pour l'impression et l'affichage à l'écran, PhotoZoom Pro 6 est un produit indispensable pour toute personne souhaitant redimensionner des images avec la meilleure qualité possible","torrent":{"xt":"urn:btih:e10f0848615394ee79357875ab4c9aad39070a5a","amp;dn":"PhotoZoom+Pro+6.0.8+x86+x64","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e10f0848615394ee79357875ab4c9aad39070a5a","infoHashBuffer":{"type":"Buffer","data":[225,15,8,72,97,83,148,238,121,53,120,117,171,76,154,173,57,7,10,90]},"announce":[],"urlList":[]}}