{"title":"Mail Direct Pro v2.5 (2007)","uid":3668599,"size":3226691,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1858e71754652c7603f8b6e7e4f28b2c060f67b&amp;dn=Mail+Direct+Pro+v2.5+%282007%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"hedkandi1","files":6,"time":1177064709,"description":"Mail Direct Pro v2.5\n\nApr 7, 2007\n\n\n\nDescription\n\n\n\nMail Direct is a program designed to send e-mail messages directly to recipients.\n\nNo SMTP mail server is needed. Mail Direct ensures faster, safer, and easier mail sending.\n\n\n\nMail Direct works with most e-mail programs, such as Outlook Express, The Bat, Eudora, Foxmail, and many more. It has a built-in SMTP server, which your e-mail client will use to send messages. It receives the messages from your client and then sends them directly to your recipient&amp;#039;s mail server, bypassing your ISP&amp;#039;s mail server. All you need to do is change the address of the outgoing mail server (SMTP) in your e-mail software from the name of your ISP&amp;#039;s mail server to &quot;localhost&quot;. Mail Direct will then be designated as your SMTP server.\n\n\n\nMail Direct allows multi-threaded &amp; high-speed mailing. At the time of transmission it can verify target e-mail addresses.\n\n\n\nFeatures:\n\n\n\nFast mailing.\n\nMail Direct will ensure instant delivery of your message because it bypasses your ISP&amp;#039;s mail-server queue. Because it uses multi-thread delivery, it can send messages to many recipients&amp;#039; mail servers simultaneously. You can set it to send mail instantly or to hold your messages in its own queue until a time of your choosing.\n\n\n\nDirect sending.\n\nMail Direct will obtain mail exchange (MX) host information from a DNS server and send your message directly to your recipient&amp;#039;s mail server using SMTP protocol. If the recipient&amp;#039;s mail address is wrong, the program will terminate delivery before sending any part of your message. This feature enhances the security of your e-mail communications and greatly reduces annoying and wasteful &quot;bounce&quot; messages.\n\n\n\nEasy to use.\n\nMail Direct has a built-in SMTP server that receives messages sent from your mail client program. You will need to change the address of the outgoing mail server (SMTP) in your mail software from your ISP&amp;#039;s mail server to &quot;localhost&quot;. If you attempt to send mail to a server that will receive mail only from recognized ISP&amp;#039;s, Mail Direct can be set to automatically switch from direct delivery and to send your message instead through a predetermined SMTP server of your choice.\n\n\n","torrent":{"xt":"urn:btih:e1858e71754652c7603f8b6e7e4f28b2c060f67b","amp;dn":"Mail+Direct+Pro+v2.5+%282007%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1858e71754652c7603f8b6e7e4f28b2c060f67b","infoHashBuffer":{"type":"Buffer","data":[225,133,142,113,117,70,82,199,96,63,139,110,126,79,40,178,192,96,246,123]},"announce":[],"urlList":[]}}