{"title":"Alannah Myles - 3 Albums (1988 - 1995) [FLAC] - Kitlope","uid":4846939,"size":977335799,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e1ccaf1f32a398279c791c1332cec8f58cdd5264&amp;dn=Alannah+Myles+-+3+Albums+%281988+-+1995%29+%5BFLAC%5D+-+Kitlope&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Kitlope","files":42,"time":1239722335,"description":"File Type: FLAC Compression 6\nCd recorder: Plextor PX-716SA\nCd Ripper: Exact Audio Copy V0.99 prebeta 4\nEAC Log: Yes\nEAC Cue Sheet: Yes\nTracker(s):http://tpb.tracker.thepiratebay.se:80/announce;\nTorrent Hash: E1CCAF1F32A398279C791C1332CEC8F58CDD5264\nFile Size: 932.06 Mb\nLabel: Atlantic\nYears, Albums &amp; Catalog #: Alannah Myles A2 81956 (1989); Rockinghorse CD 82402 (1992); A-LAN-NAH A2 82842 (1995)\n\n\n\nPlease help seed these FLACs! \n\n\n\nFrom Wiki:\n\n\nAlannah Myles (born December 25, 1958, Toronto, Ontario) is a Canadian singer-songwriter. In 1989, she released her self-titled debut album, Alannah Myles. In 1990 &quot;Black Velvet,&quot; a single taken from that album, topped the Billboard Hot 100 in the United States, and was also a hit in four other countries, including her native Canada, Australia, the Netherlands and the United Kingdom.\n\nMyles grew up in Toronto and Buckhorn, Ontario, where her family owns the ranch where her &quot;Black Velvet&quot; video was filmed and where she also learned to ride horses. She wrote her first song at the age of eight, called &quot;Ugly Little Cabbage In The Garden,&quot; a song meant for her sister, whom she was teasing who grew up singing it as a nursery rhyme for her own children. One story told about her said that, early in her life, she sold her horse to buy an Ovation guitar to play in various cafes and coffee houses. She was ostracized by her family for not having married her live-in love, Christopher Ward, who wrote and composed many of her early chart selections, including &quot;Black Velvet.&quot;\n\nWhen she was sixteen, she began performing in Southern Ontario. She eventually met Christopher Ward, the songwriter who helped her to form her own band, and performed cover versions of Aretha Franklin, T. Rex, AC/DC, Bob Seger, Anne Peebles, the Rolling Stones, and the Pretenders. She managed to get gigs by deceiving club managers into believing some of her own original songs were cover songs from other bands. Later, she joined with David Tyson to produce her self-titled debut album, Alannah Myles. She appeared together with Christopher in a 1984 installment of the television series program The Kids Of Degrassi Street, in which she played the role of an aspiring singer and single mother.\n\nIn 1989, she released Alannah Myles. It produced three Top 40 selections, &quot;Love Is,&quot; &quot;Lover Of Mine,&quot; and &quot;Still Got This Thing,&quot; as well as the number one hit &quot;Black Velvet.&quot; This was a commemoration of the life and career of Elvis Presley, of which American country-and-western singer Robin Lee simultaneously released a cover version. (However, under orders from label executives of The Atlantic Group, Lee's version of the accompanying video replaced the horse that Myles had ridden in the original video with a motorcycle.) For Myles, &quot;Black Velvet&quot; became a number one hit worldwide and was named the most played song on radio for 1989.[citation needed] &quot;Black Velvet&quot; won Myles a Grammy Award for Best Female Rock Performance, and several Juno Awards. By this point she was known worldwide.\n\nThe year 1992 brought the follow up album, Rockinghorse, which included the hit singles &quot;Song Instead Of A Kiss,&quot; &quot;Our World, Our Times,&quot; and &quot;Sonny, Say You Will.&quot; She received a Grammy nomination and 3 Juno Awards.\n\nThe year 1995 brought A-lan-nah, a lesser-known album which contained no Top 40 singles. It did include two tracks which made it into the Top 100: &quot;Family Secret&quot; and &quot;Blow Wind, Blow.&quot;\n\nIn 1997 she left her eight-record contract at the Atlantic Records label at the behest of her manager, Miles Copeland, who signed her to his Ark 21 Records. Here she released Arival, which had the Top 40 hit &quot;Bad 4 You,&quot; written and recorded by Myles, Desmond Child and Eric Bazilian at Copeland's castle songwriting retreat at Grand Brassac, France.\n\nIn February 2005, together with the Swedish band Kee Marcello's K2, she participated in the third semi-final of Melodifestivalen, the Swedish national selection for the Eurovision Song Contest. Their song &quot;We Got It All&quot; scored very few points and finished seventh out of eight songs.[1]\n\nIn July 2008, Myles, in an interview with the CBC's Evan Solomon, discussed her upcoming album &quot;Black Velvet&quot; and her financial problems over the last ten years. Through a series of bad financial decisions, she ended up &quot;scrounging to keep a roof over her head.&quot; Due to legal constraints, she had been forced to wait ten years before releasing a new recording of &quot;Black Velvet.&quot;\n\nMyles continues to tour Canada and the rest of the world as of March 2009.[citation needed] She finished her album Black Velvet, which featured a new recording of her song of the same name in addition to ten new songs. Black Velvet was released in April 2008 in Canada and Europe, with its release in the United States slated for the fall of 2009. She was recently interviewed by Evan Solomon, a news anchor for the CBC's Sunday Night Show, and declared she was happy to release her new album and was thankful she had the opportunity to title her CD &quot;Black Velvet&quot; as that single was one of her most well-known and successful singles she ever released in her entire singing career.\n\n\n\n\n\nAlannah Myles 1989\n\n\nAlannah Myles was the self-titled debut album released by Alannah Myles on January 1, 1989.\n\n\nTracks:\n\n\n1.\t&quot;Still Got This Thing&quot; \n2.\t&quot;Love Is&quot; \n3.\t&quot;Black Velvet&quot; \n4.\t&quot;Rock This Joint&quot; \n5.\t&quot;Lover Of Mine&quot; \n6.\t&quot;Kick Start My Heart&quot; \n7.\t&quot;If You Want To&quot; \n8.\t&quot;Just One Kiss&quot; \n9.\t&quot;Who Loves You&quot; \n10.\t&quot;Hurry Make Love&quot; \n\n\n\n\n\n\n\nRockinghorse 1992\n\n\nRockinghorse is the second album released by Alannah Myles in 1992.\n\n\nTracks: \n\n\n1.\t&quot;Our World Our Times&quot; \n2.\t&quot;Make Me Happy&quot; \n3.\t&quot;Sonny Say You Will&quot; \n4.\t&quot;Tumbleweed&quot; \n5.\t&quot;Livin' On A Memory&quot; \n6.\t&quot;Song Instead Of A Kiss&quot; \n7.\t&quot;Love In The Big Town&quot; \n8.\t&quot;The Last Time I Saw William&quot; \n9.\t&quot;Lies And Rumours&quot; \n10.\t&quot;Rockinghorse&quot; \n\n\n\n\n\nA-LAN-NAH 1995\n\n\nA-lan-nah is the third album released by Alannah Myles, in 1995.\n\n\nTracks: \n\n\n1.\tMistress of Erzulie ( 4.48 ) \n2.\tBlow Wind Blow ( 4.18 ) \n3.\tFamily Secret(5.19) \n4.\tMother Nature (4.04) \n5.\tIrish Rain (4.23) \n6.\tDark Side of Me (3.43) \n7.\tSimple Man's Dream (4.31) \n8.\tLightning in a Bottle (4.32) \n9.\tKeeper of My Heart (3.57) \n10.\tDo You Really Want to Know Me (2.34) \n11.\tEverybody's Breaking Up (4.39) \n12.\tSally, Go 'Round the Roses (2.49) \n\n\n\nEnjoy :)\n","torrent":{"xt":"urn:btih:e1ccaf1f32a398279c791c1332cec8f58cdd5264","amp;dn":"Alannah+Myles+-+3+Albums+%281988+-+1995%29+%5BFLAC%5D+-+Kitlope","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1ccaf1f32a398279c791c1332cec8f58cdd5264","infoHashBuffer":{"type":"Buffer","data":[225,204,175,31,50,163,152,39,156,121,28,19,50,206,200,245,140,221,82,100]},"announce":[],"urlList":[]}}