{"title":"Electric Machinery and Transformers (The Oxford Series)","uid":6454908,"size":32508905,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e2d487faba04d91f46257b0c316075d6fd23eef1&amp;dn=Electric+Machinery+and+Transformers+%28The+Oxford+Series%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"abuel-3bbas","files":1,"time":1307551616,"description":"Electric Machinery and Transformers (The Oxford Series in Electrical and Computer Engineering) by  Bhag S. Guru &amp; HÃƒÂ¼seyin R. Hiziroglu\n\n\nProduct Description\nDesigned for junior- and senior-level courses in electromechanical energy conversion, Electric Machinery and Transformers, 3/e, continues the strong pedagogical tradition established by its successful previous editions. It begins with a review of the fundamentals of circuit theory and electromagnetics and then introduces the concept of electromechanical energy conversion. The text not only provides a systematic development of a model for each electric machine based upon established principles and basic laws, but also introduces students to applications and advanced topics. It also includes information on the construction of each electric machine.\nElectric Machinery and Transformers, 3/e, enhances student learning of the basic operating principles of electric machines by using numerous supporting examples, review questions, illustrations, exercises, and chapter summaries. It encourages intuitive reasoning for problem-solving over the rote memorization of equations and procedures.\nThis third edition covers the following main topics: principles of electromechanical energy conversion; transformers; direct-current generators and motors; synchronous generators and motors; polyphase induction motors and single-phase motors; the dynamics of electric machines; and special-purpose machines.\nProduct Details\nHardcover: 720 pages\nPublisher: Oxford University Press, USA; 3 edition (July 20, 2000)\nLanguage: English\nISBN-10: 0195138902\nISBN-13: 978-0195138900\n\n[poly-technic.blogspot]\n","torrent":{"xt":"urn:btih:e2d487faba04d91f46257b0c316075d6fd23eef1","amp;dn":"Electric+Machinery+and+Transformers+%28The+Oxford+Series%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2d487faba04d91f46257b0c316075d6fd23eef1","infoHashBuffer":{"type":"Buffer","data":[226,212,135,250,186,4,217,31,70,37,123,12,49,96,117,214,253,35,238,241]},"announce":[],"urlList":[]}}