{"title":"Lethal Weapon 4(1998)DVDRip.AC3(ENG)-DROCK","uid":6556516,"size":734113246,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e2f7916aea02e36cd04731e033ce6df0b0a02880&amp;dn=Lethal+Weapon+4%281998%29DVDRip.AC3%28ENG%29-DROCK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"drock232","files":-1,"time":1311318234,"description":"Detectives Martin Riggs (Mel Gibson) and Roger Murtaugh (Danny Glover) re-teamed for their fourth foray together in this buddy-cop action comedy series based on characters created by Shane Black. With the passage of years, Murtaugh's daughter Rianne (Traci Wolfe) is now about to upgrade Murtaugh to grandfather status, while Riggs' relationship with internal affairs officer Lorna Cole (Rene Russo) means he'll become a proud papa. Elsewhere on the family front, Chinese triad members in Los Angeles smuggle families from the mainland, but this is only one item on the criminal agenda of triad leader Wah Sing Ku (Jet Li), who executes balletic martial arts maneuvers with blinding speed (fight sequences were staged by Hong Kong director Corey Yuen). The film opens with fire (when Riggs and Murtaugh encounter a flame-thrower in a bulletproof suit) and travels an entertaining popcorn plot path to a frightening, watery climax (which we won't reveal here). In between, Riggs and Murtaugh tackle the troublesome triads with an assist from wickedly witty, sharp-edged newcomer Lee Butters (Chris Rock) and private detective Leo Getz (Joe Pesci), the character first seen as a mob accountant in the second film of this highly popular series. \n\nRipped with Handbrake.\n\nLength: 2 Hours 7 Minutes\n\nFile Type: MP4\n\nFrame Width: 720\n\nFrame Height: 304\n\nFrame Rate: 23fps\n\nAudio\n\nBit Rate: 159kbps","torrent":{"xt":"urn:btih:e2f7916aea02e36cd04731e033ce6df0b0a02880","amp;dn":"Lethal+Weapon+4%281998%29DVDRip.AC3%28ENG%29-DROCK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2f7916aea02e36cd04731e033ce6df0b0a02880","infoHashBuffer":{"type":"Buffer","data":[226,247,145,106,234,2,227,108,208,71,49,224,51,206,109,240,176,160,40,128]},"announce":[],"urlList":[]}}