{"title":"Machine Man","uid":4383098,"size":376481719,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e34619ffa851f639caa3ec15347ccff18109ef32&amp;dn=Machine+Man&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gilgamesh07","files":41,"time":1220771201,"description":"By request from the forums. This torrent includes Marvel Comics&amp;#039; Machine Man v1 and v2 and X-51.\n\nMachine Man (X-51) is a fictional character created by writer/artist Jack Kirby for Marvel Comics. The character, an android, was created in 2001: A Space Odyssey #8 (July 1977), a comic written and drawn by Kirby featuring concepts based on the eponymous Stanley Kubrick film and Arthur C. Clarke novel. Shortly thereafter, Machine Man spun off into his own Kirby-created series.\n\nThis title featured Machine Man entering the mainstream Marvel Universe. Jack Kirby wrote and drew the first nine issues, which dealt with the title character&amp;#039;s status as a fugitive from the military after the death of his creator, and his first interactions with mankind. The book was cancelled at the end of 1978 with X-51 finally standing up to the military.\n\nMachine Man appeared next in a three issue story arc within the pages of The Incredible Hulk #235-237. The robot found himself battling the green giant within the suburban setting of his human friend, Dr. Peter Spaulding. By the end of the storyline, he incurred a complete system shutdown, leading to the events portrayed in his re-launched monthly series.\n\nThe title was re-launched in issue #10 after a nine-month hiatus. Status quo in the book changed with Machine Man now living amongst humanity, and dealing with his own new-found emotions. Marv Wolfman came aboard as the new writer, partnered with artist Steve Ditko, which helped set a different tone from Kirby&amp;#039;s previous stories. Issue 15 saw a new writer, Tom DeFalco, taking over the writing chores. The title lasted until issue #19, ending in February 1980.\n\nIn October 1984 - January 1985, the Machine Man title was resurrected, in a four-issue mini-series written by Tom DeFalco with art by Herb Trimpe (breakdowns only, issues #1-3) and Barry Windsor-Smith (finishes only, issues #1-3 &amp; full art for issue #4), with Windsor-Smith also coloring the entire mini-series &amp; co-plotting issue #4 with DeFalco. This series turned out to be one of the most popular of all the Machine Man titles, tying with previous continuity, but with the action set in the distant cyberpunk future of 2020, starting with Machine Man&amp;#039;s reassembly.\n\nThe mini-series was first reprinted as a 96 page trade paperback in 1988 (ISBN 0-07135-458-6), with brand new cover art by Barry Windsor-Smith.\n\nThe mini-series was republished again in 1994 as two double-size books, with the name Machine Man 2020. Characters from this alternate future have made appearances in other Marvel books, namely Arno Stark, the mercenary Iron Man 2020.\n\nIn 1990, Machine Man guest-starred in Iron Man Annual #11 (part of the &quot;Terminus Factor&quot; storyline). That story created strong hints that the 2020 Machine Man may turn out not to be the true X-51, but instead a duplicate created by Sunset Bain.\n\nIn 1999 Marvel brought the character back in a series titled X-51, The Machine Man. This series gave Machine Man a programming malfunction in that he would uncontrollably attack any mutant he came across. He was given a drastically more robotic look and his powers were vastly changed.\n\nMachine Man, whose real name is X-51, was the last of a series of sentient robots created at the Broadhurst Center for the Advancement of Mechanized Research in Central City, California, by robotics expert Dr. Abel Stack for the US Army. However, all previous 50 experimental robots went mad as they achieved sentience and became psychotic, due to a lack of identity. X-51 was the only survivor, as he was treated as a son by Stack and given a human face mask as well as being exposed to one of the monoliths from 2001. After Stack died trying to protect him, X-51 assumed the human name Aaron Stack and escaped confinement, only to be relentlessly pursued by the army. X-51 was named &quot;Mister Machine&quot; in issue #8 of the 10 issue run of 2001. When the character received his own comic, the moniker &quot;Mister Machine&quot; was never used. Also, in retelling his origin, there was no reference to the encounter with the monolith, perhaps due to licensing reasons. Kirby called Machine Man &quot;the Robot with a soul&quot;,the second Kirby creation to be so endowed. The first was a character named the Recorder, who appeared in Thor, and even looked a great deal like Machine Man. In Thor #162 he was acknowledged to be alive because he had a soul, the soul also being what Machine Man claimed he had that made him part of humanity.\n\nWhile on the run, the newly-christened Machine Man (Mister Machine in his very first appearances) initiated contact with humanity in order to better understand it.[1] After being captured and later freed, Machine Man was found by psychiatrist Peter Spaulding. He also battled Col. Krag&amp;#039;s troops.[2] Soon after that, he first encountered Curtiss Jackson.[3] Alongside the Hulk, he battled Curtiss Jackson.[4] Soon after that, he was redesigned and rebuilt by Dr. Oliver Broadhurst.[5] He then first encountered the Fantastic Four.[6] He then met mechanic &quot;Gears&quot; Garvin, and then battled Baron Brimstone.[7] He also battled Madame Menace.[8] He then first encountered Aurora, Northstar, and Sasquatch of Alpha Flight.[9] Spaulding and Garvin set-up Machine Man with a human identity as Aaron Stack, insurance investigator for the Delmar Insurance Company, but he continued having adventures as a superhero on the side.\n\nIn a meeting with the Thing of the Fantastic Four, he also first met and fell in love with another sentient robot, Jocasta. Alongside the Thing and Jocasta, he battled Ultron. However, during the battle, Machine Man witnessed the seeming destruction of Jocasta by Ultron.[10]\n\nIn more recent appearances, he has fought alongside the Avengers, which lead to the invitation to become a team reservist. Later he was captured by S.H.I.E.L.D., who wanted to use his technology to create another Deathlok. He helps the X-Men and Douglock against the villainous Red Skull, who had taken over the Helicarrier where Machine Man was held.\n\nHe helped the X-Men again against Bastion and his Sentinels. As a consequence, he was infected by Sentinel programming, assuming a more robotic look in the subsequent series X-51, and losing self-control whenever he was faced with a mutant. During this series he was on the run from Sebastian Shaw, who wants his technology for himself. Because of his new programming, while seeking aid from the Avengers, he attacks Justice and Firestar. Because of his actions against Justice and Firestar, X-51&amp;#039;s membership in the Avengers is revoked. At the end of X-51, X-51 encountered one of the monoliths and disappeared, brought into the presence of the monolith&amp;#039;s creators, the cosmic beings known as the Celestials.\n\nThanks to the scanners and the original sources.\n\nPlease seed. Please enjoy\n\n","torrent":{"xt":"urn:btih:e34619ffa851f639caa3ec15347ccff18109ef32","amp;dn":"Machine+Man","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e34619ffa851f639caa3ec15347ccff18109ef32","infoHashBuffer":{"type":"Buffer","data":[227,70,25,255,168,81,246,57,202,163,236,21,52,124,207,241,129,9,239,50]},"announce":[],"urlList":[]}}