{"title":"The.Beach.Boys.Today!.(Mono &amp; Stereo Remaster) Flac","uid":7769480,"size":426241592,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e42d207126a0a468df279e921087af817e0a5ac1&amp;dn=The.Beach.Boys.Today%21.%28Mono+%26amp%3B+Stereo+Remaster%29+Flac&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"st2580smile","files":24,"time":1351478739,"description":"1. Do You Wanna Dance? (Mono) \n2. Good to My Baby (Mono) \n3. Don't Hurt My Little Sister (Mono) \n4. When I Grow Up (To Be a Man) (Mono) \n5. Help Me, Rhonda (Mono) \n6. Dance, Dance, Dance (Mono)\n7. Please Let Me Wonder (Mono)\n8. I'm So Young (Mono)\n9. Kiss Me, Baby (Mono)\n10. She Knows Me Too Well (Mono)\n11. In the Back of My Mind (Mono) \n12. Bull Session With &quot;Big Daddy&quot; (Mono) \n13. Do You Wanna Dance? (Stereo)\n14. Good to My Baby (Stereo)\n16. When I Grow Up (To Be a Man)\n17. Help Me, Rhonda (Stereo)\n18. Dance, Dance, Dance (Stereo) \n19. Please Let Me Wonder (Stereo)\n20. I'm So Young (Stereo)\n21. Kiss Me, Baby (Stereo)\n23. In the Back of My Mind (Stereo) \n23. In the Back of My Mind (Stereo)\n24. Bull Session With &quot;Big Daddy&quot; (Mono)\n\nBy the end of a particularly stressful 1964, The Beach Boys had released four albums in twelve months, and recorded the advance singles &quot;When I Grow Up (to Be a Man)&quot; and &quot;Dance, Dance, Dance.&quot;[3] As the band leader, Brian Wilson was becoming physically and emotionally exhausted, and suffered an anxiety attack on December 23, 1964.[6]\n\nWhile the bulk of Today! was being recorded in January 1965, he informed the band that he wanted to retire from touring so he could give his full attention to creating music.[3] The band reluctantly agreed, and after a brief alliance with Glen Campbell in Wilson's place, Bruce Johnston, an ex-partner, with Terry Melcher in The Ripchords) became the Beach Boys' live bassist in April 1965.[7] Correspondingly, Wilson came to rely during 1965-66 on the group of talented session musicians known informally as the Wrecking Crew when producing backing tracks.\n\nThe album is notable for having one side of up-beat songs and a second side of melancholic ballads.[7] On the first half, &quot;Do You Wanna Dance?&quot;, &quot;When I Grow Up (to Be a Man)&quot; and &quot;Dance, Dance, Dance&quot; had all charted, and &quot;Help Me, Ronda&quot; would later be reworked to deliver the Beach Boys their second #1 hit in May.[8] The second side indicates Wilson's continuing maturation as an artist, with more sophisticated production values and deeper subject matter foreshadowing the following year's Pet Sounds.\n\nThe shift in style was welcomed by other members of the band. During the album's recording sessions, Mike Love told Melody Maker that he and the band wanted to look beyond surf rock, wanting to avoid living in the past or resting on the band's laurels.[9]\n\nThe front cover lists nine of the album's tracks, followed by &quot;plus three great new songs written by Brian Wilson.&quot; However, the remaining three tracks include a cover, &quot;I'm So Young&quot;; and the interview track &quot;Bull Session with the &quot;Big Daddy&quot;&quot;. Only &quot;In The Back of My Mind&quot; was another Brian Wilson composition.\n\nWilson later disclosed that he had begun using marijuana during December 1964 as a stress reliever, but became a regular user after he realized the profound effect it had on the way he perceived music.[10]\n\nThis was the first of several Beach Boys releases not to be issued in true stereophonic sound (Wilson preferred to work in mono exclusively for several reasons, including deafness in his right ear). Originally, Capitol issued the album in mono, as well as &quot;duophonic&quot; (a quasi-stereo format). \n\n\n\nIn 2012, a complete stereo mix of Today! was released for the first time!","torrent":{"xt":"urn:btih:e42d207126a0a468df279e921087af817e0a5ac1","amp;dn":"The.Beach.Boys.Today%21.%28Mono+%26amp%3B+Stereo+Remaster%29+Flac","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e42d207126a0a468df279e921087af817e0a5ac1","infoHashBuffer":{"type":"Buffer","data":[228,45,32,113,38,160,164,104,223,39,158,146,16,135,175,129,126,10,90,193]},"announce":[],"urlList":[]}}