{"title":"Little Big Town - Pain Killer [2014] [EAC/FLAC]","uid":11679600,"size":327172561,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e4833b4adf61cf28b04b2d77563d345ab21b3169&amp;dn=Little+Big+Town+-+Pain+Killer+%5B2014%5D+%5BEAC%2FFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"dickspic","files":18,"time":1423021795,"description":"01. Quit Breaking Up With Me (3:25)\n02. Day Drinking (2:59)\n03. Tumble &amp; Fall (4:42)\n04. Pain Killer (3:12)\n05. Girl Crush (3:13)\n06. Faster Gun (4:10)\n07. Good People (3:41)\n08. Stay All Night (2:45)\n09. Save Your Sin (2:46)\n10. Live Forever (4:14)\n11. Things You Don't Think About (3:37)\n12. Turn The Lights On (4:09)\n13. Silver &amp; Gold (3:32)\n\nLittle Big Town have long been compared to Fleetwood Mac, usually due to their lush harmonies and taste for sun-kissed melodic pop. If that analogy holds water -- and it does -- then Pain Killer is Little Big Town's Tusk, the record where the group bends, twists, and reshapes expectations of what the band can do. Coming after the sweet, shiny Tornado, the restless over-saturation in Killer is something of a shock. As pure description, the elements sound strictly mainstream: there are gnarled, distorted guitars, flirtations with electronics, thick walloping rhythms, everything that would seemingly amount to a full-fledged arena-country crossover. Instead of following a predictable pattern, the quartet embarks on a series of detours, seizing each individual track as an opportunity to veer a little further off course. While there's none of the frenzied madness that pulsates underneath Tusk, Little Big Town do slide into a bit of minor-key madness on &quot;Faster Gun&quot; and have to hold their tongue on &quot;Quit Breaking Up with Me&quot;; otherwise they'd spit out profanity. That mischievousness is intertwined with aural adventure on Pain Killer: there's a sense that the group members are goading each other on, daring their bandmates to dabble in a bit of reggae (&quot;Pain Killer&quot;), to add a whistle to a chorus (&quot;Day Drinking&quot;), to write a swaying slow dance about a &quot;Girl Crush,&quot; or to turn a bit of back-porch picking into a funky stomp (&quot;Stay All Night&quot;). Even though this record settles into a finale of three successive folk-rock tunes -- all three softly gorgeous -- it's the previous series of left-hand tours that gives Pain Killer its kick: this is the rarest thing in contemporary country, a record with an expansive world-view delivered with a kinetic kick and infallible melodies, a record that gives no indication of where it's going upon first listen but remains compelling upon further spins, after all the dazzle dissipates and Little Big Town's craft shines through","torrent":{"xt":"urn:btih:e4833b4adf61cf28b04b2d77563d345ab21b3169","amp;dn":"Little+Big+Town+-+Pain+Killer+%5B2014%5D+%5BEAC%2FFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4833b4adf61cf28b04b2d77563d345ab21b3169","infoHashBuffer":{"type":"Buffer","data":[228,131,59,74,223,97,207,40,176,75,45,119,86,61,52,90,178,27,49,105]},"announce":[],"urlList":[]}}