{"title":"Jud Suss - Jew Suss (with english subs)(1940)","uid":4680607,"size":1012125284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4a3bf207c02d89941155564c286fbcdbbb8f3e5&amp;dn=Jud+Suss+-+Jew+Suss+%28with+english+subs%29%281940%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"red_gonzo","files":1,"time":1233016704,"description":"This is the antisemitic nazi propaganda film Jud SÃƒÂ¼ÃƒÅ¸ - Jew SÃƒÂ¼ÃƒÅ¸ (1940) which was intended as an illustration of Nazi racial ideology. Based on the novel by Wilhelm Hauff it played on common prejudiced stereotypes of Jews having hooked noses and being materialistic, immoral, cunning, untrustworthy and physically unattractive. SÃƒÂ¼ÃƒÅ¸, played by Ferdinand Marian, is different from the original character because he in is fact Jewish by birth. With the exception of Oppenheimer - who shaved off his beard, cut his hair and wore &quot;Christian&quot; attire for most of the story - the actors playing male Jewish characters were made up to look unappealing and alien (non-German) to German audiences. The best example of this is Marian's co-star Werner Krauss who played the two other major Jewish characters, Rabbi Loew and Sekretar Levy. There was also a scene that purported to show Jewish religious services. The Nazi version of the story begins with the coronation of the Duke of Wurttemberg (Heinrich George), a man much beloved by his people, who swears an oath to obey the laws of the dukedom. Unfortunately, the duke does not have sufficient funds to buy coronation gifts for the duchess (Hilde von Stolz), and so he sends a loyal retainer to Frankfurt to borrow money from Oppenheimer. The law prohibits Jews from entering Wurttemberg, but the Duke provides Oppenheimer with a pass that grants him entry. Oppenheimer cuts his hair and shaves his beard, and in &quot;Christian&quot; clothes goes to Wurttemberg. A German audience in 1940 would have recognized several basic Nazi stereotypes in the portrayal of Jews and Jewish culture: There is the early scene in which Oppenheimer is shown to possess a fortune in jewels and jewelry. In another, he tells an innocent German girl that his home is &quot;the world&quot;, reflecting the Nazi stereotype of Jews as rootless wanderers in contrast to the Germans' love of their German homeland. Several conversations between Jewish characters perpetuate the Nazi line that Jews are inherently hostile to non-Jews. There is also Oppenheimer's role as a purveyor of women for the Duke, and his relentless pursuit of an &quot;Aryan&quot; woman for sexual purposes, even after she rebuffs his first attempt to seduce her. The 1940 film achieved Nazi objectives and was a great success in Germany and abroad. Within the Third Reich, it was the number one film of the 1939-1940 season, seen by over twenty million people. It was shown to SS units about to be sent against Jews, to non-Jewish populations of areas where Jews were about to be deported and to concentration camp guards. 90 min. Note: English subtitles are hardcoded into the movie.\n\nVideo specs:\nVideo codec: divx, 720x528, 1301 kbps\nAudio codec: mp3, 48kHz, Stereo\n","torrent":{"xt":"urn:btih:e4a3bf207c02d89941155564c286fbcdbbb8f3e5","amp;dn":"Jud+Suss+-+Jew+Suss+%28with+english+subs%29%281940%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4a3bf207c02d89941155564c286fbcdbbb8f3e5","infoHashBuffer":{"type":"Buffer","data":[228,163,191,32,124,2,216,153,65,21,85,100,194,134,251,205,187,184,243,229]},"announce":[],"urlList":[]}}