{"title":"Battle Engine Aquila","uid":4347240,"size":692766720,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e4cf2b79203080d7c9f5693dfdbb69b824f86ddd&amp;dn=Battle+Engine+Aquila&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"htVash","files":1,"time":1218940689,"description":"Battle Engine Aquila is a science fiction game in which you pilot the Battle Engine for the Forseti military in their wars against the Muspell to decide who will rule what&amp;#039;s left of the world. Although receiving little attention from the public, Battle Engine Aquila on the whole received good reviews from critics.\n\nEach mission takes place on an island with the two armies facing off against each other. The player&amp;#039;s role in the game is to lend support to your army, by taking out threats, punching holes in the enemy defence and completing specific mission objectives.\n\nThe Battle Engine has two modes of operation: &quot;Jet mode&quot; allows the Battle Engine to fly for a limited time, &quot;Walker mode&quot; transforms the Battle Engine into a mech-like walking tank. When the Battle Engine is in Walker Mode, its weapons are considerably stronger than when it is in Jet Mode and it has energy shielding (making it harder to be destroyed) but is MUCH slower than jet mode.\n\nThere are, by the end, 4 different types of Battle Engine that one may choose to pilot: Pulsar, Blazer, Lancer and Sniper. In earlier levels only the Prototype Battle Engine is available, which is essentially the same as the Pulsar ship but lacking the Grenade weapon that is utilised when the Battle Engine is not airborne. The Sniper Battle Engine only has 1 airborne weapon (the others have two each), the Vulcan Cannon, but it is the only ship that can engage a stealth mode, rendering it invisible. This capability drains the energy of the Battle Engine, as if it were flying.","torrent":{"xt":"urn:btih:e4cf2b79203080d7c9f5693dfdbb69b824f86ddd","amp;dn":"Battle+Engine+Aquila","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4cf2b79203080d7c9f5693dfdbb69b824f86ddd","infoHashBuffer":{"type":"Buffer","data":[228,207,43,121,32,48,128,215,201,245,105,61,253,187,105,184,36,248,109,221]},"announce":[],"urlList":[]}}