{"title":"Dresssed.To.Kill.1980.Criterion.1080p.BluRay.x264.DTS-SARTRE","uid":15019623,"size":5721870244,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:e52d9d952cb0d3ceac37911100b3dfe03ab3b7a1&amp;dn=Dresssed.To.Kill.1980.Criterion.1080p.BluRay.x264.DTS-SARTRE&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sartre7","files":22,"time":1466464191,"description":"One of Brian De Palma's most divisive films, Dressed to Kill is a spine-chilling Alfred Hitchcock update for the late 1970s. Sexually frustrated wife and mother Kate Miller (Angie Dickinson) visits her New York psychiatrist, Dr. Elliott (Michael Caine), to complain about her unfulfilling erotic life. When she then goes to meet her husband at a museum, she meets an anonymous man whom she follows out to a cab. After an afternoon of satisfying sex, Kate discovers that the man has a venereal disease, but that information becomes a moot point when a razor-wielding blonde woman slashes Kate to ribbons in the elevator of the man's building. Blonde prostitute Liz (Nancy Allen), who caught a glimpse of the murderer, becomes both the prime suspect and the killer's next target. With the police less than willing to believe her story, Liz joins forces with Kate's son Peter (Keith Gordon) to get the psychopath themselves.\r\n\r\n\r\n\r\nSTARS.........: Michael Caine, Angie Dickinson, Nancy Allen \r\nDIRECTOR......: Brian De Palma\r\nWRITERS.......: Brian De Palma\r\nGENRE.........: Mystery | Thriller\r\nRATING........: 7.1/10   23,537 votes\r\nIMDB link.....: http://www.imdb.com/title/tt0080661\r\nRUNTIME.......: 1h 45mn\r\nSIZE..........: 4.42GB\r\nVIDEO CODEC...: x264 (  )\r\nRESOLUTION....: 1920x812\r\nBITRATE.......: 5000 Kbps\r\nFRAMERATE.....: 23.976 fps\r\nAUDIO 1.......: English DTS 5.1 768 Kbps (MGM Blu Ray)\r\nAUDIO 2.......: English DTS 1.0 255 Kbps (Criterion Blu Ray)\r\nSOURCE........: Criterion Blu Ray\r\nSUBTITLES.....: ENG, ENG-SDH, BRA   \r\nCHAPTERS......: Yes\r\nENCODED BY....: Sartre\r\nENCODE DATE...: 2016-06-18\r\n\r\n\r\n\r\nCriterion Blu Ray Extras\r\n------------------------\r\n\r\n\r\nBrian De Palma  - The director talking with filmmaker Noah Baumbach about his creative style, influences, anecdotes from the set, the film's reception and thoughts on the plot's themes (19 min). \r\n\r\nNancy Allen - A conversation with star Nancy Allen reminiscing on her time on the set, her character and working with others (16 min). \r\n\r\nGeorge Litto - talking about his collaboration with De Palma and his love of movies (12 min). \r\n\r\nPino Donaggio - The composer shares his collaboration experience with the director and creative method for composing music (16 min). \r\n\r\nVictoria Lynn Johnson - 1978 Penthouse Pet of the Year  talks about her career and her involvement in the movie as a body double (9 min). \r\n\r\nStephen Sayadian - The photographic art director talks about his career, the evolution of his creative style and how that eventually lead to making poster artwork, especially for horror movies and this film (10 min).\r\n\r\nDefying Categories - A tribute of sorts to the late cinematographer Ralf Bode with appreciative thoughts by filmmaker Michael Apted and memories from experimental video artist Peer Bode. (11 min)\r\n\r\nThe Making of Dressed to Kill - An insightful and entertaining retrospective with cast and crew interviews, except Michael Caine never makes an appearance. It's a very enjoyable listen as everyone reflects on the production, story and working on this particular set, with De Palma and Dickinson being the standouts. (44 min)\r\n\r\nSlashing Dressed to Kill - Interviews provide a brief discussion on the cuts and editing done to receive an R-rating from the MPAA. (10 min)\r\n\r\nAn Appreciation by Keith Gordon - Actor turned director expresses his admiration by offering his own filmmaker's analysis of the movie. (6 min)\r\n\r\nVersion Comparison - An amusing comparison between the unrated and R-rated versions of the film as well as a look at the heavily edited cut for network television. (5 min)\r\n\r\nStoryboards - Original storyboards for the film. (3 min)\r\n\r\nTrailer (HD) - The original theatrical trailer. (2 min)","torrent":{"xt":"urn:btih:e52d9d952cb0d3ceac37911100b3dfe03ab3b7a1","amp;dn":"Dresssed.To.Kill.1980.Criterion.1080p.BluRay.x264.DTS-SARTRE","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e52d9d952cb0d3ceac37911100b3dfe03ab3b7a1","infoHashBuffer":{"type":"Buffer","data":[229,45,157,149,44,176,211,206,172,55,145,17,0,179,223,224,58,179,183,161]},"announce":[],"urlList":[]}}