{"title":"Heat Sealing Technology and Engineering for Packaging","uid":15544208,"size":20076233,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e547c82463c99f9a101fc3ba7f4315db96f8047f&amp;dn=Heat+Sealing+Technology+and+Engineering+for+Packaging&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"clouderone","files":1,"time":1470955197,"description":"Heat Sealing Technology and Engineering for Packaging - Principles and Applications - Kazuo Hishinuma (DEStech, 2009).pdf\r\n\r\nThis book is the first to cover all phases of heat sealing as it relates to packaging. Beginning with the basics of heat-sealing processes and thermoplastic materials, the book explains, with numerous formulas and original experimental data, all the key parameters. With this information, the author presents new ways to improve the reliability of heat sealing—and the quality of heat-sealed packaging. Novel monitoring techniques are provided that enable packaging engineers to better control parameters that lead to safer, more effective seals in pouches, bags and cups, and with different materials, including laminates. Specifically, the author shows how important it is to have accurate measurement of the melting surface. The book explains techniques for carrying out such measurements and demonstrates how they lead to better heat seal process control. These techniques, along with novel ways of using the peel seal and tear seal, are explained in practical terms, to assist engineers to troubleshoot and eliminate problems encountered in heat sealing, e.g., overheating, polyball, and packaging failure. Hundreds of illustrations and numerous case studies support the practical information in this book. The technical data found in this resource is a necessary supplement to JIS and ASTM standards","torrent":{"xt":"urn:btih:e547c82463c99f9a101fc3ba7f4315db96f8047f","amp;dn":"Heat+Sealing+Technology+and+Engineering+for+Packaging","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e547c82463c99f9a101fc3ba7f4315db96f8047f","infoHashBuffer":{"type":"Buffer","data":[229,71,200,36,99,201,159,154,16,31,195,186,127,67,21,219,150,248,4,127]},"announce":[],"urlList":[]}}