{"title":"1974 -- Lou Bond (2010 Remastered Reissue) [MP3]","uid":7285343,"size":81833993,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e56a2af69a990a759bb74296e2416deaa6853f57&amp;dn=1974+--+Lou+Bond+%282010+Remastered+Reissue%29+%5BMP3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":-1,"time":1337565898,"description":"Bio from Stax:\n- Not many details about Lou Bond. His only We-Produce/Stax LP is really fascinating and full of atmosphere with his backings a la Isaac Hayes. A rare and underrated late Stax production.\n\n&quot;Lou Bond is not to be categorized he is like no other artist in the business. Past or present.&quot; Thus reads the cover blurb on Lou Bond's eponymous 1974 LP for the Stax imprint We Produce. Truer words have seldom, if ever, appeared on an album cover. Bond, whose politically conscious, freestyle lyrics brand him a utopian jazzman, was backed on his one and only recording by both &quot;the horns of South Memphis&quot; (whoever they were) and the Memphis Symphony Orchestra's string section (ditto). It is alternately spare and overproduced, and is far too eclectic to ever attract the ears of the masses. It's a collection of headphones-only musicianship and new age field hollers. And though it is easy to see why this Stax artist fell between the cracks of music history, for those who have acquired the taste, Lou Bond is a real treat.\n\nHow can anyone resist Bond's raspy answer to Jackie Wilson's falsetto, married to Grand Master Flash-style flows like &quot;They're fussin' 'bout the bussing,&quot; with a straight face? Bond the equitable philosopher warns the snobs of the world to get their noses out of the air, because the air is polluted. His songs are unique, to say the least. They are, perhaps, sometimes unintentionally humorous, but more often than not they are profoundly sweet and addictive. Lou Bond will make a rare appearance at the opening reception for David Julian Leonard's photo exhibition on Friday, December 1st, at photogallery memphis, 383 South Main Street.&quot;\n\nTrack Listing:\n01 Lucky Me\n02 Why Must Our Eyes Always Be Turned Backwards\n03 To The Establishment\n04 Let Me Into Your Life\n05 That's The Way I've Always Heard It Should Be\n06 Come On Snob","torrent":{"xt":"urn:btih:e56a2af69a990a759bb74296e2416deaa6853f57","amp;dn":"1974+--+Lou+Bond+%282010+Remastered+Reissue%29+%5BMP3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56a2af69a990a759bb74296e2416deaa6853f57","infoHashBuffer":{"type":"Buffer","data":[229,106,42,246,154,153,10,117,155,183,66,150,226,65,109,234,166,133,63,87]},"announce":[],"urlList":[]}}