{"title":"Steve Winwood - Holding On [promo].VOB","uid":10726513,"size":303917056,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:e56f4c23f4cef65b56dff09eb634f6e2d0675d4d&amp;dn=Steve+Winwood+-+Holding+On+%5Bpromo%5D.VOB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"SgtRlee","files":-1,"time":1407573639,"description":"Steve Winwood - Holding On [promo].VOB\n\n\nHQ very rare promo music video from a promo DVD. &quot;Holding On&quot; is a 1988 single by Steve Winwood from the album Roll with It. The song was written by Winwood along with Will Jennings. &quot;Holding On&quot; was the last of four number ones for Winwood on the Adult Contemporary chart. The single went to number one for two weeks and peaked at number eleven on the Billboard Hot 100.\n\nThe music video (directed by David Fincher) opens with an unidentified photographer taking out camera equipment. The rest of the video is shown in motion, with flashes indicating candid snapshots of various people from different walks of life: people walking on the street, patrons of a diner, women in formal dress, a dinner suggesting an underworld boss and his girlfriend (although they pose for the camera, others cover their faces or move to leave the table), a soldier just home from the war (presumed to be World War II) embracing his son, and an elderly couple in high spirits on a park bench.\n\nInterspersed with these images are occasional scenes of Winwood playing solitaire in his room, then going out for a walk, having his shoes shined, having coffee at a diner, then finally returning to his room and lying on his bed as the sun shines through his window.\n\n\nStephen Lawrence &quot;Steve&quot; Winwood (born 12 May 1948) is an English musician whose genres include rock, blue-eyed soul, rhythm and blues, blues rock, pop rock, and jazz. A multi-instrumentalist, he can play keyboards, bass guitar, drums, guitar, mandolin, violin, and other strings.\n\nWinwood was a key member of The Spencer Davis Group, Traffic, Blind Faith and Go. He also had a successful solo career with hits including &quot;Valerie&quot;, &quot;Back in the High Life Again&quot; and two US Billboard Hot 100 number ones; &quot;Higher Love&quot; and &quot;Roll With It&quot;. He was inducted into the Rock and Roll Hall of Fame as a member of Traffic in 2004.\n\nIn 2005 Winwood was honoured as a BMI Icon at the annual BMI London Awards for his &quot;enduring influence on generations of music makers.&quot; In 2008, Rolling Stone magazine ranked Winwood #33 in its 100 Greatest Singers of All Time. Winwood has won two Grammy Awards.\n(video does not have any logos)\n\n\n    &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Holding_On_(Steve_Winwood_song)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Holding_On_(Steve_Winwood_song)&lt;/a&gt; \n      &lt;a href=&quot;\nhttp://bayimg.com/mAPJiAaFl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bayimg.com/mAPJiAaFl&lt;/a&gt; \n   \n\n\nFile properties info using Media Player Classic:     \n   Video: MPEG2 Video 720x480 (4:3) 29.97fps 8000kbps\n   Audio: LPCM 48000Hz stereo 1536kbps [DVD, 16 bit]\n   Duration: 00:04:11\n\n\n\n\n*Install the &quot;Media Player Classic&quot; player if you can't play this file, \nor for better visual and audio quality playback of all your videos. \nIt's 100% free to download and use. Latest stable build is v1.7.6\n\n*Media Player Classic Home Cinema*         &lt;a href=&quot;\nhttp://mpc-hc.sourceforge.net/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://mpc-hc.sourceforge.net/&lt;/a&gt; \n\nSgtRlee (Sgt.R.Lee) \n\t","torrent":{"xt":"urn:btih:e56f4c23f4cef65b56dff09eb634f6e2d0675d4d","amp;dn":"Steve+Winwood+-+Holding+On+%5Bpromo%5D.VOB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e56f4c23f4cef65b56dff09eb634f6e2d0675d4d","infoHashBuffer":{"type":"Buffer","data":[229,111,76,35,244,206,246,91,86,223,240,158,182,52,246,226,208,103,93,77]},"announce":[],"urlList":[]}}