{"title":"Thailand - Lessons in Terror (2008) [Islam]","uid":10592641,"size":182812672,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e573f7c3a38f9e425290dfce6f78b2705250b75e&amp;dn=Thailand+-+Lessons+in+Terror+%282008%29+%5BIslam%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Kidon01","files":1,"time":1405816724,"description":"UK Channel 4. Unreported World S16E08 - Thailand Lessons in Terror (5 December 2008)\n\nThis week's Unreported World reveals how just several hours drive away from the tourist hotspot of Phuket, Islamic extremists are waging a murderous campaign against Buddhist teachers in a largely hidden conflict which has turned hundreds of primary schools into bloody battlegrounds.\n\nSouthern Thailand is home to one of the most violent conflicts in South East Asia, with more than three thousand people killed since 2004 out of a population of just two million. Armed Islamic Jihadis are targeting state schools because they regard the education system as an attempt by kuffar to impose Buddhist Thai culture on Muslims. They demand an independent Sharia ruled Muslim state in Thailand. Human Rights Watch describes the violent campaign, which also targets doctors and monks, as ethnic cleansing.\n\nReporter Seyi Rhodes and Producer Andy Wells begin their journey at the home of 36-year-old teacher Deeranan Sairee in Yala, one of the most dangerous areas in the region. Many areas are under curfew and attacks by insurgents, including road-side bombings, are a daily occurrence.\n\nThe insurgents have killed more than 100 teachers and forced the closure of more than 900 state schools, following a sustained campaign of bombing and shootings. Teachers now routinely carry pistols to protect themselves.\n\nFor more information:\njihadwatchDOTorg/category/thailand","torrent":{"xt":"urn:btih:e573f7c3a38f9e425290dfce6f78b2705250b75e","amp;dn":"Thailand+-+Lessons+in+Terror+%282008%29+%5BIslam%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e573f7c3a38f9e425290dfce6f78b2705250b75e","infoHashBuffer":{"type":"Buffer","data":[229,115,247,195,163,143,158,66,82,144,223,206,111,120,178,112,82,80,183,94]},"announce":[],"urlList":[]}}