{"title":"Electricity And Magnetism Stop Faking It! Finally Understanding","uid":6437775,"size":13354804,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e65a3337756bebac7d4177311f44a245ca7a42ac&amp;dn=Electricity+And+Magnetism+Stop+Faking+It%21+Finally+Understanding+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"daemonx0x","files":-1,"time":1306853621,"description":"Electricity And Magnetism Stop Faking It! Finally Understanding Science So You Can Teach It-viny\n\nShocked by static? Mixed up about magnets? Curious about currents? This book will help you get beyond memorizing electricity-related formulas, rules, and procedures so you can understand the topic at a deep level deep enough to teach it with confidence and comfort. By covering the basics of static electricity, current electricity, and magnetism, the book develops a scientific model showing that electricity and magnetism are really the same phenomenon in different forms. A bonus feature: access to interactive software that you can download from the NSTA Web site.\n\nThe software will help you investigate electrical circuits from simple to complex without having to buy a lot of expensive materials (or risking electrocution!). Electricity and Magnetism is the fifth title in the award-winning NSTA Press Stop Faking It! Series. As author Bill Robertson writes, The book you have in your hands is not a textbook. It is, however, designed to help you get science at a level you never thought possible, and also to bring you to the point where tackling more traditional science resources won t be a terrifying, lump-in-your-throat, I-don t-think-I ll-survive experience. Robertson serves as your friendly guide, one with a comforting knack for anticipating fears, meeting information needs, and entertaining as he edifies.","torrent":{"xt":"urn:btih:e65a3337756bebac7d4177311f44a245ca7a42ac","amp;dn":"Electricity+And+Magnetism+Stop+Faking+It%21+Finally+Understanding+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e65a3337756bebac7d4177311f44a245ca7a42ac","infoHashBuffer":{"type":"Buffer","data":[230,90,51,55,117,107,235,172,125,65,119,49,31,68,162,69,202,122,66,172]},"announce":[],"urlList":[]}}