{"title":"Comfort.Keys.Pro.v5.1.2.Portable","uid":7026584,"size":6306868,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e6665634dff80b49180f83859f9195412cd23c51&amp;dn=Comfort.Keys.Pro.v5.1.2.Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Anacondaz","files":-1,"time":1329036887,"description":"\n\nComfort Keys Pro 5.1.2.0 Multilanguage (+Portable)\n\n\nDiscover how to perform any routine action in one click!\n\n\nStop typing the same text over and over again! Now you don't need to go through numerous menus to find the necessary program or web page. With this new automation tool you can configure hotkeys for quick execution of all your actions - just like real pro's do. With Comfort Keys, you considerably decrease the Repetitive Strain Injury (RSI) risk caused by frequently pressing mouse buttons and moving hands from the mouse to the keyboard and back. Shortcut keys configured in the program work in all MicrosoftÃ‚Â® Windows applications. While specifying shortcut keys, you can use any keys including NumLock and CapsLock.\n\nThe built-in on-screen keyboard will help you to select a comfortable keyboard combination and afterwards this on-screen keyboard will show you what shortcut keys are available for you. It is easy to use Comfort Keys in workgroups. To do it, just save the shortcut file to a network resource and configure it to be used on every workstation. It is completely compatible with MicrosoftÃ‚Â® Windows Vista, XP and 2000.\n\nComfort Keys will help you to:\n- Launch the necessary programs and open web pages by pressing a single hotkey.\n- Insert predefined texts (email templates, signatures, passwords, greetings, phone numbers, addresses, etc.) using hotkeys or the built-in template manager.\n- Change the language and case of the typed text.\n- Control the sound volume in a quick and convenient manner.\n- Record key press sequences (macros) and play them back as many times as you need.\n- Block some keys or simulate the press of a specific key when another one is pressed.\n- And much more...\n\nFeatures\n- Multilingual interface\n- Themes: an ability to configure interface themes\n- Sounds: an ability to assign sounds to program events\n- Colors: an ability to configure theme colors\n- Support: priority technical support\n- Upgrade: notifications of every Major Upgrade and the new registration key, free of charge\n- Initial setup wizard\n- Exceptions: an ability to specify applications in which Comfort Keys will be disabled\n- Quick start from the Windows context menu\n- Standard hotkey sets\n- Advanced task switching window\n- Process history window\n\nOn-Screen Keyboard\n- Gestures function support (fast entering of capital letters, spaces, etc.)\n- Customizing: an ability to customize the keyboard layout and create your own keyboard types\n- The number of available types of the on-screen keyboards 20 35+\n- Word auto-complete function\n- A floating window for starting the on-screen keyboard\n- An icon for starting the keyboard next to the text cursor\n- Advanced language bar 2 languages\n- Application shortcut icons that are shown on the on-screen keyboard\n- Development: support of programmatic control of the on-screen keyboard\n- Special characters: an ability to display symbols accessible via Ctrl and Ctrl+Shift\n- Logon: An ability to show the on-screen keyboard before logging into the system\n- Auto-repeat function\n\nClipboard Manager\n- The maximum number of fragments stored in the clipboard history 100 No Limit\n- Storing: An ability to configure the clipboard data directory\n- Data encryption\n- A preview area for clipboard history fragments\n- Formats: an ability to paste the contents of the clipboard in a predefined format\n- Filtering: an ability to filter fragments of the clipboard manager\n- Favorites: an ability to configure the favorites fragments of the clipboard manager\n\nTyping assistant\n- The number of simultaneously supported switchable languages 2 No Limit\n- Text templates: an ability to work with text templates\n- Standard template sets\n- Word auto-complete function\n- An icon with the Caps Lock status and the selected language next to the text cursor\n- Advanced language bar\n- Text template encryption\n\n\n\n\n\n\n\n-----------------------------------------------------------------------------------\n-----------------------------------------------------------------------------------\n\nTo know , learn and get all things come and join here\nLOTS AND LOTS OF GREAT THINGS ARE HERE\n                                                                  &lt;a href=&quot;\nhttps://forum.suprbay.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org&lt;/a&gt;\n\nFor reporting bad or suspicious torrents                                                                                                                                                          &lt;a href=&quot;\nhttps://forum.suprbay.org/forumdisplay.php?fid=29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://forum.suprbay.org/forumdisplay.php?fid=29&lt;/a&gt;\n\nFor my 1500+ Torrents                                                                                                                                                            &lt;a href=&quot;\nhttp://thepiratebay.se/user/Anacondaz/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/Anacondaz/&lt;/a&gt;\n\n\t","torrent":{"xt":"urn:btih:e6665634dff80b49180f83859f9195412cd23c51","amp;dn":"Comfort.Keys.Pro.v5.1.2.Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6665634dff80b49180f83859f9195412cd23c51","infoHashBuffer":{"type":"Buffer","data":[230,102,86,52,223,248,11,73,24,15,131,133,159,145,149,65,44,210,60,81]},"announce":[],"urlList":[]}}