{"title":"The Art of Emily the Strange","uid":8658582,"size":124430234,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:e6cce58fb3bfcc91438129c75e428ab482a91908&amp;dn=The+Art+of+Emily+the+Strange&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LeonardTSpock","files":-1,"time":1373269922,"description":"'The Art of Emily the Strange'\n\nDark Horse Comics, 2009, 120 pages\n\nBy Rob Reger, Buzz Parker, Cosmic Debris\n\nIn her fifteen-plus years in existence, oddballs, outcasts, and art freaks the world over have grown to know and love a strange young girl named Emily. With roots in the punk-rock art scene of Santa Cruz skate culture and an early appeal to European trend spotters, the iconic image of Emily and her philosophy of devout individualism have become deeply rooted in global culture. The Art of Emily Volume One is the first-ever collection of images showing the wide and inspired range of artistic styles and mediums that have been used to create the world of Emily the Strange. From skateboard stickers to custom rock-and-roll album art, large-scale psychedelic paintings, and insanely intricate Mongolian paper cutting, the fantastic and artful imaginings of Rob Reger, Buzz Parker, and a staggeringly talented array of collaborators will give insight and inspiration to any Emily fan.\n\nEmily the Strange is an advertising mascot character by Rob Reger for his company Cosmic Debris Etc. Inc.\n\nShe first appeared on a sticker distributed at concerts, record stores and skate shops to promote Cosmic Debris, the clothing line founded by artist and skateboarder Rob Reger, racing car driver Matt Reed and Nathan Carrico, who designed Emily in 1991 for Santa Cruz Skateboards in Santa Cruz, California.\n\nCosmic Debris has opened four Emily the Strange flagship stores to date (Taiwan, Taipei, Hong Kong and Greece), with plans to open Emily the Strange retail stores in the Americas in the next two years.","torrent":{"xt":"urn:btih:e6cce58fb3bfcc91438129c75e428ab482a91908","amp;dn":"The+Art+of+Emily+the+Strange","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6cce58fb3bfcc91438129c75e428ab482a91908","infoHashBuffer":{"type":"Buffer","data":[230,204,229,143,179,191,204,145,67,129,41,199,94,66,138,180,130,169,25,8]},"announce":[],"urlList":[]}}