{"title":"Hermann Hesse - Glass Bead Game (doxyerfre)","uid":5706863,"size":2202081,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e6db557204bd1f856b0bac17f0407c658b6e15df&amp;dn=Hermann+Hesse+-+Glass+Bead+Game+%28doxyerfre%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":null,"files":1,"time":1279728258,"description":"E-Book PDF 2.1MB\n\nBy Hermann Hesse\n\nGlass Bead Game is the most complex of Hesse's work. I think the mistake people make is taking the characters, plot, setting in literal terms. Ultimately, Glass Bead Game is best appreciated as metaphor -- an elaborate, detail-rich metaphor of the unconscious struggle with the world of conception and idea, and the world of actual experience. It is also revealing to look into the book's subtleties. Hesse doesn't come out directly and tell us what he's doing, he intends for us to earn it. We must remember that the book is about the famous Joseph Knecht (the perspective implies a future wholly influenced by him). The setting is an intellectual community, reaching it's zenith of thought. Castalia is presented in overwhelmingly positive terms--a harmonized utopia of art, music, and science. The focus on such an idealistic setting is often misplaced; rather, the focus should be on Joseph Knecht's famous act: rejecting, or more accurately--fulfilling the role of Castalia, and leaving the world of symbols, thoughts, and dualistic study of the external, and experiencing the world, free of the dependence of thought. This one act, seemingly has enormous consequences. We must take a step back and imagine the repercussions: a world thoroughly free of the domination of conception, both in the lives of individuals and society in general; a world which is constantly taking creative leaps of faith, and constantly becoming rather than mere witnessing or studying. Looked at in metaphorical terms, the Glass Bead Game is not a piece of literature, but rather a spiritual road map intended to influence well into the future. It is also worth noting that this is the last major work of Hesse. Is it quite easy to draw the comparison between Hesse and Knecht. The Glass Bead Game was that final leap from thought into the calm, engulfing waters of sheer being. Hesse went to the forest never to come back, but he left this special little book as a helpful guide.\n\nA Review","torrent":{"xt":"urn:btih:e6db557204bd1f856b0bac17f0407c658b6e15df","amp;dn":"Hermann+Hesse+-+Glass+Bead+Game+%28doxyerfre%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6db557204bd1f856b0bac17f0407c658b6e15df","infoHashBuffer":{"type":"Buffer","data":[230,219,85,114,4,189,31,133,107,11,172,23,240,64,124,101,139,110,21,223]},"announce":[],"urlList":[]}}