{"title":"Fahrenheit 9/11 by Michael Moore","uid":4442461,"size":733472768,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e6fc79e137cd456014e2f223a1e7270e14ffc576&amp;dn=Fahrenheit+9%2F11+by+Michael+Moore&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"FreedomLover","files":1,"time":1223884840,"description":"This film by Michael Moore exposes the connections between the Bush clan, the Bin Laden family, and oil-rich Saudi Arabia. Was 9/11 an inside job? Unlikely, although the CIA is capable of any outrage against humanity it probably did not orchestrate 9/11. However, there is no doubt that there was a massive cover-up in the wake of the attacks on the World Trade Center. And they provided this gung-ho administration with a good excuse to attack Afghanistan and Iraq subsequently dividing the spoils between its campaign sponsors, the industrial/military/oil complex, which de facto rules America these days. The saddest thing about the 9/11 attacks is that the USA has now virtually suspended its constitution through the Patriot Act and other fascist legislation and has completely lost its reputation abroad. There is no doubt that America is slowly becoming a corporate dictatorship under the thin veil of democratic rhetoric propagated by the corporate media (FOX, CNN, Clear Channel, etc.) who have completely given up all journalistic pretense at objective reporting for corporate dribble and brainwashing.\n\nIf you have any doubt about America's descent into fascism, read American journalist Amy Goodman's book: THE EXCEPTION TO THE RULERS or visit her website: http://www.democracynow.org/ or other progressive websites such as http://www.commondreams.org/ or http://www.projectcensored.org/\n\n\n\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::\n:::::::::Please note this file is in ITALIAN ! ! !::::::::::::::::::::::::\n:::::::::Please hunt the net for an English file if required! Sorry.::::::\n::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::::","torrent":{"xt":"urn:btih:e6fc79e137cd456014e2f223a1e7270e14ffc576","amp;dn":"Fahrenheit+9%2F11+by+Michael+Moore","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6fc79e137cd456014e2f223a1e7270e14ffc576","infoHashBuffer":{"type":"Buffer","data":[230,252,121,225,55,205,69,96,20,226,242,35,161,231,39,14,20,255,197,118]},"announce":[],"urlList":[]}}