{"title":"Matt_Richards-Deerskins_into_Buckskins-How_to_Tan-PDF","uid":5486487,"size":56707572,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:e7306407537ff925f2ce504ca591b09eb5195b96&amp;dn=Matt_Richards-Deerskins_into_Buckskins-How_to_Tan-PDF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"das_wookie","files":-1,"time":1270747532,"description":"Wanting to be a responsible hunter and &quot;use all which is provided&quot; from my kill, I decided I had to learn how to tan the hides.  Searching the web high and low for info, I finally stumbled upon a page from a gal in O' Canada who detailed her process of tanning a hide.  She had used this book to learn from and documented her process following it's steps.  Having consumed all the info on her site, I decided I too wanted to read the book.  It was EXACTLY what I needed and instilled confidence in me to set forth on my journey to learn how to create buckskins.\n\nI've since endeavored to not only tan all of the hides from MY kills, but while also teaching others the art of deer hunting, I make sure that they too respect the animal killed, and use all which their kills provide.  I've since taught four others how to shoot, field dress, feed the field dressings to local wildlife, skin the kill, break down the animal to &quot;just meat&quot; in the cooler, freeze the bones for my dogs, and finally... tan the hide.  Nothing goes to waste and ALL of the deer is used, they way it should be done!\n\nThis book is hands down the best resource I ever found on how to learn the tanning process, and while it can be a bit laborious and physically exhausting at times, it's VERY much worth it!  If you hunt, you need to learn to make buckskin, and this book will show you everything you need to know on how to do it!  Respect your kill, not just with a clean shot, but by using everything you can from your kill!\n\nSkinned:   &lt;a href=&quot; http://bayimg.com/pAldeAacN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/pAldeAacN&lt;/a&gt; \nLime Soak: &lt;a href=&quot; http://bayimg.com/pALdLAaCn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/pALdLAaCn&lt;/a&gt; \nSoaked:    &lt;a href=&quot; http://bayimg.com/PAldOaAcN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/PAldOaAcN&lt;/a&gt; \nScrapping: &lt;a href=&quot; http://bayimg.com/PALdhAACn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/PALdhAACn&lt;/a&gt; \nAftermath: &lt;a href=&quot; http://bayimg.com/PalDpaACN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/PalDpaACN&lt;/a&gt; \nScrapped:  &lt;a href=&quot; http://bayimg.com/PaldjaACN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/PaldjaACN&lt;/a&gt; \nRinse:     &lt;a href=&quot; http://bayimg.com/AaLEdaaCn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/AaLEdaaCn&lt;/a&gt; \nWring1:    &lt;a href=&quot; http://bayimg.com/AaLeiAACN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/AaLeiAACN&lt;/a&gt; \nWring2:    &lt;a href=&quot; http://bayimg.com/aaLELaACn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/aaLELaACn&lt;/a&gt; \nBraining1: &lt;a href=&quot; http://bayimg.com/AalEmaaCN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/AalEmaaCN&lt;/a&gt; \nBraining2: &lt;a href=&quot; http://bayimg.com/aAlEOAACn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/aAlEOAACn&lt;/a&gt; \nBraining3: &lt;a href=&quot; http://bayimg.com/bAlEAAAcn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/bAlEAAAcn&lt;/a&gt; \nBraining4: &lt;a href=&quot; http://bayimg.com/balEBaAcn&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/balEBaAcn&lt;/a&gt; \nBraining5: &lt;a href=&quot; http://bayimg.com/BalEEaaCN&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://bayimg.com/BalEEaaCN&lt;/a&gt; \n\n\nSorry, no photos of the second wring out, stretching, drying, or somoking process...  but that's the basic routine.\n\nYOU CAN DO THIS TOO!  :)\n\n----------------------------------------------------------------------\n\nDetails on the book are as follows from:\nhttp://www.bookfinder.com/dir/i/Deerskins_Into_Buckskins-How_To_Tan_With_Brains_Soap_Or_Eggs/096586720X/\n\nISBN\t096586720X / 9780965867207 / 0-9658672-0-X\nPublisher\tPartners Pub Group\nLanguage\tEnglish\nEdition\tSoftcover\nList price\t$14.95\n\nOver 165 photos and illustrations bring you step by step from raw skin to velvety soft buckskin and then show you how to create beautiful garments and useful goods. You will also learn how to make rawhide and hide glue, tan in a wilderness setting and the best way to skin. History, humor and science make Deerskins into Buckskins not only practical, but fun!\n\nDesigned to be easily understood by the beginner yet rich with details for the experienced, this book teaches tanning as a natural process. No chemicals are needed! All the tools and materials are waiting around your home and land. While the tools are simple, having a great method is the key.\n\nThis book has that method (see the following reviews).\n\nBuckskin is durable, soft, washable and warm. A hand-made garment for people all over the world for millennia, it breathes and stretches with your body, cuts the wind and won't tear on briars. It is excellent to wear hiking, hunting or around the house. Plus you don't need to hunt. Deerskins that would otherwise go to waste are available every fall from neighbors, locals and butcher shops.\n\n----------------------------------------------------------------------\n\nReviews pulled from Amazon for book:\n...easy to understand and useful if you're interested in preserving and using your deer hide to make a pair of trousers or leather gloves. Get started, buy a copy. Enjoy. -- Cody Beers, Wyoming Wildlife, March 1998\n\n...proves to be a comprehensive guide to natural leather making. -- American Library Association, BOOKLIST, December 15, 1997\n\nBy far the best book on the subject. -- Carla Emery, author, The Encyclopedia of Country Living\n\nGet this book. You'll be amazed at the unexpected ease of the process and more importantly your results. -- Jim Riggs, author, Blue Mountain Buckskin\n\nI have successfully completed dozens of buckskins under the mentoring of numerous experts. It is obvious that Matt has created a 'quantum leap' in the art. His process dramatically reduces the time and work, resulting in the nicest buckskin I have ever made. -- Jeff Damm, engineer and backyard tanner\n\nIf a guy couldn't tan a hide with this he should stay out of the woods! -- Ted Fry, Raptor Archery\n\nInformation and practical advice you won't find in any other book. Easy to read yet amazingly thorough, with just a touch of twisted humor in the right places. A terrific resource! -- Susan Jennys, Muzzleblasts, June 1998\n\nMatt Richards brings tanning to a level of simplicity that is accessible to anyone. Experimentation combined with years of tanning for a living and a thorough study of leather chemistry, has resulted in a simple method that produces excellent results. -- American Survival Guide, January 1998\n\nThe authors intimate understanding of deerskins, tools, processes, and problems bears witness to a tremendous depth of knowledge about his craft. Deerskins into Buckskins is a highly recommendable work....this book deserves a place on your bookshelf -- Scott Jones, Bulletin of Primitive Technology, spring 1998\n\nBuckskin is durable, soft, washable and warm. A hand-made garment for people all over the world for millennia, it breathes and stretches with your body, cuts the wind and won't tear on briars. It is excellent to wear hiking, hunting or around the house. Plus you don't need to hunt. Deerskins that would otherwise go to waste are available every fall from neighbors, locals and butcher shops\n\n----------------------------------------------------------------------","torrent":{"xt":"urn:btih:e7306407537ff925f2ce504ca591b09eb5195b96","amp;dn":"Matt_Richards-Deerskins_into_Buckskins-How_to_Tan-PDF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7306407537ff925f2ce504ca591b09eb5195b96","infoHashBuffer":{"type":"Buffer","data":[231,48,100,7,83,127,249,37,242,206,80,76,165,145,176,158,181,25,91,150]},"announce":[],"urlList":[]}}