{"title":"Allison Anders &amp; Dean Lent &amp; Kurt Voss - Border Radio","uid":5334167,"size":1771252015,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e767ceba1567669dd26235a9e4b3b0e4cb0b737e&amp;dn=Allison+Anders+%26+Dean+Lent+%26+Kurt+Voss+-+Border+Radio&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"lord_terabyte","files":-1,"time":1265270594,"description":"Allison Anders &amp; Dean Lent &amp; Kurt Voss - Border Radio [+Extras] (1987)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0090766&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0090766&lt;/a&gt;\n\nLanguage\tEnglish 3 audio tracks\nSubtitles\tEnglish sub/idx\n &lt;a href=&quot;\nhttp://img219.imageshack.us/img219/7188/mov203461tg2.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://img219.imageshack.us/img219/7188/mov203461tg2.jpg&lt;/a&gt;\n\n[QUOTE]The 1980s was a wayward decade for a lot of people, but for punk rockers in particular, it was definitely not the best of times.\n\nPunk was spawned from the boredom of the late 1970s, but it didn't take long for it to go mainstream. By the mid-'80s, the movement had been assimilated by popular culture and many of its icons had traded in their bad boy ways for a much shinier Yankee dollar. This left those who wanted to maintain the original vision of the genre in a bit of a wasteland: too out of date to matter, too stubborn to just fade away.\n\nThe 1987 independent feature Border Radio sits itself down smack in the middle of this conundrum. Made itself with a punk rock spirit, it was shot on 16mm black-and-white film over several years with a trio of student directors at its helm. The screenplay was written in tandem by the filmmakers--Allison Anders (Gas Food Lodging), Dean Lent (now a cinematographer), and Kurt Voss (Down and Out With the Dolls)--but in the spirit of true collaboration, it was fleshed out on set, with the cast improvising new scenarios. The result is something loose, ragged, and short, like a punk song on film; the downside is, like a lot of punk, it's a little shallow, stuck on one note for the duration.\n\nShot in Los Angeles, Border Radio features several important members of that city's music scene. Chris D., a member of the Flesh Eaters and Divine Horseman, plays Jeff, a popular cult musician who has seen far too much compromise creep into his act over the years. His friend and bandmate, Dean, is played by John Doe, leader of the seminal rock band X. Additionally, the score is done by Dave Alvin of the Blasters (whose pre-existing song also provided the movie's title), and he also shows up in Border Radio as a guitarist who has become estranged from Jeff. For rock stars, all three of these gentlemen are distinctly lacking in the charisma department. Their amateurish acting is just the beginning of Border Radio's problems, however.\n\nWhen Jeff and Dean were at the end of their rope, they teamed up with obnoxious hanger-on Chris (Chris Shearer, Grace of My Heart) to rob a nightclub who they felt had exploited them (how punk rock is that?). As Border Radio begins, some thugs from the club have come looking for their money, and so Jeff hightails it down to Mexico, leaving Dean to take the beating and his wife, Lu (Luanna Anders), to answer the angry phone calls from Jeff's record label and take care of their daughter. On her search for Jeff, Lu gets suckered in by Chris and soon learns the true story about the robbery. She organizes a road trip to retrieve the pouting performer, but since this is the aimless 1980s, any journey of this kind is going to end up as self-reflexive and ironically pointless.\n\nBorder Radio bears the influence of Jim Jarmusch. It goes for the same kind of meandering ordinariness that was the hallmark of early Jarmusch classics like Stranger than Paradise. This is a difficult conceit to manufacture, however, you have to have a special eye for it. Either none of the three directors were cut out for this kind of storytelling or there were too many cooks in this kitchen, and so no real direction could be found. Border Radio is all over the place. It has traces of road pictures, crime movies, faux documentary, and kitchen-sink drama, but it never settles on one element long enough to give the movie any cohesion. At one point, John Doe even declares that he's in a western, and there truly is the whiff of the outlaw lingering around the production, but when it comes down to it, Border Radio plays it a little too safe to truly stand apart.\n\nSo, the sum of all these parts is that Border Radio is an interesting curio of its time. While some of the participants went on to greater cinematic glory--Anders has made some good pictures, and John Doe has been excellent in quite a large number of character roles--Border Radio is merely the entryway at the edge of that glory, and it comes off as such.[/QUOTE]\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard04-13.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard04-13.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard05-12.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard05-12.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard06-8.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard06-8.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard07.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard07.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard08.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard08.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard09.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://i783.photobucket.com/albums/yy116/muffy_kitteh/Clipboard09.png&lt;/a&gt;\n\n------my rip------\n\n~~~~~~ Border Radio.avi ~~~~~~                                     \n                                                               \n\nFile Size (in bytes):...........................1,442,516,992                     \n                                                                               \n--- Video Information ---                                                       \nVideo Codec Name:...............................XviD ISO MPEG-4              \nDuration (hh:mm:ss):............................1:23:38                \nFrame Count:....................................120300             \nFrame Width (pixels):...........................592                  \nFrame Height (pixels):..........................432                  \nAspect Ratio:...................................1.370                     \nFrames Per Second:..............................23.976          \nVideo Bitrate (kbps):...........................1704                 \n......MPEG-4......B-VOP........................                    \nQuality Factor (bits/pixel)/frame:..............0.278&quot;                     \n                                                                                \n\n--- Audio Information ---                                                       \n\nAudio Codec:....................................0x2000 (Dolby AC3) AC3                   \nAudio Sample Rate (Hz):.........................48000             \nAudio Bitrate(kbps):............................192                 \nAudio Bitrate Type (&quot;CBR&quot; or &quot;VBR&quot;):............CBR            \nAudio Channel Count:............................1           \n\n\n********************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n &lt;a href=&quot;\nhttp://freakyflicks.proboards54.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freakyflicks.proboards54.com&lt;/a&gt;\n\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE ","torrent":{"xt":"urn:btih:e767ceba1567669dd26235a9e4b3b0e4cb0b737e","amp;dn":"Allison+Anders+%26+Dean+Lent+%26+Kurt+Voss+-+Border+Radio","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e767ceba1567669dd26235a9e4b3b0e4cb0b737e","infoHashBuffer":{"type":"Buffer","data":[231,103,206,186,21,103,102,157,210,98,53,169,228,179,176,228,203,11,115,126]},"announce":[],"urlList":[]}}