{"title":"Bobby Darin - The Ultimate Bobby Darin (1986)","uid":8660626,"size":271425818,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e7f9c71b49c4eadcf4f3f747f0ff5466df9c5686&amp;dn=Bobby+Darin+-+The+Ultimate+Bobby+Darin+%281986%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":null,"files":27,"time":1373312834,"description":"This is the same torrent that was uploaded to Demonoid in September 2008.\n\n\nBobby Darin - The Ultimate Bobby Darin (1986)\n &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/41GSMYR7ZJL._SL500_AA240_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/41GSMYR7ZJL._SL500_AA240_.jpg&lt;/a&gt;\n\nIncludes:\nFiles by track, ripped at FLAC 8 using Easy CD-DA Extractor (www.poikosoft.com)\nTracks have full tags (including embedded thumbnail).\nAll artwork in jpgs at 300 d.p.i. Rotated and cropped losslessly using jpegcrop.\nAMG Bio.txt\nAMG Review.txt\nNotes.txt (which is simply these notes included in the torrent)\n\nBio Excerpt from All Music:\n\nThere's been considerable discussion about whether Bobby Darin should be classified as a rock &amp; roll singer, a Vegas hipster cat, an interpreter of popular standards, or even a folk-rocker. He was all of these and none of these. Throughout his career he made a point of not becoming committed to any one style at the exclusion of others; at the height of his nightclub fame he incorporated a folk set into his act. When it appeared he could have gone on indefinitely as a sort of junior version of Frank Sinatra, he would periodically record pop/rock and folk-rock singles whose principal appeal lay outside of the adult pop market. At one point he started calling himself Bob Darin and recorded songs with vague anti-establishment overtones that could be said to be biting the largely bourgeois hands that fed his highest-paying gigs. It may be most accurate to say that Darin was, above all, a singer who wanted to do a lot of things, rather than make his mark as a particular stylist. That may have cost him some points as far as making it to the very top of certain genres, but also makes his work more versatile than almost any other vocalist of his era.\n\nWhen Darin had his first hits in the late '50s, he was a teen idol of sorts, albeit a teen idol with much more talent and mature command than the typical singer in that style. The novelty-tinged &quot;Splish Splash&quot; was his breakthrough smash, followed by &quot;Queen of the Hop&quot; and the ballad &quot;Dream Lover.&quot; ...\n\nTo read the entire bio: &lt;a href=&quot;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jifwxqe5ld6e~T1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=11:jifwxqe5ld6e~T1&lt;/a&gt;\n\nAll Music Album Review:\n\nAt the time of its release in 1988, The Ultimate Bobby Darin was arguably the most thorough single-disc compilation available. And for range and selection it remains the most thorough single-disc retrospective of the legendary singer, effectively capturing the stunning range of his unique musical vision. Each of its 17 songs is a gem. Included are &quot;Splish Splash,&quot; &quot;Dream Lover,&quot; &quot;Mack the Knife,&quot; and &quot;Beyond the Sea,&quot; as well as &quot;Somebody to Love&quot; and &quot;I'll Be There,&quot; which don't appear on The Hit Singles Collection. For sound quality, however, both this release and the early-'90s retrospectives Splish Splash: The Best of Bobby Darin, Vol. 1 and Mack the Knife: The Best of Bobby Darin, Vol. 2 have been supplanted by the more recent Hit Singles Collection and other post-2000 releases of his Atlantic catalog.\n\nTaken from: &lt;a href=&quot; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:difwxqr5ldhe&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.allmusic.com/cg/amg.dll?p=amg&amp;sql=10:difwxqr5ldhe&lt;/a&gt;\n\nReviews and samples here: &lt;a href=&quot; http://www.amazon.com/dp/B000002LV4&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.amazon.com/dp/B000002LV4&lt;/a&gt;\n\nTrack List:\n\n01. Splish Splash\n02. Queen Of The Hop\n03. Plain Jane\n04. Dream Lover\n05. Mack The Knife\n06. Clementine\n07. Bill Bailey, Won't You Please Come Home\n08. Lazy River\n09. You Must Have Been A Beautiful Baby\n10. Irresistable You\n11. Multiplication\n12. Things\n13. I'll Be There\n14. Early In The Morning\n15. Artificial Flowers\n16. Somebody To Love\n17. Beyond The Sea\n","torrent":{"xt":"urn:btih:e7f9c71b49c4eadcf4f3f747f0ff5466df9c5686","amp;dn":"Bobby+Darin+-+The+Ultimate+Bobby+Darin+%281986%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7f9c71b49c4eadcf4f3f747f0ff5466df9c5686","infoHashBuffer":{"type":"Buffer","data":[231,249,199,27,73,196,234,220,244,243,247,71,240,255,84,102,223,156,86,134]},"announce":[],"urlList":[]}}