{"title":"Cold Feet Season 4","uid":4862332,"size":3982310770,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ea10cc5ba0d8f7570cd2bdb70d622fefecd8b49e&amp;dn=Cold+Feet+Season+4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"KP12388","files":8,"time":1240322781,"description":"Series 4\n\nJenny and Pete await the birth of their second child but Jenny rethinks her current lifestyle after she miscarries. She decides to take a job in New York in Episode 2 and leaves with little Adam. Pete is unhappy for a time but begins a relationship with Jo Ellison, a friend of Rachel's. The relationship goes well until Jo has to return to Australia after her visa expires. Pete follows her and declares his love and they get married in Episode 8. Karen and David are sleeping in separate beds until she decides he should move out. He moves into Pete's spare bedroom and starts seeing a therapist (Michael Troughton). Karen develops alcoholism and decides to seek therapy too. She and David reconcile and he moves back in. Soon, she starts an affair with a publisher, Mark (Sean Pertwee), which is revealed to David in Episode 8. Having had enough of the lies, he leaves Karen. Adam and Rachel decide to adopt a child and begin going through the procedures. They are pleased when they later discover that Rachel is pregnant but are distraught when their social worker tells them that the adoption cannot proceed. In Australia for Pete and Jo's wedding, Rachel goes into premature labour and gives birth to a boy.","torrent":{"xt":"urn:btih:ea10cc5ba0d8f7570cd2bdb70d622fefecd8b49e","amp;dn":"Cold+Feet+Season+4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ea10cc5ba0d8f7570cd2bdb70d622fefecd8b49e","infoHashBuffer":{"type":"Buffer","data":[234,16,204,91,160,216,247,87,12,210,189,183,13,98,47,239,236,216,180,158]},"announce":[],"urlList":[]}}