{"title":"Cartoon - Swamp Thing: The Animated Series (1991)","uid":4512351,"size":1392603183,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:eaffa83587aea0b8d39d70feff43b936fd6a7da4&amp;dn=Cartoon+-+Swamp+Thing%3A+The+Animated+Series+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cowboy23","files":6,"time":1226835817,"description":"Swamp Thing is an American animated television series based on the DC Comics character, Swamp Thing. Debuting April 20, 1991 on FOX, it lasted only five episodes. The short-lived series, produced by DiC Entertainment, corresponded with Kenner&amp;#039;s Swamp Thing action figure collection released the year prior.\n\nLike previous film incarnations of Swamp Thing, the animated series rejects the popular Alan Moore revision of Swamp Thing&amp;#039;s origin and portrays him with his original origin as a man turned into a plant-like entity. Anton Arcane takes the role of the main villain responsible for Alec Holland&amp;#039;s transformation into Swamp Thing. Arcade is backed by his gang of Un-Men: Dr. Deemo, Weedkiller, and Skinman. Swamp Thing also has two friends named Tomahawk and Bayou Jack. Tomahawk is Native American not to be confused with the DC/Vertigo character, Thomas Hawk, who was a soldier in the American Revolution rescued by Native Americans. Bayou Jack is a Vietnam veteran.\n\nSimilar to Troma&amp;#039;s Toxic Crusaders, the animation style of Swamp Thing follows the trend of goofy, horror anti-heroes made for the children. Spoofing Chip Taylor&amp;#039;s &quot;Wild Thing,&quot; the opening theme plays &quot;Swamp Thing! ...You are amazing!&quot; The series also bears an environmentally conscious side also noted in many of its contemporaries.\n\nSwamp Thing was apparently turned down by CBS, leading it its mid-season debut on FOX. Despite the show&amp;#039;s limited number of episodes, NBC featured it during Chip and Pepper&amp;#039;s Cartoon Madness in fall 1991, and the Sci-Fi Channel would syndicate it years later. USA Network and the UK&amp;#039;s Children&amp;#039;s Channel also re-aired Swamp Thing in the 1990s. Most recent was its stint on Toon Disney in the 2000s.\n\nEver since the Swamp Thing animated series, the title character&amp;#039;s only animated appearances have been two small cameos in Justice League and Justice League Unlimited. He first appears at a cantina in &quot;Comfort and Joy.&quot; In the premiere episode of JLU, &quot;Initiation,&quot; an unnamed creature aboard the Justice League Watchtower also looks remarkably similar to Swamp Thing.","torrent":{"xt":"urn:btih:eaffa83587aea0b8d39d70feff43b936fd6a7da4","amp;dn":"Cartoon+-+Swamp+Thing%3A+The+Animated+Series+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaffa83587aea0b8d39d70feff43b936fd6a7da4","infoHashBuffer":{"type":"Buffer","data":[234,255,168,53,135,174,160,184,211,157,112,254,255,67,185,54,253,106,125,164]},"announce":[],"urlList":[]}}