{"title":"Nursing Care in Pediatric Respiratory Disease [PDF] [StormRG]","uid":11255178,"size":14622724,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:eb5a970199a4bcd74ea9b2154836df5882367f0a&amp;dn=Nursing+Care+in+Pediatric+Respiratory+Disease+%5BPDF%5D+%5BStormRG%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"0xmovva","files":-1,"time":1413889553,"description":"TITLE/EDITION Nursing Care in Pediatric Respiratory Disease \nAuthor: Concettina Tolomeo\nPaperback: 356 pages\nPublisher: Wiley-Blackwell; 1 edition (January 3, 2012)\nLanguage: English\nISBN-10: 0813817684\nISBN-13: 978-0813817682\nFormat: Retail PDF\nNOTE: this is the standalone ebook and may not include access codes that come packaged with the bound book\n\n__________________________________________________________________________________\n\n\nPediatric respiratory disorders are responsible for a number of acute and chronic health conditions and are a leading cause of pediatric emergency room visits and hospitalizations. More than ever, nurses and nurse practitioners must have an understanding of the anatomy, pathophysiology, diagnosis and state of the art treatments in pediatric respiratory disease as they are often the first to come in contact with and recognize respiratory problems in children. Nursing Care in Pediatric Respiratory Disease seeks to provide both nurses and nurse practitioners with this information in order to aid them in the diagnosis and treatment of children suffering from acute and chronic respiratory disorders.\nNursing Care in Pediatric Respiratory Disease opens with an overview of the anatomy and physiology of the respiratory system, best practices for assessing respiratory symptoms in children, and common respiratory therapies and treatment methods. It then proceeds through an examination of varying acute and chronic upper and lower respiratory diseases spanning from asthma and cystic fibrosis to vocal cord paralysis and sinusitis in both hospital and ambulatory settings.\n\nNursing Care in Pediatric Respiratory Disease provides nurses and other health care providers with a comprehensive and practical resource which allows them to collaborate and advocate more effectively, as well as educate both the family and child in management of respiratory disorders","torrent":{"xt":"urn:btih:eb5a970199a4bcd74ea9b2154836df5882367f0a","amp;dn":"Nursing+Care+in+Pediatric+Respiratory+Disease+%5BPDF%5D+%5BStormRG%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb5a970199a4bcd74ea9b2154836df5882367f0a","infoHashBuffer":{"type":"Buffer","data":[235,90,151,1,153,164,188,215,78,169,178,21,72,54,223,88,130,54,127,10]},"announce":[],"urlList":[]}}