{"title":"Freaks, Geeks &amp; Asperger Syndrome_ A User Guide to Adolescen","uid":8367452,"size":1494131,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ebdd4f6df6222986a17b5709fb1d309531a92bc0&amp;dn=Freaks%2C+Geeks+%26amp%3B+Asperger+Syndrome_+A+User+Guide+to+Adolescen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"ariane_c","files":2,"time":1365808836,"description":"[IMG]https://yuq.me/u/2525926/PorbhNCvTI.png[/IMG]\n\nPublication Date: August 15, 2002\n\nHave you ever been called a freak or a geek? Have you ever felt like one? Luke Jackson is 13 years old and has Asperger Syndrome. Over the years Luke has learned to laugh at such names but there are other aspects of life which are more difficult. Adolescence and the teenage years are a minefield of emotions, transitions and decisions and when a child has Asperger Syndrome, the result is often explosive.\nLuke has three sisters and one brother in various stages of their adolescent and teenage years but he is acutely aware of just how different he is and how little information is available for adolescents like himself.\nDrawing from his own experiences and gaining information from his teenage brother and sisters, he wrote this enlightening, honest and witty book in an attempt to address difficult topics such as bullying, friendships, when and how to tell others about AS, school problems, dating, relationships and morality.\nLuke writes briefly about his younger autistic and AD/HD brothers, providing amusing insights into the antics of his younger years and advice for parents, carers and teachers of younger AS children. However, his main reason for writing was because &quot;so many books are written about us, but none are written directly to adolescents with Asperger Syndrome. I thought I would write one in the hope that we could all learn together.&quot;","torrent":{"xt":"urn:btih:ebdd4f6df6222986a17b5709fb1d309531a92bc0","amp;dn":"Freaks%2C+Geeks+%26amp%3B+Asperger+Syndrome_+A+User+Guide+to+Adolescen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebdd4f6df6222986a17b5709fb1d309531a92bc0","infoHashBuffer":{"type":"Buffer","data":[235,221,79,109,246,34,41,134,161,123,87,9,251,29,48,149,49,169,43,192]},"announce":[],"urlList":[]}}