{"title":"Definitely Maybe(multi-subs)(2Lions-Team)","uid":5448068,"size":4681828138,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ebf4c33c410d7772c297ff7ace893910fa657644&amp;dn=Definitely+Maybe%28multi-subs%29%282Lions-Team%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"JUULTJE","files":-1,"time":1269086149,"description":"Definitely, Maybe 2008\n\nVerenigd Koninkrijk / Verenigde Staten / Frankrijk\nKomedie / Romantiek\n112 minuten\n\ngeregisseerd door Adam Brooks\nmet Ryan Reynolds, Abigail Breslin en Isla Fisher\n\nWill Hayes zit midden in een echtscheidingsprocedure en zijn dochtertje wil weten hoe hij haar moeder ontmoet heeft. Will vertelt haar van de vrouwen die destijds in zijn leven waren en laat zijn dochter raden met wie hij uiteindelijk getrouwd is. Zou het zijn studievriendin Emily zijn? Of zijn beste vriendin en vertrouwelinge April? Of de vrijgevochten journaliste Summer?\n\nEngels\n\nRomantic comedy: Will Hayes, a 30-something Manhattan dad is in the midst of a divorce when his 10 year old daughter, Maya, starts to question him about his life before marriage. Maya wants to know absolutely everything about how her parents met and fell in love. Will's story begins in 1992, as a young, starry-eyed aspiring politician who moves to New York from Wisconsin in order to work on the Clinton campaign. For Maya, Will relives his past as a idealistic young man learning the ins and outs of big city politics, and recounts the history of his romantic relationships with three very different women. On the campaign, Will's best buddy is Russell McCormack. They not only have similar political aspirations, they share the same type of girl problems, too. Will hopelessly attempts a &quot;PG&quot; version of his story for his daughter ad changes the names so Maya has to guess who he finally married. Is her mother Will's college sweetheart, the dependable girl next-door Emily? Is she his longtime best friend and confidante, the apolitical April? Or is she the free-spirited but ambitious journalist? As Maya puts together the pieces of her dad's romantic puzzle, she begins to understand that love is not so simple or easy. And as Will tells her his tale, Maya helps him to understand that it's definitely never too late to go back...and maybe even possible to find a happy ending.  \n\nWeblink http://www.imdb.com/title/tt0832266/\nWeblink http://www.moviemeter.nl/film/45942\n\nVideo                : DVD Rip\nAudio                : Engels French Hungarian\nSubs                 : Engels Dutch French Portuguese Hungarian Arabic Danish Icelandic Norwegian\nID                   : 0xE0\nFormat               : MPEG Video\nFormat version       : Version 2\nBit rate mode        : Variable\nWidth                : 720 pixels\nHeight               : 576 pixels\nDisplay aspect ratio : 16:9\nFrame rate           : 25.000 fps\nStandard             : PAL\nCover                : Yes\n\n*****************************************\n\nBrought to you by Juultje\n2Lions Team\n\nmeer zien??\nKom dan eens kijken op ons forum \n\n                          &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions the site to be for all your Dutch MOVIES and more\n\n******************************************\n\n\nDON T HIT AND RUN Niet gelijk afhaken als de FILM binnen is blijf seeden. \n\nDon`t quit after you finished the download, but keep seeding\n\n\nThere are fake torrents from uploaders who use our team name.\nThose are not ours, or members from our team.\nWe 2Lions-Team are not responsible for the fake posts on our name\n\nWij 2Lions-Team zijn niet verantwoordelijk voor die zieke FAKE posten die op onze naam worden gedaan\n\nPlease check our site !!!\n\nto the fakers , get a life !!!\n\t\t\n\n\n\n","torrent":{"xt":"urn:btih:ebf4c33c410d7772c297ff7ace893910fa657644","amp;dn":"Definitely+Maybe%28multi-subs%29%282Lions-Team%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebf4c33c410d7772c297ff7ace893910fa657644","infoHashBuffer":{"type":"Buffer","data":[235,244,195,60,65,13,119,114,194,151,255,122,206,137,57,16,250,101,118,68]},"announce":[],"urlList":[]}}