{"title":"History Of The Grateful Dead Vol. 1 (Bear's Choice) vtwin88cube","uid":6219894,"size":480207344,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ec06584cf8c9d7d7f8ef53b3803f67ac0d47dd23&amp;dn=History+Of+The+Grateful+Dead+Vol.+1+%28Bear%5C%27s+Choice%29+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1299294578,"description":"Grateful Dead\nHistory Of The Grateful Dead Vol. 1 \n(Bear's Choice) Bonus Track Ed. (2003)\n\n\nRock's longest, strangest trip, the Grateful Dead were the psychedelic era's most beloved musical ambassadors as well as its most enduring survivors, spreading their message of peace, love, and mind-expansion across the globe throughout the better part of three decades. The object of adoration for popular music's most fervent and celebrated fan following -- the Deadheads, their numbers and devotion legendary in their own right -- they were the ultimate cult band, creating a self-styled universe all their own; for the better part of their career orbiting well outside of the mainstream, the Dead became superstars solely on their own terms, tie-dyed pied pipers whose epic, free-form live shows were rites of passage for an extended family of listeners who knew no cultural boundaries.\n\n\nChannels:\t\t2 (stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\n\nAudio Quality:\t\tPerfect (Lossless)\nEncoder:\t\tFlac 1.2.1\t\nContains:\t\tAlbum Art, CRC, ID Tag [Vorbis Comments]\nM3U File:\t\tYes\n\nFormat:\t\t\tFlac\nGenre:\t\t\tRock\t\nSource:\t\t\tWeb\nLabel:\t\t\tRhino/WEA\nRelease Date:\t\tJul 13, 1973\nRecording Date:\t\tFeb 5, 1970 - Feb 14, 1970\n\n\nThis 1973 release was the very last collection that the Grateful Dead authorized during their tenure with Warner Bros. in the late '60s and early '70s. However, this live disc was a sort of melancholy affair, as it centered on material featuring Ron &quot;Pigpen&quot; McKernan (guitar/vocals/mouth harp), who had left the band due to illness in June of the previous year. History of the Grateful Dead, Vol. 1 (Bear's Choice) is somewhat misleading, as a follow-up never came to pass. Band historians, however, claim that this release was optimistically titled because the label had hoped to issue a series of live recordings (ÃƒÂ  la Dick's Picks) containing highlights from a variety of vintage Dead performances. Alas, with the formation of the group's own label, it was not to be. The single disc includes performances from a highly touted series of shows held over two nights (February 13-14, 1970) at the Fillmore East in New York City. While most assuredly not the finest example of the Dead's formidable acoustic sets, the platter opens with a quartet of cover tunes -- many of which had been entries in Jerry Garcia (guitar/vocals) and McKernan's folky jug band repertoire prior to ultimately forming the electric, psychedelic Grateful Dead. McKernan's playful cover of Lightnin' Hopkins' &quot;Katie Mae&quot; is a somewhat lightweight affair. He counterbalances ad-libbed lyrics with his own very sparse solo guitar picking, which is in perfect keeping with the lonesome nature of this blues. Garcia and Bob Weir (guitar/vocals) join in on the remaining &quot;unplugged&quot; tracks. Both the affective and noir &quot;Dark Hollow&quot; and &quot;I've Been All Around This World&quot; reveal the command of this highly underutilized subdivision of the Dead. Clocking in at seven-plus minutes, the album's sole original composition, &quot;Black Peter,&quot; is masterfully executed. It ultimately bests the original Workingman's Dead (1969) version in sheer emotive realization. The two electric offerings -- a cover of Howlin' Wolf's &quot;Smokestack Lightning&quot; and Otis Redding's &quot;Hard to Handle&quot; -- are full-blown rave-ups allowing the entire band to weave its collective R&amp;B-influenced psychedelia, unedited and in real time. Both tracks had become assertive vehicles for McKernan's no-nonsense R&amp;B sensibilities. In 2001, History of the Grateful Dead, Vol. 1 (Bear's Choice) was included in the 12-disc Golden Road (1965-1973) box set, and in 2003 was also made available by Rhino and Warner Strategic Marketing as a stand-alone purchase. This remastered edition comes replete with a newly inked 16-page liner notes insert containing an essay from &quot;the Bear&quot; (aka Owsley Stanley) himself. The expanded track list yields four additional performances from the same cache of shows: the McKernan-led &quot;Good Lovin',&quot; &quot;Big Boss Man,&quot; a second and equally scintillating version of &quot;Smokestack Lightning,&quot; and an uptempo &quot;Sitting on Top of the World,&quot; the latter of which keeps the frenetic spirit of the reading from the Dead's self-titled debut firmly intact. \n\n\nTrack List:\n\n01.Katie Mae 4:44\n02.Dark Hollow 3:52\n03.I've Been All Around This World 4:18\n04.Wake Up Little Susie 2:31\n05.Black Peter 7:27\n06.Smokestack Lightnin' 17:59\n07.Hard To Handle 6:29\n08.Good Lovin' 8:56\n09.Big Boss Man 4:53\n10.Smokestack Lightnin' (Version Two) 15:11\n11.Sitting On Top Of The World 3:20\n\n\n\nCheers!","torrent":{"xt":"urn:btih:ec06584cf8c9d7d7f8ef53b3803f67ac0d47dd23","amp;dn":"History+Of+The+Grateful+Dead+Vol.+1+%28Bear%5C%27s+Choice%29+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec06584cf8c9d7d7f8ef53b3803f67ac0d47dd23","infoHashBuffer":{"type":"Buffer","data":[236,6,88,76,248,201,215,215,248,239,83,179,128,63,103,172,13,71,221,35]},"announce":[],"urlList":[]}}