{"title":"T.Saada i D.Merrill - Byłem człowiekiem Arafata [  ] PL","uid":13220700,"size":509217290,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ecc2a29e4621699e5bb23c9f494bfa88afc82d97&amp;dn=T.Saada+i+D.Merrill+-+By%C5%82em+cz%C5%82owiekiem+Arafata+%5BMP3%40128%5D+PL&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"everdarksoul","files":21,"time":1452768468,"description":"Audiobook PL - 19 części /   \r\nrozmiar: 485 MB / czas: 08:49:09\r\nczyta: Wojciech Żołądkowicz\r\n\r\nNa lotnisku w stolicy Kataru oczekiwali go już bracia. Widząc pistolet za pasem starszego brata, Tass jeszcze wyraźniej uświadomił sobie powagę sytuacji:\r\n&quot;Nagle do mnie dotarło, że obecność trzech mężczyzn oznaczała, że teraz, tutaj zostanie dokonane zabójstwo honorowe. Mieli być świadkami, zgodnie z wymaganiami muzułmańskiego prawa szariatu. Za chwilę brat wyceluje mi w głowę i zada mi standardowe pytanie: Czy powrócisz do islamu..?\r\nKiedy odpowiem odmownie, powtórzy to pytanie. Jeśli znowu odpowiem odmownie, pytanie zostanie powtórzone po raz trzeci. Po usłyszeniu trzeciej odmowy zastrzeli mnie na miejscu, przy wejściu na lotnisko...&quot;\r\nDoszło jednak do spotkania Tassa z rodzicami i rozmowy z nimi, po której - o dziwo - ojciec uroczyście zapowiedział, że przeklnie każdego, kto będzie usiłował skrzywdzić jego syna.\r\n\r\nKsiążka &quot;byłem Człowiekiem Arafata&quot; to literatura faktu, biografia. Prawdziwa historia Tass'a Saada - byłego bojownika islamskiego i terrorysty, jednego z otoczenia Jasera Arafata - którego jako nastolatek podziwiał i uwielbiał - a którego potem został szoferem oraz zabijał Żydów na jego rozkazy. Książka warta uwagi - mimo iż dość mocno cuchnie ewangelizacyjną propagandą, gdyż niemal cała droga Tass'a ukazana jest tu w kontekście jego nawrócenia na chrześcijaństwo - ale po za całym tym religijnym szajsem, to również całkiem ciekawa, prawdziwa i &quot;ludzka&quot; opowieść - a doskonała realizacja techniczna audiobooka oraz świetny styl, w jakim przeczytał go Wojciech Żołądkowicz, czynią go tym bardziej godnym polecenia","torrent":{"xt":"urn:btih:ecc2a29e4621699e5bb23c9f494bfa88afc82d97","amp;dn":"T.Saada+i+D.Merrill+-+By%C5%82em+cz%C5%82owiekiem+Arafata+%5BMP3%40128%5D+PL","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ecc2a29e4621699e5bb23c9f494bfa88afc82d97","infoHashBuffer":{"type":"Buffer","data":[236,194,162,158,70,33,105,158,91,178,60,159,73,75,250,136,175,200,45,151]},"announce":[],"urlList":[]}}