{"title":"The Auteurs - Now I'm A Cowboy [1994]","uid":9457055,"size":293553710,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ed374c1ea07b30b77d542cf13a29411a198c2405&amp;dn=The+Auteurs+-+Now+I%27m+A+Cowboy+%5B1994%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"GenXRock","files":-1,"time":1389288717,"description":"Review by Amy Hanson  [-]\n&quot;Brainchild&quot; may have informed the title of the Auteurs' sophomore album, Now I'm a Cowboy, but it was the sneering, in-with-the-hip-crowd antics of the opening &quot;Lenny Valentino&quot; which flew in the face of the light retro-pop the band wielded just a year earlier. Rougher, sexier, more slipshod than before, this song had a lot to say, and the band was right behind it. But that's not to imply that the band didn't carry itself with equal aplomb across the rest of the set. the Auteurs blazed through a mixed mutant bag of smoothies and deadlies, where every title read like a trip around the world. Meanwhile, pre-empting all that Pulp would later perfect, Luke Haines' feral lyricism touched on the struggle of upper and lower classes and the horror that falls when they collide. &quot;New French Girlfriend&quot; hashed Haines' vocals to bits with a yummy guitar, while &quot;Chinese Bakery&quot; is an off-kilter rock rampage across streets that slice uptown and downtown, leaving &quot;The Upper Classes&quot; to fill the breach. Elsewhere, both &quot;Life Classes/Life Model&quot; and the sordid claustrophobia of &quot;Underground Movies&quot; emerge as biting commentary. Now I'm a Cowboy served the Auteurs well, becoming an edgily delicious bridge between their immediate past and their enduring future. Dig a little deeper and add a pinch of hindsight, however, and it's also easy to discern the treasure trove of embryonic nuggets that would surface in Haines' Baader Meinhof and Black Box Recorder solo projects. (4/5)","torrent":{"xt":"urn:btih:ed374c1ea07b30b77d542cf13a29411a198c2405","amp;dn":"The+Auteurs+-+Now+I%27m+A+Cowboy+%5B1994%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed374c1ea07b30b77d542cf13a29411a198c2405","infoHashBuffer":{"type":"Buffer","data":[237,55,76,30,160,123,48,183,125,84,44,241,58,41,65,26,25,140,36,5]},"announce":[],"urlList":[]}}