{"title":"[-VivThomas-] Lady --NEW 2015-- XXX DVDRip","uid":11900297,"size":729451574,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:eda1902f53c620d26e690fbb5c0d94dcfff80925&amp;dn=%5B-VivThomas-%5D+Lady+--NEW+2015--+XXX+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Upl0ad3rR","files":1,"time":1431292661,"description":"[-VivThomas-] Lady --NEW 2015-- XXX DVDRip\n\n---:More From My Torrent's Here:---   &lt;a href=&quot;\nhttps://thepiratebay.se/user/Upl0ad3rR&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://thepiratebay.se/user/Upl0ad3rR&lt;/a&gt;\n\n---:ScreeNshotS:---  &lt;a href=&quot;\nhttp://image-tpb.com/img-554fa7863ccc7.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-554fa7863ccc7.html&lt;/a&gt; \n &lt;a href=&quot;\nhttp://image-tpb.com/img-554fa788beabe.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://image-tpb.com/img-554fa788beabe.html&lt;/a&gt; \n\nIn her starring role in &quot;Lady,&quot; stunning Czech beauty Kari has everything a wealthy woman could possibly want. She's got the elegant estate, the finest designer fashions, priceless jewels, and a taste for decadent luxury. She also has an insatiable desire to ravage - and be ravaged by - beautiful young women, and she never takes &quot;no&quot; for an answer. Kari's first conquest is Roxy Mendez. After dispensing with the preliminaries on the veranda of her mansion she has her way with the busty beauty. Once Kari has fingered and eaten Roxy to orgasm the tables turn and Mendez tongues Kari's Censored and ass and fingers her to ecstasy. While savoring a late night glass of Champagne Kari looks on as Candy Sweet plays with herself, and then the Censored-eating, rimming, face-sitting, and climaxing begins. One quiet afternoon KAri entertains a busty guest, Tracey Smile. A bit of chit-chat leads to a kiss, and then Kari pounces on Tracy's clean-shaven Censored, sucking, eating, and fingering until she's had her fill, and Smile is completely satisfied. Smile gives as good as she gets, we soon see, and she uses every trick she knows to give Kari the most priceless gift to all, an explosive orgasm. Unsure of what awaits her, Rosaline Rosa is seated on a chaise on the portico when Kari joins her. As usual, few words are spoken or necessary - Kari knows what she wants, and she quickly strips and savors Rosaline's trim and tempting young body and then rides her new friend's face to a final come during a scorching round of sixty-nine. Elegance, beauty, seduction, steamy Censored, and sizzling sex make &quot;Lady&quot; an instant legend of lesbian erotica.\n\nTracy Smile, Rosaline Rose, Candy Sweet, Kari, Roxy Mendez","torrent":{"xt":"urn:btih:eda1902f53c620d26e690fbb5c0d94dcfff80925","amp;dn":"%5B-VivThomas-%5D+Lady+--NEW+2015--+XXX+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eda1902f53c620d26e690fbb5c0d94dcfff80925","infoHashBuffer":{"type":"Buffer","data":[237,161,144,47,83,198,32,210,110,105,15,187,92,13,148,220,255,248,9,37]},"announce":[],"urlList":[]}}