{"title":"[EPUB] Troublemaker: Surviving Hollywood &amp; Scientology","uid":14803563,"size":4385265,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee032502467367fbac7ceae485d6ed56afbb365b&amp;dn=%5BEPUB%5D+Troublemaker%3A+Surviving+Hollywood+%26amp%3B+Scientology&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"kingking11","files":2,"time":1465150170,"description":"Leah Remini has never been the type to hold her tongue. That willingness to speak her mind, stand her ground, and rattle the occasional cage has enabled this tough-talking girl from Brooklyn to forge an enduring and successful career in Hollywood. But being a troublemaker has come at a cost.\r\nThat was never more evident than in 2013, when Remini loudly and publicly broke with the Church of Scientology. Now, in this frank, funny, poignant memoir, the former King of Queens star opens up about that experience for the first time, revealing the in-depth details of her painful happy wheels demo split with the church and its controversial practices.\r\nIndoctrinated into the church as a child while living with her mother and sister in New York, Remini eventually moved to Los Angeles, where her dreams of becoming an actress and advancing Scientology’s causes grew increasingly intertwined. As an adult, she found the success she’d worked so hard for, and with it a prominent place in the hierarchy of celebrity Scientologists alongside people such as Tom Cruise, Scientology’s most high-profile adherent. Remini spent time directly with Cruise and was included among the guests at his 2006 wedding to Katie Holmes","torrent":{"xt":"urn:btih:ee032502467367fbac7ceae485d6ed56afbb365b","amp;dn":"%5BEPUB%5D+Troublemaker%3A+Surviving+Hollywood+%26amp%3B+Scientology","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee032502467367fbac7ceae485d6ed56afbb365b","infoHashBuffer":{"type":"Buffer","data":[238,3,37,2,70,115,103,251,172,124,234,228,133,214,237,86,175,187,54,91]},"announce":[],"urlList":[]}}