{"title":"Eat People: And Other Unapologetic Rules for Game","uid":10593401,"size":255380,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ef308612b2c6a87c49cbc6f326be10ba42447916&amp;dn=Eat+People%3A+And+Other+Unapologetic+Rules+for+Game&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"mdusanjay","files":-1,"time":1405829077,"description":"Eat People: And Other Unapologetic Rules for Game-Changing Entrepreneurs by Andy Kessler\nEnglish | 2012 | ISBN-10: 1591845424, 1591843774 | 253 pages | EPUB | 0,3 MB\n\nHow entrepreneurs find the next big thing-and make it huge. The era of easy money and easy jobs is officially over. Today, we're all entrepreneurs, and the tides of change threaten to capsize anyone who plays it safe.\n\nTaking risks is the name of the game-but how can you tell a smart bet from a stupid gamble? Andy Kessler has made a career out of seeing the future of business, as an analyst, investment banker, venture capitalist, and hedge fund manager. He evaluated the business potential of the likes of Steve Jobs and Michael Dell before they were Steve Jobs and Michael Dell. His eye for what's next is unparalleled. Now Kessler explains how the world's greatest entrepreneurs don't just start successful companies-they overturn entire industries. He offers twelve surprising and controversial rules for these radical entrepreneurs, such as: ? Eat people: Get rid of worthless jobs to create more wealth for everybody ? Create artificial scarcity for virtual goods ? Trust markets to make better decisions than managers Whether you're at a big corporation or running a small business, you're now an entrepreneur. Will you see change coming and grab on to opportunity or miss the boat?\n","torrent":{"xt":"urn:btih:ef308612b2c6a87c49cbc6f326be10ba42447916","amp;dn":"Eat+People%3A+And+Other+Unapologetic+Rules+for+Game","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef308612b2c6a87c49cbc6f326be10ba42447916","infoHashBuffer":{"type":"Buffer","data":[239,48,134,18,178,198,168,124,73,203,198,243,38,190,16,186,66,68,121,22]},"announce":[],"urlList":[]}}