{"title":"Paul Haig - The Warp of Pure Fun [1985]","uid":3977880,"size":43376549,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:efbe0d027e4747d644f455010d82d25b2641d39d&amp;dn=Paul+Haig+-+The+Warp+of+Pure+Fun+%5B1985%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"80zforever","files":10,"time":1200388394,"description":"Paul Haig might be best known as the frontman of Scottish post-punk band Josef K, whose lone official record played a major role in the development of the C-86 scene that followed a few years after the group&amp;#039;s disintegration. Haig continued with a number of involvements in the following decades, releasing a number of records on his own in addition to issuing several collaborative efforts. The early-&amp;#039;80s breakup of Josef K also saw him abandon some of the anti-commercial ideals that he previously stood for, as he also aligned himself with a number of musically varied names in the process. \n\nHaig was most prolific in the years immediately following Josef K, releasing a number of singles and full-lengths under his own name as well as Rhythm of Life. Released in 1983, the synth-based The Rhythm of Life (recorded in New York) featured the handiwork of Pere Ubu&amp;#039;s Anton Fier, Parliament/Funkadelic&amp;#039;s Bernie Worrell, and the Thompson Twins&amp;#039; Tom Bailey. Compared to the Human League and the British Electronic Foundation, the record hardly resembled his earlier, frantically guitar-driven work, basing itself in slick pop and alienating many of his fans as a result. \n\nA couple of 1984 singles were recorded with Cabaret Voltaire and Bernard Sumner before Haig teamed up more significantly with ex-Associate and live associate Alan Rankine. A full album was shelved due to label issues, but the recordings that followed were released as 1985&amp;#039;s The Warp of Pure Fun. Stylistically similar to The Rhythm of Life, Rankine remained aboard and added his mastery of electronics and production\n\n01.\tSilent Motion\t         3:51\n02.\tHeaven Help You Now 4:03\n03.\tLove Eternal\t4:07\n04.\tThis Dying Flame\t3:51\n05.\tSense of Fun\t6:08\n06.\tScare Me\t3:11\n07.\tBig Blue World\t3:59\n08.\tThe Only Truth\t3:49\n09.\tOne Lifetime Away\t6:24\n10.\tLove &amp; War\t5:40\n","torrent":{"xt":"urn:btih:efbe0d027e4747d644f455010d82d25b2641d39d","amp;dn":"Paul+Haig+-+The+Warp+of+Pure+Fun+%5B1985%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"efbe0d027e4747d644f455010d82d25b2641d39d","infoHashBuffer":{"type":"Buffer","data":[239,190,13,2,126,71,71,214,68,244,85,1,13,130,210,91,38,65,211,157]},"announce":[],"urlList":[]}}