{"title":"Wave - Life and Memories After the Tsunami - Sonali Deraniyagala","uid":9431927,"size":1130475,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f0c2ad53a70cffa8e628d1499488d1fd7775b2af&amp;dn=Wave+-+Life+and+Memories+After+the+Tsunami+-+Sonali+Deraniyagala&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":1,"time":1388824266,"description":"The book opens and we are inside the wave: thirty feet high, moving at twenty-five mph, racing two miles inland. And from there into the depths of the author's despair: how to live now that her life has been undone? \n\n\nSonali Deraniyagala tells her story - the loss of her two boys, her husband, and her parents - without artifice or sentimentality. In the stark language of unfathomable sorrow, anger, and guilt: she struggles through the first months following the tragedy -- someone always at her side to prevent her from harming herself, her whole being furiously clenched against the reality she can't face; and then reluctantly emerging and, over the ensuing years, slowly allowing her memory to function again. \n\n\nThen she goes back through the rich and joyous life she's mourning, from her family's home in London, to the birth of her children, to the year she met her English husband at Cambridge, to her childhood in Colombo while learning the balance between the almost unbearable reminders of her loss and her fundamental need to keep her family, somehow, still with her.","torrent":{"xt":"urn:btih:f0c2ad53a70cffa8e628d1499488d1fd7775b2af","amp;dn":"Wave+-+Life+and+Memories+After+the+Tsunami+-+Sonali+Deraniyagala","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0c2ad53a70cffa8e628d1499488d1fd7775b2af","infoHashBuffer":{"type":"Buffer","data":[240,194,173,83,167,12,255,168,230,40,209,73,148,136,209,253,119,117,178,175]},"announce":[],"urlList":[]}}