{"title":"Shaun of the dead, Hot fuzz,The worlds end [The Three Flavours C","uid":9768819,"size":2199031020,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1033299da7cb5c85bb932f4ac3544ffa94e9434&amp;dn=Shaun+of+the+dead%2C+Hot+fuzz%2CThe+worlds+end+%5BThe+Three+Flavours+C&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"cray131","files":-1,"time":1394923383,"description":"This torrent has got all 3 simon pegg movies and it is in YIFFY HD.\nProduct Description\nA triple bill of British comedy features from the hit team of Simon Pegg, Nick Frost and Edgar Wright. In 'The World's End' (2013), galvanised by Gary (Pegg), 40-somethings Oliver (Martin Freeman), Andy (Frost), Steven (Paddy Considine) and Peter (Eddie Marsan) return to their home town for one more attempt at trying to reach the legendary pub, 'The World's End'. But after setting out on their quest, taking in watering holes such as 'The Two Headed Dog' and 'The Famous Cock', the friends' objective soon pales into insignificance when they realise that the fate of the entire human race may ultimately rest in their hands. In 'Hot Fuzz' (2007), when a hotshot young London sergeant, Nicholas Angel (Pegg)'s arrest record puts the whole Metropolitan force to shame, his superiors shunt him to a rural posting hoping they've heard the last of him. The sleepy hamlet he's posted to however, behind all the lace-curtain politeness, is a hotbed of grisly murder and vigilante-ism. His diligence and character sits ill with the locals - all except the Sergeant's layabout son Danny Butterman (Frost), who's a huge fan of the cop buddy movie genre. The pair bond and end up taking on a sinister cult of local pensioners in a guns-blazing, granny-kicking, rocket-launching gore-fest aimed at restoring order. 'Shaun Of The Dead' (2004) fuses the style (and copious bloodshed) of classic zombie films with observational suburban comedy. Shaun (Pegg) is a useless but likeable thirty-something who works in an electronics shop in Crouch End. He doesn't get much respect from his fellow staff, even though he's standing in as temporary boss; his girlfriend Liz (Kate Ashfield) has had enough of his lack of direction and penchant for downing pints in the local pub; and he doesn't get on with his stepdad (Bill Nighy). Things get worse when the living dead make their appearance, threatening to spread their zombie curse across the nation. Will Shaun be able to rise from his sofa to save the lives of the two women he loves - Liz and his dear old mum?","torrent":{"xt":"urn:btih:f1033299da7cb5c85bb932f4ac3544ffa94e9434","amp;dn":"Shaun+of+the+dead%2C+Hot+fuzz%2CThe+worlds+end+%5BThe+Three+Flavours+C","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1033299da7cb5c85bb932f4ac3544ffa94e9434","infoHashBuffer":{"type":"Buffer","data":[241,3,50,153,218,124,181,200,91,185,50,244,172,53,68,255,169,78,148,52]},"announce":[],"urlList":[]}}