{"title":"Duke Ellington - 2002 - 1969 All-Star White House Tribute FLAC","uid":9012344,"size":462560091,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f1338c63c294b111a43ca235a62fdcf3d34193af&amp;dn=Duke+Ellington+-+2002+-+1969+All-Star+White+House+Tribute+FLAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"eika256","files":-1,"time":1381126422,"description":"Duke Ellington - 2002 - 1969 All-Star White House Tribute\n\nOne of the undeniable highlights of President Richard Nixon's administration was the 1969 White House gala celebrating Duke Ellington's 70th birthday, though jazz fans waited 33 years for their release. The all-star band includes trumpeters Clark Terry and Bill Berry, alto saxophonist Paul Desmond, baritone saxophonist Gerry Mulligan, guitarist Jim Hall, trombonists J.J. Johnson and Urbie Green, pianist Hank Jones, bassist Milt Hinton, and drummer Louis Bellson. There are three medleys of Ellington hits, with a new soloist for each song, since each of the brass and reed players is individually featured with the rhythm section. The first medley showcases Desmond's whisper-soft solo in &quot;Chelsea Bridge,&quot; Mulligan's lyrical take of &quot;Sophisticated Lady,&quot; and the sauntering feature for the trumpeters of &quot;Just Squeeze Me,&quot; which is wrapped by an extended workout of &quot;In a Mellotone&quot; that spotlights just about everyone. The lush miniature of &quot;In a Sentimental Mood&quot; makes one wish that Hall and Hinton had recorded additional duets together, while Mulligan's somewhat wild arrangement of &quot;Prelude to a Kiss&quot; may have caused Ellington to lift an eyebrow. Billy Taylor takes over at the piano for a brief trio medley, while liner-note writer Doug Ramsey, who was present for the affair, mentions that the maestro sat bolt upright when he heard Desmond's flawless impression of Johnny Hodges during &quot;Things Ain't What They Used to Be,&quot; which also has enjoyable solos by Mulligan and Dave Brubeck. Earl Hines' rollicking interpretation of &quot;Perdido&quot; is a crowd-pleaser. Singer Virginia Mayo's selections are easily eclipsed by the better-known Joe Williams, especially his emotional delivery of &quot;Heritage.&quot; Ellington himself finally takes over the piano for &quot;Pat,&quot; a lovely (and likely improvised) ballad dedicated to Mrs. Nixon. This wonderful tribute to Duke Ellington is highly recommended. (AllMusic)\n\nTrack list:\n01 - Take the 'A' Train\n02 - I Got It Bad\n03 - Chelsea Bridge\n04 - Satin Doll\n05 - Sophisticated Lady\n06 - Just Squeeze Me\n07 - I Let a Song Go Out of My Heart\n08 - Do Nothing Till You Hear from Me\n09 - Don't Get Around Much Anymore\n10 - In a Mellow Tone\n11 - In a Sentimental Mood\n12 - Prelude to a Kiss\n13 - Ring Dem Bells\n14 - Drop Me Off in Harlem\n15 - All Too Soon\n16 - It Don't Mean a Thing (If It Ain't Got That Swing)\n17 - Things Ain't What They Used to Be\n18 - Perdido\n19 - Warm Valley\n20 - Caravan\n21 - Mood Indigo\n22 - Prelude to a Kiss [2]\n23 - I Didn't Know about You\n24 - Praise God and Dance\n25 - Come Sunday\n26 - Heritage\n27 - Jump for Joy\n28 - Pat\n\nEnjoy and share! ","torrent":{"xt":"urn:btih:f1338c63c294b111a43ca235a62fdcf3d34193af","amp;dn":"Duke+Ellington+-+2002+-+1969+All-Star+White+House+Tribute+FLAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1338c63c294b111a43ca235a62fdcf3d34193af","infoHashBuffer":{"type":"Buffer","data":[241,51,140,99,194,148,177,17,164,60,162,53,166,47,220,243,211,65,147,175]},"announce":[],"urlList":[]}}