{"title":"PES2013_DEMO.","uid":7473569,"size":1075184663,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:f1876ff5754a9aa4cb4c2a18a352a9ad4e516e8e&amp;dn=PES2013_DEMO.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"akonsharon9","files":1,"time":1343227854,"description":"Pro Evolution Soccer 2013 (also known by fans as PES 2013 and known officially as World Soccer Winning Eleven 2013 in Asia) is a video game sequel to the 12th edition in the Pro Evolution Soccer series developed and published by Konami Digital Entertainment, Inc.\n\nPES 2013 marks the huge advance for football simulation, with the new video game offering PES FullControl wherein players are given total control over every pass, shot and first touches to the ball. Likewise , Pro-Active AI ensures that players move as they should both on and off the ball, creating a truly authentic big match experience. The Player ID system then enhances the feeling of individuality, with players that not just move and look like their real life counterparts, but also play just like them.\n\nPES 2013 demo allows any difficulty setting to be used, and boasts localised language settings.\n\nPES 2013 First Demo features eight fully licensed teams : Germany, England, Portugal, and Italy showcase European football, while Santos FC, SC International, Fluminense and Flamengo are available in the Copa Libertadores mode.\n","torrent":{"xt":"urn:btih:f1876ff5754a9aa4cb4c2a18a352a9ad4e516e8e","amp;dn":"PES2013_DEMO.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1876ff5754a9aa4cb4c2a18a352a9ad4e516e8e","infoHashBuffer":{"type":"Buffer","data":[241,135,111,245,117,74,154,164,203,76,42,24,163,82,169,173,78,81,110,142]},"announce":[],"urlList":[]}}