{"title":"CherryPlayer 2.2.6 + portable","uid":12152929,"size":55021952,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f1b108366429e9ae8fab590fa959dbcdb3c5e350&amp;dn=CherryPlayer+2.2.6+%2B+portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"macchiatolatte32","files":2,"time":1437682779,"description":"CherryPlayer 2.2.6 Released!\nDid you play ever &quot;Dota 2&quot;, &quot;League of Legends&quot;, &quot;Counter-Strike: Global Offensive&quot;, &quot;FIFA 15&quot;, &quot;Poker&quot; etc? In 2.2.6 release we added to player support Twitch.tv service to watch live games competition between teams and gamers.\n\nTwitch.tv is enough popular service that becomes more and more popular in our days so we added this service support in CherryPlayer. Now you can find your favorite game and watch its live stream in CherryPlayer. We tried to add to player all main functionality that you can find on official Twitch.tv website. It is first version of integration Twitch.tv to player, and we plan to improve Twitch.tv support in next releases.\n\nYou can ask what adventage from playback live game stream in player compare to browser? CherryPlayer uses hardware acceleration during playback live stream from Twitch.tv so in CherryPlayer CPU usage is ~1-5% when if you play the same stream in browser then CPU usage is much more. For example on tested PC playback live stream in browser takes 30-50% CPU depends from video quality and free resources. The same live stream is played in CherryPlayer with 1-5% CPU usage. Low CPU usage can be important for notebook to save charge. Additionally browser takes more RAM compare to CherryPlayer.\n\nHow to use Twitch.tv in CherryPlayer?\n\nIn left panel you can find Twitch section with top &quot;Games&quot;, &quot;Channels&quot; and &quot;Videos&quot; playlists. The structure is the same that you can find on Twitch.tv official website. Select &quot;Game&quot; playlist and you can see top games, double click on any game will open playlist with all currently live streams for this game. Select &quot;Channels&quot; playlist and you can see top currently live streams. Select &quot;Videos&quot; playlist and you can see top videos from past broadcasts.\n\nIf you want to find your game or any channel/stream then go to video search, in search settings select &quot;Twitch.tv&quot; source and one from available options &quot;Live streams&quot;, &quot;Channels&quot; or &quot;Games&quot;.\n\nEvery twitch item in playlist has channel name in rectangle, double click on channel name will open channel page with currently live stream (if available), highlights and past broadcasts videos.\n\nAdditionally you can sort live streams by languages, and sort videos by created date.\n\nEnjoy!","torrent":{"xt":"urn:btih:f1b108366429e9ae8fab590fa959dbcdb3c5e350","amp;dn":"CherryPlayer+2.2.6+%2B+portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b108366429e9ae8fab590fa959dbcdb3c5e350","infoHashBuffer":{"type":"Buffer","data":[241,177,8,54,100,41,233,174,143,171,89,15,169,89,219,205,179,197,227,80]},"announce":[],"urlList":[]}}