{"title":"Acid Witch - Witchtanic Hellucinations","uid":4997770,"size":64596755,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f1e30f8d656552a1be242db39dc7250c649477d6&amp;dn=Acid+Witch+-+Witchtanic+Hellucinations&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tomasz81","files":-1,"time":1247361313,"description":" &lt;a href=&quot;http://www.metalstorm.ee/pub/review.php?review_id=6149&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.metalstorm.ee/pub/review.php?review_id=6149&lt;/a&gt;\n\n01. Intro\n02. Into The Cave\n03. Swamp Spells\n04. Witchblood Cult\n05. The Black Witch\n06. Witchtanic Hellucinations\n07. Beastly Brew\n08. Cauldron Cave\n09. Rabid Werewitch\n10. Realm Of The Wicked\n11. Witches Tits\n12. Broomstick Bitch\n13. October 31st\n\n\nThe following text is printed on the cd:\n\n&quot;Unauthorized copying of this material is prohibited, if caught you will face up to 13 years of sucking cold smelly pus crusted WITCHES TITS&quot;\n\n\nSomewhere in the United States of America is a cave. And in that cave, with rotting corpses scattered on the ground, is a cauldron. And in that cauldron, rusty and filthy, brews a wicked potion called &quot;Witchtanic Hellucinations&quot;. Do not get too close to it or you might inhale some of its vile and corrupting vapours. Or is that what you're after? Then come closer in this lair of the Acid Witch and change your life forever.\n\nWhat exactly is this brew comprised of? Let's take a look at this evil witch's cabinet, shall we? Ah, there we have freshly disunited zombie corpses and a couple of vials of the hippie-drug acid, some Black Sabbath albums, but also the works of Necros Christos, Autopsy and early Entombed. And some old school horror b-movies, fuzzy seventies' doom distortion and a good dose of drug-induced insanity to top it all off. The utter uncompromising attitude of Lasse, Shagrat and Dave is very charming and exactly the attitude you can expect from a band on Razorback Records' gorey roster.\n\nSo what exactly does this add up to? Let me tell you: it all adds up to a diabolic three quarters of fuzzy Doom metal with swirling Death metal riffs, psychedelic guitar solos, demonic old-school gurgled growls, eerie witches' crackles and insults with a lot of humorous gore and nasty shit going on. Take a look at the cover art, which should tell you more than enough. The entire thing is old school to the bone.\n\nAcid Witch completely overwhelmed me with their &quot;Witchtanic Hellucinations&quot;. It might sound paradoxical, giving the thematic and audible concept of this album, but it has been a while since I've heard something so fresh and invigorating. If you're an open-minded fan of seventies' Doom or gorey Death metal, you're invited to take a chalice full of this wicked witches' brew and chug it down! Or as the band likes to say: let the death trip begin!","torrent":{"xt":"urn:btih:f1e30f8d656552a1be242db39dc7250c649477d6","amp;dn":"Acid+Witch+-+Witchtanic+Hellucinations","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1e30f8d656552a1be242db39dc7250c649477d6","infoHashBuffer":{"type":"Buffer","data":[241,227,15,141,101,101,82,161,190,36,45,179,157,199,37,12,100,148,119,214]},"announce":[],"urlList":[]}}