{"title":"Funny.Games.US.ENG.DVDRip-LGLuX.mp4","uid":4253586,"size":729693421,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f23d6b3d382f6cefb9fab0fc1ce73c1a85df62b5&amp;dn=Funny.Games.US.ENG.DVDRip-LGLuX.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"LGLuX","files":1,"time":1214135824,"description":"Name:        Funny Games (US)\nDirector:    Michael Haneke\nStarring:    Noami Watts , Tim Roth\nLenght:      Approx. 119 Min\nFormat:      MP4\nCodec:       H.264\nFilesize:    approx. 700 MB\n\n\n\n*** This comment may contain spoilers ***\n\nAnn: &quot;Why don&amp;#039;t you just kill us?&quot; Peter: &quot;You shouldn&amp;#039;t forget the importance of entertainment.&quot; These two lines are the very base for the message behind Funny Games, a stark, unrelenting look at America&amp;#039;s infatuation with violence and torture.\n\nThis is an English version remake of the 1997 German Funny Games, by the very same director Michael Haneke. Haneke wanted his original film to reach a broader audience, especially America since his inspiration for the film was his fascination with America&amp;#039;s desensitized appetite for gore and violent torture. The premise is very simple: a well-to-do American family, George (Tim Roth), Ann (Naomi Watts), and Georgie (Devon Gearhart), arrive at their summer home for a relaxing vacation and are held hostage in their own home by two deranged young men, Paul (Michael Pitt) and Peter (Brady Corbet), who play a &quot;game&quot; with the family that consists of tormenting the family physically and psychologically.\n\nNormally I would never have seen this film, as I have vowed never to see any type of slasher/torture-porn. However after reading about the director&amp;#039;s vision of trying to show the audience how sickening the watching of graphic torture for entertainment really is, I knew I had to see it.\n\nUnlike the hypocritical Untraceable or The Condemned, this film does exactly what it intends to do. This film gets in your head by giving the pretense that you will witness all the horrible acts, and then turns around on you by not showing anything! Everything is off-screen so you are left with only the sound effects. It is more disturbing as your imagination sets to work on the images off screen, and that in itself is more horrifying.\n\nHaneke crafts a superbly intelligent psychological horror, but almost too intelligent as it almost falters on expecting you to know the philosophy behind the film-making and for someone knowing nothing about the film it might be confusing or frustrating.\n\nI would not recommend this film to everyone as it will disappoint the Saw/Hostel audience and may confuse newcomers. With that aside, I greatly welcomed the dissection of violence, and someone who understands the point of the film and enjoys art house-style film-making will appreciate it. \n\nEnjoy\n\nLGLuX","torrent":{"xt":"urn:btih:f23d6b3d382f6cefb9fab0fc1ce73c1a85df62b5","amp;dn":"Funny.Games.US.ENG.DVDRip-LGLuX.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f23d6b3d382f6cefb9fab0fc1ce73c1a85df62b5","infoHashBuffer":{"type":"Buffer","data":[242,61,107,61,56,47,108,239,185,250,176,252,28,231,60,26,133,223,98,181]},"announce":[],"urlList":[]}}