{"title":"Autopilot: The Art and Science of Doing Nothing (2013) epub","uid":10106765,"size":844667,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f298b13ffbe0ba17b1c6199a79653344e559d4cd&amp;dn=Autopilot%3A+The+Art+and+Science+of+Doing+Nothing+%282013%29+epub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"bookzilla","files":1,"time":1399423331,"description":"Andrew Smart wants you to sit and do nothing much more often - and he has the science to explain why.\n\n At every turn we're pushed to do more, faster and more efficiently: that drumbeat resounds throughout our wage-slave society. Multitasking is not only a virtue, it's a necessity. Books such as Getting Things Done, The One Minute Manager, and The 7 Habits of Highly Effective People regularly top the bestseller lists, and have spawned a considerable industry.\n\n But Andrew Smart argues that slackers may have the last laugh. The latest neuroscience shows that the &quot;culture of effectiveness&quot; is not only ineffective, it can be harmful to your well-being. He makes a compelling case - backed by science - that filling life with activity at work and at home actually hurts your brain.\n\n A survivor of corporate-mandated &quot;Six Sigma&quot; training to improve efficiency, Smart has channeled a self-described &quot;loathing&quot; of the time-management industry into a witty, informative and wide-ranging book that draws on the most recent research into brain power. Use it to explain to bosses, family, and friends why you need to relax - right now.","torrent":{"xt":"urn:btih:f298b13ffbe0ba17b1c6199a79653344e559d4cd","amp;dn":"Autopilot%3A+The+Art+and+Science+of+Doing+Nothing+%282013%29+epub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f298b13ffbe0ba17b1c6199a79653344e559d4cd","infoHashBuffer":{"type":"Buffer","data":[242,152,177,63,251,224,186,23,177,198,25,154,121,101,51,68,229,89,212,205]},"announce":[],"urlList":[]}}