{"title":"A Month in the Country (1987)","uid":6299488,"size":733759488,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f32a83d003de95856cafe61278f315dc5685f994&amp;dn=A+Month+in+the+Country+%281987%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"pasky64","files":1,"time":1302108389,"description":"Set in the early 1920s, the film follows the experiences of an artist, Tom Birkin (Colin Firth), who has been employed to carry out restoration work on a Medieval mural discovered in a church in the small rural community of Oxgodby, Yorkshire. The escape to the idyllic countryside is cathartic for Birkin, a veteran of World War I, and he soon fits into the slow-paced life of the remote village. In particular he forms a close friendship with archaeologist  James Moon (Kenneth Branagh), another veteran, who, like Birkin, has been emotionally scarred by the war. Moon is similarly employed in the village, working to uncover a mysterious lost grave, but is more interested in discovering the remains of an earlier church building.\n\nBirkin becomes accepted into the Ellerbeck family, with whom he dines on Sundays, and they eventually persuade him to preach a sermon at the Methodist chapel. Birkin also forms an emotional, albeit unspoken, attachment to Alice Keach (Natasha Richardson), the young wife of the vicar. The vicar himself (Patrick Malahide), who dislikes the superstition still prevalent in the remote community, is portrayed unsympathetically as an obstruction to the ongoing work in the church.\n","torrent":{"xt":"urn:btih:f32a83d003de95856cafe61278f315dc5685f994","amp;dn":"A+Month+in+the+Country+%281987%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f32a83d003de95856cafe61278f315dc5685f994","infoHashBuffer":{"type":"Buffer","data":[243,42,131,208,3,222,149,133,108,175,230,18,120,243,21,220,86,133,249,148]},"announce":[],"urlList":[]}}