{"title":"Sophie scholl, los ultimos dias.DVDRIP.(spanish).","uid":5084033,"size":733747200,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f35b3577de89212192295351520c9df917f88c31&amp;dn=Sophie+scholl%2C+los+ultimos+dias.DVDRIP.%28spanish%29.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"zurera","files":1,"time":1252577253,"description":"Munich, 1943. Durante la devastadora ocupaciÃƒÂ³n de Europa por Hitler, un grupo de jÃƒÂ³venes, en su mayorÃƒÂ­a universitarios, recurre a la resistencia pa-siva como ÃƒÂºnica soluciÃƒÂ³n para paralizar a los na-zis y a su inhumana mÃƒÂ¡quina bÃƒÂ©lica. AsÃƒÂ­ nace La Rosa Blanca, un movimiento de resistencia cuyo propÃƒÂ³sito era la caÃƒÂ­da del Tercer Reich. Sophie Scholl (Julia Jentsch) es la ÃƒÂºnica mujer del grupo, una joven ingenua que no tardarÃƒÂ¡ en convertirse en una antinazi convencida e intrÃƒÂ©pida. El 18 de febrero de 1943 detienen a Sophie y a su hermano mientras distribuyen panfletos en la universidad. Durante los dÃƒÂ­as que siguen al arresto, el duro interrogatorio al que es sometida Sophie por parte de un oficial de la Gestapo, Robert Mohr (Alexander Held), no tarda en convertirse en un intenso duelo psicolÃƒÂ³gico. La joven miente y desmiente, maniobra y le reta, parece rendirse antes de ata-car de nuevo con renovadas fuerzas, y casi consigue derrotar a su oponente. Por fin, ante unas pruebas aplastantes, Sophie confiesa, aunque hace un ÃƒÂºltimo y desesperado intento para proteger a su her-mano y a los otros miembros de La Rosa Blanca. Conmovido por la in-frecuente valentÃƒÂ­a de Sophie, Robert Mohr le ofrece una escapatoria a cambio de traicionar sus ideales. Pero ella rechaza la oferta, su suerte estÃƒÂ¡ echada...","torrent":{"xt":"urn:btih:f35b3577de89212192295351520c9df917f88c31","amp;dn":"Sophie+scholl%2C+los+ultimos+dias.DVDRIP.%28spanish%29.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f35b3577de89212192295351520c9df917f88c31","infoHashBuffer":{"type":"Buffer","data":[243,91,53,119,222,137,33,33,146,41,83,81,82,12,157,249,23,248,140,49]},"announce":[],"urlList":[]}}