{"title":"Taking Back Sunday - Discography (2002-2014) [FLAC]","uid":9802910,"size":4124304525,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:f37d86cc88b704093d228ed87f63fdf38601ccdc&amp;dn=Taking+Back+Sunday+-+Discography+%282002-2014%29+%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"politux","files":-1,"time":1395410400,"description":"\n  Taking Back Sunday - Discography (2002-2014) [FLAC]\n\n  Genre: Pop/Rock\n  Styles: Alternative, Emo\n  Source: CD \n  Codec: FLAC\n  Bitrate: ~ 1,000 kbps\n  Bit Depth: 16\n  Sample Rate: 44.1 kHz\n\n  2001 Taking Back Sunday EP\n  2002 Taking Back Sunday (Tell All Your Friends Demo)\n  2004 Where You Want To Be\n  2005 Tell All Your Friends (Bonus Edition)\n  2006 Louder Now (Partone)\n  2007 Louder Now (Parttwo)\n  2007 Notes From The Past\n  2009 New Again\n  2010 Live From Orensanz\n  2011 Taking Back Sunday\n  2011 Taking Back Sunday (Limited Edition)\n  2014 Happiness Is\n\n  Formed in 1999 in Amityville, New York, Taking Back Sunday modeled their interpretation of melodic hardcore after bands like Lifetime, Endpoint, and Sunny Day Real Estate, as well as guitarist Ed Reyes' emo outfit the Movielife. After the release of a five-song demo and a year's worth of touring (including shows with At the Drive-In and Alkaline Trio), Taking Back Sunday signed to Victory Records and entered New Jersey's Big Blue Meanie Recording Studios alongside producer Sal Villanueva and engineer Tim Gilles. The result, Tell All Your Friends, layered Adam Lazzara's emotional vocals and the dual-guitar assault of Reyes and John Nolan, fashioning a classic hardcore sound with pop songwriting components. The debut album was released in March 2002 and is the only official album to display the founding lineup.\n\n  The group spent the rest of that year and much of 2003 touring, but when Nolan and bassist Shaun Cooper left the band (which was rounded out by drummer Mark O'Connell), Taking Back Sunday's future was left in doubt. However, guitarist/vocalist Fred Mascherino (ex-Breaking Pangaea) and bassist Matt Rubano (ex-Schleigho) filled out the lineup in time for the band's fall 2003 tour and subsequent recording sessions. The sophomore effort, Where You Want to Be, arrived in summer 2004 and debuted at number three on Billboard's Top 200, establishing Taking Back Sunday as a forerunner in the wave of commercial emo bands. It also introduced the vocal interplay of Lazzara and Mascherino, a combination that would briefly become one of the band's sonic calling cards. TBS toured steadily behind the album, headlining a sold-out North American tour and hitting the usual Warped Tour stops as well.\n\n  In the wake of Where You Want to Be's success, Taking Back Sunday signed with Warner Bros. in June 2005 and co-headlined several shows with Jimmy Eat World. Ever the hard workers, they returned to the studio in August to commence work on their third full-length album. Produced by Eric Valentine (Third Eye Blind, Queens of the Stone Age), Louder Now debuted at number two upon its release in April 2006. The album was a darker, more aggressive effort that tapped into the band's live energy, which was further displayed on the concert CD/DVD package Louder Now: Part Two. Despite the band's mounting profile, however, Fred Mascherino exited the lineup in October 2007 and launched a solo career. Several months later, former Facing New York member Matt Fazzi was announced as Mascherino's replacement, and the revised band spent the bulk of 2008 writing new material and playing sporadic shows. New Again, the first album to feature Fazzi's contributions, was released in summer 2009. The concert album Live from Orensanz followed in 2010. Later that year, the band announced that the lineup from their debut, Tell All Your Friends, would be reuniting in the studio for their next album. The following year, the band released their fifth studio album, the eponymous Taking Back Sunday, followed by the EP Faith (When I Let You Down). Celebrating ten years since the release of their debut album, the revived lineup embarked on a tour in 2012, playing the album in its entirety. A live acoustic version of the tour was released for download in mid-2012 and at the same time, the group announced that they had started to record their sixth album. Produced by Marc Jacob Hudson and Mike Sapone, Happiness Is was released in the spring of 2014.","torrent":{"xt":"urn:btih:f37d86cc88b704093d228ed87f63fdf38601ccdc","amp;dn":"Taking+Back+Sunday+-+Discography+%282002-2014%29+%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f37d86cc88b704093d228ed87f63fdf38601ccdc","infoHashBuffer":{"type":"Buffer","data":[243,125,134,204,136,183,4,9,61,34,142,216,127,99,253,243,134,1,204,220]},"announce":[],"urlList":[]}}