{"title":"Maximum Minka (Scoreland) [DVDRip]","uid":8036479,"size":2431054952,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:f3cb1cf14ad6eb1d663be37347aa62d485c7871e&amp;dn=Maximum+Minka+%28Scoreland%29+%5BDVDRip%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"chkm8te","files":4,"time":1358530216,"description":"Maximum Minka (Scoreland) [DVDRip]\n\nWhether you are a recent fan of the amazing Minka or you've been an admirer since her debut for us in the October 1994 SCORE magazine, this DVD is the definitive guide to the story of the world's # 1 Asian tit-princess. Her fantasy-boobs measuring a staggering 56 inches on top and straining the straps of her 44KK brassieres, Korean-born Minka has remained a huge breast-man favorite for 16 years as a big-bust model, magazine covergirl, hardcore porn star, showgirl , ring girl and exotic dancer. Personally Hosted by Minka Throughout, Maximum Minka Tells her Story from her incredible Early days to the present. Minka Tells All and is the hostess of Maximum Minka, Celebrating 16 years of her career and association with SCORE magazine. Everything you could possibly want to know about Minka is in this special DVD. And in many ways, it's also the story of SCORE magazine's evolution. It begins with the Korean superstar's early days in America, and shows her gradual fantasy breast-expansion from the early '90s to the present, Minka's voyages on three Boob Cruises, the hooter-bouncing action of the Mega-Boob Olympics, five of her hottest, hardcore XXX fuck scenes-including a threesome with fellow bra-killer Kayla Kleevage and Blue Balls-and Minka destroying an assortment of bras. Minka takes you on a private tour of her home in Las Vegas; real-life tennis champion Minka hits the court with balls in hand, and she tours Miami's South Beach with the SCORE staff, where she stops traffic. And that's not all. The Extras section features rare footage of Minka at the mobbed SCORE exhibit at a trade show with fellow SCORE Girls, a intimate interview with the editor of SCORE, and even a personalized Korean food lesson with Minka. Almost three hours of mind-blowing tits, sex and exotic Asian pleasures makes Maximum Minka an absolute must-own DVD.\n\nScreens: &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=5bash2rgyuxs5atsagre.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=5bash2rgyuxs5atsagre.jpg&lt;/a&gt;\n &lt;a href=&quot;\nhttp://xxxhost.me/viewer.php?file=f9ws88pza6ahpmht2ow0.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://xxxhost.me/viewer.php?file=f9ws88pza6ahpmht2ow0.jpg&lt;/a&gt;","torrent":{"xt":"urn:btih:f3cb1cf14ad6eb1d663be37347aa62d485c7871e","amp;dn":"Maximum+Minka+%28Scoreland%29+%5BDVDRip%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3cb1cf14ad6eb1d663be37347aa62d485c7871e","infoHashBuffer":{"type":"Buffer","data":[243,203,28,241,74,214,235,29,102,59,227,115,71,170,98,212,133,199,135,30]},"announce":[],"urlList":[]}}