{"title":"The Cutting Edge 3: Chasing the Dream (2008)(ENG FR)(MULTI SUBS","uid":5163356,"size":4653687342,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f3f2d29cd4ddd8f73eb1eaaef056c3fe60295d18&amp;dn=The+Cutting+Edge+3%3A+Chasing+the+Dream+%282008%29%28ENG+FR%29%28MULTI+SUBS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Pioen","files":-1,"time":1258282756,"description":"The Cutting Edge 3: Chasing the Dream (2008) \n\nVanaf 17 november in de videotheek      \n\n\nVerenigde Staten\nDrama\n90 minuten\n\ngeregisseerd door Stuart Gillard\nmet Matt Lanter, Francia Raisa en Christy Carlson Romano\n\nZach (Matt Lander) en Celeste (Sarah Gadon) zijn samen een ijsschaats duo. Wanneer Celeste haar enkel kneust is Zach genoodzaakt een andere partner te zoeken. Zijn oog valt op de vrouwelijke ijshockeyspeelster Alexandra (Francia Raisa). Alexandra is nog een ruwe diamant die nog heel erg geslepen moet worden. Weten Zach en Alexandra zich klaar te maken voor de internationale spelen in Parijs?\n\n\nEnglish\n\nZach Conroy and Celeste Mercier are the hottest couple on and off the ice until a nasty spill knocks Celeste out of competition. With their dreams of gold medals put in ice and their romance chilling as a result, Zach has to find another partner for the championship in Paris. And fast. In glides Alejandra Alex Delgado, a beautiful, tough talking hockey player with fierce moves and a fearless skating style. Zachs willing to give her a chance, but his coach, Bryan quits in a huff to train Zachs biggest rivals, Cindy Halgyord and Jason Bright. That leaves Zach with a newbie partner and no coach until he convinces former figure skating champ Jackie Dorsey to step in. She puts Zach and Alex through their paces, but the hardest trick of all is keeping them focused on practice and not each other as they bicker and struggle with a growing attraction both on and off the ice. Jackie knows these kids are fire and ice, and sees the chemistry between them. She also knows that if they cant get it together, theyll set the skating world on fire. That is, if the heat between them doesnt cause a total meltdown. With the competition fierce and the stakes higher than ever, the only way Zach and Alex can win is by putting aside their feelings and pulling out a secret weapon: the deadly Pamchecko jump. But is it worth the risk? Can Zach rise above the past and his history of injuring partners? And can Alex prove that shes got the moves to match her passion? It all comes down to the biggest moment of their lives when they learn that sometimes on the ice and in life youve got to risk it all. \n\nSpotinformatie \nCategorie : Beeld \nFormaat : DVD5 \nBron : Retail\nSoort DVD: DVD5\nViDEO:UNTOUCHED\nAUDIO:English, French 5.1\nSubs:Dutch, English , French, Italian, Dutch, Russian, Croation, Greek, Portuguese, Romanian, Slovenian\nMENU: YES\nMENU TAAL:English\n\n\nGereed   \n \nGenre : Drama\n \nWeblink : http://www.moviemeter.nl/film/50207 \nWeblink : http://www.imdb.com/title/tt1110626\n\n***************************************** \n\n\nBrought to you by \nPioen\n2Lions Team\n\n &lt;a href=&quot;\nhttp://www.2lions.ons-forum.nl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.2lions.ons-forum.nl&lt;/a&gt;\n\n2Lions-Team for all your Dutch MOVIES and more \n\n*****************************************\n\nDON T HIT AND RUN Niet gelijk afhaken als de film binnen is blijf seeden.","torrent":{"xt":"urn:btih:f3f2d29cd4ddd8f73eb1eaaef056c3fe60295d18","amp;dn":"The+Cutting+Edge+3%3A+Chasing+the+Dream+%282008%29%28ENG+FR%29%28MULTI+SUBS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3f2d29cd4ddd8f73eb1eaaef056c3fe60295d18","infoHashBuffer":{"type":"Buffer","data":[243,242,210,156,212,221,216,247,62,177,234,174,240,86,195,254,96,41,93,24]},"announce":[],"urlList":[]}}