{"title":"Johnny Shines With Big Walter Horton(blues)(mp3@320)[rogercc]","uid":6607977,"size":94586683,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f49d2559c3d6d567a101da3a6a20012d3e445c54&amp;dn=Johnny+Shines+With+Big+Walter+Horton%28blues%29%28mp3%40320%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"rogercc1","files":13,"time":1313486961,"description":"JOHNNY SHINES WITH BIG WALTER HORTON\nAudio CD 1 Mar 2000 \nLabel: Testament\nFormat:Mp3@320\n\n\nCalling an album one the best in this particular genre, Chicago blues, is a pretty big move. There are plenty of masters of this particular form, and the success of several different record companies recording the genre over the years has assured no shortage of material. Something just comes together splendidly on these sessions that elevates this album well above the level of even some of the great Chicago sides of artists such as Muddy Waters. It might not exude the timeless gold dust of such records, but at the same time has a raw energy and breathless courage that goes well beyond anything the Chess label got on tape in its studios. The sound is also richly thick and loaded with midrange overtones. This benefits not only bass sounds but the presence of the drummers as well. Outrageous drum breaks are one byproduct, and the listener might even sense the ensemble somehow about to topple before everything comes together at the slightest chicken scratch of Johnny Shines' electric guitar. Bringing that subject up: in the late '60s, this artist had yet to start developing his acoustic country blues phase and was playing the electric as if a concrete pick had been welded to his hand. One can only imagine an uptight recording engineer fussing with this sound, trying get something slicker and more professional. Thankfully, the recording teams in charge of this blues masterpiece don't indulge in the quiver, shiver, and shake mentality and just let the sounds go down, including this Shines guitar sound, which is almost more like a living creature scratching at the insides of the speaker box like a misdirected rodent. We are approaching guitar heaven, but it vaults over the gates with the appearance of Luther Allison, whose meaty, juicy tone is the perfect contrast for Shines. This album collects tracks from two different recording sessions a few years apart. Allison is present for only one of the sessions, but the harmonica genius Big Walter Horton is on both dates, flooding the bandstand with chordal cascades and even bringing a frightening edge to some cuts with distorted vocalese. This is not only a great blues record, it is a great party blues record. ~ Eugene Chadbourne\n\n\nTracklist\n\n1. Hello Central \n2. You Don't Have To Go \n3. Sneakin' And Hidin' \n4. Till I Made My Tonsils Sore \n5. Fat Mama \n6. G. B. Blues \n7. Worried Life Blues \n8. I Cry, I Cry \n9. If It Ain't Me \n10. I Want To Warn You \n11. I Cry, I Cry (Alternate Take) \n12. Sneakin' And Hidin', Part 2\n","torrent":{"xt":"urn:btih:f49d2559c3d6d567a101da3a6a20012d3e445c54","amp;dn":"Johnny+Shines+With+Big+Walter+Horton%28blues%29%28mp3%40320%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f49d2559c3d6d567a101da3a6a20012d3e445c54","infoHashBuffer":{"type":"Buffer","data":[244,157,37,89,195,214,213,103,161,1,218,58,106,32,1,45,62,68,92,84]},"announce":[],"urlList":[]}}