{"title":"A Crafty Christmas - Mollie Cox Bryan","uid":11238562,"size":2056181,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f50eec43c686c1882ecfdc0f4a9114b2f109fa72&amp;dn=A+Crafty+Christmas+-+Mollie+Cox+Bryan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1413639940,"description":"&quot;Bryan's voice is rich with empathy, suspense, and Southern charm.&quot; --Ellery Adams, New York Times bestselling author\n\nChristmas is just around the corner, and the ladies of the Cumberland Creek Scrapbook Crop are thrilled when Sheila wins the first place prize in a scrapbooking design contest: a ten-day scrapbook-themed cruise in the Caribbean. Vera and Paige decide to tag along, which should pose the perfect opportunity to learn some new techniques, mingle with fellow croppers, and get in some rest and relaxation before the chaos of Christmas. But when Sheila finds a famous crafter dead, and investigators determine she was poisoned, the luxury cruise veers toward disaster as Sheila becomes the number one suspect--or was she really the intended victim? Just as the croppers begin un-wrapping the truth, a storm strands them at sea, and they'll find it's harder than ever to survive the holidays with a killer on deck. . .\n\nPraise for Mollie Cox Bryan\n\n&quot;A satisfying and surprising read.&quot; --Sheila Connolly, New York Times bestselling author on Scrapped\n\n&quot;Thought-provoking and well-paced. . . A great story, well told!&quot; --Juliet Blackwell, New York Times bestselling author of the Witchcraft mysteries on Scrapped\n\n&quot;A font of ingenuity. . .superb entertainment.&quot; --Mystery Scene * magazine on Scrapbook of Secrets*\n\nIncludes tips and a glossary of terms for the modern scrapbooker!\n\nReview\n\nThis book examines mental illness and desperation. Mollie Cox Bryan skillfully weaves these heavy topics into the cozy mystery so that the book is upbeat, while at the same time making you think. It is this combination that makes me enjoy her books so much.&quot;\n\n--Lynn Ferris, Examiner\n\nSeriously, it is awesome! I love holiday themed books. As a scrapbooker and card maker, this book really appealed to me and I loved reading and experiencing scrapbooking fun with the characters.\n~Brooke's Blogs\n\nI LOVE this series...What I like best about this series is the way Bryan has created a wonderful ensemble of characters. They really fit together as a team.\n~Booklady's Booknotes\n\nA CRAFTY CHRISTMAS is a great way to start getting into the holiday spirit and I think you should go right out get it and let the season begin! â™¥â™¥â™¥â™¥â™¥\n~Rantin' Ravin' and Reading\n\nI enjoy Mollie's writing style and how she puts twists and turns throughout the entire book. She keeps me guessing all the way to the end.\n~Griperang's Bookmarks\n\nI truly enjoyed this book. The characters continue to be their wonderful, unique, quirky selves. The location of a scrapbooking cruise was great ...\n~Books Are Life - Vita Libri\n\nMollie Cox Bryan has done it again, Her characters are likeable and the story keeps you reading until the end. I couldn't put this book down.\n~Shelley's Book Case\n\nAuthor Mollie Cox Bryan combines the holiday season and a luxury cruise for the perfect setting in the latest installment in her scrapbooking series. She mixes in a murder mystery, suspense and a dose of humor for a fun-filled adventure you can't resist.\n~Thoughts in Progress","torrent":{"xt":"urn:btih:f50eec43c686c1882ecfdc0f4a9114b2f109fa72","amp;dn":"A+Crafty+Christmas+-+Mollie+Cox+Bryan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f50eec43c686c1882ecfdc0f4a9114b2f109fa72","infoHashBuffer":{"type":"Buffer","data":[245,14,236,67,198,134,193,136,46,207,220,15,74,145,20,178,241,9,250,114]},"announce":[],"urlList":[]}}