{"title":"Dragonfly DVDRip Spanish","uid":4629628,"size":734312609,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f55f9a6ece41ef2caff6bf887354f347d229758a&amp;dn=Dragonfly+DVDRip+Spanish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Mois20","files":4,"time":1231344252,"description":"Cuando muere un ser querido, Ã‚Â¿se va para siempre? El jefe de urgencias del Chicago Me-morial Hospital, el Dr. Joe Darrow (Kevin Cost-ner) es un respetado experto en traumatologÃƒÂ­a. Pero su dilatada experiencia profesional no le sirve de mucho cuando su mujer muere trÃƒÂ¡gicamente. Emily Darrow (Susanna Thompson), que tambiÃƒÂ©n era mÃƒÂ©dico, se encontraba de misiÃƒÂ³n cuando falleciÃƒÂ³ en accidente de autobÃƒÂºs en una carretera de montaÃƒÂ±a de Venezuela. Seis meses despuÃƒÂ©s de su muerte, el cuerpo de Emily sigue sin aparecer y Joe estÃƒÂ¡ tan hundido que se ha aislado del mundo. Todo le recuerda a Emily, especialmente las libÃƒÂ©lulas, el amuleto personal de la joven debido a una marca de nacimiento que tenÃƒÂ­a en el hombro. La extraÃƒÂ±a forma empieza a aparecer en otros contextos, en todo lo que rodea a Joe. Parece decirle que debe mirar mÃƒÂ¡s allÃƒÂ¡ de lo que tiene ante los ojos si quiere encontrar la respuesta a sus preguntas. De hecho, estas preguntas incomodan a todo el mundo, salvo a la Hermana Made-line (Linda Hunt), una monja catÃƒÂ³lica que ha estudiado las oscuras profundidades de las experiencias prÃƒÂ³ximas a la muerte. Mientras los demÃƒÂ¡s le dicen que tiene que pasar pÃƒÂ¡gina y volver a empezar, la Hermana Madeline se da cuenta que Joe y Emily tienen asuntos pendientes y que ninguno de los dos descansarÃƒÂ¡ hasta que todo quede resuelto. Con esta idea en mente, Joe logra dar un paso adelante, aunque le guÃƒÂ­a mÃƒÂ¡s la fe que la realidad. Y ese paso va a significar un cambio decisivo en su vida.","torrent":{"xt":"urn:btih:f55f9a6ece41ef2caff6bf887354f347d229758a","amp;dn":"Dragonfly+DVDRip+Spanish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f55f9a6ece41ef2caff6bf887354f347d229758a","infoHashBuffer":{"type":"Buffer","data":[245,95,154,110,206,65,239,44,175,246,191,136,115,84,243,71,210,41,117,138]},"announce":[],"urlList":[]}}