{"title":"Chris Botti - My Funny Valentine (2006) [CD Rip] vtwin88cube","uid":6172525,"size":111612494,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f621b005157679f2fe4ec120b7c73957aa641a53&amp;dn=Chris+Botti+-+My+Funny+Valentine+%282006%29+%5BCD+Rip%5D+vtwin88cube&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vtwin88cube","files":-1,"time":1297639170,"description":"Chris Botti\nMy Funny Valentine\nVictoria's Secret Exclusive (2006)\n\nThough best-known as a contemporary jazz performer, trumpeter Chris Botti made his initial splash on the pop music scene. A native of Oregon, he started playing at the age of ten, and while still in high school, he began performing professionally. After studying in the prestigious Indiana University music program under the noted jazz educator David Baker, Botti relocated to New York, where he served with saxophonist George Coleman and trumpet great Woody Shaw; under the guidance of producers including Hugh Padgham and Arif Mardin, he swiftly emerged as a highly regarded pop session player, lending his trumpet to recordings from figures including Bob Dylan, Aretha Franklin, and Thomas Dolby. In 1990, Botti was asked to join Paul Simon's band, where he remained for the next five years. Finally, in 1995, he recorded his solo debut, First Wish, a record combining the sounds of contemporary pop-jazz with the textures of art rock. After scoring the 1996 film Caught, Botti resurfaced in 1997 with his second LP, Midnight Without You, which was followed by Slowing Down the World in 1999. Two years later, he was a featured soloist on Sting's Brand New Day world tour, and that time allowed Botti to rediscover old musical passions and create new ones. Night Sessions (2001), which was recorded in Los Angeles, captured such jazzy pop. That muse was explored further in 2003 with A Thousand Kisses Deep, and to a lesser extent on the more traditional orchestral jazz of 2004's When I Fall in Love. That record was his first Top 40 entry, and it was followed by the number 18 hit To Love Again: The Duets in 2005. Another Top 40 placement, Italia, followed in 2007, with the live album Chris Botti in Boston following in 2009.\n\nChannels:\t\t2 (Stereo)\nSample Rate:\t\t44.1 KHz\nSample Size:\t\t16 bit\nBit Rate:\t\t320 kbps\n\nAudio Quality:\t\tVery High (Lossy)\nEncoder:\t\tLAME 3.98r\nEncoder Settings:\tConstant Bit Rate 320 kbps (Insane)\nContains:\t\tAlbum Art, ID Tag [ID3v2.3 (ANSI) &amp; ID3v1.1]\nM3U Playlist:\t\tYes\n\nFormat:\t\t\tMp3\nGenre:\t\t\tJazz\nSource:\t\t\tRetail CD\n\n01.My Funny Valentine (Live From Studio A) (Previously Unreleased)\n02.To Love Again\n03.My Romance\n04.My One And Only Love (Feat. Paula Cole)\n05.Embraceable You\n06.Are You Lonesome Tonight (Feat. Paul Buchanan)\n07.You Don't Know What Love Is\n08.Pavanne\n09.Someone To Watch Over Me\n10.What'll I Do\n","torrent":{"xt":"urn:btih:f621b005157679f2fe4ec120b7c73957aa641a53","amp;dn":"Chris+Botti+-+My+Funny+Valentine+%282006%29+%5BCD+Rip%5D+vtwin88cube","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f621b005157679f2fe4ec120b7c73957aa641a53","infoHashBuffer":{"type":"Buffer","data":[246,33,176,5,21,118,121,242,254,78,193,32,183,199,57,87,170,100,26,83]},"announce":[],"urlList":[]}}