{"title":"Songs From the Stars by Norman Spinrad (epub,mobi,pdf)","uid":10612893,"size":1515919,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f653456cb655219acb48c3ef7baa1da04754b3cb&amp;dn=Songs+From+the+Stars+by+Norman+Spinrad+%28epub%2Cmobi%2Cpdf%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"gratefuldawg77","files":5,"time":1406063155,"description":"Centuries after the big smash, the successor civilization of Aquaria more or less flourishes on the west coast of what was once the United States, a society built on White Science, following the &quot;law of muscle, sun, wind and water.&quot; Only the sorcerers of Space Systems, Inc., dare traffic in the &quot;Black Sciences&quot; of atomic, petroleum and physics which destroyed the old golden age of space, for they alone know of the higher destiny that awaits man in the abandoned Big Ear space station. For centuries, they have secretly infiltrated Aquarius through the gray town of La Mirage while crafting a spaceship capable of reaching the Big Ear and turning man's ears once more to the mysterious Songs from the Stars.\nNow, through the Aquarians Clear Blue Lou, perfect master of the Clear Blue Way, and Sunshine Sue, queen of the Word of Mouth communication network, they scheme to bring their ultimate scenario to fruition.\nSex, love, emotion, karma, destiny, perhaps even The Way itself, all become elements in the scenario of Arnold Harker, Black Scientist, sorcerer, project manager of Operation Enterprise.\nBut when Clear Blue Lou, Sunshine Sue and Arnold Harker finally confront the interstellar brotherhood of sentient beings, they find, each in his way, that The Galactic Way utterly transcends their hopes, wildest dreams and darkest fears. In this novel of science, mysticism and their ultimate synergistic fusion, Norman Spinrad once again demonstrates his power to create a vivid future that encompasses our dreams of space\n &lt;a href=&quot;\nhttps://www.goodreads.com/book/show/10151508-songs-from-the-stars&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttps://www.goodreads.com/book/show/10151508-songs-from-the-stars&lt;/a&gt;","torrent":{"xt":"urn:btih:f653456cb655219acb48c3ef7baa1da04754b3cb","amp;dn":"Songs+From+the+Stars+by+Norman+Spinrad+%28epub%2Cmobi%2Cpdf%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f653456cb655219acb48c3ef7baa1da04754b3cb","infoHashBuffer":{"type":"Buffer","data":[246,83,69,108,182,85,33,154,203,72,195,239,123,170,29,160,71,84,179,203]},"announce":[],"urlList":[]}}