{"title":"Conspiracy World - Texe Marrs","uid":11712905,"size":16468492,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f67bd313cb41cf0251f0f5989500edef2ddfc98b&amp;dn=Conspiracy+World+-+Texe+Marrs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"starxteel","files":1,"time":1424399576,"description":"&quot;Conspiracies are very real. Here is proof that the world is more strange and far more evil and dangerous than you and I can even imagine.&quot;\nFor over two decades researcher and author Texe Marrs has investigated true history and real news. In Conspiracy World you get some of the best of his findings and results. What you read in these pages may well surprise, shock, and anger you. In some cases, discovering the hard, cold facts might even frighten you out of your wits.\nThis is not the politically correct, tainted and flawed &quot;news&quot; stuff you typically read in your newspapers or view on controlled media TV programs - CBS, ABC, NBC, Fox, etc. What Texe Marrs has done is rip off the veneer. Tearing away the pretense and dismissing the Orwellian doublespeak of mainstream politicians and educators, he tells readers exactly what really happened, he examines what is going on now at this moment that seriously affects your life, and more important, he reveals tomorrow's news today! His track record for predictive events is breathtakingly on-target.\nIn this stunning and fascinating huge volume, you will learn of things secret, and things forbidden about government coverups and scandals, of Big Brother's fast-growth police state, the truth about the Illuminati and secret societies, mind-boggling disclosures concerning UFOs, aliens, and extraterrestrials, the inside scoop on dangerous cults and unholy, wicked religions, the scary true story of mind control, satanism, and black science, the facts about the elitists' goal of depopulation of planet earth, and about actual plans for 21st century concentration camps in the U.S.A. You'll also discover evidence exposing the power elite of global banking cartels who have greedy designs on your wallet.\nRead and be amazed. Then, tell others what you have discovered. Help spread the truth before it's too late before more minds become numbed from poison vaccine administered by a faceless bureaucrat, or perhaps, we all end up locked away somewhere in a remote gulag prison cell. And remember the whole planet is literally brimming with unheralded secrets. That's not conspiracy theory. It's undeniable, eye-opening history, and it is irresistible, unvarnished truth. What we have here is nothing less than Conspiracy World.\n\nAbout the author:\n Texe Marrs is author of 46 books, including The Personal Robot Book; Careers with Robots; The Great Robot Book; and Codex Magica: Secret Signs, Mysterious Symbols, and Hidden Codes of the Illuminati. A retired United States Air Force officer, he graduated Summa Cum Laude from Park University and earned his Masters Degree at North Carolina State University. Mr. Marrs is founder and president of powerofprophecy.com in Austin, Texas and is host of a popular radio program heard around the world","torrent":{"xt":"urn:btih:f67bd313cb41cf0251f0f5989500edef2ddfc98b","amp;dn":"Conspiracy+World+-+Texe+Marrs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f67bd313cb41cf0251f0f5989500edef2ddfc98b","infoHashBuffer":{"type":"Buffer","data":[246,123,211,19,203,65,207,2,81,240,245,152,149,0,237,239,45,223,201,139]},"announce":[],"urlList":[]}}