{"title":"John Yudkin - Pure, White and Deadly (1972, Revised 1988 Edition","uid":7359846,"size":38030645,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6deee8e0218d1a6c8fc22baf1ddb258309200d0&amp;dn=John+Yudkin+-+Pure%2C+White+and+Deadly+%281972%2C+Revised+1988+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PoliticoJoe","files":-1,"time":1339921431,"description":"[img]http://tjockispojken.blogg.se/images/2011/socker_148307515.jpg[/img] [img]http://ecx.images-amazon.com/images/I/61GOIg0VUaL._SL500_.jpg[/img]\n\nJohn Yudkin: [i]&quot;Pure, White and Deadly&quot;: Problem of Sugar: The new facts about the sugar you eat as a cause of heart disease, diabetes and other killers.[/i] Written in 1972, Revised in 1986 and lastly 1988. \n\nThis is the rare and out-of-print, but ahead of its time groundbreaking study of how Sugar causes obesity! Widely panned and discredited at the time, Yudkin today get's the last laugh as all of his conclusions and predictions have come true. Note: HFCS wide usage began in 1984, Obesity stats were not collected until 1985 and this data is from 1986 so please keep that in mind while reading.\n\nThis book is NOT available anywhere today and used sells for $250 USD - $800 USD. I've painstakingly scanned the edition held in the FDA HQ's library (Silver Spring, MD) for [i][b]EDUCATIONAL PURPOSES ONLY![/b][/i]\n\n&quot;Yudkin was a Profit&quot; - As lauded by Dr. Robert H. Lustig on BBC's &quot;The Men Who Made Us Fat&quot; (Part One of Three).\nTorrent:\nInfo: [url=http://www.bbc.co.uk/programmes/b01jxzv8]http://www.bbc.co.uk/programmes/b01jxzv8[/url]\n\nAlso lauded in Lusting's UCTV lecture, &quot;Sugar: The Bitter Truth&quot;, which may be viewed on YouTube:\n\n[quote]Why do people eat so much sugar?\nWhy do we know so little about its dangers?\nHow strong is the scientific case against sugar?\nShould it even be banned altogether?\n\nJohn Yudkin was one of the first to point out the dangers of sugar when he published the original edition of Pure, White, and Deadly in 1972. Now, in this extensively rewritten and expanded edition, he reveals the new evidence about the dangers of sugar and its drastic consequences for our health. In everyday language Professor Yudkin explains how sugar consumption is linked to diabetes, heart and liver disease, dental caries and other conditions. He pays particular attention to its effects on young children and shows how they, like everyone else, can benefit from reduced sugar intake. He also examines the role of the sugar industry, which has made the strenuous efforts to dismiss the case against sugar.\n\nPure, White and Deadly is a shocking indictment of a product that is an everyday (and often invisible) part of our diet. It should be read by all who are concerned with their own and the nation's welfare. [/quote]\n\nPaperback: 200 pages\nPublisher: Penguin Books Ltd; 2Rev Ed edition (April 28, 1988)\nLanguage: English\nISBN-10: 0140083537\nISBN-13: 978-0140083538","torrent":{"xt":"urn:btih:f6deee8e0218d1a6c8fc22baf1ddb258309200d0","amp;dn":"John+Yudkin+-+Pure%2C+White+and+Deadly+%281972%2C+Revised+1988+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6deee8e0218d1a6c8fc22baf1ddb258309200d0","infoHashBuffer":{"type":"Buffer","data":[246,222,238,142,2,24,209,166,200,252,34,186,241,221,178,88,48,146,0,208]},"announce":[],"urlList":[]}}