{"title":"Seinfeld Complete Boxset DVDRip","uid":11223186,"size":32961486848,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f710f4ae5579ca0837ff21c815759b10b76fa4d8&amp;dn=Seinfeld+Complete+Boxset+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":7,"uploader":null,"files":171,"time":1413409565,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0098904/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0098904/&lt;/a&gt;\n\nGenre Situation comedy\nCamera setup Single camera\nRunning time approx. 0:23 (per episode)\nCreator(s) Larry David &amp; Gerry Seinfeld\nStarring Jerry Seinfeld, Julia Louis-Dreyfus, Jason Alexander &amp; Michael Richards\nCountry of origin US\nOriginal channel NBC\nOriginal run July 5, 1989 ï¿½ May 14, 1998\nNo. of episodes 180\n\nPlot:\n\nSeinfeld is an Emmy Award-winning American situation comedy that originally aired on the National Broadcasting Company from July 5, 1989 to May 14, 1998, lasting nine seasons. Many of its catchphrases have entered into the popular culture lexicon. The show led the Arthur Nielsen Media Research Ratings in its sixth and ninth seasons and finished among the top two (along with NBC's ER) every year from 1994 to 1998. In 2002, TV Guide named Seinfeld as the greatest American television program of all time. In 2006, a sitcom industry poll conducted by UK Channel 4 voted Seinfeld as the third best sitcom ever, ranking behind Frasier and Fawlty Towers. The series was created by Jerry Seinfeld and Larry David, with the former starring as an eponymous fictionalized version of himself. Set predominantly in an apartment block on New York City's Upper West Side, the show features a host of Jerry's friends and acquaintances, which include George Costanza, Elaine Benes and Cosmo Kramer. Seinfeld was produced by Castle Rock Entertainment and distributed by Columbia Pictures Television and Columbia TriStar Television (now Sony Pictures Television). It was largely co-written by David and Seinfeld with inputs from numerous script writers, including Larry Charles, Peter Mehlman, Gregg Kavet, Andy Robin, Carol Leifer, David Mandel, Jeff Schaffer, Steve Koren, Jennifer Crittenden, Tom Gammill, Max Pross, Charlie Rubin, Alec Berg, Spike Feresten, and Peter and Bobby Farrelly","torrent":{"xt":"urn:btih:f710f4ae5579ca0837ff21c815759b10b76fa4d8","amp;dn":"Seinfeld+Complete+Boxset+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f710f4ae5579ca0837ff21c815759b10b76fa4d8","infoHashBuffer":{"type":"Buffer","data":[247,16,244,174,85,121,202,8,55,255,33,200,21,117,155,16,183,111,164,216]},"announce":[],"urlList":[]}}