{"title":"Red - Release the Panic Recalibrated - 320 kbps","uid":10121377,"size":64346113,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f7c795a2e52f6338276ac48ef798339c2cfd7320&amp;dn=Red+-+Release+the+Panic+Recalibrated+-+320+kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"blitzcomp","files":7,"time":1399677968,"description":"Taken from http://www.jesusfreakhideout.com/\n\nOn the heels of their most underwhelming album to date, Red is poised to re-Release The Panic with a slightly different approach. Many fans were disappointed with the lack of orchestration on their latest effort and it seems that Release the Panic: Recalibrated is the answer Red fans have been hoping for. This album takes 6 songs off of Release the Panic and adds strings/orchestration. It also includes one B-Side track called &quot;Run and Escape.&quot;\n\nThe first half of the album features heavy post-grunge rockers with a hint of metal that bounce beautifully between screaming and clean vocals. &quot;Run and Escape&quot; is a great driving opener with excellent strings and a strong melody. In the second verse, the lead singer Mike Barnes growls, &quot;Fear and shame descend on me / I close my mind and let it be / enslaving me and sealing my fate&quot; and in the chorus he starts to break free from that agony, &quot;Run and escape from the chains that weigh me down&quot;. The song displays a lot of emotion, especially during the bridge when the music comes to a complete stop before bursting into a beautiful haunting instrumental. Unfortunately, the next two songs, &quot;Damage&quot; and &quot;Release the Panic,&quot; do little to separate the songs from their original versions.\n\nThe second half of the EP is filled with mid-tempo radio friendly cuts. The strings that have been added to these four tracks have been masterfully integrated into the music resulting in a sound that is better than the originals. For these songs, the power chord guitars have been turned down to highlight the elegant strings which give the music a rich and beautiful atmosphere.\n\nAs always with Red, these songs are filled with confusion, anguish, and frustration but ultimately have an optimistic and redemptive outlook. If you have already purchased or listened to the original album and like it, you will surely like this &quot;recalibrated&quot; edition. Although it is a bit disappointing that they only re-did half of the album, the end product is a better version of their original and is filled with songs that are both heavy-hitting and beautifully orchestrated.","torrent":{"xt":"urn:btih:f7c795a2e52f6338276ac48ef798339c2cfd7320","amp;dn":"Red+-+Release+the+Panic+Recalibrated+-+320+kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f7c795a2e52f6338276ac48ef798339c2cfd7320","infoHashBuffer":{"type":"Buffer","data":[247,199,149,162,229,47,99,56,39,106,196,142,247,152,51,156,44,253,115,32]},"announce":[],"urlList":[]}}