{"title":"Into the Bermuda Triangle : Pursuing the Truth Behind the World'","uid":11818355,"size":3981008,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f8a7c4838c0687ad4f8d560906340f845a3de9a5&amp;dn=Into+the+Bermuda+Triangle+%3A+Pursuing+the+Truth+Behind+the+World%27&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"HowdyDooDoo","files":1,"time":1429171912,"description":"Still unsolved, still baffling, still claiming new victims. Here are the untold stories. A pilot reports a strange haze enveloping his plane, then disappears; eleven hours after fuel starvation, as if calling from a void, he is heard 600 miles away. He requests permission to land, then vanishes forever. A freighter steaming over placid seas disappears without a trace. A pleasure yacht ghosts past without a soul on board. A pilot calls for help because a &quot;weird object&quot; is harassing his plane. A jet collides with an &quot;unknown&quot; and is never found. . . . Into the Bermuda Triangle is the first comprehensive examination of these baffling disappearances in more than a generation. Drawing on official reports from the NTSB and other investigative agencies as well as interviews with scientists, theorists, and survivors, leading authority Gian Quasar not only sets the record straight on previously examined cases, he also offers a bulging file of new cases, the collective results of his twelve-year investigation. In meticulous detail this unflinching account: Documents confirmed disappearances of airplanes and ships Gathers new testimony and reexamines old interviews from eyewitnesses and survivors Explores possible explanations ranging from zero-point energy to magnetic vortices Challenges our assumptions with the sheer weight of accumulated evidence In this age of technological and scientific discovery, there are still mysteries that transcend understanding. The Bermuda Triangle is one","torrent":{"xt":"urn:btih:f8a7c4838c0687ad4f8d560906340f845a3de9a5","amp;dn":"Into+the+Bermuda+Triangle+%3A+Pursuing+the+Truth+Behind+the+World%27","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8a7c4838c0687ad4f8d560906340f845a3de9a5","infoHashBuffer":{"type":"Buffer","data":[248,167,196,131,140,6,135,173,79,141,86,9,6,52,15,132,90,61,233,165]},"announce":[],"urlList":[]}}