{"title":"Family Guy Seizoen 2 DVDR XviD - NLsubs DutchReleaseTeam","uid":6030942,"size":3851559858,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f91dd1256a95b26143b593b44d7c169497af87e5&amp;dn=Family+Guy+Seizoen+2+DVDR+XviD+-+NLsubs+DutchReleaseTeam&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Koedje","files":26,"time":1292078455,"description":"Plot:\n\nDe animatieserie over een gestoorde familie met een vader die het wel probeert maar er niet in slaagt om enige stuctuur en regelmaat in zijn eigen leven en dat van zijn familie te scheppen. Niets is te gek. Er gebeurt altijd van alles in de familie van vader Peter Griffin. Maar het is voornamelijk chaos en wanorde die heersen. De jongste van de drie kinderen in de familie, Stewie, is een duivels mannetje die een moordaanslag niet uit de weg gaat als ie zijn zin niet krijgt. De hond Brian mengt zich in de conversaties want hij kan praten, rookt sigaretjes en drinkt een martini op zijn tijd. En moeder is de enige stabiele factor in het gezin en daarom vaak het middelpunt van spot en grappen. Eigenlijk heeft Family Guy geen vaste verhaallijn behalve dat er altijd bizarre en enorm lachwekkende situaties zijn. Die doorgaans beginnen met een mooi plan van vader Peter wat bijna altijd desastreus uitpakt voor hem en zijn familie. Family Guy is inmiddels een klassieke comedy serie die elke keer weer verrast met bizarre wendingen en de meest originele grappen.\n\n\nSeizoen 2:\n\n\n\nSeizoen 2 Aflevering 1: Peter, Peter, Caviar Eater\nPeter changes for the worse after he and Lois inherit a mansion in Newport.\n\n\t\n\nSeizoen 2 Aflevering 2: Holy Crap\nPeter\\'s ultra-religious father causes trouble when he comes to live with the family.\n\n\t\n\nSeizoen 2 Aflevering 3: Da Boom\nThe Griffins survive a Y2K atomic holocaust and attempt to rebuild civilization.\n\n\t\n\nSeizoen 2 Aflevering 4: Brian in Love\nBrian suffers from a mid-life crisis that may be due to unrequited love.\n\t\n\n\nSeizoen 2 Aflevering 5: Love Thy Trophy\nEveryone on Spooner Street becomes enemies when a trophy they all won mysteriously goes missing; Meg makes extra tips at her new job as a waitress by telling everyone she\\'s unwed, teenage mother of Stewie.\n\t\n\n\nSeizoen 2 Aflevering 6: Death Is a Bitch\nIn an attempt to avoid paying expensive hospital bill, Peter says that he is dead on hospital sign-out sheet. Later that night he visited by Death who has come to take him away. While chasing Peter down, Death twists his ankle and cannot fulfill his duties. So Peter must take his place.\n\n\t\n\nSeizoen 2 Aflevering 7: The King Is Dead\nPeter takes over Lois\\' production of The King and I.\n\n\t\n\nSeizoen 2 Aflevering 8: I Am Peter, Hear Me Roar\nAfter being sued for sexual harassment, Peter is forced to attend sensitivity training seminar. After failing miserably Peter is then sent to an all women\\'s retreat. Upon returning Peter has a new personality and a new outlook upon life. Both of which are exactly like that of a woman\\'s.\n\t\n\n\nSeizoen 2 Aflevering 9: If I\\'m Dyin\\' I\\'m Lyin\\'\nPeter\\'s attempt to un-cancel a TV show gets him worshiped as a god.\n\n\t\n\nSeizoen 2 Aflevering 10: Running Mates\nPeter and Lois face off in a school board election.\n\n\t\n\nSeizoen 2 Aflevering 11: A Picture Is Worth 1,000 Bucks\nChris\\' artwork gets discovered by a famous critic.\n\n\t\n\nSeizoen 2 Aflevering 12: Fifteen Minutes of Shame\nMeg\\'s plan to embarrass her family backfires.\n\n\t\n\nSeizoen 2 Aflevering 13: Road to Rhode Island\nBrian and Stewie have to make their way across the US.\n\n\t\n\nSeizoen 2 Aflevering 14: Let\\'s Go to the Hop\nPeter goes undercover to stop a toad-licking epidemic.\n\n\t\nSeizoen 2 Aflevering 15: Dammit Janet\nStewie discovers love at the day care center.\n\n\n\t\nSeizoen 2 Aflevering 16: There\\'s Something About Paulie\nPeter has to repay a mafia debt by playing babysitter for Big Fat Paulie.\n\n\n\t\nSeizoen 2 Aflevering 17: He\\'s Too Sexy for His Fat\nLiposuction turns Peter beautiful, but insufferable.\n\n\n\t\nSeizoen 2 Aflevering 18: E. Peterbus Unum\nPeter\\'s home becomes an independent nation and goes to war with the US.\n\n\n\t\nSeizoen 2 Aflevering 19: The Story on Page One\nMeg gets the lead story in her school paper, but it\\'s not the one she wrote.\n\n\n\t\nSeizoen 2 Aflevering 20: Wasted Talent\nPeter becomes a master pianist as long as he\\'s drunk.\n\n\n\t\nSeizoen 2 Aflevering 21: Fore, Father\nPeter becomes a golf mentor to Cleveland\\'s son.\n\n\n\nMeer zien? Kijk dan op - http://hetmultimediacafe.nl/index.php\n\nDutchReleaseteam = Hardcoded Dutch Subs","torrent":{"xt":"urn:btih:f91dd1256a95b26143b593b44d7c169497af87e5","amp;dn":"Family+Guy+Seizoen+2+DVDR+XviD+-+NLsubs+DutchReleaseTeam","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f91dd1256a95b26143b593b44d7c169497af87e5","infoHashBuffer":{"type":"Buffer","data":[249,29,209,37,106,149,178,97,67,181,147,180,77,124,22,148,151,175,135,229]},"announce":[],"urlList":[]}}