{"title":"Frankenstein Meets The Wolfman [1943] @ .avi","uid":4751491,"size":481199110,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f92e115ee92991945743a71a4f62c7d000022ae5&amp;dn=Frankenstein+Meets+The+Wolfman+%5B1943%5D+%40+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"alien99","files":1,"time":1236209251,"description":"Lon Chaney Jr.\t ... \tLawrence Stewart Talbot / The Wolf Man (as Lon Chaney)\n\tIlona Massey\t... \tBaroness Elsa Frankenstein\n\tPatric Knowles\t... \tDr. Frank Mannering\n\tLionel Atwill\t... \tMayor\n\tBela Lugosi\t... \tThe Frankenstein Monster\nuthor: simeon_flake\n\nOne must pity the Wolf Man. Marked not only with the pentagram, but marked to never have a sequel that was all his own. A real shame, considering that even the likes of the Mummy got 'four' sequels. Universal begins their monster-mash rallies of the 1940s here, as Wolfie must share his sandbox with the &quot;undying monster&quot; &amp; the two get along well for the most part, but eventually, even the best of friends will have their disputes....\n\nThe film begins on a very high note, with one of the most chilling and atmospheric openings in any horror movie. The potential was certainly here for a great 'Wolf Man' sequel that could've surpassed the original. Too bad the monster has to rear his ugly, stitched up head.\n\nSpeaking of that monster, &quot;Poor Bela&quot; always get the blame dumped on him for why this film had to be chopped up in post-production, the story always being that the monster with his voice was simply too &quot;Hungarian funny&quot;, yet this film was produced by the same Universal that a year earlier made &quot;Ghost of Frankenstein&quot; which featured the monster with Bela's voice. It didn't bother anyone then, so what was the problem now? There has to be more to the story than &quot;it was all Lugosi's fault&quot;. Would it be considered out of the realm of possibility to speculate that perhaps the great Curt Siodmak (the screenwriter) wrote some seriously crappy dialogue for the creature to recite that would've produced titters no matter who spoke it?\n","torrent":{"xt":"urn:btih:f92e115ee92991945743a71a4f62c7d000022ae5","amp;dn":"Frankenstein+Meets+The+Wolfman+%5B1943%5D+%40+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f92e115ee92991945743a71a4f62c7d000022ae5","infoHashBuffer":{"type":"Buffer","data":[249,46,17,94,233,41,145,148,87,67,167,26,79,98,199,208,0,2,42,229]},"announce":[],"urlList":[]}}