{"title":"Grocery Warning","uid":6864526,"size":3891808,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f9349f63254ad8ebb38cc835b83991b7716568aa&amp;dn=Grocery+Warning&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Djofullinn","files":1,"time":1323039950,"description":"Consumer warning: Thousands of brand-name grocery products are contaminated with toxic chemicals and dangerous ingredients... Would you like to know which ones? Did you know that food companies deliberately add harmful chemicals and additives to your food? Now learn how to identify and avoid these harmful chemicals to save yourself from cancer, heart disease, diabetes, depression and much more... Did you know that 95% of shoppers fill their grocery carts with ingredients known to cause cancer? You're probably one of these shoppers -- which means you may be buying poison without even knowing it. And the results are devastating: cancer, diabetes, heart disease, depression, obesity, migraines and even worse. But now, in Grocery Warning, consumer health advocate Mike Adams exposes what he calls, &quot;The Great Chemical Cover-Up&quot; of the food companies, revealing the most common toxic food additives and ingredients promoting life-threatening diseases that can leave you bankrupt and dead -- at virtually any age! You've probably heard of trans fatty acids and hydrogenated oils, but did you know there are other ingredients that are just as harmful to your health, but are almost never covered in the mainstream press? Grocery Warning reveals what the so-called health authorities refuse to admit about the dangerous ingredients, chemicals and additives in food that directly promote obesity and degenerative disease. Grocery Warning is a must-have guide for every consumer who wishes to protect themselves (and their families) from the life-threatening chemicals found in foods, beverages and grocery products.\n &lt;a href=&quot;\nhttp://www.amazon.com/Grocery-Warning-System-Health-Ranger/dp/B001SSDUEG/ref=sr_1_1_title_0_main?s=books&amp;ie=UTF8&amp;qid=1322979026&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Grocery-Warning-System-Health-Ranger/dp/B001SSDUEG/ref=sr_1_1_title_0_main?s=books&amp;ie=UTF8&amp;qid=1322979026&amp;sr=1-1&lt;/a&gt;","torrent":{"xt":"urn:btih:f9349f63254ad8ebb38cc835b83991b7716568aa","amp;dn":"Grocery+Warning","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9349f63254ad8ebb38cc835b83991b7716568aa","infoHashBuffer":{"type":"Buffer","data":[249,52,159,99,37,74,216,235,179,140,200,53,184,57,145,183,113,101,104,170]},"announce":[],"urlList":[]}}