{"title":"ASTRO CITY (volume 1) 01-06 COMPLETE (2013 DC digital editions)","uid":8564096,"size":358905851,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:f9ed8a909a4715403b706ca5596fb3669931e1f6&amp;dn=ASTRO+CITY+%28volume+1%29+01-06+COMPLETE+%282013+DC+digital+editions%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"STFmaryville","files":-1,"time":1370959213,"description":"One of the best series of the last 20 years! Here are the new 2013 digital editions (from DC) of the 1995 six-issue miniseries that introduced a fictional American city and the ordinary people that live there, coping in many different ways with the heroes and villains that walk -- and fly -- among them. This series reunited Alex Ross (cover artist, character designs and co-plotter) with his creative partner from MARVELS, writer Kurt Busiek, and reintroduced the fantastic art of Brent Anderson.\n\nThese are the new digital HD releases from DC Comics (which owns Wildstorm, the first home of Astro City under &quot;Homage Comics&quot;) courtesy of Son of Ultron-Empire. They are 1920 pixel width images.\n\nTruly a must-download, must-read, must-keep set!\n\nAlso check out the new ASTRO CITY monthly series, which just released its first issue, from Vertigo.  --STFmaryville\n\n------\n\nFrom Wikipedia, about the amazing assortment of awards this series received:\n\nAstro City won both the Eisner and Harvey Awards for Best New Series for 1996, the Eisner for Best Continuing Series for 1997 and 1998, the Harvey for Best Continuing or Limited Series for 1998, and was a top votegetter for the Comics Buyer's Guide Fan Award for Favorite Limited Series for 1997. The earliest collection Astro City: Life in the Big City, won the Harvey Award for Best Graphic Album of Previously Published Work for 1997 and the Comics Buyer's Guide Fan Award for Favorite Reprint Graphic Novel/Album for 1997. Astro City: Confession was a top votegetter for the Comics Buyer's Guide Fan Award for Favorite Reprint Graphic Album of 1998 and 1999. Astro City: Family Album was a top vote-getter for the Comics Buyer's Guide Fan Award for Favorite Reprint Graphic Album of 1999.\n\nParticular stories or storylines have also come in for honors. Astro City #1 won the 1996 Harvey for Best Single Issue or Story, while #4, &quot;Safeguards&quot;, took the Eisner for Best Single Issue/Single Story for the same year. The 1997 and 1998 Eisners went to vol. 2, #1, &quot;Welcome to Astro City&quot;, and vol. 2, #10, &quot;Show 'Em All&quot;, respectively, and the 1998 Eisner for Best Serialized Story went to vol. 2, #4-9's &quot;Confession&quot; storyline.\n\n&quot;Welcome to the Big City&quot; in Volume 2 #1 was a top vote-getter for the Comics Buyer's Guide Fan Award for Favorite Comic-Book Story for 1997. The story &quot;The Nearness of You&quot; from the 1/2 issue received votes for the same award that year, as did the &quot;Everyday Life&quot; story which ran in Volume 2 issues 2 and 3. The story &quot;Confession&quot; from Volume 2 issues 5-9 won the Comics Buyer's Guide Fan Award for Favorite Story for 1998. &quot;Show 'Em All&quot; from issue 10 was a top vote-getter for the Comics Buyer's Guide Fan Award for Favorite Story for 1998.\n\nKurt Busiek was honored with 1998's Harvey and 1999's Eisner for Best Writer, in both instances for bodies of work including Astro City. Alex Ross took both awards for Best Cover Artist in 1996, 1997, and 1998, in all instances but one for Astro City or bodies of work including it (the exception was the 1997 Harvey, awarded for Kingdom Come #1). He also took 1999's Harvey and 2000's Eisner for Best Cover Artist, again for bodies of work including Astro City.\n\n------\n\nAn Amazon review of the collected edition of these 6 issues:\n\nBreathing new life into a tired genre\nDecember 31, 2000\nBy John Dennett\n\nFor those seasoned veterans of comic book fandom, Kurt Busiek's Astro City series is a breath of fresh air in a stuffy, over-crowded room.\n\nFar from the deconstructionist bent of Alan Moore, Frank Miller, Grant Morrison, et al, Busiek *loves* superheroes and all the accompanying absurdity. His goal, as eloquently expressed in his introduction to this volume, is to explore the as yet uncharted themes, metaphors and plots while holding dear all of the magic and power of what came before.\n\nWhile Astro City may prove a bit frustrating for a comics newcomer, it's a warm and inviting destination for the weary superhero fan.","torrent":{"xt":"urn:btih:f9ed8a909a4715403b706ca5596fb3669931e1f6","amp;dn":"ASTRO+CITY+%28volume+1%29+01-06+COMPLETE+%282013+DC+digital+editions%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9ed8a909a4715403b706ca5596fb3669931e1f6","infoHashBuffer":{"type":"Buffer","data":[249,237,138,144,154,71,21,64,59,112,108,165,89,111,179,102,153,49,225,246]},"announce":[],"urlList":[]}}