{"title":"(CoLoMbO ElEcTrOnIc)Emancipator - Soon It Will Be Cold Enough (2","uid":4161132,"size":79756943,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa2133f2cc2afa4056154d317eab91c24364c20a&amp;dn=%28CoLoMbO+ElEcTrOnIc%29Emancipator+-+Soon+It+Will+Be+Cold+Enough+%282&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"vinonovello85","files":18,"time":1209383297,"description":"Titolo: Emancipator - Soon It Will Be Cold Enough\nAnno: 2007\nGenere: downtempo/electronic/trip hop\nMp3 Bitrate: VBR\nCovers: front\n\nSome albums just feel so good, so cool, you can?t help but feel good while listening to them.\n\nEmancipator?s Soon It Will Be Cold Enough is such an album. Incorporating hints of jazz, electronica, trip-hop and down-tempo into its violins, keys, various samples and the occasional female voice, this 19-year-old college student has put together a release worthier of the attentions of a record label.\n\nTaking a liking to music at an early age, the quality and professionalism of the production is in stark contrast to the fact this artist can?t even legally buy booze yet. ?Eve? sweeps in with some modified harmony vocals then shows off both Emancipator?s piano skills as well as the beautiful violins of Cindy Kao, whose work is peppered throughout the 65-minute epic. ?Soon It Will Be Cold Enough To Build Fires? plays around with some lovely acoustic guitars, a sampled horn and some left over vocal cuts from another track.\n\nThe rhythm of programmed drums and wash of beautiful violin on ?Anthem? reminds me a little of Moby and DJ Shadow, the tribal beat opening and subsequent electronic bass on ?Good Knight? feels like some of Bobby Cochran?s (Hands Upon Black Earth) best work, the driving bass and Kao?s violin on ?Lionheart? feel like the soundtrack to dusk, while the voice of Thao Nguyen on ?When I Go? sings ?off key,? as she puts it, but really her style is addictive, sexy and the sound of her lovely speaking voice when she says, ?You are nourishing. That?s what he said? gives me a chill.\n\nThe amount of work that went into this album is amazing. As Emancipator himself states, ? ?instrumentation on the album was either played and recorded by myself, or was programmed from scratch using individual ?oneshots,? which are basically just recordings of single notes being played. Many of the melodies or bass lines were constructed in this way ? by pitch shifting and moving around individual sounds like sound legos.?\n\nThe fact that this is funded not by a record label, but by a college student who does this in his spare time, is admirable. Pop onto his site you can even download some remixes (including his mash up remix pairing Sigur Ros with Mobb Deep. Hearing Mobb Deep rap ?I?m only 19 but my mind is old? has so much added weight when melded like this). And, to boot, the music is damn cool. Highly recommended.(musictap.net)\n------------------------------------------------------------------------------------------------------------\nplease seed and enjoy us @","torrent":{"xt":"urn:btih:fa2133f2cc2afa4056154d317eab91c24364c20a","amp;dn":"%28CoLoMbO+ElEcTrOnIc%29Emancipator+-+Soon+It+Will+Be+Cold+Enough+%282","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa2133f2cc2afa4056154d317eab91c24364c20a","infoHashBuffer":{"type":"Buffer","data":[250,33,51,242,204,42,250,64,86,21,77,49,126,171,145,194,67,100,194,10]},"announce":[],"urlList":[]}}