{"title":"The Dragon's Gift:The Real Story of China in Africa ","uid":8859522,"size":3997034,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fa400cb95d64ae015654efa5cac8924d8cdaeb11&amp;dn=The+Dragon%27s+Gift%3AThe+Real+Story+of+China+in+Africa+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"livhre","files":-1,"time":1377739433,"description":"Is China a rogue donor, as some media pundits suggest? Or is China helping the developing world pave a pathway out of poverty, as the Chinese claim? In the last few years, China's aid program has leapt out of the shadows. Media reports about huge aid packages, support for pariah regimes, regiments of Chinese labor, and the ruthless exploitation of workers and natural resources in some of the poorest countries in the world sparked fierce debates. These debates, however, took placewith very few hard facts. China's tradition of secrecy about its aid fueled rumors and speculation, making it difficult to gauge the risks and opportunities provided by China's growing embrace.This well-timed book, by one of the world's leading experts, provides the first comprehensive account of China's aid and economic cooperation overseas. Deborah Brautigam tackles the myths and realities, explaining what the Chinese are doing, how they do it, how much aid they give, and how it all fits into their &quot;going global&quot; strategy. Drawing on three decades of experience in China and Africa, and hundreds of interviews in Africa, China, Europe and the US, Brautigam shines new light on a topicof great interest.China has ended poverty for hundreds of millions of its own citizens. Will Chinese engagement benefit Africa? Using hard data and a series of vivid stories ranging across agriculture, industry, natural resources, and governance, Brautigam's fascinating book provides an answer. It is essential reading for anyone concerned with China's rise, and what it might mean for the challenge of ending poverty in Africa. ","torrent":{"xt":"urn:btih:fa400cb95d64ae015654efa5cac8924d8cdaeb11","amp;dn":"The+Dragon%27s+Gift%3AThe+Real+Story+of+China+in+Africa+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa400cb95d64ae015654efa5cac8924d8cdaeb11","infoHashBuffer":{"type":"Buffer","data":[250,64,12,185,93,100,174,1,86,84,239,165,202,200,146,77,140,218,235,17]},"announce":[],"urlList":[]}}