{"title":"Julia Ann Hardcore (DVD.xvid) - anal, DP","uid":4842102,"size":1468049408,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:fa9d7ed15a3f4925d1b3a3236a92b4ccff7c73de&amp;dn=Julia+Ann+Hardcore+%28DVD.xvid%29+-+anal%2C+DP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pure_screens","files":1,"time":1239544338,"description":"Julia Ann Hardcore (DVD.xvid)\n\n\n\n\n\nscreens (+ DVD-covers):\n &lt;a href=&quot;\nhttp://x4porn.blogbugs.org/8362157/Julia-Ann---Hardcore.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://x4porn.blogbugs.org/8362157/Julia-Ann---Hardcore.html&lt;/a&gt;\n\n\n\n\n\n\nDo you think you really know Julia Ann?\nGuess Again! With a new brunette look, the shapely beauty adds several exciting new &quot;firsts&quot; to her erotic resume. \nAn anal pounding from Manuel Ferrara and a DP with Randy Spears and Eric Masterson. Sean Michaels brings her interracial fantasies to live. \nGia Paloma and Roxy Deville bring the toys for another DP. \nA POV scorcher and Julia's first four-man gangbang usher in a new chapter in this Hall of Fame legend's career.\n\n\nActresses\n\n    * Gia Paloma                   [LezOnly]\n    * Julia Ann                    [Anal Facial DP IR]\n    * Roxy DeVille                 [LezOnly]\n\n\nScene Breakdowns:\n\nScene 1. Julia Ann, Sean Michaels\nScene 2. Julia Ann, Manuel Ferrara\nScene 3. Eric Masterson, Jack Venice, John West, Julia Ann, Marcus London\nScene 4. Julia Ann, Randy Spears, Tommy Gunn\nScene 5. Julia Ann, Julian\nScene 6. Gia Paloma, Julia Ann, Roxy DeVille\n\n\nStudio:          Wicked\nReleased:        2006\nFormat:          Xvid\nLanguage:        English\n\n\n1700+ torrents (ALWAYS with honest screens &amp; detailed info):\n\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/pure_screens&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pure_screens&lt;/a&gt;\n\n\n\nREVIEW:\n\nWell fans here's a review for a new dvd starring Julia Ann a contract girl for Wicked Pictures. The main thrust of this dvd is Julia taking us and herself on a sexual journey through six sex scenes which she has fantasized about for some time and we're lucky enough to go along for the ride. Stops to look forward to in this trek include interracial, POV,anal, dp, and some facial pops. I've not watched much of Julia's movies since I don't normally watch features to much but when I read about this my curiousity was given a nice buzz so I wanted to check it out. I like that Julia is a fully grown woman, pretty much knows her sexuality, what she likes, doesn't like and now she wants to stretch her boundaries-- on camera where she has been a strong feature girl for some time. Julia might be a wild sex beast off camera but we've not had a chance to see that as much as we'll see here in these scenes. Another item here is Julia coming on before each scene to give us some dialogue giving context to what we're about to see. You can sense her confidence as she tells of her desires so now let's enjoy the ride as we see Julia take it in the ass, take jizz to her face, and get dominated a little! The one major drawback for me in this and I'll take away some points in the video category is I didn't like how the picture looked in some of the scenes and it did hamper my overall enjoyment. I'll try better to get into it during each scene but this might be a gonzo inspired dvd but the picture look isn't what you'd see in a Zero Tolerance, Evil Angel, or a Red Light District set. It is closer perhaps to what you see in a feature film which is trying here to be a gonzo film and it didn't really work for me in the long run though you could see the action just not as well as you'd see it in one of those companies gonzo shoots. I will say maybe on a better quality tv you'd see it better but I'm an average guy with a decent tv and that's how it looked to me. Also condoms are very much in use so if that's a no sale then you'll want to pass on this one as a buy but I'd still rent if curious to see the anal and other fun stuff.\n\nJulia Ann: Interracial\n\nJulia tells us as this first scene dawns she's coming out a long term relationship and that this gave her the perfect opportunity to explore these fantasies and one of them was doing interracial. Now we are also told that early on in her porn career she actually did a scene with Sean Michaels but the footage was ruined so that was that until now where a much more mature Julia hooks up with Sean in a second encounter. Julia is so at ease as she lays the scene out, and she is very happy to have Sean working with her, saying he always does a good job putting the girl at ease. Then we get to the scene itself and wow the white light is almost blinding as it surrounds the two of them. I don't even know how to really describe it other than that. The two are bathed in this almost giving the scene a dreamlike quality. Now Jonathon does get the shot in close at times and there the picture is pretty good. Julia and Sean do a good job making out and we slowly see the clothes start to come off and for longtime Julia fans this might really be a turn on seeing her make out with a black man and then she works out Sean's cock engulfing it. I did love how Julia took her time working over Sean's cock and there are some good shots up close during this dick sucking. For his part Sean gets in on the oral fun as Julia assumes a doggie pose and who wouldn't want to be in his place then, licking all over her ass and pussy, yeah very nice! Now for the sex the reverse to lead off looked good and we see some nice boob movement but the lighting is still bothering me some but her bouncing titties are doing a decent job of making me forget. There is also a romp in cowgirl and it takes a little bit until Mr. Morgan gets the camera in up close but you get a nice booty view then. Mr. Michaels also lays pipe to Miss Ann in doggie and mish before jettisoning his load onto those big tata's. The only real problem with this scene for me was how the picture looked for most of it, I wasn't drawn into the whole dreamlike aura or the big light bathing the two of them. The action, though, was solid and the chemistry was easy to see between the two.\n\nJulia Ann: Anal with Manuel Ferrara\n\nWell who better to break Julia's anal cherry on film than the reigning AVN Male Performer of the year. Julia tells us about seeing Manuel and Katsumi taking the 2006 AVN award for best anal sex scene and how Katsumi remarked it was easy doing anal with Manuel so that got Julia to musing how it would be for her to have anal sex with this charming man as she so eloquently described him so now we get to see how it goes. We see the two of them on a rotating bed and Manuel's got the romantic vibe going right away feeling up Julia's ass over the mesh stockings. Manuel then gets to work sucking on those titties and the two do some intense staring into one another's eyes as Manuel also dips a few fingers down into Julia's pussy which with the excitement of this scene's novelty I'm sure had it dripping wet. Manuel makes sure it is a wet pussy as he then buries his face in between Julia's thighs and then it's over to a doggie pose where he can be a bit more aggressive with his pussy/ ass licking-- mind you the bed is rotating the entire time though it's not distracting. The lighting in this scene is natural so far as I can tell but a little darker than I'd like. Julia then decides it's time and we're onto the blowjob which again is more feature style in it's look than gonzo style-- the gonzo aspects I suppose were Manuel reaching around to finger bang Julia and she does a little deep throating but the picture look wasn't very gonzo friendly. Sexwise you get a good hard spoon followed by Julia turing into cowgirl where there were a couple good butt shots. Before they get to the anal you see Julia and Manuel kissing while she's jerking his cock and then it's back to spoon where Manuel slowly inserts his penis into her ass. Now here's where a really good gonzo picture would show the sliding in from a pretty close angle but we don't get that and it's not until they get to reverse anal that you really get a good anal shot. Again long time Julia fans will be loving this I think seeing her ass filled with a dick and I was too knowing this was a first, I was just wishing the picture was capturing it a little more clearer. After the bed makes several more rotations we see a pullout and Manuel stands over Julia's face jerking until he cums and we're to far away to see it flowing into her mouth but we do get in close before the end to see the jizz glistening on her chin and she gives some cleanup so again if this is among her first messy facials it was worth waiting for, she looks great covered in cum!\n\nJulia Ann: Blowbang\n\nIn the set up for this scene Julia tells us how she'd been a contract girl for so long but when she also started doing makeup for gonzo sets she saw how the &quot;other half&quot; lived which in some cases involved blowbangs aka sucking off more than 2 guys so that made for a very good fantasy scene. It took three blowbang scenes she witnessed before Julia was over being intimidated and became intrigued as she says. So we get to the scene which has Julia walking into another dimly lit room where four men sit wearing tux's. Julia is clad in some nice lingerie. She walks around to each guy checking them out, then the four guys stand up and surround Julia who pulls her top down exposing her tits and the men unleash their cocks which Julia takes a firm grip over and begins working her way around the circle. Jonathon does a pretty good job giving us a closer view from up top and then in close on Julia as she works those rods. Had the scene been lit better my appreciation would have risen even further as Julia definitely comes off as a strong oral performer and there's no sense of phoning it in. She had seen enough gonzo bj's to know how it goes and she does well giving us that type bj here. I liked seeing her tits free too and there's a little bounce in them from time to time. This isn't a bj only blowbang as there is some fucking, a little from behind, some cowgirl, and then reverse. She take the first pop to her face again the chin getting a good coating of cum and the other's splooge on those large melons.\n\nJulia Ann: 2 on 1\n\nAs she's freshly single Julia is able to do another scene she'd not really thought much about before, she liked two girls and a guy before but now she's going to reverse that and be the only girl with two guys which will also lead to another first, her initial DP! Well the scene gets into it and Nurse Ann comes in finding Tommy Gunn and Randy Spears wearing their straight jackets and I'm not sure what it said on that clipboard about their treatment but in evidently involved some sexual favors as she starts in on Tommy helping his cock out but she keeps the jacket on as she gives his schlong some loving. Randy watches on not knowing if he was going to receive the same but not to worry there Mr. Spears as Julia does make her way over and lavish some oral love to his tool. The clothes and jackets then come off as the guys do some rapid fire throat fucking along with some simultaneous sex-- again know that there are condoms used. The lighting here seems fairly basis, almost a greyish tone to it but when they get in close it's not to bad. Julia by now has shown a fine inclination for the harder bj giving some nice eye contact too. There's a pretty good doggie shot with some nice ass cheek shaking which moves neatly to Julia hoping onto Randy for a romp in reverse. There is some hazyness to some of the shots when it gets in close, again not something you usually see in a gonzo film but I've seen a few times in a feature type shoot. Cowgirl was up next and you see that asshole teasing us and it's great knowing it will soon be filled plus Julia is doing a real nice job sucking Randy off including some ball licking. Foot fetishists get some brief love when Randy's nailing Julia in mish one of her legs is up near his face and he sucks on those toes. Both men get some time to lay pipe in missionary and then there's a sudden edit and they're double penetrating Julia which is good but where's the setup? We don't get some regular anal first at least for a minute or so instead it's a quick cut right to the DP which is a little disappointing. It was great, however, when the shot gets in close to see Julia's holes both filled. Now to the pops and both men fire at about the same time with Randy's load coating her tits and Tommy's reaching Julia's mouth. So a dp with no real setup before it so a slight let down in that regard but overall it was hot to see Julia's ass and pussy filled at the same time.\n\nJulia Ann: POV\n\nOn we go and here Julia wanted to get in on the whole POV craze and who better to help her out than the well endowed Julian. The scene takes place in a kitchen where Julian comes up to Julia camera in hand and I think it's his birthday and he wants to recreate their magical first date. Julia is into it right away as she's wearing the exact same dress which nicely shows some lovely cleavage. The two chat a bit as Julian moves in and out on Julia who eventually makes her way to the preferred position for POV, on her knees and staring up. Again the darker tint to the picture drags the enjoyment down some for me but I've enjoyed watching Julia sucking cock this entire dvd and she keeps up the good oral work here. There is also a second camera shooting giving us the shot of Julian shooting Julia. Miss Ann then does the right thing standing up and opening up that dress so we see those nice tits and her neatly trimmed pussy. Julian lets her hop on the counter and the two do some joint pussy fingering until he slides his cock in. They alternate the shots from Julian's POV and then the pulled back shot showcasing them both. The best shot I saw was when Julia climbs on facing Julian and he's looking up at her attractive face and those tits do some nice things. There is also the shot with Julia facing away as she rides the dick and the end has Julia sliding the condom off for some good ole knob polishing until she jerks the load out and here there was another mistake I think as they use the far away shot for the popshot. You see what looks to be cum on her hands as she keeps jerking as he is popping but we never really get in close to see--- why didn't they use Julian's shot for the money shot that was very confusing as in the bts there's a slightly better angle captured for the pop which sadly isn't in the main scene. Still some good POV head and a few good shots most notably in the reverse with Julia facing out to us.\n\nJulia Ann: G/G 2 on 1; Strapon DP\n\nNow we get to a scene where Julia gets to be the middle in the 3 girl sandwich. She recalls a scene some years back where she was one of the girls laying fake cock to Jeanna Fine and now she's picked two current hotties to do the same to her-- this was also to prep her for the real dp which she did in that earlier scene with Randy and Tommy. As the scene opens we find Julia in a cage and up walks Gia Paloma who is a perfect dom girl and there's also Roxy Deville who is also bound but not in a cage. Roxy's got some sort of facial device on which has a ball gag almost shoved all the way in. Gia walks around surveying her two victims,lol, and she opens up the door to the cage but she's giving an evil laugh as she teases Julia's body doing some good boob play. After some brief fun Gia makes her way over to Roxy who has her arms stretched out above her but they are let down so Roxy can walk over and dangle her legs over the top of the cage with Julia arching up to eat that tasty pussy. The hazy aspect to the picture is back again in spurts but I liked the harder edge Julia was going for and she chose to great girls for this scene. Watch her try and kiss Roxy making out essentially with a ball gag which does get removed by Gia and this allows for some real kisses and Julia gets a quick suck on Roxy's nice modest set of boobs too. The two girls move Julia over to the long couch and get her on it spreading those legs wide and they start spanking that ass and yes some toy play gets underway, the destination, Julia's pussy though her ass will see it's fair share by scenes end. There's even a paddle brought in to make those cheeks nice and rosy. We soon get into the strap on action with Julia sucking off Roxy while Gia continues the toy play from behind. The sex consists of Julia doing some reverse on Roxy's schlong and then it's some toy play to that ass with the dp coming not long after. The picture was slightly better in this scene than the previous ones but still a little bit below what I normally like to see in a gonzo scene. Of course since this is not a real cock you don't get the obvious pop to end the scene and we basically end with the girls still nailing Julia with the strap on in the dp leading to the fade out.\n\nFinal Thoughts:\n\nWell fans it was interesting to see Julia Ann take this journey through her darker side and it was cool to see her do things like anal, dp's, and blowbangs. There was a major drawback for me,though, and that was the technical side where I just didn't get into the feature fusing with the gonzo picture. I'm not sure how to really describe it perhaps but I didn't dislike the scenes nor the setups moreso it was the darker picture or the the bright light surrounding the performers like it did in the interracial scene with Sean. Julia was very good in her gonzo style blowjobs and she did take some good facial pops with some nice cleanup too. \n\nI'd definitely rent this if you're a long time Julia fan curious to see her do things which she's not done before and for the gonzo fan this is a chance to see a feature girl dabble in gonzo and I for one think Julia did fine with only the picture letting the scene down and not her energy nor her costars. I try not to dwell to much on the technical side as I'm not an expert at all but this to me was obvious and it held the scenes back some for me. The action was there, the shots could have been better-- the POV for instance should have used the close up shot Julian was shooting for the popshot rather than the faraway shot we got. I think Wicked should definitely do this again if they have a girl who's not done much gonzo or even if she has and hasn't for awhile she could indulge her fantasies and I wouldn't mind seeing Julia Ann doing more scenes like this in future Wicked productions, now that she's done anal please let's keep that up!\n\n\n\n\n\n\n.","torrent":{"xt":"urn:btih:fa9d7ed15a3f4925d1b3a3236a92b4ccff7c73de","amp;dn":"Julia+Ann+Hardcore+%28DVD.xvid%29+-+anal%2C+DP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa9d7ed15a3f4925d1b3a3236a92b4ccff7c73de","infoHashBuffer":{"type":"Buffer","data":[250,157,126,209,90,63,73,37,209,179,163,35,106,146,180,204,255,124,115,222]},"announce":[],"urlList":[]}}