{"title":"Miriam Makeba - The Guinea Years [FLAC] TQMP","uid":6811246,"size":318235619,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fb22ba41d892ef7472971939a5f093e7c4ac3bc6&amp;dn=Miriam+Makeba+-+The+Guinea+Years+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"pastafari","files":-1,"time":1321043485,"description":"Miriam Makeba - The Guinea Years\nSyliphone, 1975\nStern's Africa, 2001\n\n* * * * * * * * * * * * * * * * * *\n\nI've been listening to several Miriam Makeba albums before deciding which one to share. Her early recordings in the US are great \n\nbut nothing beats what she recorded for Syliphone in Guinea. It was during the so called authenticite period, a time when music \n\nin Guinea was bursting like galaxies in the early universe (sorry, been reading that astronomy guy again) - Bembeya Jazz, \n\nKeletigui et ses tambourinis, Kaloum Star, Horoya Band, Camayenne Sofa and Balla et ses balladins, just to name the most \n\nfamous bands. They are all featured on Stern's African Pearl series: Cultural Revolution and The Discoteque Years. Stern also \n\nreleased a set dedicated to Balla et ses balladins. It was with musicians from this great band, Miriam Makeba's band was formed. \n\nThe Guinea Years show Makeba at her peak backed by very talented musicians. I OCR-ed the booklet so anyone can read, and \n\nhopefully repost and spread, the very informative liner notes. Hope you enjoy this as much as I do ;)\n\n* * * * * * * * * * * * * * * * * *\n\nMiriam Makeba: The Guinea Years\n\nMore than a quarter-century before the term &quot;world music&quot; caught on, Miriam Makeba was a world music star. She had been a \n\npopular singer and actress in Johannesburg since 1953, but beyond South Africa and neighbouring countries she was unknown. \n\nThat changed dramatically when she landed in New York on November 30. 1959. Within a few dizzying weeks of her arrival in the \n\nUnited States, she had appeared nationwide on prime-time live television, recorded the first of her six albums for RCA, and begun \n\npreparing for a concert tour with Harry Belafonte (a huge star at the time). Her fame spread rapidly to Europe and around the \n\nglobe. A show-business success, a media darling, a fashion plate, an award-winner, she was an international pop star Ã‚Â­ the first \n\nfrom Africa.\n\nMakeba introduced African music to millions of non-Africans. She sang songs from South Africa's Zulu, Sotho, Swazi and her own \n\nXhosa folk repertoires along with new songs from the multi-ethnic urban townships. She also sang songs from other regions of \n\nAfrica, and her albums and concerts included songs from every other continent on the planet - folksongs, standards and new \n\ncompositions. She spoke half a dozen languages and sang in many more. Touring far and wide, she brought audiences an \n\nunprecedented breadth of music and also gave them back some of their own in her unforgettable voice.\n\nShe could follow diverse traditions faithfully or rework material in new ways. Along with Harry Belafonte, Pete Seeger, Antonio \n\nCarlos Jobim and a few other artists prominent in the late '50s and early '60s, Miriam Makeba invented a genre - a sensibility more \n\nthan a sound - which could aptly be called world music (though it had no name at the time). It was music with a worldview and \n\nworldwide appeal.\n\nStephen Biko once said that every South African was involved in politics. Makeba certainly was, but not by choice. During her \n\nfirst year and a half in the U.S. she was reluctant to comment on South Africa's brutal legalized racism, but after the Sharpeville \n\nmassacre of 1961, in which several of her relatives were among the 69 civilians killed by the police, she couldn't keep herself from \n\nspeaking out. Newspapers quoted her. The South African consulate in New York retaliated by revoking her passport when she \n\nwanted to fly back to Johannesburg for her mother's funeral. She was no longer a citizen of the country of her birth. Then, when \n\nshe addressed the United Nations' Special Committee on Apartheid, the government of South Africa &quot;banned&quot; her. Thus she \n\nbecame, in effect, a criminal at large, subject to arrest if she returned home. \n\nBut to people of every colour and nationality Makeba was a heroine. Martin Luther King and John F. Kennedy both heard her sing \n\nand expressed their admiration for her. So did many heads of state and a good many of their opponents (openly or in secret). \n\nShe was seen as an icon of civil rights, ethnic pride, self-determination and internationalism.&quot;I have become a world citizen&quot; she \n\nremarked, and in fact she nearly was one: in that period she travelled on diplomatic passports issued to her by eight different \n\ngovernments.\n\nA music festival brought Makeba to Guinea tor the first time in 1967. On that occasion President Sekou Toure, who had led this \n\nWest African nation to independence from France nine years earlier, presented her with a signed copy4 of one of his books and \n\ninvited her to come back and live in Guinea. Leave the country that had first welcomed her when her native country had refused \n\nher? \n\nMany Americans loved her but others distrusted her, even hated her, particularly when she took up with Stokely Carmichael. \n\nThey were suspicious of the Student Non-Violent Coordinating Committee (however innocent the name sounded) and they saw \n\nCarmichael, its leader, as a dangerous radical. The FBI tailed him. When he married Makeba in 1969 the FBI included her in its \n\n&quot;investigation&quot;. Suddenly, and inexplicably her American concert engagements were being cancelled and her record company \n\ndropped plans to make a new album. Only a few months before, she'd been in the Top 20 with &quot;Pata Pata&quot;, and two years earlier \n\nshe'd won a Grammy (the first awarded to an African); now she couldn't get a gig. When King was assassinated on April 4, 1968, \n\nthe FBI charged Carmichael with inciting the riots that broke out in Washington. Things very quickly got very shaky for \n\nCarmichael and Makeba. They fled to Conakry, Guinea.\n\nPresident Toure welcomed the couple to Guinea with open arms, declared them permanent guests of the state and gave them a \n\nVilla. Guinea would be their home. The nation was celebrating the 10th anniversary of its independence, and revolutionary zeal \n\nwas still the order of the day. Toure called his ideology African Socialism, and zeal was an essential component (as grand plans \n\nfar outnumbered successful programmes).\n\nThere's every reason to believe that Sekou Toure genuinely admired both Stokely Carmichael and Miriam Makeba, but it's also \n\nclear that he used them. The famous newlyweds enhanced his prestige, and he took them with him on travels throughout the \n\ncountry and abroad. The President made each a Special Ambassador, and each filled his or her role well. Carmichael held strong \n\nconvictions, possessed a keen intellect, and could speak compellingly to heads of state and crowds on the street alike. Makeba \n\novercame her natural shyness and applied her sympathies, talents and star-power to good works in remote corners of Guinea and \n\nat OAU and UN conferences in foreign capitals. Yes, Toure used Carmichael and Makeba, but they gladly allowed themselves to \n\nbe used and never doubted that their causes were just.\n\nSekou Toure was an autocrat who brooked no opposition. Regarding music, however, he showed an open mind and good \n\njudgement. Early in his presidency he had established a national network of music schools, festivals and state-subsidized \n\nensembles. By the time Miriam Makeba arrived in Guinea, he had built a recording studio in Conakry and founded a national record \n\ncompany. His charge to musicians was twofold: honour Guinea's great classical and folk traditions (which colonialists had \n\ndisdained, and create modern African music. His was one programme that did succeed - gloriously. Toure's support enabled \n\ntraditional singers, drummers, dancers and the country's virtuosic players of the kora and the bala xylophone to devote \n\nthemselves to their art. Guinea's splendid modern bands could not have made the records or mounted the tours they did without \n\ntheir government's sponsorship.\n\nSo Makeba encountered a flourishing musical environment in Guinea. It didn't need the gilding of an international star, but it made \n\nroom for her. And though she didn't need Sekou Toure's patronage to further her musical career (she could get all the work she \n\nwanted in Europe), she eagerly accepted it for the opportunity to take part in a renaissance. She assembled a formidable group \n\nof Guinean musicians. learned old and new songs in the Maninka and Fula languages, toured with Les Ballets Africaines de Guinee, \n\npromoted younger singers such as Sona Diabate, and recorded exclusively for Syliphone, the Guinean national record company. \n\nMiriam Makeba recorded at least 28 songs in Conakry. Eight of these, plus four more written and sung by her daughter, Bongi \n\nMakeba Lee, were included in a Syliphone LP entitled Miriam &amp; Bongi. A second LP, Appel a l'Afrlque, featuring Miriam Makeba with \n\na Guinean quintet, was recorded live at the Palais du Peuple in Conakry. Both LPs (or abridged editions of them) have been \n\navailable intermittently outside of Guinea. Only an abridged version of the live LP has been released on CD. But Syliphone \n\nreleased other Makeba recordings in Guinea only. A number of 45-rpm singles have been gathering dust in the Syliphone archives \n\nin Conakry. Six of the best songs of these recordings -are presented together for the first time in The Guinea Years. This \n\nrevelatory new CD also features two songs from the Palais du Peuple concert that were never included in international editions of \n\nAppel a l'Afrique. Rounding out this unique compilation are seven cuts from Miriam &amp; Bongi, an LP that has long been out of print.\n \nThis album presents Makeba in her ever remarkable multilingual mode, singing in six African languages, two European languages, \n\nand Arabic. The music is correspondingly varied. Three songs have been in her repertoire since the earliest years of her career in \n\nSouth Africa: two by her Zimbabwean friend Dorothy Masuka, and &quot;lovely lies,&quot; which she first recorded as 'Laku Tshoni Llanga&quot; \n\nwith The Manhattan Brothers in 1954. Her own composition, &quot;Amampondo,&quot; is based on a Xhosa rhythm. &quot;West Wind Unification,&quot; \n\nwhich her daughter Bongi wrote for her, sounds like early '70s soft soul music - which it is. &quot;Jeux Interdits (Forbidden Games)&quot; is \n\na contemporary French chanson. &quot;Milele&quot; is a Congolese mother's lament for her dead child. Perhaps the most unusual piece of \n\nthis collection is &quot;Africa (Ifrika),&quot; by Algerian songwriter Lamine Bechuchi, which combines Manding-styled electric guitars with \n\nMaghreb-styled violins.\n\nFor many listeners the most interesting of these recordings are bound to be those that are most Guinean. Two, &quot;Ojuiginira&quot; and \n\n&quot;Malouyame,&quot; are classics of the Manding jaliya canon of praise songs. &quot;Ojuiginira&quot; recounts the virtues of Sekou Toure's \n\ngreat-uncle, Keme Burama, and &quot;Malouyame,&quot; also known as &quot;Bani,&quot; could - and usually was - interpreted as a tribute to \n\nPresident Toure. Two other songs, also of traditional origin, &quot;Toure Barika&quot; (&quot;Thanks to Toure&quot;) and &quot;Sekou Famake&quot; (&quot;Sekou the \n\nMighty Ruler&quot;), are obviously addressed to the man who bore those names. &quot;Maobhe Guinee,&quot; a song in the Fula language, is \n\nsomewhat more genera: it lauds the President's entire Parti Democratique de GuinÃƒÂ©e.\n\nMiriam Makeba was no sycophant. While she had much to be grateful to Sekou Toure for, she was only doing what all musicians \n\nin Guinea did in that era. Even the Malian singer Salif Keita sang Toure's praises in &quot;Mandjou.&quot; Praising leaders is an ancient \n\ncustom that is still practiced in many parts of Africa, particularly in the West African countries where griot traditions remain \n\nstrong. Moreover, for Makeba, these songs integrated her political and her artistic ideals. The politics may seem naive now, but \n\nthe art remains unassailable, for what is most striking about Makeba's Guinean songs is how adeptly she sang them. To hear this \n\nwoman from a Johannesburg township sounding like a jelimuso from Kankan is to realize that Makeba could sing just about \n\nanything with aplomb and soul.\n\nIn 1978, when Makeba was 46, she divorced Carmichael after ten years of marriage. By that time the Guinean economy was \n\nfailing badly and President Toure's rule was becoming increasingly repressive. Makeba quietly resigned her commission as a UN \n\ndelegate, but she continued to live in Guinea (as did Carmichael). She gave an occasional concert but recorded nothing more for \n\nSyliphone, which was on its last legs, one of the many enterprises felled by the country's declining fortunes. Makeba spent most \n\nof her time in the remote village of Dalaba, where she had a modest house. Her daughter and grandchildren often stayed with \n\nher, and she involved herself in village projects and community health.\n\nIn 1984 Sekou Toure died. His designated successor was soon ousted by a coup d'etat, but though the new government was \n\ncritical of Makeba's ties to the Toure regime, it allowed her to stay in Guinea, and she accepted.\n\nAnd she never stopped singing. In 1987 she joined Paul Simon and her countrymen Hugh Masekela and Ladysmith Black Mambazo \n\non a historic worldwide tour, and the following year she recorded an album in New York - the first she'd made there in 20 years. \n\nThen in 1990, when apartheid authorities in South Africa finally released Nelson Mandela from prison, they also lifted the ban on \n\nMiriam Makeba, and she returned home after 30 years in exile. Four years later, as millions of people around the world listened by \n\nradio or watched on television, Makeba sang at Mandela's inauguration as South Africa's first democratically elected president.\n\nMiriam Makeba will turn 70 years old in 2002. She still sings for devoted audiences throughout Africa and every other continent \n\non our planet. She is, after all, truly a world music star (stress each word: world... music... star), and she always will be.\n-- Ken Braun (CD liner notes)\n\n* * * * * * * * * * * * * * * * * * *\n\nTrack List\n01 - Teya Teya\n02 - L'Enfant et la Gazelle\n03 - MilÃƒÂ©lÃƒÂ©\n04 - Amapondo\n05 - TourÃƒÂ© Barika\n06 - Lovely Lies\n07 - Africa\n08 - Maobhe GuinÃƒÂ©e\n09 - Jeux Interdits\n10 - West Wind Unification\n11 - Oakhla Yunik\n12 - Teya Teya (alt. t.)\n13 - Ojuginira\n14 - Malouyame\n15 - Hadeya Deya\n16 - SÃƒÂ©kou FamakÃƒÂ©\n\n* * * * * * * * * * * * * * * * * * *\n\nArtwork, EAC log and CUE sheet included.\nAudio format: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt;\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nTQMP. The Quality Music Project.","torrent":{"xt":"urn:btih:fb22ba41d892ef7472971939a5f093e7c4ac3bc6","amp;dn":"Miriam+Makeba+-+The+Guinea+Years+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb22ba41d892ef7472971939a5f093e7c4ac3bc6","infoHashBuffer":{"type":"Buffer","data":[251,34,186,65,216,146,239,116,114,151,25,57,165,240,147,231,196,172,59,198]},"announce":[],"urlList":[]}}