{"title":"PBS.This Emotional Life (2009).2of3.WS.PDTV.XviD.Ekolb","uid":5263232,"size":976713750,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fb24b79b323b038b8e17ffe6dff1d9a6b4b3b591&amp;dn=PBS.This+Emotional+Life+%282009%29.2of3.WS.PDTV.XviD.Ekolb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"Ekolb","files":-1,"time":1262803631,"description":"This Emotional Life (2009)\npremiering on PBS, Jan 4, 2010\nPart 2 of 3\n\nEvery day, it seems, some new study reveals a previously hidden epidemic of depression, anxiety, or other psychological problem. At the root of the confusion lies three key questions: What is biological, what is cultural, and what can we do when things go wrong?  After centuries of assuming that we humans, with our mysterious minds and messy emotions, were just not fit subjects for study, science has developed some startling insights into human nature. This three-part series, produced by WGBH and Vulcan Productions, takes viewers on an in-depth tour of the science of human emotions in an effort to truly understand what makes us tick.  Using the latest cutting edge research from neuroscience, startling observations from social science and experts in psychology, This Emotional Life will explore the biological need for social relationships, how to manage negative feelings, and the search for greater happiness, unveiling a new understanding of what it means to be human.\n\nFacing Our Fears\nSome emotions-such as anger, sadness, and fear-may be seen as obstacles to happiness. This episode explores where these &quot;negative emotions&quot; come from, how they are important to our lives, and why, for many of us, they sometimes require attention and management. The stories include a woman whose inability to control her temper is jeopardizing her relationships, and a teenager trying to overcome depression. Veterans and their families struggle with posttraumatic stress disorder (PTSD) and search for treatment.\n\nFormat            : AVI\nLength            : 931 MiB for 1h 56mn 4s 231ms\n\nCodec             : XviD\nSource            : PDTV\nLanguage          : English US\nSubtitles         : None\nGenre             : Scince/Nature\n\nVideo #0          : MPEG-4 Visual at 974 Kbps\nAspect            : 608 x 336 (1.810) at 29.970 fps\n\nAudio #0          : MPEG Audio at 134 Kbps\nInfos             : 2 channels, 48.0 KHz\n\n\nEnjoy!\nEkolb","torrent":{"xt":"urn:btih:fb24b79b323b038b8e17ffe6dff1d9a6b4b3b591","amp;dn":"PBS.This+Emotional+Life+%282009%29.2of3.WS.PDTV.XviD.Ekolb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb24b79b323b038b8e17ffe6dff1d9a6b4b3b591","infoHashBuffer":{"type":"Buffer","data":[251,36,183,155,50,59,3,139,142,23,255,230,223,241,217,166,180,179,181,145]},"announce":[],"urlList":[]}}