{"title":"Windows Vista 64 bit Recovery Disc","uid":4641637,"size":155752448,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:fbf47dd7d63708ea2e7acac1709747c5f7eb94b5&amp;dn=Windows+Vista+64+bit+Recovery+Disc&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"LosslessDude","files":-1,"time":1231735619,"description":"Burn image to dvd/cd and presto... &lt;a href=&quot;\nhttp://neosmart.net/blog/2008/windows-vista-recovery-disc-download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://neosmart.net/blog/2008/windows-vista-recovery-disc-download/&lt;/a&gt;\n\n\nIf you're like most PC users, you probably got Windows Vista with a new PC or laptop. And if you're like 99% of the population, you get your new machines from one of the major manufacturers. Dell, Acer, HP, Toshiba, Lenovo, they all have one thing in common: they don't give you a real Windows Vista installation disc with your purchase. Instead, they bundle what they call a &quot;recovery disc&quot; (that's if you're lucky - otherwise you'll have a recovery partition instead) with your machine and leave it at that.\n\nIt doesn't matter that you just paid a thousand dollars for a machine that comes with a valid Windows Vista license - your computer manufacturer just don't want to spend the money (or perhaps take on the responsibility) of giving you a Windows Vista installation DVD to accompany your expensive purchase.\n\nThe problem is, with Windows Vista, the installation media serves more than one purpose. It's not just a way to get Windows installed, it's also the only way of recovering a borked installation. The Windows Vista DVD has a &quot;recovery center&quot; that provides you with the option of recovering your system via automated recovery (searches for problems and attempts to fix them automatically), rolling-back to a system restore point, recovering a full PC backup, or accessing a command-line recovery console for advanced recovery purposes.\n\nMicrosoft seems to have realized this problem, and have thankfully made a recovery disc for this purpose. It contains the contents of the Windows Vista DVD's &quot;recovery center,&quot; as we've come to refer to it. It cannot be used to install or reinstall Windows Vista, and just serves as a Windows PE interface to recovering your PC. Technically, one could re-create this installation media with freely-downloadable media from Microsoft (namely the Microsoft WAIK kit, a multi-gigabyte download); but it's damn-decent of Microsoft to make this available to Windows' users who might not be capable of creating such a thing on their own.\n\nNeoSmart Technologies is hosting a copy of the Windows Vista Recovery Disc for your convenience. It is a 120 MiB download, and in the standard ISO format.\n\n","torrent":{"xt":"urn:btih:fbf47dd7d63708ea2e7acac1709747c5f7eb94b5","amp;dn":"Windows+Vista+64+bit+Recovery+Disc","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbf47dd7d63708ea2e7acac1709747c5f7eb94b5","infoHashBuffer":{"type":"Buffer","data":[251,244,125,215,214,55,8,234,46,122,202,193,112,151,71,197,247,235,148,181]},"announce":[],"urlList":[]}}