{"title":"Railworks TS29014 First Capital Connect Class 319 EMU","uid":9763211,"size":94120470,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fc647a54999db2035ba4a0f231b35c1eb4e166c1&amp;dn=Railworks+TS29014+First+Capital+Connect+Class+319+EMU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"tpb_4_ever","files":-1,"time":1394843553,"description":"The Class 319 EMU for Train Simulator is available in First Capital Connect livery and includes a full four-car unit, comprising DTSO, MSO and TSO vehicles. Features of the model include passenger view, fully detailed cab interior, cab lighting, working cab fan, opening cab windows, two-tone horn, cab window blind, day/night running light selection, window reflections in passenger compartments, and driver vigilance device (which can be enabled and disabled). \n\nThe locomotive is also Quick Drive compatible, giving you the freedom to drive the First Capital Connect Class 319 on any Quick Drive enabled route for Train Simulator. Also included are scenarios specifically for the London-Brighton route (available separately and required to play these scenarios).\n\n\n\n\nPlease support the developers and buy some of their content if you can afford it.\n\n\nPlease use the email address or the facebook fanpage for requests, questions and also if you want to share an addon with the community which we will post on your behalf.\n\nIf you would like to contribute, please read the Readme.pdf.\n\n\n\n\nA Team tpb_4_ever upload.","torrent":{"xt":"urn:btih:fc647a54999db2035ba4a0f231b35c1eb4e166c1","amp;dn":"Railworks+TS29014+First+Capital+Connect+Class+319+EMU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc647a54999db2035ba4a0f231b35c1eb4e166c1","infoHashBuffer":{"type":"Buffer","data":[252,100,122,84,153,157,178,3,91,164,160,242,49,179,92,30,180,225,102,193]},"announce":[],"urlList":[]}}