{"title":"Frederick Forsyth - The Veteran","uid":9712788,"size":554439712,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:fc888d668ef9850f57ae2001e11c936ded4ae70b&amp;dn=Frederick+Forsyth+-+The+Veteran&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"BosuxRedsux","files":-1,"time":1394127124,"description":"\nFrederick Forsyth, The Master Storyteller, Presents Five Brilliantly Ingenious Tales of Murder, Justice, Intrigue and Revenge\n\n\n\nA miracle in war-torn Siena that begins with the persecution of a young nun in the turbulent days of the sixteenth century and culminates in the bitter German retreat from Italy; a drug-smuggling heist on an international flight where the knock are only one step ahead of the smugglers; a ruthless urban murder, where a brilliant QC decides to defend the killers, resulting in a startling act of justice; an incandescent art scam at a famous London auction house, and a brilliantly plotted revenge that shatters the elegant world of Old Masters - each story is a remarkable tour de force.\n\nAnd above all here is a brilliant novella, 'Whispering Wind', which begins with the single survivor of Custer's Last Stand at the battle of Little Big Horn. It follows the defense from rape and murder of a Cheyenne girl and a flight across the mountains and forests of the West, ending in a savage present-day manhunt in the wild lands of Montana.\n\nWhether his theme is international espionage, miraculous events in war-torn Italy or a Customs drug bust, these stories all share Forsyth's trademark for compulsive storytelling, his clinical eye for authentic detail and an unnerving sense of suspense.\n\nNot since his New York Times bestselling story collection No Comebacks has he crafted such remarkable work.\n\nFive breathtaking tales from the greatest storyteller of them all.","torrent":{"xt":"urn:btih:fc888d668ef9850f57ae2001e11c936ded4ae70b","amp;dn":"Frederick+Forsyth+-+The+Veteran","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc888d668ef9850f57ae2001e11c936ded4ae70b","infoHashBuffer":{"type":"Buffer","data":[252,136,141,102,142,249,133,15,87,174,32,1,225,28,147,109,237,74,231,11]},"announce":[],"urlList":[]}}