{"title":"Ideal - Series 7 complete plus extras DVDRip","uid":6919828,"size":1653012526,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fc8b7048ecbeb960241c307cf7d019b266f3f710&amp;dn=Ideal+-+Series+7+complete+plus+extras+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":".BONE.","files":-1,"time":1325167781,"description":"Ideal is a British comedy-drama, or dark comedy originally broadcast on digital channel BBC Three, created by Graham Duff and produced by BBC Comedy North and Baby Cow Productions. It stars Johnny Vegas as small-time cannabis dealer Moz.\n\n\nIt is set in Salford, Greater Manchester, chosen because Duff was familiar with the area having done many stand-up gigs there during his youth. Most of the series takes place in Moz's flat and revolves around the eclectic array of characters who visit Moz to buy cannabis, socialise or both.\n\n\nEpisodes\n\n01. The Police\n\nMoz plots to win back the heart of his true love, Jenny. However, when he discovers she has joined the police force, his plans are thrown into disarray.\n\n02. The Debtors\n\nA penniless Moz calls in his debts. However, his mates seem very reluctant to pay him back. Jess falls under the spell of masked hit man Cartoon Head.\n\n03. The Brothel\n\nMoz and Nicki start running rival hash dealing businesses, but a price war soon kicks off with each attempting to undercut the other. Across the landing, Brian and Carmel have opened a brothel.\n\n04. The Paintings\n\nMistakenly believing Moz to be an avant garde artist, Tilly arranges for him have an exhibition. Jess and Cartoon Head experiment with ketamine and find themselves way out of their depth.\n\n05. The Love\n\nMoz tries to turn his friendship with Tilly into a full-blown relationship. Colin hires his estranged wife Carmel as an escort girl.\n\n06. The Red King\n\nMoz comes face to face with a gang of deadly gingers known as the Red Mist. Carmel has to choose between Colin and Jake, whilst Yasuko leaves Derrick for Fist.\n\nSpecial Features\n\nMoz's Exhibition\nThe Red Mist\nBecausemonauts III Promo\nOut Takes\nTrailers","torrent":{"xt":"urn:btih:fc8b7048ecbeb960241c307cf7d019b266f3f710","amp;dn":"Ideal+-+Series+7+complete+plus+extras+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fc8b7048ecbeb960241c307cf7d019b266f3f710","infoHashBuffer":{"type":"Buffer","data":[252,139,112,72,236,190,185,96,36,28,48,124,247,208,25,178,102,243,247,16]},"announce":[],"urlList":[]}}