{"title":"El Viaje de Chihiro","uid":4656996,"size":733626415,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:fca9c8dc050bef72d587c0d04de2f2217cd0e98c&amp;dn=El+Viaje+de+Chihiro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"anikuni","files":2,"time":1232235202,"description":"  Chihiro es una niÃƒÂ±a caprichosa y testaruda de diez aÃƒÂ±os que cree que el universo entero debe someterse a sus deseos. Cuando sus padres - Akio y Yugo - le dicen que tienen que cambiar de casa se pone furiosa y no hace nada para ocultar sus sentimientos.\n\n   Cuando la familia se marcha Chihiro se agarra al ramo de flores que le han regalado sus amigos como si llevara en ÃƒÂ©l todos sus recuerdos. Rumbo a su nueva casa, la familia parece equivocarse de camino y de repente se encuentran al final de un enorme edificio rojo con un interminable tÃƒÂºnel en el centro que parece una boca gigantesca.\n\n   El tÃƒÂºnel conduce a un pueblo fantasmal donde les espera un magnÃƒÂ­fico banquete. Akio y Yugo se lanzan sobre la comida. Chihiro mira a sus padres, que siguen devorando plato tras plato, cuando de repente son transformados en cerdos. Sin querer han entrado en un mundo habitado por dioses antiguos y seres mÃƒÂ¡gicos, dominado por la diabÃƒÂ³lica Yubaba, una arpÃƒÂ­a hechicera.\n\n   Yubaba le explica a Chihiro que a los intrusos los transforman en animales y despuÃƒÂ©s los matan para comerlos. Los que consiguen escapar de este trÃƒÂ¡gico destino son condenados a morir una vez que se demuestra su inutilidad.\n\n   Afortunadamente Chihiro encuentra a un aliado en forma del enigmÃƒÂ¡tico Haku. Para postergar su terrible destino y para sobrevivir en este extraÃƒÂ±o y peligroso mundo debe hacerse ÃƒÂºtil, debe trabajar. Chihiro sale de su pereza habitual pero a la vez debe renunciar a su humanidad, a sus recuerdos e incluso a su nombre...\n","torrent":{"xt":"urn:btih:fca9c8dc050bef72d587c0d04de2f2217cd0e98c","amp;dn":"El+Viaje+de+Chihiro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fca9c8dc050bef72d587c0d04de2f2217cd0e98c","infoHashBuffer":{"type":"Buffer","data":[252,169,200,220,5,11,239,114,213,135,192,208,77,226,242,33,124,208,233,140]},"announce":[],"urlList":[]}}