{"title":"Hunter's Run (2007) - George R R Martin, Gardner Dozois, Daniel","uid":10382230,"size":1257337,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fcc13badeb414ed8dbb4b1722608318f96201ed9&amp;dn=Hunter%27s+Run+%282007%29+-+George+R+R+Martin%2C+Gardner+Dozois%2C+Daniel+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"galib777","files":-1,"time":1403051332,"description":"Hunter's Run\nAuthors: George R R Martin, Gardner Dozois, Daniel Abraham\nPublished: 2007\nGenre: Science Fiction\nFormat: PDF\nPages: 316\n-----------------------------------------------------------------------------------\nLike so many others, Ramon Espejo ran from the poverty and hopelessness of the Third World to the promise of a new world--joining a host of like-minded workers and dreamers aboard one of the great starships of the mysterious, repulsive Enye. But the life he found on the far-off planet of Sao Paulo was no better than the one he had abandoned.\n\nTough, volatile, and angry--a luckless prospector hoping for that one rich strike that will make him wealthy--Ramon is content only when on his own out in the bush, far from the dirty, loud, bustling hive of humanity that he detests with sociopathic fervor. Then one night his rage and too much alcohol get the better of him, resulting in sudden bloodshed and a high-profile murder. Ramon is forced to flee into the wilderness for however long it will take for the furor to die down.\n\nHere, mercifully, almost happily alone, Ramon is once again free. But while searching for his long-elusive lode, he stumbles upon something completely unexpected: a highly advanced alien race in hiding; fugitives like himself on a world not their own. Suddenly in possession of a powerful, dangerous secret, Ramon must battle for his freedom from alien captors and also against the hostile and unpredictable planet. And so the chase begins.\n\nPolice, fugitive aliens, and a human murderer weave a web of shifting alliances as Ramon enters the greatest manhunt the alien world of Sao Paulo has ever known. If he is to survive, Ramon must overcome inscrutable aliens and deadly predators, but his greatest enemy is himself. With every move in the desperate game, he struggles to outwit his enemies and solve the mystery of a murder he himself committed.\n\nA rip-roaring adventure tale and character study of a fascinating and twisted mind, &quot;Hunter's Run&quot; showcases three masters of the form at their best.","torrent":{"xt":"urn:btih:fcc13badeb414ed8dbb4b1722608318f96201ed9","amp;dn":"Hunter%27s+Run+%282007%29+-+George+R+R+Martin%2C+Gardner+Dozois%2C+Daniel+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fcc13badeb414ed8dbb4b1722608318f96201ed9","infoHashBuffer":{"type":"Buffer","data":[252,193,59,173,235,65,78,216,219,180,177,114,38,8,49,143,150,32,30,217]},"announce":[],"urlList":[]}}