{"title":"Gosford.Park.(Robert.Altman,2001).DVDRip.Dual.avi","uid":4556903,"size":2004757924,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:fe878dccf281b2b7f8e9d3f40fa4424b49c9b9bf&amp;dn=Gosford.Park.%28Robert.Altman%2C2001%29.DVDRip.Dual.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"shahinaz","files":1,"time":1228515324,"description":"Year 2001\n\nRun Time 137 min.\n\nCountries USA / UK\n\nDirector Robert Altman\n\nGenre Comedy Drama/Mystery/Comedy of Manners/Whodunit/Ensemble Film\n\nProduced by Capitol Films/ Chicagofilms/ Entertainment Film Distributors/ Film Council of a Sandcastle 5/ Medusa Produzione\n\nPlot Synopsis\tby Mark Deming\n\nMaverick American filmmaker Robert Altman takes a witty and absorbing look at the foibles of the British class system in this intelligent murder mystery set in the early '30s. Sir William McCordle (Michael Gambon) and his wife Lady Sylvia (Kristin Scott Thomas) are a pair of wealthy British socialites who have invited a variety of friends, relatives, and acquaintances to their mansion in the country for a weekend of hunting and relaxation. Among the honored guests are Constance (Maggie Smith), Lady Sylvia's matronly aunt; Ivor Novello (Jeremy Northam), William's cousin who is also a well-known actor and songwriter; and Morris Weissman (Bob Balaban), an American film producer who is friendly with Ivor and researching an upcoming project. Observing the proceedings are the domestic staff of the mansion, including imperious butler Jennings (Alan Bates); footmen George (Richard E. Grant) and Arthur (Jeremy Swift); Probert (Derek Jacobi), a valet to Sir William; housekeeper Mrs. Wilson (Helen Mirren); Mrs. Croft (Eileen Atkins), who oversees the kitchen; and Elsie (Emily Watson), a maid. Also on hand are the guests' personal servants, including Mary (Kelly Macdonald), Constance's maid; Henry (Ryan Phillippe), Weissman's valet; and Parks (Clive Owens), a butler. While the servants are required to display a high level of decorum, they are expected to be passive observers who do not comment on what they see, though the gossip among them travels thick and fast once they retire to the servants' quarters downstairs. And it turns out that there's plenty worth gossiping about, especially after Sir William turns up dead, and everyone is ordered to stay at the mansion while the police investigate the killing. Gosford Park also features Charles Dance, Tom Hollander, Natasha Wightman, and Ron Webster; the screenplay was written by Julian Fellowes, based on a story by Altman and co-star Bob Balaban.\n\nInfo from allmovie","torrent":{"xt":"urn:btih:fe878dccf281b2b7f8e9d3f40fa4424b49c9b9bf","amp;dn":"Gosford.Park.%28Robert.Altman%2C2001%29.DVDRip.Dual.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe878dccf281b2b7f8e9d3f40fa4424b49c9b9bf","infoHashBuffer":{"type":"Buffer","data":[254,135,141,204,242,129,178,183,248,233,211,244,15,164,66,75,73,201,185,191]},"announce":[],"urlList":[]}}