{"title":"Hitler's Olympics: The Story of the 1936 Nazi Games","uid":9668507,"size":44207660,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fe88c0e5f4876e5b91667309b28d850f07b5c2be&amp;dn=Hitler%27s+Olympics%3A+The+Story+of+the+1936+Nazi+Games&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"sidmal","files":-1,"time":1393423415,"description":"\nHitler's Olympics: The Story of the 1936 Nazi Games\n Pen and Sword | 2006 | ISBN: 1844154440 | English | 223 pages | PDF | 43.2 MB\n\n Much has been said about the 1936 Berlin Olympics with the most notable event being, of course, Hitler snubbing Jesse Owens by refusing to shake his hand after he had won one of his events. This led to many charges of racism (Hitler - a racist? Surely not!) and yet it never happened. As is very clearly recounted in this first-class work, that snub will forever remain the Great Myth of the Berlin Olympics.\n\n In effect, Hitler, his entourage and fellow VIPs were in a raised enclosure similar to a Royal Box. When a German athlete won gold and was presented with his medal, that athlete turned towards Hitler and gave the Nazi Salute - which Hitler duly returned. Later, when Owens received his medal he turned and bowed towards that same VIP enclosure and Hitler returned the gesture with another straight-armed salute before turning and leaving the box.\n\n That, however, is only one story from an Olympic Games from another era altogether. 1936 was a time when there were few, if any, coloured people representing European teams, starting blocks were not permitted, the swimming pool was outside and Europeans won the Gymnastic events. In short, this was a different time in the life of Europe people - almost on the very eve of a war which would change the make-up of that Continent's populations forever.\n\n The story of the 1936 Olympics is an engaging, fascinating tale of the many successes and failures told with fear or favour towards those who were involved.\n","torrent":{"xt":"urn:btih:fe88c0e5f4876e5b91667309b28d850f07b5c2be","amp;dn":"Hitler%27s+Olympics%3A+The+Story+of+the+1936+Nazi+Games","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe88c0e5f4876e5b91667309b28d850f07b5c2be","infoHashBuffer":{"type":"Buffer","data":[254,136,192,229,244,135,110,91,145,102,115,9,178,141,133,15,7,181,194,190]},"announce":[],"urlList":[]}}