{"title":"Uncensored Science: Bill Nye Debates Ken Ham (2014) [720p, 8 sub","uid":11439991,"size":1112676730,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:febfb65e5771339726195ea90d8e3c6c08d7b468&amp;dn=Uncensored+Science%3A+Bill+Nye+Debates+Ken+Ham+%282014%29+%5B720p%2C+8+sub&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"ChaosCon","files":1,"time":1415750709,"description":"Bill Nye and Ken Ham debate whether creation is a viable model of origins in today's modern scientific era. Moderated by Tom Foreman of CNN.\n\nHam, a former science instructor who moved to the USA from Australia over 25-years ago, is joined by the popular children's program personality Bill Nye &quot;the science guy&quot; for this first and only-scheduled debate. Each man delivers what he believes is the best information available, then has an opportunity for rebuttal, and then answers questions submitted by the audience. Presented in a packed 900 seat auditorium, this event sold out in the first 2-minutes of online ticketing, and includes an audience of Christians and non-Christians, creationists and atheists. The topic: &quot;Is creation a viable model of origins in today's modern scientific era?&quot; This DVD documents the actual, uncut statements, arguments, and audience reactions to these two leading spokesmen. You will understand the faith and facts behind the worldviews of each proponent-and those whom they represent-better than ever before!\n\nNotes: This rip is edited clean, without the 10+ minute waiting screen at the beginning of the previously live broadcast. The English subtitles are native for the broadcast. All other subtitle languages were processed through Google Translate for the convenience of foreign viewers, but I have no control over the accuracy of those translations.\n\nFormat: MPEG-4 at 986 Kbps, 1061.13 MiB for 2h 30mn\nVideo: AVC, 1280x736 (1.737), 29.970 fps at 823 Kbps\nAudio 1: AAC, 2 channels, 44.1 KHz at 157 Kbps, English\nSubtitles: English, Google Translated (Arabic, Chinese, French, Hindi, Portuguese, Russian, Spanish)\n\nScreens: &lt;a href=&quot; http://i.imgur.com/5zWQ6Xi.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://i.imgur.com/5zWQ6Xi.png&lt;/a&gt;","torrent":{"xt":"urn:btih:febfb65e5771339726195ea90d8e3c6c08d7b468","amp;dn":"Uncensored+Science%3A+Bill+Nye+Debates+Ken+Ham+%282014%29+%5B720p%2C+8+sub","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"febfb65e5771339726195ea90d8e3c6c08d7b468","infoHashBuffer":{"type":"Buffer","data":[254,191,182,94,87,113,51,151,38,25,94,169,13,142,60,108,8,215,180,104]},"announce":[],"urlList":[]}}