{"title":"Professor Longhair  Crawfish Fiesta (blues)(flac)[rogercc]","uid":5910394,"size":232034790,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fef02866c2b51695e9b18b7dd885f256d2e4c9bd&amp;dn=Professor+Longhair++Crawfish+Fiesta+%28blues%29%28flac%29%5Brogercc%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"rogercc1","files":14,"time":1288030816,"description":"PROFESSOR LONGHAIR CRAWFISH FIESTA\nReleased:1980\nLabel: Alligator\nFormat:Flac\n\n\n\nProbably the best of all the many albums Longhair waxed during his comeback. A tremendously tight combo featuring three horns and Dr. John on guitar delightfully back the Professor every step of the way as he recasts Solomon Burke's &quot;Cry to Me&quot; and Fats Domino's &quot;Whole Lotta Loving&quot; in his own indelible image and roars, yodels, and whistles out wonderful remakes of his own oldies &quot;Big Chief&quot; and &quot;Bald Head.&quot; ~ Bill Dahl\n\nBorn Henry Roeland Byrd and known affectionately as &quot;Fess&quot; to most New Orleans residents, Professor Longhair began his musical career as a street entertainer in the early 30s. By the late 40s he was playing piano, leading small combos with arcane names such as the Four Hairs Combo and Professor Longhair &amp; his Shuffling Hungarians. He worked as part of Dave Bartholomew's big band in 1949, then began a series of recordings for various labels, including Star Talent, Mercury, and Atlantic. For the next 20 years Professor Longhair continued to record for obscure labels but remained on the fringes of the New Orleans scene, forced to supplement his meager earnings from music with odd day jobs.\nIn 1971 he re-created the Four Hairs Combo for an appearance at the New Orleans Jazz &amp; Heritage Festival. This inaugurated the comeback phase of his musical career and attracted the interest of a small but dedicated cadre of college students who undertook his rehabilitation as part of a burgeoning roots revival.\nAs he stated, &quot;I'm a little rowdy with my playing,&quot; and the synthesis he developed of calypso and rhumba rhythms, boogie-woogie, and street-parade music became the basis for young groups like the Neville Brothers and the Radiators as they sought to translate their own respective musical visions of the New Orleans &quot;good time&quot; heritage. Despite his often unorthodox approach, Fess remained true to the essence of New Orleans music in never straying too far from the basic maxims of &quot;feeling, freedom, and fun.&quot;\nAt the time of his death in 1980, he was the most popular and revered musician in New Orleans. His passing left a vacuum in the city's longstanding piano traditions, seemingly closing the book on an illustrious musical heritage. ~ Bruce Boyd Raeburn\n\n\n1  Big Chief 3:16 \n2. Her Mind Is Gone 4:24 \n3. Something On Your Mind 4:13 \n4. You're Driving Me Crazy 2:36 \n5. Red Beans aka I Got My Mojo Working 4:12 \n6. Willie Fugal's Blues 2:06 \n8. In The Wee Wee Hours 3:24 \n9. Cry To Me 3:38 \n10. Bald Head 3:00 \n11. Whole Lotta Loving 3:48 \n12. Crawfish Fiesta\n\nRecorded at Sea-Saint Studios, New Orleans. \n\n\n\nPersonnel: Professor Longhair (piano, vocals); Dr. John (guitar); Andy Kaslow, Tony Dagradi (tenor saxophones); Jim Moore (baritone saxophone); David Lee Watson (bass); John Vidacovich (drums); Alfred &quot;Uganda&quot; Roberts (congas)\n","torrent":{"xt":"urn:btih:fef02866c2b51695e9b18b7dd885f256d2e4c9bd","amp;dn":"Professor+Longhair++Crawfish+Fiesta+%28blues%29%28flac%29%5Brogercc%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef02866c2b51695e9b18b7dd885f256d2e4c9bd","infoHashBuffer":{"type":"Buffer","data":[254,240,40,102,194,181,22,149,233,177,139,125,216,133,242,86,210,228,201,189]},"announce":[],"urlList":[]}}