{"title":"The Moment by Douglas Kennedy","uid":10093703,"size":2011395,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fef295a6191a3b98be08a1a0125ba47503cff031&amp;dn=The+Moment+by+Douglas+Kennedy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":0,"uploader":"PirateBook","files":2,"time":1399248403,"description":"\nThomas Nesbitt is a divorced American writer in the midst of a rueful middle age. Living a very private life in Maine - in touch only with his daughter and still trying to reconcile himself to the end of a long marriage that he knew was flawed from the outset - he finds his solitude disrupted by the arrival, one wintry morning, of a box postmarked Berlin. \n\nThe return address on the box - Dussmann - unsettles him completely. For it is the name of the woman with whom he had an intense love affair twenty-six years ago in Berlin - at a time when the city was cleaved in two, and personal and political allegiances were haunted by the deep shadows of the Cold War.\n\nRefusing initially to confront what he might find in that box, Thomas nevertheless finds himself forced to grapple with a past he has never discussed with any living person - and in the process relive those months in Berlin, when he discovered, for the first and only time in his life, the full, extraordinary force of true love. But Petra Dussmann - the woman to whom he lost his heart - was not just a refugee from a police state, but also someone who lived with an ongoing sorrow beyond dreams... and one which gradually rewrote both their destinies.\n\nIn this, his tenth novel, Douglas Kennedy has written that rare thing: a love story as morally complex as it is tragic and deeply reflective. Brilliantly gripping, it is an atmospherically dense, ethically tangled tale of romantic certainty and conflicting loyalties, all set amidst a stunningly rendered portrait of Berlin in the final dark years before The Wall came down.\n\nLike all of Kennedy's previous, critically acclaimed bestselling novels, The Moment is both unputdownable and profound. Posing so many searching questions about why and how we fall in love - and the tangled way we project on to others that which our hearts seek - it is a love story of great epic sweep and immense emotional power.","torrent":{"xt":"urn:btih:fef295a6191a3b98be08a1a0125ba47503cff031","amp;dn":"The+Moment+by+Douglas+Kennedy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fef295a6191a3b98be08a1a0125ba47503cff031","infoHashBuffer":{"type":"Buffer","data":[254,242,149,166,25,26,59,152,190,8,161,160,18,91,164,117,3,207,240,49]},"announce":[],"urlList":[]}}