{"title":"Goldrake S1e33-37,[DVD5 - ITA JAP]DVD 6 of 12","uid":4998500,"size":4488734720,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ff4bc2be072e8002eadb96d45bbfec3948ce2933&amp;dn=Goldrake+S1e33-37%2C%5BDVD5+-+ITA+JAP%5DDVD+6+of+12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":2,"uploader":"Addoxx","files":13,"time":1247405120,"description":"Atlas Ufo Robot (a.k.a. Goldrake)\n\nTitolo originale [UFO Robo Grendizer]\nTitolo italiano Atlas Ufo Robot (a.k.a. Goldrake)\nNumero di episodi 74 (27 della prima serie, 47 della seconda)\nStudio di produzione Toei Doga\nAutore Go Nagai\nDirettore dell'animazione Toshio Ketsuta\nDisegnatori Kazuo Komatsubara (primi 48 episodi); Shingo Araki (i rimanenti)\nColonna sonora Shunsuke Kikuchi (gli arrangiamenti alle scene sono di Shozo Uehara e Keisuke Fujikawa)\nRegisti Tomoharu Katsumata, Masamune Ochiai and Masayuki Akemi\nAnni di produzione Dal 1975 al 1977\nCopyright Ã‚Â© Go Nagai/Dynamic Planning - Toei Animation\n\nEpisodio 33: Il mostro dallo spazio\n\nZuril sacrifica una squadriglia di minidischi per scoprire i punti deboli di Goldrake, una volta in possesso dei dati il ministro delle scienze invia il potente mostro della stella Zari per attaccarlo e distruggerlo. Actarus attaccato nei propri punti deboli viene messo in seria difficoltÃƒÂ  ma alla fine riesce a prevalere.\n\nEpisodio 34: Un lupo siderale\n\nIl comandante Gaus, principe della stella Lupo viene inviato da re Vega sulla Terra per distruggere Goldrake, se riuscirÃƒÂ  nella sua missione otterrÃƒÂ  l'indipendenza del suo pianeta. Goldrake si scontra con il mostro siderale di Gaus e sembra sul punto di capitolare, ma lo stesso Gaus lo risparmia per offrirgli la possibilitÃƒÂ  di uno scontro corpo a corpo; durante il duello Actarus ha la meglio riuscendo prima a far precipitare il suo avversario nelle rapide del fiume, poi salvandolo quando ormai la corrente lo aveva sopraffatto. Il nobile gesto di Actarus scuote la coscienza di Gaus che, per non lasciare la Terra nelle mani di Vega, nello scontro finale si lascia colpire a morte da Goldrake. Actarus che insieme a Venusia ha compreso le reali intenzioni del principe della stella Lupo rende omaggio al suo avversario ormai morente.\n\nEpisodio 35: Il terremoto misterioso\n\nIl comandante Bitol a bordo di un mostro meccanico dotato di potenti trivelle per penetrare nel sottosuolo viene inviato dalla base lunare sulla Terra, la sua missione ÃƒÂ¨ distruggere la base di Goldrake attaccando dal sottosuolo. Goldrake si trova in grossa difficoltÃƒÂ  in quanto il mostro ÃƒÂ¨ in grado sia di agire sottoterra che di volare e gli attacchi di Actarus risultano inefficaci. Alcor decolla allora con il nuovo disco Goldrake 2 ed agganciandosi a Goldrake i due riescono a prevalere.\n\nEpisodio 36: Il raggio ciclonico\n\nIl comandante Zigra, della guardia imperiale di Vega, dopo aver distrutto un meteorite che stava per centrare la base lunare parte alla caccia di Goldrake, egli infatti ha scoperto che ÃƒÂ¨ particolarmente vulnerabile negli istanti che seguono la manovra di sgancio del seggiolino per consentire ad Actarus di passare dal disco alla testa del robot. Infatti durante lo scontro Zigra approfitta del punto debole di Goldrake e danneggia gravemente il disco, Actarus affronta il nemico in un corpo a corpo ma la potenza del vegano lo mette in grossa difficoltÃƒÂ , solo l'intervento di Alcor con Goldrake 2 consentirÃƒÂ  al nostro eroe di prevalere ancora una volta.\n\nEpisodio 37: Esplosione nella galassia\n\nLa stella Vegatron grande fonte di energia per le armate di Vega viene inghiottita da una Supernova, Zuril propone di prelevare il super uranio terrestre per procurarsi l'energia necessaria al funzionamento delle proprie macchine da guerra. Un mostro galattico scortato da una nutrita squadriglia di minidischi tenta un colpo a sorpresa nel deposito del super uranio, durante lo scontro Alcor rimane ferito e sta per perdere il controllo del proprio apparecchio ma Venusia riesce a prendere il controllo del veicolo e con una manovra magistrale distrugge il mostro spaziale che stava per sopraffare anche Goldrake.","torrent":{"xt":"urn:btih:ff4bc2be072e8002eadb96d45bbfec3948ce2933","amp;dn":"Goldrake+S1e33-37%2C%5BDVD5+-+ITA+JAP%5DDVD+6+of+12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff4bc2be072e8002eadb96d45bbfec3948ce2933","infoHashBuffer":{"type":"Buffer","data":[255,75,194,190,7,46,128,2,234,219,150,212,91,191,236,57,72,206,41,51]},"announce":[],"urlList":[]}}