{"title":"Close My Eyes (1991)","uid":4456826,"size":1101322240,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ffa052233d82a8785ee73d831eae6c0d5536fba7&amp;dn=Close+My+Eyes+%281991%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":3,"leechers":1,"uploader":"Creativinity","files":1,"time":1224521765,"description":"After some years of tension, Richard (Clive Owen) begins a sexual relationship with his sister Natalie (Saskia Reeves). Natalie, now married, the relationship proves dangerously obsessional. Their private intensity (&amp; working class origins) contrast with the middle-class, inhibited, stuffy public scenes we see in the Richmond world into which Natalie has moved with her marriage. As the guilt and intensity of the siblings increases we seem to be heading for disaster, a forboding which increases when Natalie's husband Sinclair finds out.\n\nIt took me over a year to find this movie and believe me it was worth the search. I didn't encode it, I'm just transferring it to Pirate Bay because I'm sure thousands of people will want to see it. This movie is so damn hot.\n\nFor those of you who don't know how to watch it: you have to download a bittorent client like utorrent fromand install it. Once it's installed, you just download this torrent from this site. Once it's finished downloading, find it in your computer (usually it's under C:UserDownloads) and watch it with a program like Windows Media Player or VLC player.","torrent":{"xt":"urn:btih:ffa052233d82a8785ee73d831eae6c0d5536fba7","amp;dn":"Close+My+Eyes+%281991%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffa052233d82a8785ee73d831eae6c0d5536fba7","infoHashBuffer":{"type":"Buffer","data":[255,160,82,35,61,130,168,120,94,231,61,131,30,174,108,13,85,54,251,167]},"announce":[],"urlList":[]}}